         TITLE 'IGG0CLBZ - CATALOG AMS CONVERTV SUPPORT                *
                        '
IGG0CLBZ CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLBZ  78.174'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPCONV'
@EL00001 DS    0H                                                  0163
@EF00001 DS    0H                                                  0163
@ER00001 BR    @14                                                 0163
IGGPCONV DS    0H                                                  0164
         ENTRY IGGPCONV
         DROP @15
Z003     DS    0H                                                  0166
Z003CONV DS    0H                                                  0167
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
         TESTAUTH  FCTN=1
*        IF R15 ^= ZERO THEN             /* NON ZERO AUTHORIZATION  */
         LTR   R15,R15                                             0174
         BZ    @RF00174                                            0174
*          DO;                           /* INADEQUATE AUTHORIZATION*/
*                                                                  0175
*             /* SET CCAMODID='BZ', CCAREASN=RSN4, CCARETRN=RCTSAUTH */
*             CCAPROB=IGGSEGID+(RSN4*K256)+RCTSAUTH;               0176
         MVC   CCAPROB(4,R11),@CF04038                             0176
*                                          /* INDICATE AUTHORIZATION
*                                          ERROR           @Y30LSJG*/
*            CALL EXIT;                 /*  RETURN WITH ERROR       */
         BAL   @14,EXIT                                            0177
*          END;                          /* END APF CHECKING        */
*                                                                  0178
*                                                                  0178
*   /* FIND THE TIOT ENTRY ADDRESS FOR THE DD CARD ASSOCIATED        */
*   /* WITH THIS REQUEST                                             */
*   /*                                                               */
*        RESPECIFY TIOENTRY BASED(TIOTENTY);                       0179
@RF00174 DS    0H                                                  0180
*        TIOTENTY=CCATCB->TCBTIO;            /*SET PTR TO FIRST DD   */
         L     @10,CCATCB(,R11)                                    0180
         L     TIOTENTY,TCBTIO(,@10)                               0180
*        TIOTENTY=TIOTENTY+24;               /*ENTRY IN THE TIOT     */
         AL    TIOTENTY,@CF00130                                   0181
*        DO WHILE(TIOEDDNM^=DDNAME & TIOELNGH^=0);/*SRCH FOR DD ENTY */
         B     @DE00182                                            0182
@DL00182 DS    0H                                                  0183
*                                                            /* LOOP */
*          TIOTENTY=TIOTENTY+TIOELNGH;       /*SET ADDR NEXT DD ENTRY*/
         SLR   @10,@10                                             0183
         IC    @10,TIOELNGH(,TIOTENTY)                             0183
         ALR   TIOTENTY,@10                                        0183
*        END;                                /*END SEARCH LOOP       */
@DE00182 L     @10,CCACPL(,R11)                                    0184
         L     @10,CTGDDNM(,@10)                                   0184
         CLC   TIOEDDNM(8,TIOTENTY),DDNAME(@10)                    0184
         BE    @DC00182                                            0184
         CLI   TIOELNGH(TIOTENTY),0                                0184
         BNE   @DL00182                                            0184
@DC00182 DS    0H                                                  0185
*        IF TIOEDDNM ^= DDNAME THEN      /* CHECK IF A DDNAME WAS FND*/
         L     @10,CCACPL(,R11)                                    0185
         L     @10,CTGDDNM(,@10)                                   0185
         CLC   TIOEDDNM(8,TIOTENTY),DDNAME(@10)                    0185
         BE    @RF00185                                            0185
*          DO;                           /* EXIT WITH ERR IF NO DD  */
*                                                                  0186
*             /* SET CCAMODID='BZ', CCAREASN=RSN8, CCARETRN=RCNMNTD  */
*             CCAPROB=IGGSEGID+(RSN8*K256)+RCNMNTD;                0187
         MVC   CCAPROB(4,R11),@CF04041                             0187
*                                         /* INDICATE UNIT NOT FOND*/
*            CALL EXIT;                  /* QUIT WITH ERROR         */
         BAL   @14,EXIT                                            0188
*          END;                          /* END IF NO DD ENTRY FOUND */
*        CONVUCB = TIOEFSRT;             /* GET UCB POINTER FROM TIOT*/
*                                                                  0190
@RF00185 L     @10,CCACMSWA(,R11)                                  0190
         L     @15,TIOEFSRT-1(,TIOTENTY)                           0190
         LA    @15,0(,@15)                                         0190
         ST    @15,CONVUCB(,@10)                                   0190
*   /* THE VOLID IN THE UCB FOR THE DEVICE MUST BE VERIFIED AGAINST */
*   /* THE VOLID SUPPLIED AS PART IN THE INPUT FPL                  */
*                                                                  0191
*        CCAFLPT = CTGFIELD(1);         /* POSITION TO FIRST FPL    */
         L     @10,CCACPL(,R11)                                    0191
         L     @10,CTGFIELD(,@10)                                  0191
         ST    @10,CCAFLPT(,R11)                                   0191
*        DO WHILE FIELDNM ^= 'VOLSER  ' & /* SEARCH FOR VOLSER FPL  */
*                 CCAFLPT ^= ZERO;      /* STOP IF END OF CHAIN     */
         B     @DE00192                                            0192
@DL00192 DS    0H                                                  0193
*          CCAFLPT = CTGFLCHN;          /* GET NEXT FPL             */
         L     @10,CCAFLPT(,R11)                                   0193
         L     @10,CTGFLCHN(,@10)                                  0193
         ST    @10,CCAFLPT(,R11)                                   0193
*        END;                           /* END OF SEARCH FOR VOLSER */
@DE00192 L     @10,CCAFLPT(,R11)                                   0194
         L     @05,CTGFLDNM(,@10)                                  0194
         CLC   FIELDNM(8,@05),@CC03976                             0194
         BE    @DC00192                                            0194
         LTR   @10,@10                                             0194
         BNZ   @DL00192                                            0194
@DC00192 DS    0H                                                  0195
*        CONVOLSR = CONVOLID;           /* SAVE CONVERTED VOLSER    */
*                                                                  0195
         L     @10,CCACMSWA(,R11)                                  0195
         L     @05,CCAFLPT(,R11)                                   0195
         L     @05,CTGFLPT(,@05)                                   0195
         MVC   CONVOLSR(6,@10),CONVOLID(@05)                       0195
*        IF CONVOLID ^= UCBVOLI ×       /* ERROR IF INCORRECT VOLID */
*           UCBMOUNT = ON THEN          /* ERROR IF MOUNT PENDING   */
         L     @10,CONVUCB(,@10)                                   0196
         CLC   CONVOLID(6,@05),UCBVOLI(@10)                        0196
         BNE   @RT00196                                            0196
         TM    UCBMOUNT(@10),B'10000000'                           0196
         BNO   @RF00196                                            0196
@RT00196 DS    0H                                                  0197
*          DO;                          /* QUIT IF ERROR FOUND      */
*                                                                  0197
*             /* SET CCAMODID='BZ', CCAREASN=RSN2, CCARETRN=RCNMNTD  */
*             CCAPROB=IGGSEGID+(RSN2*K256)+RCNMNTD;                0198
         MVC   CCAPROB(4,R11),@CF04043                             0198
*                                         /* VOLUME NOT MOUNTED ERR*/
*            CALL EXIT;                 /* QUIT WITH ERROR          */
         BAL   @14,EXIT                                            0199
*          END;                         /* END IF VOLUME NOT MOUNTED*/
*                                                                  0200
*   /* THE UCB FOR THE VOLUME BEING CONVERTED HAS NOW BEEN          */
*   /* FOUND. THE FORMAT 4 DSCB CAN NOW BE READ AND MODIFIED        */
*                                                                  0201
*   /* A BIT IN THE FORMAT 4 DSCB (DS4VSBAD) INDICATING THIS        */
*   /* VOLUME IS NOT USABLE MUST BE SET TO TAKE CARE OF THE         */
*   /* CASE WHERE THE CONVERTV OPERATION FAILS IN THE MIDDLE,       */
*   /* AND ANOTHER PROGRAM TRIES TO ACCESS THE CONVERTED VOLUME     */
*   /* BEFORE THE CATALOG HAS BEEN PROPERLY UPDATED TO REFLECT      */
*   /* THE NEW DEVICE TYPE                                          */
*   /* THE FORMAT 4 READING AND UPDATING ROUTINES ARE NOW CALLED    */
*   /* TO READ THE FORMAT 4 DSCB, SET THE DS4VSBAD BIT ON, AND      */
*   /* REWRITE THE FORMAT 4. WHEN THIS HAS BEEN ACCOMPLISHED,       */
*   /* THE CATALOG CAN BE CONVERTED TO POINT TO THE VOLUME          */
*   /* BEING CONVERTED                                              */
*                                                                  0201
*        RFY IECSDSF4 BASED(ADDR(F4WBUF));                         0201
@RF00196 DS    0H                                                  0202
*        RFY IGGMF4WA BASED(CCAURAB);                              0202
*        CONVURAB = CCAURAB;             /* SAVE RAB WITH VOLUME ETY */
         L     @10,CCACMSWA(,R11)                                  0203
         L     @05,CCAURAB(,R11)                                   0203
         ST    @05,CONVURAB(,@10)                                  0203
*        CCAURAB=CCAR0REC;              /* FORMAT 4 ROUTINE WRK AREA*/
         L     @05,CCAR0REC(,R11)                                  0204
         ST    @05,CCAURAB(,R11)                                   0204
*        F4WDUCB=CONVUCB;               /* UCB ADDRESS              */
*                                                                  0205
         MVC   F4WDUCB(3,@05),CONVUCB+1(@10)                       0205
*        /* CALL TO MODULE IGG0CLBU                                  */
*Z007F4RD:                                                         0206
*        CALL IGGPF4RD;                                            0206
Z007F4RD L     @15,@CV00040                                        0206
         BALR  @14,@15                                             0206
*                                       /* READ FORMAT 4 DSCB       */
*        IF CCACD1^=0 THEN                  /*CHECK IF ANY ERROR    */
         CLI   CCACD1(R11),0                                       0207
         BE    @RF00207                                            0207
*          DO;                                                     0208
*            IF CCACD1^='08'X ×              /*CHECK SPECIAL CASE   */
*              DS4IDFMT^='F4'X THEN               /* ON FMT4 READ   */
*                                                                  0209
         CLI   CCACD1(R11),X'08'                                   0209
         BNE   @RT00209                                            0209
         L     @10,CCAURAB(,R11)                                   0209
         CLI   DS4IDFMT+120(@10),X'F4'                             0209
         BE    @RF00209                                            0209
@RT00209 DS    0H                                                  0210
*               /* SET CCAMODID='BZ', CCAREASN=RSN0, CCARETRN=RCNTFMT4
*                                                                    */
*               CCAPROB=IGGSEGID+(RSN0*K256)+RCNTFMT4;             0210
         MVC   CCAPROB(4,R11),@CF04044                             0210
*                                            /* SET I/O ERROR CODE */
*            CALL EXIT;                  /* EXIT WITH THE READ ERROR*/
@RF00209 BAL   @14,EXIT                                            0211
*          END;                          /* END ERROR ON READ       */
*        DS4VSBAD = ON;                  /* INDICATE BAD VOLUME     */
@RF00207 L     @10,CCAURAB(,R11)                                   0213
         OI    DS4VSBAD+120(@10),B'01000000'                       0213
*   /* THE BAD VOLUME BIT WILL BE RESET AFTER THE CONVERT OP        */
*   /* HAS BEEN SUCCESSFULLY COMPLETED                              */
*                                                                  0214
*        /* CALL TO MODULE IGG0CLBU                                  */
*Z009F4WR:                                                         0214
*        CALL IGGPF4WR;                                            0214
Z009F4WR L     @15,@CV00041                                        0214
         BALR  @14,@15                                             0214
*                                                  /* WRITE F4 DSCB   *
*        CCAURAB=CONVURAB;                   /* RESET RAB ADDR */  0215
*                                                                  0215
         L     @10,CCACMSWA(,R11)                                  0215
         L     @10,CONVURAB(,@10)                                  0215
         ST    @10,CCAURAB(,R11)                                   0215
*   /* THE CONTROL INTERVAL NUMBER OF THE VOLUME RECORD IS          */
*   /* CHECKED TO SEE IF IT IS THE VOLUME RECORD FOR THE CATLOG     */
*   /* IF A CATALOG IS ON THE VOLUME, SPECIAL PROCESSING MUST       */
*   /* BE PERFORMED .                                               */
*                                                                  0216
*        IF RCDCINO = 9 THEN             /* CHECK IF CATALOG VOLUME */
         L     @10,CCACPE1(,@10)                                   0216
         CLC   RCDCINO(3,@10),@CF03521+1                           0216
         BNE   @RF00216                                            0216
*          CCAAUCAT = ON;                /* INDICATE THIS VOL IS CAT*/
*                                                                  0217
         OI    CCAAUCAT(R11),B'00000001'                           0217
*        CCAFLPT = CTGFIELD(1);          /* POINT TO FIRST FPL      */
@RF00216 L     @10,CCACPL(,R11)                                    0218
         L     @10,CTGFIELD(,@10)                                  0218
         ST    @10,CCAFLPT(,R11)                                   0218
*   /* THE DEVICE OPTION BITS IN THE PASSED DEVICE TYPES  THAT ARE  */
*   /* NOT RETAINED IN THE CATALOG MUST BE TURNED OFF               */
*                                                                  0219
*        DO WHILE CCAFLPT ^= ZERO;      /* CHECK ALL FPLS           */
         B     @DE00219                                            0219
@DL00219 DS    0H                                                  0220
*          IF FIELDNM = 'DEVTYP  ' THEN /* IS THIS A DEVTYPE FPL    */
         L     @10,CCAFLPT(,R11)                                   0220
         L     @05,CTGFLDNM(,@10)                                  0220
         CLC   FIELDNM(8,@05),@CC03985                             0220
         BNE   @RF00220                                            0220
*            DO;                        /* TURN OFF NON CATLOGED BIT*/
*              DEVSHR = OFF;            /* TURN OFF SHARE BIT       */
*              DEVOPT7 = OFF;           /* TURN OFF OPTION 7        */
*              DEVOPT8 = OFF;           /* TURN OFF OPTION 8        */
         L     @05,CTGFLPT(,@10)                                   0224
         NI    DEVSHR(@05),B'11011100'                             0224
*              IF CTGFLDCD = CTGFLDEQ THEN /* CHECK IF TEST FPL     */
         CLI   CTGFLDCD(@10),X'80'                                 0225
         BNE   @RF00225                                            0225
*                CONVDEV1 = DEVDATA;    /* SAVE OLD DEVTYPE         */
         L     @10,CCACMSWA(,R11)                                  0226
         MVC   CONVDEV1(4,@10),DEVDATA(@05)                        0226
*            END;                       /* END TURN OFF OPTIONS     */
@RF00225 DS    0H                                                  0228
*          CCAFLPT = CTGFLCHN;          /*GET NEXT FPL OR ZERO      */
@RF00220 L     @10,CCAFLPT(,R11)                                   0228
         L     @10,CTGFLCHN(,@10)                                  0228
         ST    @10,CCAFLPT(,R11)                                   0228
*        END;                           /* END RESET NON CATLGED OPT*/
*                                                                  0229
@DE00219 L     @10,CCAFLPT(,R11)                                   0229
         LTR   @10,@10                                             0229
         BNZ   @DL00219                                            0229
*        CCAFLPT = CTGFIELD(1);         /* POINT TO FIRST FPL AGAIN */
*                                                                  0230
         L     @10,CCACPL(,R11)                                    0230
         L     @10,CTGFIELD(,@10)                                  0230
         ST    @10,CCAFLPT(,R11)                                   0230
*        CONVDEV2 = DEVDATA;            /* SAVE NEW DEVTYPE         */
         L     @05,CCACMSWA(,R11)                                  0231
         L     @10,CTGFLPT(,@10)                                   0231
         MVC   CONVDEV2(4,@05),DEVDATA(@10)                        0231
*        CTVDEVTY = DEVDATA;             /* REPLACE THE DEVICE TYPE */
         L     @01,CCAURAB(,R11)                                   0232
         L     @15,CCACPE1(,@01)                                   0232
         MVC   CTVDEVTY+48(4,@15),DEVDATA(@10)                     0232
*                                        /* DATA IN THE VOLUME RECRD*/
*                                        /* WITH THE DEVICE TYPE DAT*/
*                                        /* FROM THE LAST FPL       */
*                                                                  0233
*        IF RCDCRAVL = CONVOLSR &        /* CK IF CRA VOL   @Y30LSPS*/
*           RCDCRADT = CONVDEV1 THEN     /* DEVTYPE MATCH   @Y30LSPS*/
         CLC   RCDCRAVL(6,@15),CONVOLSR(@05)                       0233
         BNE   @RF00233                                            0233
         CLC   RCDCRADT(4,@15),CONVDEV1(@05)                       0233
         BNE   @RF00233                                            0233
*          DO;                           /* CRA VOLUME PROCS @Y30LSPS*/
*            RCDCRADT = CONVDEV2;        /* CHANGE DEVTYPE   @Y30LSPS*/
         MVC   RCDCRADT(4,@15),CONVDEV2(@05)                       0235
*            CONVCRA = ON;               /* INDICATE CRA VOL @Y30LSPS*/
         OI    CONVCRA(@05),B'01000000'                            0236
*            CONVOLCI = RCDCINO;         /* SAVE VOL CI NO   @Y30LSPS*/
         MVC   CONVOLCI(3,@05),RCDCINO(@15)                        0237
*          END;                          /* END IF CRA VOL   @Y30LSPS*/
*                                                                  0238
*   /* THE UPDATE VOLUME RECORD MUST NOW BE WRITTEN OUT             */
*                                                                  0239
*         DO;                                                      0239
*                                                                  0239
@RF00233 DS    0H                                                  0240
*         /* CALL TO MODULE IGG0CLAG                                 */
*Z011PUPC:CALL IGGPPUPC;                                           0240
Z011PUPC L     @15,@CV00039                                        0240
         BALR  @14,@15                                             0240
*                                       /* PUT-UPDATE RECORD      */
*         END;                        /* CALL PUT UPDATE         */
*                                                                  0241
*                                                                  0241
*   /* THE CCR RECORD MUST BE READ IN AND THE CAXNFCI UPDATED       */
*                                                                  0242
*         /* CALL TO MODULE IGG0CLAG                                 */
*Z012RCCR:CALL IGGPRCCR;                                           0242
Z012RCCR L     @15,@CV00042                                        0242
         BALR  @14,@15                                             0242
*                                        /* READ CCR AND UPDATE CAX  */
*                                                                  0243
*   /* THE CALLER CPL AND ASSOCIATED TEST AND MODIFY FPLS           */
*   /* ARE SETUP TO CHANGE THE DEVICE TYPE INFORMATION IN ALL       */
*   /*  RECORDS FOR ALL VOLUME ENTRIES FOR THE VOLUME               */
*   /* BEING CONVERTED                                              */
*                                                                  0243
*        RFY CTGPL BASED(CCAMCPL);                                 0243
*        CCAMCPL = CCACPL;              /* SET CPL LOCATION         */
         L     @10,CCACPL(,R11)                                    0244
         ST    @10,CCAMCPL(,R11)                                   0244
*        CCAREUSE = ON;                 /* INDICATE RABS REUSEABLE  */
         OI    CCAREUSE(R11),B'00000100'                           0245
*        CCAF2NVC = ON;                 /* SET NO VALIDITY CHECK FLG*/
         OI    CCAF2NVC(R11),B'01000000'                           0246
*        CCARABB = CCAURAB;             /* SET BASE RECORD RAB ADDR */
         L     @10,CCAURAB(,R11)                                   0247
         ST    @10,CCARABB(,R11)                                   0247
*        CCARABF = ADDR(CCARAB1);       /* SET FIRST RAB TO USE     */
         LA    @10,CCARAB1(,R11)                                   0248
         ST    @10,CCARABF(,R11)                                   0248
*        CCARABL = ADDR(CCARAB3);       /* SET LAST RAB TO USE      */
         LA    @10,CCARAB3(,R11)                                   0249
         ST    @10,CCARABL(,R11)                                   0249
*        CCASCRA = ON;                  /* INHIBIT CRA UPDATE       */
*                                                                  0250
*        CCASCRA = OFF;                  /* ALLOW CRA UPDATE @Y30LSPS*/
         NI    CCASCRA(R11),B'11011111'                            0251
*        CCASRCIN = ZERO;                /* START WITH FIRST RECORD */
         SLR   @10,@10                                             0252
         STCM  @10,7,CCASRCIN(R11)                                 0252
*        DO WHILE CCACD1 = RCS;          /* CONTINUE UNTIL EOF      */
*                                                                  0253
         B     @DE00253                                            0253
@DL00253 DS    0H                                                  0254
*Z013GALO:   CALL IGGPGALO;                                        0254
Z013GALO BAL   @14,IGGPGALO                                        0254
*                                        /* CALL GET ALL LOW KEY RNG*/
*          IF CCACD1 = RCS THEN          /* UPDATE ONLY IF GET OK   */
         CLI   CCACD1(R11),0                                       0255
         BNE   @RF00255                                            0255
*            DO;                         /* MODIFY DEVICE TYPE FIELDS*/
*              CONVSRCI = CCASRCIN;      /* SAVE CI NUMBER ACROS MOD */
         L     @10,CCACMSWA(,R11)                                  0257
         SLR   @05,@05                                             0257
         ICM   @05,7,CCASRCIN(R11)                                 0257
         ST    @05,CONVSRCI(,@10)                                  0257
*              IF RCDCRAVL = CONVOLSR & /* CHECK IF CONVERTV CRA VOL*/
*                 RCDCRADT = CONVDEV1 THEN /* CK SAME DEVTYPE       */
         L     @05,CCAURAB(,R11)                                   0258
         L     @15,CCACPE1(,@05)                                   0258
         CLC   RCDCRAVL(6,@15),CONVOLSR(@10)                       0258
         BNE   @RF00258                                            0258
         CLC   RCDCRADT(4,@15),CONVDEV1(@10)                       0258
         BNE   @RF00258                                            0258
*                DO;                    /* MUST UPDATE CAR DEVICETYP*/
*                  RCDCRADT = CONVDEV2; /* CHANGE CRA DEVTYPE       */
         MVC   RCDCRADT(4,@15),CONVDEV2(@10)                       0260
*                  CCARBWR = ON;        /* FORCE MODIFY TO WRITE REC*/
         OI    CCARBWR(@05),B'00010000'                            0261
*                END;                   /* END IF CHANGE CRA DEVTYPE*/
*              IF RCDID ^= 'E' &         /* DO NOT CALL MODIFY FOR E*/
*                 RCDID ^= 'W' &         /* VOLUME EXTENTIONS       */
*                 RCDID ^= 'L' &         /* INDEX RECORD EXTENTIONS */
*                 RCDID ^= 'V' &         /* NO DEVTYP FIELD IN VOLUM*/
*                 RCDID ^= 'C' &         /* NO DEVTYPE IN CLUSTER RC*/
*                 RCDID ^= 'F' THEN      /* FREE RECORDS            */
*                                                                  0263
@RF00258 L     @10,CCAURAB(,R11)                                   0263
         L     @10,CCACPE1(,@10)                                   0263
         CLI   RCDID(@10),C'E'                                     0263
         BE    @RF00263                                            0263
         CLI   RCDID(@10),C'W'                                     0263
         BE    @RF00263                                            0263
         CLI   RCDID(@10),C'L'                                     0263
         BE    @RF00263                                            0263
         CLI   RCDID(@10),C'V'                                     0263
         BE    @RF00263                                            0263
         CLI   RCDID(@10),C'C'                                     0263
         BE    @RF00263                                            0263
         CLI   RCDID(@10),C'F'                                     0263
         BE    @RF00263                                            0263
*                  /* CALL TO MODULE IGG0CLAV                        */
*Z014MOD:          CALL IGGPMOD;                                   0264
Z014MOD  L     @15,@CV00037                                        0264
         BALR  @14,@15                                             0264
*                                         /* GO MODIFY ALL DEVICE TYP*/
*                                        /* ENTRIES FOR THE VOLUME  */
*                                        /* BEING CONVERTED         */
*              IF CCARBWR = ON THEN     /* CK IF MODIFY WROTE REC   */
@RF00263 L     @10,CCAURAB(,R11)                                   0265
         TM    CCARBWR(@10),B'00010000'                            0265
         BNO   @RF00265                                            0265
*                DO;                    /* NO MODIFY MUST WRITE REC */
*                  CCARBWR = OFF;       /* RESET MUST WRITE BIT     */
*                                                                  0267
         NI    CCARBWR(@10),B'11101111'                            0267
*                   DO;                                            0268
*                                                                  0268
*                   /* CALL TO MODULE IGG0CLAG                       */
*Z016PUPC:          CALL IGGPPUPC;                                 0269
Z016PUPC L     @15,@CV00039                                        0269
         BALR  @14,@15                                             0269
*                                       /* PUT-UPDATE RECORD      */
*                   END;              /* CALL PUT UPDATE         */
*                END;                   /* END IF NO CALL TO MODIFY */
*              CCASRCIN = CONVSRCI;     /* RESTORE CI NUMBER        */
@RF00265 L     @10,CCACMSWA(,R11)                                  0272
         L     @10,CONVSRCI(,@10)                                  0272
         STCM  @10,7,CCASRCIN(R11)                                 0272
*              CCASRCIN = CCASRCIN + ONE; /* INCR TO NEXT CI        */
         AL    @10,@CF00052                                        0273
         STCM  @10,7,CCASRCIN(R11)                                 0273
*            END;                        /* END MODIFY ONE CI RECORD */
*                                                                  0274
*          ELSE                          /* NON ZERO FROM GET ALL LOW*/
*            DO;                         /* ERROR OR EOF            */
         B     @RC00255                                            0275
@RF00255 DS    0H                                                  0276
*              IF CCACD1 ^= RCLEOD THEN  /* CHECK IF EOF ON LOW KEYS
*                                                           @Y30LSJG*/
         CLI   CCACD1(R11),234                                     0276
         BE    @RF00276                                            0276
*                 CALL EXIT;             /* EXIT WITH ERROR         */
         BAL   @14,EXIT                                            0277
*            END;                        /* END IF NON ZERO FROM ALO */
*                                                                  0278
@RF00276 DS    0H                                                  0279
*        END;                            /* END MODIFY OF RECORDS LP*/
*                                                                  0279
@RC00255 DS    0H                                                  0279
@DE00253 CLI   CCACD1(R11),0                                       0279
         BE    @DL00253                                            0279
*        CCACD1 = RCS;                   /* RESET EOF ERROR INDICAT */
         MVI   CCACD1(R11),X'00'                                   0280
*        IF CONVCRA = ON THEN            /* CK IF CRA ON VOL @Y30LSPS*/
         L     @10,CCACMSWA(,R11)                                  0281
         TM    CONVCRA(@10),B'01000000'                            0281
         BNO   @RF00281                                            0281
*         DO;                           /* UPDATE CRA RECS   @Y30LSPS*/
*           CCASRCIN = CONVOLCI;        /* RE GET VOL RECRD  @Y30LSPS*/
*                                                                  0283
         MVC   CCASRCIN(3,R11),CONVOLCI(@10)                       0283
*             /* CALL TO MODULE IGG0CLBI                             */
*Z017GET:     CALL IGGPGET;                                        0284
Z017GET  L     @15,@CV00038                                        0284
         BALR  @14,@15                                             0284
*                                        /* GET FOR UPDATE   @Y30LSPS*/
*    /* THE GET FOR UPDATE OPENS AND POSITIONS THE CURRENT CRA       */
*    /* TO THE CRA FOR THE VOLUME BEING CONVERTED. IT IS NOW @Y30LSPS*/
*   /* POSSIBLE TO CONVERT THE SELF DESCRIBING RECORDS FOR   @Y30LSPS*/
*    /* THE CRA ON THE VOLUME BEING CONVERTED.               @Y30LSPS*/
*                                                                  0285
*            CCARAICI = ON;              /* INHIBIT CAT UPDT @Y30LSPS*/
*                                                                  0285
         OI    CCARAICI(R11),B'00000010'                           0285
*             DO;                                                  0286
*                                                                  0286
*             /* CALL TO MODULE IGG0CLAG                             */
*Z019PUPC:    CALL IGGPPUPC;                                       0287
Z019PUPC L     @15,@CV00039                                        0287
         BALR  @14,@15                                             0287
*                                       /* PUT-UPDATE RECORD      */
*             END;                    /* DUMMY PUT FOR UP @Y30LSPS*/
*            CCARAICI = OFF;             /* ALLOW CATLG UPDT @Y30LSPS*/
*            CCARAEOV = ON;              /* PROCESS CRA RECS @Y30LSPS*/
*                                                                  0290
         OI    CCARAEOV(R11),B'01000000'                           0290
         NI    CCARAICI(R11),B'11111101'                           0290
*            DO CCASRCIN = ZERO TO FIVE; /* CRA SELF DESC RE @Y30LSPS*/
         SLR   @10,@10                                             0291
         STCM  @10,7,CCASRCIN(R11)                                 0291
@DL00291 DS    0H                                                  0292
*              CONVSRCI = CCASRCIN;      /* SAVE CI NUMBER   @Y30LSPS*/
*                                                                  0292
         L     @10,CCACMSWA(,R11)                                  0292
         SLR   @05,@05                                             0292
         ICM   @05,7,CCASRCIN(R11)                                 0292
         ST    @05,CONVSRCI(,@10)                                  0292
*               /* CALL TO MODULE IGG0CLBI                           */
*Z020GET:       CALL IGGPGET;                                      0293
Z020GET  L     @15,@CV00038                                        0293
         BALR  @14,@15                                             0293
*                                        /* GET A CRA RECD   @Y30LSPS*/
*              IF CCACD1 = RCS THEN      /* CK IF IO OK      @Y30LSPS*/
         CLI   CCACD1(R11),0                                       0294
         BNE   @RF00294                                            0294
*                DO;                     /* MODIFY DEVTYPE   @Y30LSPS*/
*                  IF RCDCRAVL = CONVOLSR & /* VOLID MATCH   @Y30LSPS*/
*                     RCDCRADT = CONVDEV1 THEN /* DEVTYPE OK @Y30LSPS*/
         L     @10,CCAURAB(,R11)                                   0296
         L     @05,CCACPE1(,@10)                                   0296
         L     @15,CCACMSWA(,R11)                                  0296
         CLC   RCDCRAVL(6,@05),CONVOLSR(@15)                       0296
         BNE   @RF00296                                            0296
         CLC   RCDCRADT(4,@05),CONVDEV1(@15)                       0296
         BNE   @RF00296                                            0296
*                    DO;                 /* UPDATE KEY DEVTY @Y30LSPS*/
*                      RCDCRADT = CONVDEV2; /* CHANGE IT     @Y30LSPS*/
         MVC   RCDCRADT(4,@05),CONVDEV2(@15)                       0298
*                      CCARBWR = ON;     /* FORCE WRITE      @Y30LSPS*/
         OI    CCARBWR(@10),B'00010000'                            0299
*                    END;                /* END IF KEY MODFY @Y30LSPS*/
*                                                                  0300
*                  IF RCDID ^= 'E' &     /* DO NOT MOD IF E  @Y30LSPS*/
*                     RCDID ^= 'F' THEN  /* DO NOT MOD IF F  @Y30LSPS*/
*                                                                  0301
@RF00296 L     @10,CCAURAB(,R11)                                   0301
         L     @10,CCACPE1(,@10)                                   0301
         CLI   RCDID(@10),C'E'                                     0301
         BE    @RF00301                                            0301
         CLI   RCDID(@10),C'F'                                     0301
         BE    @RF00301                                            0301
*                     /* CALL TO MODULE IGG0CLAV                     */
*Z021MOD:             CALL IGGPMOD;                                0302
Z021MOD  L     @15,@CV00037                                        0302
         BALR  @14,@15                                             0302
*                                         /* MODIFY DEVTYPES  @Y30LSPS*
*                                                                  0303
*                  IF CCARBWR = ON THEN  /* CK IF MOD WROTE  @Y30LSPS*/
@RF00301 L     @10,CCAURAB(,R11)                                   0303
         TM    CCARBWR(@10),B'00010000'                            0303
         BNO   @RF00303                                            0303
*                    DO;                 /* MUST WRITE KEY   @Y30LSPS*/
*                      CCARBWR = OFF;    /* RESET MUST WRITE @Y30LSPS*/
*                                                                  0305
         NI    CCARBWR(@10),B'11101111'                            0305
*                       DO;                                        0306
*                                                                  0306
*                       /* CALL TO MODULE IGG0CLAG                   */
*Z023PUPC:              CALL IGGPPUPC;                             0307
Z023PUPC L     @15,@CV00039                                        0307
         BALR  @14,@15                                             0307
*                                       /* PUT-UPDATE RECORD      */
*                       END;          /* CALL PUT UPDATE  @Y30LSPS*/
*                    END;                /* END MOD NO WRITE @Y30LSPS*/
*                                                                  0309
*                  CCASRCIN = CONVSRCI;  /* RESTORE CI NBR   @Y30LSPS*/
@RF00303 L     @10,CCACMSWA(,R11)                                  0310
         MVC   CCASRCIN(3,R11),CONVSRCI+1(@10)                     0310
*                END;                    /* END IF GET UP OK @Y30LSPS*/
*              ELSE  CALL EXIT;          /* EXIT WITH IO ERR @Y30LSPS*/
*                                                                  0312
         B     @RC00294                                            0312
@RF00294 BAL   @14,EXIT                                            0312
*            END;                        /* END UPDATE CRA   @Y30LSPS*/
@RC00294 LA    @10,1                                               0313
         SLR   @05,@05                                             0313
         ICM   @05,7,CCASRCIN(R11)                                 0313
         ALR   @10,@05                                             0313
         STCM  @10,7,CCASRCIN(R11)                                 0313
         C     @10,@CF00054                                        0313
         BNH   @DL00291                                            0313
*          CCARAEOV = OFF;               /* RESET CRA PROCES @Y30LSPS*/
         NI    CCARAEOV(R11),B'10111111'                           0314
*        END;                            /* END IF CRA VOL   @Y30LSPS*/
*                                                                  0315
*   /* THE DEVICE TYPE FIELDS FOR ALL RECORDS ON THE VOLUME         */
*   /* BEING CONVERTED HAVE NOW BEEN CONVERTED. THE VOLUME IS       */
*   /* NOW CONVERTED, AND THE CATALOG SHOULD CORRECTLY POINT        */
*   /* TO THE NEW CONVERTED DEVICE TYPE. THE DS4VSBAD BIT           */
*   /* INDICATING THAT THE VOLUME IS BEING CONVERTED AND IS         */
*   /* UNUSABLE CAN NOW BE RESET                                    */
*                                                                  0316
*        CONVURAB = CCAURAB;             /* SAVE CURRENT USER RAB   */
@RF00281 L     @10,CCACMSWA(,R11)                                  0316
         L     @05,CCAURAB(,R11)                                   0316
         ST    @05,CONVURAB(,@10)                                  0316
*        CCAURAB=CCAR0REC;              /* FORMAT 4 ROUTINE WRK AREA*/
         L     @05,CCAR0REC(,R11)                                  0317
         ST    @05,CCAURAB(,R11)                                   0317
*        F4WDUCB=CONVUCB;               /* UCB ADDRESS              */
*                                                                  0318
         MVC   F4WDUCB(3,@05),CONVUCB+1(@10)                       0318
*        /* CALL TO MODULE IGG0CLBU                                  */
*Z024F4RD:                                                         0319
*        CALL IGGPF4RD;                                            0319
Z024F4RD L     @15,@CV00040                                        0319
         BALR  @14,@15                                             0319
*                                       /* READ FORMAT 4 DSCB       */
*        IF CCACD1^=0 THEN                   /*CHECK IF ANY ERROR    */
         CLI   CCACD1(R11),0                                       0320
         BE    @RF00320                                            0320
*          DO;                                                     0321
*            IF CCACD1^='08'X ×             /*CHECK SPECIAL CASE    */
*              DS4IDFMT^='F4'X THEN               /* ON FMT4 READ   */
*                                                                  0322
         CLI   CCACD1(R11),X'08'                                   0322
         BNE   @RT00322                                            0322
         L     @10,CCAURAB(,R11)                                   0322
         CLI   DS4IDFMT+120(@10),X'F4'                             0322
         BE    @RF00322                                            0322
@RT00322 DS    0H                                                  0323
*               /* SET CCAMODID='BZ', CCAREASN=RSN0, CCARETRN=RCNTFMT4
*                                                                    */
*               CCAPROB=IGGSEGID+(RSN0*K256)+RCNTFMT4;             0323
         MVC   CCAPROB(4,R11),@CF04044                             0323
*                                            /* SET I/O ERROR CODE */
*            CALL EXIT;                  /* EXIT WITH ERROR         */
@RF00322 BAL   @14,EXIT                                            0324
*          END;                          /* END ERROR ON READ       */
*        DS4VSBAD = OFF;                 /* INDICATE GOOD VOLUME    */
@RF00320 L     @10,CCAURAB(,R11)                                   0326
         NI    DS4VSBAD+120(@10),B'10111111'                       0326
*   /* THE BAD VOLUME BIT IS NOW RESET AFTER THE CONVERT OP         */
*   /* HAS BEEN SUCCESSFULLY COMPLETED                              */
*                                                                  0327
*        /* CALL TO MODULE IGG0CLBU                                  */
*Z026F4WR:                                                         0327
*        CALL IGGPF4WR;                                            0327
Z026F4WR L     @15,@CV00041                                        0327
         BALR  @14,@15                                             0327
*                                                  /* WRITE F4 DSCB   *
*        CCAURAB= CONVURAB;                   /* RESET RAB ADDR */ 0328
*                                                                  0328
         L     @10,CCACMSWA(,R11)                                  0328
         L     @05,CONVURAB(,@10)                                  0328
         ST    @05,CCAURAB(,R11)                                   0328
*   /* IF THE VOLUME CONTAINS A USER CATALOG, CATALOG MGT MUST      */
*   /* POSITION TO THE MASTER CATALOG AND CHANGE THE DEVICE         */
*   /* TYPE INFORMATION IN THE USERCAT RECORD IN THE MASTER         */
*   /* CATALOG                                                      */
*                                                                  0329
*        IF CCAAUCAT = ON &              /* IF VOLUME CONTAINS UCAT */
*          CCACD1 = RCS THEN             /* ONLY CONT IF NO ERRORS  */
         TM    CCAAUCAT(R11),B'00000001'                           0329
         BNO   @RF00329                                            0329
         CLI   CCACD1(R11),0                                       0329
         BNE   @RF00329                                            0329
*          DO;                           /* MUST CHANGE USERCAT REC */
*              CONVACB = CCAACB;         /* SAVE UCAT ACB           */
         L     @05,CCAACB(,R11)                                    0331
         ST    @05,CONVACB(,@10)                                   0331
*              CONVRPL1 = CCARPL1;      /* SAVE USERCAT RPL PTR     */
         L     @15,CCARPL1(,R11)                                   0332
         ST    @15,CONVRPL1(,@10)                                  0332
*              CONVCAT = CTGCAT;        /* SAVE PTR TO USER CAT IN  */
         L     @15,CCAMCPL(,R11)                                   0333
         L     @14,CTGCAT(,@15)                                    0333
         ST    @14,CONVCAT(,@10)                                   0333
*              CTGCAT = ADDR(CBSACB);   /* PT TO MCAT ACB    @Y30LSPS*/
         L     @10,CVTPTR                                          0334
         L     @10,CVTCBSP(,@10)                                   0334
         LA    @10,CBSACB(,@10)                                    0334
         ST    @10,CTGCAT(,@15)                                    0334
*              CTGNAME = ON;             /* INDICATE TRUE NAME      */
         OI    CTGNAME(@15),B'00000100'                            0335
*              CTGENT = ADDR(CAXCNAM);   /* CAXWA HAS UCAT TRUE NAME*/
         L     @10,ACBUAPTR(,@05)                                  0336
         LA    @10,CAXCNAM(,@10)                                   0336
         ST    @10,CTGENT(,@15)                                    0336
*              CTGCNAME = OFF;           /* INDICATE ACB PROVIDED   */
         NI    CTGCNAME(@15),B'11111101'                           0337
*              CCAURAB = ADDR(CCARAB1); /*INSURE GET TO RAB 1       */
         LA    @10,CCARAB1(,R11)                                   0338
         ST    @10,CCAURAB(,R11)                                   0338
*              CCAF1UP = ON;            /*INSURE GET FOR UPD        */
         OI    CCAF1UP(R11),B'00000010'                            0339
*              CCACD1 = RCS;            /*INSURE CLEARED ERROR BYTE */
         MVI   CCACD1(R11),X'00'                                   0340
*              CCAACB = ZERO;           /* INDICATE NO CCA CATLG    */
*                                                                  0341
         SLR   @10,@10                                             0341
         ST    @10,CCAACB(,R11)                                    0341
*               /* CALL TO MODULE IGG0CLAH                           */
*Z027SCAT:      CALL IGGPSCAT;                                     0342
Z027SCAT L     @15,@CV00044                                        0342
         BALR  @14,@15                                             0342
*                                      /*GO TO SEARCH CATLG TO FIND*/
*                                       /* U ENTRY                  */
*              IF CCACD1 = RCS &        /*IF NO ERROR &             */
*                 RCDID = 'U' THEN      /* U ENTRY FOUND            */
         CLI   CCACD1(R11),0                                       0343
         BNE   @RF00343                                            0343
         L     @10,CCAURAB(,R11)                                   0343
         L     @10,CCACPE1(,@10)                                   0343
         CLI   RCDID(@10),C'U'                                     0343
         BNE   @RF00343                                            0343
*                DO;                    /*  THEN                    */
*                                                                  0344
*                  /* CALL TO MODULE IGG0CLAV                        */
*Z028MOD:          CALL IGGPMOD;                                   0345
Z028MOD  L     @15,@CV00037                                        0345
         BALR  @14,@15                                             0345
*                                         /* MODIFY DEVICE TYPE ENTRY*/
*                END;                                              0346
*              ELSE CONVNCAT = ON; /* INDICATE NO UCAT ENTRY IN MCAT*/
         B     @RC00343                                            0347
@RF00343 L     @10,CCACMSWA(,R11)                                  0347
         OI    CONVNCAT(@10),B'10000000'                           0347
*              CCACD1 = RCS;            /*INSURE CLEARED ERROR BYTE */
*                                                                  0348
@RC00343 MVI   CCACD1(R11),X'00'                                   0348
*               /* CALL TO MODULE IGG0CLA3                           */
*Z029RPLF:      CALL IGGPRPLF;                                     0349
Z029RPLF L     @15,@CV00043                                        0349
         BALR  @14,@15                                             0349
*                                      /*DEQ THE MCAT              */
*              CCAF2XEQ = ON ;          /*RESTORE  DEQ RQD. IND.    */
         OI    CCAF2XEQ(R11),B'00010000'                           0350
*              CCAF4DRQ = ON ;          /*RESTORE  EXC CONT. IND.   */
         OI    CCAF4DRQ(R11),B'10000000'                           0351
*              CCAACB = CONVACB;        /*RESTORE UCAT ACB PTR      */
         L     @10,CCACMSWA(,R11)                                  0352
         L     @05,CONVACB(,@10)                                   0352
         ST    @05,CCAACB(,R11)                                    0352
*              CCARPL1 = CONVRPL1;      /* RESTORE USERCAT RPL      */
         L     @15,CONVRPL1(,@10)                                  0353
         ST    @15,CCARPL1(,R11)                                   0353
*              CTGCAT = CONVCAT;        /* RESTORE CPL CAT PTR      */
         L     @01,CCAMCPL(,R11)                                   0354
         L     @00,CONVCAT(,@10)                                   0354
         ST    @00,CTGCAT(,@01)                                    0354
*              CCAEDRNM = ADDR(CAXCNAM);  /*RESTORE DEQ MINOR NAME  */
         L     @05,ACBUAPTR(,@05)                                  0355
         LA    @15,CAXCNAM(,@05)                                   0355
         ST    @15,CCAEDRNM(,R11)                                  0355
*              CCAEDUCB = ADDR(CAXUCB); /*RESTORE DEQ UCB PTR       */
         LA    @05,CAXUCB(,@05)                                    0356
         ST    @05,CCAEDUCB(,R11)                                  0356
*              IF CONVNCAT = ON THEN    /* CK IF UCAT ENTRY FND     */
*                                                                  0357
         TM    CONVNCAT(@10),B'10000000'                           0357
         BNO   @RF00357                                            0357
*                 /* SET CCAMODID='BZ', CCAREASN=RSN0, CCARETRN=RCNOUCE
*                                                                    */
*                 CCAPROB=IGGSEGID+(RSN0*K256)+RCNOUCEN;           0358
         MVC   CCAPROB(4,R11),@CF04045                             0358
*                                              /* NO UCAT ERROR    */
*            END;                                                  0359
*                                                                  0359
@RF00357 DS    0H                                                  0360
*        /* ANY CORE GOTTEN DURING THE OPERATION OF THIS ROUTINE    */
*        /* MUST NOW BE FREED                                       */
*                                                                  0360
*        /* HOPEFULLY EVERYTHING HAS NOW BEEN CONVERTED AND CONTROL */
*        /* CAN NOW RETURN TO THE CALLER                            */
*                                                                  0360
*                                                                  0360
*          CALL EXIT;                   /* RETURN TO CALLER         */
@RF00329 BAL   @14,EXIT                                            0360
*          GEN(DS 0F);              /* FULLWORD BOUNDARY ALIGNMENT */
         DS 0F
*          GEN(DC CL8'IGGPGALO');   /* NAME OF FOLLOWING PROCEDURE */
         DC CL8'IGGPGALO'
*          END;                         /* END OF INNER PROCEDURE   */
@EL00002 DS    0H                                                  0363
@EF00002 DS    0H                                                  0363
@ER00002 BR    @14                                                 0363
         EJECT
*/********************************************************************/
*/*                                                                  */
*/*        IGGPGALO  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*IGGPGALO: PROC OPTIONS(NOSAVEAREA,NOSAVE);                        0364
IGGPGALO DS    0H                                                  0365
*                                   /* SPECIFY PROCEDURE OPTIONS */
*          GEN(ENTRY IGGPGALO );    /* IDENTIFY ENTRY-POINT SYMBOL */
         ENTRY IGGPGALO
*Z031:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z031GALO:                          /* LABEL FOR PROCEDURE TRACKING  */
*          RFY (R5,R6,R7,R8,R9,R10) UNRSTD;                        0366
Z031     DS    0H                                                  0366
Z031GALO DS    0H                                                  0367
*                                   /* PL/S COMPILER WORK REGISTERS */
*          RFY (R2,R3,R4) RSTD;     /* RESTRICT LOCAL WORK REGISTERS */
*          GEN(STM 12,14,12(13));       /* SAVE REGISTERS OF CALLER */
         STM 12,14,12(13)
*          GEN(LA 13,12(13));           /* POINT TO NEXT SAVE AREA  */
         LA 13,12(13)
*          GEN(BALR 12,0);              /* ESTABLISH ADDRESSABILITY */
         BALR 12,0
*          GEN(LA 15,*-IGGSEGST(0,0));  /* COMPUTE MODULE BASE      */
         LA 15,*-IGGSEGST(0,0)
*          GEN(SR 12,15);               /* SET BASE TO MODULE BASE  */
*                                                                  0372
         SR 12,15
*   /* THIS ROUTINE READS ALL LOW KEY RANGE CI RECORDS. IT WILL     */
*   /* INCREMENT TO THE NEXT EXTENT WHEN ZERO VALUE RECORDS OR NON  */
*   /* VALID LOW KEY RANGE RECORDS ARE ENCOUNTERED. THIS WILL       */
*   /* CONTINUE UNTIL THE CI REQUESTED IS THE NEXT NEVER ASSIGNED CI */
*   /* VALUE. THIS IS ONE MORE THAN THE HIGHEST VALID LOW KEY RANGE */
*   /* CI.                                                          */
*                                                                  0373
*        IF CCASRCIN ^< CAXNFCI THEN     /* CHECK IS NEXT NEVER ASSGN*/
*                                                                  0373
         L     @10,CCAACB(,R11)                                    0373
         L     @10,ACBUAPTR(,@10)                                  0373
         CLC   CCASRCIN(3,R11),CAXNFCI(@10)                        0373
         BL    @RF00373                                            0373
*           /* SET CCAMODID='BZ', CCAREASN=RSN4, CCARETRN=RCLEOD     */
*           CCAPROB=IGGSEGID+(RSN4*K256)+RCLEOD;                   0374
         MVC   CCAPROB(4,R11),@CF04046                             0374
*                                       /* INDICATE EOF IF REACHED 0375
*                                                          @Y30LSJG*/
*        ELSE                            /* KEEP GONG. THE END IS NOT*/
*        DO;                             /* GET THE NEXT LOW KEY CI */
         B     @RC00373                                            0375
@RF00373 DS    0H                                                  0376
*          CCAF1KEY = OFF;               /* TURN OFF GET BY KEY     */
         NI    CCAF1KEY(R11),B'11101111'                           0376
*          CCABZSAV = CCASRCIN;          /* SAVE CI NUMBR ACROS I/O */
*                                                                  0377
         SLR   @10,@10                                             0377
         ICM   @10,7,CCASRCIN(R11)                                 0377
         ST    @10,CCABZSAV(,R11)                                  0377
*           /* CALL TO MODULE IGG0CLBI                               */
*Z033GET:   CALL IGGPGET;                                          0378
Z033GET  L     @15,@CV00038                                        0378
         BALR  @14,@15                                             0378
*                                        /* GET CI RECORD CCASRCIN  */
*          CCASRCIN = CCABZSAV;          /* RESTORE CI NUMBER       */
         MVC   CCASRCIN(3,R11),CCABZSAV+1(R11)                     0379
*          IF CCACD1 ^= RCS THEN         /* SOME ERRORS ARE VALID   */
         CLI   CCACD1(R11),0                                       0380
         BE    @RF00380                                            0380
*            DO;                         /* CHANGE VALID ERRORS TO OK*/
*              IF RCDID = 'L' ×          /* CAN GET INDEX EXTENTIONS */
*                 RCDID = 'F' THEN       /* CAN GET FREE RECORDS    */
         L     @10,CCAURAB(,R11)                                   0382
         L     @10,CCACPE1(,@10)                                   0382
         CLI   RCDID(@10),C'L'                                     0382
         BE    @RT00382                                            0382
         CLI   RCDID(@10),C'F'                                     0382
         BNE   @RF00382                                            0382
@RT00382 DS    0H                                                  0383
*                   /* CLEAR CCAMODID, CCAREASN, AND CCARETRN*/    0383
*                 CCAPROB=IGNOREIT;       /* CHANNGE ERROR TO VALID*/
         SLR   @10,@10                                             0383
         ST    @10,CCAPROB(,R11)                                   0383
*            END;                        /* END IF NOT ZERO RET CODE*/
@RF00382 DS    0H                                                  0385
*          DO WHILE CCACD1 = RCHIGH;     /* RCHIGH IS RETURNED BY GET*/
@RF00380 B     @DE00385                                            0385
@DL00385 DS    0H                                                  0386
*                                        /* IF THE RCDKEYTY FIELD IS */
*                                        /* NOT EQUAL TO ZERO       */
*            RESPECIFY IDAEDBHD BASED(EDBPTR);                     0386
*            RESPECIFY IDAEDB BASED(EDBENTRY);                     0387
*            EDBPTR = ACBAMBL->AMBLDTA->AMBEDB; /* GET DATA EDB     */
         L     @10,CCAACB(,R11)                                    0388
         L     @10,ACBAMBL(,@10)                                   0388
         L     @10,AMBLDTA(,@10)                                   0388
         L     EDBPTR,AMBEDB(,@10)                                 0388
*            EDBENTRY = EDBPTR + LENGTH(IDAEDBHD); /* POSITION  HDR */
         LA    EDBENTRY,8                                          0389
         ALR   EDBENTRY,EDBPTR                                     0389
*            DO WHILE CCASRCIN * CILEN > EDBLORBA; /*SEARCH EDB EXTS*/
         B     @DE00390                                            0390
@DL00390 DS    0H                                                  0391
*                                        /* AN RBA HIGHER THAN CURRET*/
*                                        /* IS DISCOVERED           */
*              EDBENTRY = EDBENTRY + EDBLEN; /* GET NEXT EDB EXTENT */
         AH    EDBENTRY,EDBLEN(,EDBPTR)                            0391
*            END;                        /* END SEARCH EDB EXTENTS  */
*                                                                  0392
@DE00390 SLR   @10,@10                                             0392
         ICM   @10,7,CCASRCIN(R11)                                 0392
         SLA   @10,9                                               0392
         L     @07,EDBLORBA(,EDBENTRY)                             0392
         CLR   @10,@07                                             0392
         BH    @DL00390                                            0392
*            CCASRCIN = EDBLORBA/CILEN;  /* CALC CI NBR FROM RBA    */
         SRL   @07,9                                               0393
         STCM  @07,7,CCASRCIN(R11)                                 0393
*            IF CCASRCIN ^< CAXNFCI THEN /* CHECK IF EOF REACHED NOW */
         L     @10,CCAACB(,R11)                                    0394
         L     @10,ACBUAPTR(,@10)                                  0394
         CLC   CCASRCIN(3,R11),CAXNFCI(@10)                        0394
         BL    @RF00394                                            0394
*              DO;                       /* EOF IF CI = NEXT NOT ASGN*/
*                                                                  0395
*                 /* SET CCAMODID='BZ', CCAREASN=RSN4, CCARETRN=RCLEOD
*                                                                    */
*                 CCAPROB=IGGSEGID+(RSN4*K256)+RCLEOD;             0396
         MVC   CCAPROB(4,R11),@CF04046                             0396
*                                            /* INDICAT EOF ON LOW KEY
*                                                           @Y30LSJG*/
*              END;                      /* END IF LOW KEY RANGE EOF */
*                                                                  0397
*            ELSE DO;                    /* EOF ON LOW KEY NOT YET  */
         B     @RC00394                                            0398
@RF00394 DS    0H                                                  0399
*                   CCABZSAV = CCASRCIN; /* SAVE CI ACROSS I/0      */
         SLR   @10,@10                                             0399
         ICM   @10,7,CCASRCIN(R11)                                 0399
         ST    @10,CCABZSAV(,R11)                                  0399
*                   CCAPROB=IGNOREIT;    /* ZERO ERROR CODE @ZA10854*/
*                                                                  0400
         SLR   @10,@10                                             0400
         ST    @10,CCAPROB(,R11)                                   0400
*                    /* CALL TO MODULE IGG0CLBI                      */
*Z036GET:            CALL IGGPGET;                                 0401
Z036GET  L     @15,@CV00038                                        0401
         BALR  @14,@15                                             0401
*                                         /* GET FIRST CI IN EXTENT  */
*                   CCASRCIN = CCABZSAV; /* RESTORE CI FROM I/O     */
         MVC   CCASRCIN(3,R11),CCABZSAV+1(R11)                     0402
*                 END;                   /* END IF NOT EOF AND NEW EX*/
*                                                                  0403
*          IF CCACD1 ^= RCS THEN         /* SOME ERRORS ARE VALID   */
@RC00394 CLI   CCACD1(R11),0                                       0404
         BE    @RF00404                                            0404
*            DO;                         /* CHANGE VALID ERRORS TO OK*/
*              IF RCDID = 'L' ×          /* CAN GET INDEX EXTENTIONS */
*                 RCDID = 'F' THEN       /* CAN GET FREE RECORDS    */
         L     @10,CCAURAB(,R11)                                   0406
         L     @10,CCACPE1(,@10)                                   0406
         CLI   RCDID(@10),C'L'                                     0406
         BE    @RT00406                                            0406
         CLI   RCDID(@10),C'F'                                     0406
         BNE   @RF00406                                            0406
@RT00406 DS    0H                                                  0407
*                   /* CLEAR CCAMODID, CCAREASN, AND CCARETRN*/    0407
*                 CCAPROB=IGNOREIT;       /* CHANNGE ERROR TO VALID*/
         SLR   @10,@10                                             0407
         ST    @10,CCAPROB(,R11)                                   0407
*            END;                        /* END IF ERROR ON GET     */
@RF00406 DS    0H                                                  0409
*          END;                          /* END IF RCHIGH RETURNED  */
@RF00404 DS    0H                                                  0409
@DE00385 CLI   CCACD1(R11),230                                     0409
         BE    @DL00385                                            0409
*        END;                            /* END IF NOT EOF ON ENTRY */
*                                                                  0410
*                                                                  0410
*          CALL EXIT;               /* RETURN TO CALLER         */ 0411
@RC00373 BAL   @14,EXIT                                            0411
*          END ;                    /* END OF INNER PROCEDURE   */ 0412
@EL00003 DS    0H                                                  0412
@EF00003 DS    0H                                                  0412
@ER00003 BR    @14                                                 0412
         EJECT
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*EXIT:     PROC OPTIONS(NOSAVEAREA,NOSAVE);                        0413
EXIT     DS    0H                                                  0414
*                                   /* SPECIFY PROCEDURE OPTIONS     */
*          GEN(LM 12,14,0(13));     /* RESTORE REGISTERS OF CALLER */
         LM 12,14,0(13)
*          GEN(MVI 12(13),255);     /* MARK END OF PDL          */ 0415
         MVI 12(13),255
*          GEN(BR 14);              /* RETURN TO CALLER         */ 0416
         BR 14
*PATCH:    GEN(DC (12+((*+139-@MAINENT)/140))A(0));                0417
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*                                       /* PATCH AREA               */
*          END ;                    /* END OF EXIT PROCEDURE   */  0418
@EL00004 DS    0H                                                  0418
@EF00004 DS    0H                                                  0418
@ER00004 BR    @14                                                 0418
*          END                                                     0419
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                        *
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                        *
*/*%INCLUDE SYSLIB  (IGGCCA  )                                        *
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                        *
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                        *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        *
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        *
*/*%INCLUDE SYSLIB  (IFGACB  )                                        *
*/*%INCLUDE SYSLIB  (AMCBS   )                                        *
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                        *
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                        *
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                        *
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                        *
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                        *
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                        *
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        *
*/*%INCLUDE SYSLIB  (IECSDSL1)                                        *
*/*%INCLUDE SYSLIB  (IGGMF4WA)                                        *
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                        *
*/*%INCLUDE SYSLIB  (IDAAMDSB)                                        *
*/*%INCLUDE SYSLIB  (IGGMCMWA)                                        *
*/*%INCLUDE SYSLIB  (IGGMSAWA)                                        *
*/*%INCLUDE SYSLIB  (IGGMVEDC)                                        *
*/*%INCLUDE SYSLIB  (IDAEDB  )                                        *
*/*%INCLUDE SYSLIB  (IDAAMBL )                                        *
*/*%INCLUDE SYSLIB  (IDAAMB  )                                        *
*;                                                                 0419
@DATA    DS    0H
@DATD    DSECT
         DS    0F
IGG0CLBZ CSECT
         DS    0F
@CF00052 DC    F'1'
@CF00054 DC    F'5'
@CF03521 DC    F'9'
@CF00130 DC    F'24'
@CF04044 DC    F'-1024917398'
@CF04045 DC    F'-1024917266'
@CF04043 DC    F'-1024916920'
@CF04038 DC    F'-1024916254'
@CF04046 DC    F'-1024916246'
@CF04041 DC    F'-1024915384'
@DATD    DSECT
         DS    0D
UCBPTR   DS    A
TIOTPTR  DS    A
F4PTR    DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLBZ CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00037 DC    V(IGGPMOD)
@CV00038 DC    V(IGGPGET)
@CV00039 DC    V(IGGPPUPC)
@CV00040 DC    V(IGGPF4RD)
@CV00041 DC    V(IGGPF4WR)
@CV00042 DC    V(IGGPRCCR)
@CV00043 DC    V(IGGPRPLF)
@CV00044 DC    V(IGGPSCAT)
@CV00036 DC    V(IGGPEXT)
         DS    0D
@CC03976 DC    C'VOLSER  '
@CC03985 DC    C'DEVTYP  '
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
TIOTENTY EQU   @05
EDBENTRY EQU   @05
EDBPTR   EQU   @06
IGGSEGBR EQU   @12
RWA      EQU   @02
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R15      EQU   @15
DCWABASE EQU   @04
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R0       EQU   @00
R1       EQU   @01
R13      EQU   @13
R14      EQU   @14
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCAFLG1  EQU   IGGCCA+14
CCAF1KEY EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAFLG2  EQU   IGGCCA+15
CCAF2NVC EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCAFLG4  EQU   IGGCCA+17
CCAF4DRQ EQU   CCAFLG4
CCAFLG5  EQU   IGGCCA+18
CCAFLG6  EQU   IGGCCA+19
CCAREUSE EQU   CCAFLG6
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCASRCIN EQU   CCASRID
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0REC EQU   CCARAB0+4
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5SEG EQU   CCARAB5+8
CCATIQRN EQU   IGGCCA+212
CCARPL1  EQU   IGGCCA+220
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAEDRNM EQU   CCAEQDQ+8
CCAEDUCB EQU   CCAEQDQ+12
CCAMSSPL EQU   IGGCCA+300
CCACMS   EQU   IGGCCA+316
CCACMSWA EQU   CCACMS
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAFLPT  EQU   IGGCCA+364
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCAMCPL  EQU   CCAXCPL
CCARABB  EQU   IGGCCA+380
CCARABF  EQU   IGGCCA+384
CCARABL  EQU   IGGCCA+388
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCAMSFLG EQU   IGGCCA+401
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCAIDPT3 EQU   IGGCCA+480
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCAALPTR EQU   IGGCCA+540
CCAFLG7  EQU   IGGCCA+552
CCAFLG8  EQU   IGGCCA+553
CCASCRA  EQU   CCAFLG8
CCAAUCAT EQU   CCAFLG8
CCAFLG9  EQU   IGGCCA+554
CCARAEOV EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFLGS EQU   CCAMNAT+240
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAFLG11 EQU   IGGCCA+1059
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCACUMPL EQU   IGGCCA+1412
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CCADGDGA EQU   IGGCCA+1488
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGNAME  EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFIELD EQU   CTGPL+28
CTGFL    EQU   0
CTGFLDCD EQU   CTGFL+1
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLCHN EQU   CTGFL+12
CTGFLDAT EQU   CTGFL+16
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
FIELDNM  EQU   0
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCARBWR  EQU   CCARABFL
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGOGC1 EQU   CATGOPT+3
CATGOSEQ EQU   CATGOPT+4
CATRCD   EQU   0
RCDCINO  EQU   CATRCD+1
RCDCRAVL EQU   CATRCD+5
RCDCRADT EQU   CATRCD+14
RCDID    EQU   CATRCD+44
NREPLF   EQU   CATRCD+48
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
VARFIELD EQU   0
CNTRLINF EQU   0
LENFIX   EQU   CNTRLINF+1
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBTIO   EQU   TCB+12
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSACB   EQU   AMCBS+8
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXFLG3  EQU   IGGCAXWA+10
CAXUCB   EQU   IGGCAXWA+28
CAXCCR   EQU   IGGCAXWA+32
CAXNFCI  EQU   CAXCCR+3
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00102 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
TIOT1    EQU   0
TIOENTRY EQU   0
TIOELNGH EQU   TIOENTRY
TIOESTTA EQU   TIOENTRY+1
TIOERLOC EQU   TIOENTRY+2
TIOELINK EQU   TIOERLOC+1
TIOESYOT EQU   TIOELINK
TIOEDDNM EQU   TIOENTRY+4
TIOESTTC EQU   TIOENTRY+15
TIOESTTB EQU   TIOENTRY+16
TIOEFSRT EQU   TIOENTRY+17
POOLSTAR EQU   TIOENTRY+20
IECSDSF4 EQU   0
IECSDSL4 EQU   0
DS4IDFMT EQU   IECSDSL4
DS4DEVCT EQU   IECSDSL4+18
DS4DEVOV EQU   DS4DEVCT+6
DS4AMCAT EQU   IECSDSL4+40
DS4VSIND EQU   DS4AMCAT
DS4VSBAD EQU   DS4VSIND
IGGMF4WA EQU   0
F4WDEB   EQU   IGGMF4WA
F4WDUCB  EQU   F4WDEB+33
F4WECB   EQU   IGGMF4WA+52
F4WIOB   EQU   IGGMF4WA+56
F4WCCW   EQU   IGGMF4WA+96
F4WBUF   EQU   IGGMF4WA+120
ASGO     EQU   1
PASSGO   EQU   1
PASSWORD EQU   PASSGO
USERAREC EQU   PASSGO+50
USERLIST EQU   0
LTENTRY  EQU   USERLIST+2
LTRETCOD EQU   LTENTRY
SPACEPRM EQU   0
SPCOPTNS EQU   SPACEPRM+6
CTGDSATR EQU   0
CTGATR1  EQU   CTGDSATR
CTGATR2  EQU   CTGDSATR+1
RGATTRFL EQU   0
RGATTR1  EQU   RGATTRFL
RGATTSG1 EQU   RGATTRFL+1
DEVCHARS EQU   0
RTDEVUCB EQU   DEVCHARS
RTBOKAB  EQU   DEVCHARS+14
RTDVFLGS EQU   DEVCHARS+17
IDAAMDSB EQU   0
AMDATTR  EQU   IDAAMDSB+1
AMDNEST  EQU   IDAAMDSB+4
AMDHLRBA EQU   IDAAMDSB+28
AMDSSRBA EQU   IDAAMDSB+32
AMDATTR3 EQU   IDAAMDSB+40
AMDSTAT  EQU   IDAAMDSB+48
DSPTBL   EQU   0
CMSWA    EQU   0
CMWFLAGS EQU   CMSWA
CMCISUSE EQU   CMSWA+2
CMWRKATR EQU   CMCISUSE
CMCPLFVT EQU   CMSWA+20
CMNRMEXT EQU   CMSWA+24
CMLDTFPL EQU   CMNRMEXT
CMSSEXTS EQU   CMSWA+28
CMHDTFPL EQU   CMSSEXTS
CMCANVOL EQU   CMSWA+32
CMHIXFPL EQU   CMCANVOL
CMRNGCTR EQU   CMSWA+40
CMVOLCTR EQU   CMSWA+42
CMSDFSPC EQU   CMSWA+48
CMVLLIST EQU   CMSWA+64
CMVLRTCD EQU   CMVLLIST+2
CMSPCATR EQU   CMSWA+76
CMWASTOR EQU   CMSWA+132
CMPOT    EQU   CMWASTOR
CMDCONV  EQU   CMPOT
CMIXFANO EQU   CMDCONV
CMPOTX   EQU   CMWASTOR+4
CMPBI    EQU   CMPOTX
CMIXFANS EQU   CMPBI
CMWABYTB EQU   CMSWA+140
CMPBIX   EQU   CMWABYTB
CMNEST   EQU   CMPBIX
CMFANT   EQU   CMNEST
CMSPCQTY EQU   CMFANT
CMWGENAM EQU   CMSWA+144
CMWDATE  EQU   CMWGENAM+12
CMWTIME  EQU   CMWGENAM+17
DCWPLSPS EQU   CMSWA+200
DCWPLSPL EQU   DCWPLSPS
DCWPLBFS EQU   CMSWA+232
DCWPLBFL EQU   DCWPLBFS
DCWPLEDS EQU   CMSWA+260
DCWPLEDL EQU   DCWPLEDS
DCWPLARS EQU   CMSWA+288
DCWPLARL EQU   DCWPLARS
DCWPLCDS EQU   CMSWA+316
DCWPLCDL EQU   DCWPLCDS
CMUCATCI EQU   CMSWA+410
CUMPLWA  EQU   0
CUMPL    EQU   CUMPLWA
CUMIN    EQU   CUMPL
CUMOUT   EQU   CUMPL+1
CUMWA    EQU   CUMPLWA+8
CUMFLAG  EQU   CUMWA
CUMWASS2 EQU   CUMWA+48
CUMWASS  EQU   CUMWASS2+2
CUMWTYP  EQU   CUMWASS
SALPARL  EQU   0
SALPARMS EQU   SALPARL+6
SALRLIST EQU   SALPARL+14
PRLIST   EQU   0
PRLENT   EQU   PRLIST+1
PRELENTF EQU   PRLENT
CTVOLRCD EQU   1
CTVDVCHR EQU   CTVOLRCD+52
CTVDEVTY EQU   CTVDVCHR
CTVBOKAB EQU   CTVDVCHR+14
CTVDVFLG EQU   CTVDVCHR+17
CTVSPHDR EQU   0
CTVSPFLG EQU   CTVSPHDR+15
CTVDESGP EQU   0
CTVEXTST EQU   CTVDESGP+4
CTVSTDES EQU   CTVEXTST
CTVDSGRP EQU   0
CTVDSDFL EQU   CTVDSGRP+6
CTVDSDIR EQU   CTVDSGRP+9
CTVGOPT  EQU   0
CTVGOCI  EQU   CTVGOPT
CTVGOGCI EQU   CTVGOPT+3
CTVRCTRL EQU   0
CTVEXRPT EQU   CTVRCTRL
CTVSPMAP EQU   0
CTVSMSN  EQU   CTVSPMAP
CTVDSPAC EQU   0
CTVDSPSN EQU   CTVDSPAC
CTVDSPFG EQU   CTVDSPAC+15
CTVSPEXT EQU   CTVDSPAC+21
CTVEXTNT EQU   CTVSPEXT
CTVDIR   EQU   0
CTVDSDSN EQU   CTVDIR
CTVDEXTN EQU   0
IDAEDBHD EQU   0
EDBLEN   EQU   IDAEDBHD+2
IDAEDB   EQU   0
EDBFLG1  EQU   IDAEDB+2
EDBLORBA EQU   IDAEDB+12
IDAAMBL  EQU   0
AMBLEOV  EQU   IDAAMBL+12
AMBLEFLG EQU   AMBLEOV
AMBLDDNM EQU   IDAAMBL+16
AMBLIDF  EQU   AMBLDDNM
AMBLQ    EQU   AMBLIDF+7
AMBLVC   EQU   IDAAMBL+28
AMBLTYPE EQU   IDAAMBL+30
AMBLSHAR EQU   IDAAMBL+33
AMBLFLG1 EQU   IDAAMBL+35
AMBLFLG2 EQU   IDAAMBL+36
AMBLDTA  EQU   IDAAMBL+52
IDAAMB   EQU   0
AMBEOVR  EQU   IDAAMB+24
AMBFLG0  EQU   AMBEOVR
AMBFLG1  EQU   IDAAMB+25
AMBDSORG EQU   IDAAMB+26
AMBIOBAD EQU   IDAAMB+28
AMBINFL  EQU   IDAAMB+42
AMBDEBPT EQU   IDAAMB+44
AMBOFLGS EQU   IDAAMB+48
AMBFLG2  EQU   IDAAMB+49
AMBEDB   EQU   IDAAMB+52
AMBEOVPT EQU   IDAAMB+56
AMBCSWD1 EQU   IDAAMB+84
AMBAFLG  EQU   AMBCSWD1
DDNAME   EQU   0
DEVDATA  EQU   0
DEVOPTFL EQU   DEVDATA+1
DEVSHR   EQU   DEVOPTFL
DEVOPT7  EQU   DEVOPTFL
DEVOPT8  EQU   DEVOPTFL
CONVOLID EQU   0
MYWORKA  EQU   0
CONVRPL1 EQU   MYWORKA
CONVACB  EQU   MYWORKA+4
CONVUCB  EQU   MYWORKA+8
CONVURAB EQU   MYWORKA+12
CONVSRCI EQU   MYWORKA+16
CONVCAT  EQU   MYWORKA+20
CONVFLAG EQU   MYWORKA+24
CONVNCAT EQU   CONVFLAG
CONVCRA  EQU   CONVFLAG
CONVDEV1 EQU   MYWORKA+28
CONVDEV2 EQU   MYWORKA+32
CONVOLSR EQU   MYWORKA+36
CONVOLCI EQU   MYWORKA+42
BUFSIZE  EQU   0
CATRECRD EQU   0
CATSN    EQU   0
CI       EQU   0
CTGVLDSP EQU   0
DATEFLD  EQU   0
ENTRYNAM EQU   0
EXCPNAME EQU   0
LRECL    EQU   0
OWNIDFLD EQU   0
TNAM     EQU   0
UCBBGN   EQU   0
@NM00039 EQU   CTGDDNM
CTGPROB  EQU   @NM00039
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
UCBOBS01 EQU   UCBDEV
UCBVOLI  EQU   UCBOBS01+4
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBMOUNT EQU   UCBDMCT
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00101 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
TIOEDEVE EQU   TIOESTTB
TIOSTTB  EQU   TIOEDEVE
CTGRBASE EQU   NREPLF+1
CATTR    EQU   CTGRBASE+58
CATTR1   EQU   CATTR
CATTR2   EQU   CATTR+1
COPEN    EQU   CTGRBASE+60
CSPACPRM EQU   CTGRBASE+65
@NM00118 EQU   CATTR1
CCATTR   EQU   @NM00118
@NM00119 EQU   CCATTR
@NM00121 EQU   CATTR1
CRGATTR  EQU   @NM00121
CUPG     EQU   CRGATTR
FLC      EQU   PSA
F4WDCB   EQU   F4WDEB+4
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00122 EQU   CRGATTR
CUPD     EQU   CUPG
CPGSP    EQU   @NM00119
@NM00120 EQU   @NM00119
CEXT     EQU   CTGRBASE+86
CDOSUINF EQU   CTGRBASE+84
CLRECL   EQU   CTGRBASE+80
CHIA     EQU   CTGRBASE+76
CHIU     EQU   CTGRBASE+72
CSORT    EQU   CSPACPRM+6
CSEC     EQU   CSPACPRM+3
CPRIM    EQU   CSPACPRM
CBUF     EQU   CTGRBASE+61
@NM00117 EQU   COPEN
COPENDS  EQU   COPEN
CNUS     EQU   CATTR2
@NM00116 EQU   CATTR2
CATTRSSH EQU   CATTR2
CATTRISH EQU   CATTR2
CTRKOV   EQU   CATTR1
CTEMP    EQU   CATTR1
CINHIB   EQU   CATTR1
CRECOV   EQU   CATTR1
CERASE   EQU   CATTR1
CREUSE   EQU   CATTR1
CUNIQ    EQU   CATTR1
CSP      EQU   CATTR1
CEXP     EQU   CTGRBASE+55
CCRE     EQU   CTGRBASE+52
COWNID   EQU   CTGRBASE+44
CNAME    EQU   CTGRBASE
TIOUCBP  EQU   TIOEDEVE+1
TIOVERF  EQU   TIOSTTB
TIOUNLD  EQU   TIOSTTB
TIOMNTD  EQU   TIOSTTB
TIOSETU  EQU   TIOSTTB
TIOVLSR  EQU   TIOSTTB
TIOPVIO  EQU   TIOSTTB
TIOREQD  EQU   TIOSTTB
TIOUSED  EQU   TIOSTTB
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00101
UCBSKPFG EQU   @NM00101
UCBRIPND EQU   @NM00101
UCBRTIAC EQU   @NM00101
UCBRSV79 EQU   @NM00101
UCBRSV78 EQU   @NM00101
UCBRSV77 EQU   @NM00101
UCBOLTEP EQU   @NM00101
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBDQDSP EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00100 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRESVP EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVTOC  EQU   UCBOBS01
@NM00089 EQU   MCATDSTR+1
@NM00088 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
@NM00179 EQU   DEVOPTFL
DEVRPS   EQU   DEVOPTFL
@NM00178 EQU   DEVOPTFL
@NM00177 EQU   DEVOPTFL
@NM00176 EQU   DEVDATA
AMBTRACE EQU   IDAAMB+120
AMBVIOT  EQU   IDAAMB+116
AMBSZCP  EQU   IDAAMB+114
AMBSZFW  EQU   IDAAMB+112
AMBSZWR  EQU   IDAAMB+110
AMBSZRD  EQU   IDAAMB+108
AMBEXEX  EQU   IDAAMB+100
AMBWSHD  EQU   IDAAMB+96
AMBCPA   EQU   IDAAMB+92
AMBBM2SH EQU   IDAAMB+88
AMBRDCNT EQU   AMBCSWD1+2
@NM00175 EQU   AMBCSWD1+1
@NM00174 EQU   AMBAFLG
AMBCFX   EQU   AMBAFLG
AMBSIS   EQU   AMBAFLG
AMBDFR   EQU   AMBAFLG
AMBICI   EQU   AMBAFLG
AMBGSR   EQU   AMBAFLG
AMBLSR   EQU   AMBAFLG
@NM00173 EQU   AMBAFLG
AMBUPLH  EQU   IDAAMB+80
AMBPAMBL EQU   IDAAMB+76
AMBPIXP  EQU   IDAAMB+72
@NM00172 EQU   IDAAMB+68
AMBIWA   EQU   IDAAMB+64
AMBWKA   EQU   IDAAMB+60
AMBAMBXN EQU   AMBEOVPT
AMBRPT   EQU   IDAAMB+50
AMBPUG   EQU   AMBFLG2
AMBBUSY  EQU   AMBOFLGS
AMBEXFG  EQU   AMBOFLGS
@NM00171 EQU   AMBOFLGS
AMBOPEN  EQU   AMBOFLGS
@NM00170 EQU   AMBOFLGS
AMBDEBAD EQU   AMBDEBPT+1
AMBIFLGS EQU   AMBDEBPT
AMBAMETH EQU   IDAAMB+43
AMBUPX   EQU   AMBINFL
AMBUCRA  EQU   AMBINFL
AMBSCRA  EQU   AMBINFL
AMBCAT   EQU   AMBINFL
@NM00169 EQU   AMBINFL
@NM00168 EQU   AMBINFL
AMBTIOT  EQU   IDAAMB+40
@NM00167 EQU   IDAAMB+38
AMBDDSN  EQU   IDAAMB+35
AMBCDSN  EQU   IDAAMB+32
AMBIOMB  EQU   AMBIOBAD
@NM00166 EQU   AMBDSORG+1
AMBDORGA EQU   AMBDSORG+1
@NM00165 EQU   AMBDSORG
AMBINBUF EQU   AMBFLG1
AMBJRN   EQU   AMBFLG1
AMBUBF   EQU   AMBFLG1
AMBSPEED EQU   AMBFLG1
AMBPCAT  EQU   AMBFLG1
AMBMCAT  EQU   AMBFLG1
AMBTYPE  EQU   AMBFLG1
AMBCREAT EQU   AMBFLG1
@NM00164 EQU   AMBFLG0
AMBPSDS  EQU   AMBFLG0
AMBDSB   EQU   IDAAMB+20
AMBCACB  EQU   IDAAMB+16
AMBPH    EQU   IDAAMB+12
AMBBUFC  EQU   IDAAMB+8
AMBLINK  EQU   IDAAMB+4
AMBLEN   EQU   IDAAMB+2
AMBRSC   EQU   IDAAMB+1
AMBID    EQU   IDAAMB
AMBLCMB  EQU   IDAAMBL+64
AMBLBIB  EQU   IDAAMBL+60
AMBLIX   EQU   IDAAMBL+56
AMBLMIDS EQU   IDAAMBL+42
AMBLNIDS EQU   IDAAMBL+41
@NM00163 EQU   IDAAMBL+40
AMBLNUM  EQU   IDAAMBL+38
AMBLNST  EQU   IDAAMBL+37
@NM00162 EQU   AMBLFLG2
AMBLSTAG EQU   AMBLFLG2
@NM00161 EQU   AMBLFLG2
AMBLDUMY EQU   AMBLFLG1
AMBLCAT  EQU   AMBLFLG1
AMBLUCRA EQU   AMBLFLG1
AMBLSCRA EQU   AMBLFLG1
AMBLVVIC EQU   AMBLFLG1
AMBLUPD  EQU   AMBLFLG1
AMBLCINV EQU   AMBLFLG1
AMBLFULL EQU   AMBLFLG1
AMBLLEN  EQU   IDAAMBL+34
@NM00160 EQU   AMBLSHAR
AMBLWRIT EQU   AMBLSHAR
AMBLCATO EQU   AMBLSHAR
AMBLPRIM EQU   AMBLSHAR
AMBLID   EQU   IDAAMBL+32
@NM00159 EQU   IDAAMBL+31
@NM00158 EQU   AMBLTYPE
AMBLFIX  EQU   AMBLTYPE
AMBLBASE EQU   AMBLTYPE
AMBLAIX  EQU   AMBLTYPE
AMBLUPGR EQU   AMBLTYPE
AMBLPATH EQU   AMBLTYPE
AMBLENO  EQU   AMBLVC+1
AMBLVRT  EQU   AMBLVC
AMBLXPT  EQU   IDAAMBL+24
AMBLDFR  EQU   AMBLQ
AMBLESDS EQU   AMBLQ
AMBLKSDS EQU   AMBLQ
AMBLUBF  EQU   AMBLQ
AMBLFSTP EQU   AMBLQ
AMBLLSR  EQU   AMBLQ
AMBLGSR  EQU   AMBLQ
AMBLDDC  EQU   AMBLQ
AMBLDCI  EQU   AMBLIDF+4
AMBLCACB EQU   AMBLIDF
@NM00157 EQU   AMBLEOV+2
AMBLCOMP EQU   AMBLEOV+1
AMBLESET EQU   AMBLEFLG
AMBLWAIT EQU   AMBLEFLG
AMBLACB  EQU   IDAAMBL+8
AMBLSCHN EQU   IDAAMBL+4
AMBLPCHN EQU   IDAAMBL
EDBTKBAL EQU   IDAEDB+20
EDBHIRBA EQU   IDAEDB+16
EDBSTTRK EQU   IDAEDB+8
EDBLPMBA EQU   IDAEDB+4
EDBM     EQU   IDAEDB+3
@NM00156 EQU   EDBFLG1
EDBPSDS  EQU   EDBFLG1
EDBTOFLW EQU   EDBFLG1
EDBLKR   EQU   EDBFLG1
@NM00155 EQU   IDAEDB
EDBLPMBC EQU   IDAEDBHD+4
EDBNO    EQU   IDAEDBHD+1
EDBID    EQU   IDAEDBHD
CTVDRSTT EQU   CTVDEXTN+4
CTVDIRTS EQU   CTVDEXTN
CTVDSDCI EQU   CTVDIR+2
CTVDSDLF EQU   CTVDSDSN+1
CTVDSDCV EQU   CTVDSDSN
CTVEXTNN EQU   CTVEXTNT+2
CTVEXTT  EQU   CTVEXTNT
CTVSQT   EQU   CTVDSPAC+18
CTVSPOPT EQU   CTVDSPAC+17
CTVNOEXT EQU   CTVDSPAC+16
@NM00154 EQU   CTVDSPFG
CTVCATDF EQU   CTVDSPFG
@NM00153 EQU   CTVDSPFG
CTVAUTO  EQU   CTVDSPFG
CTVUNIQ  EQU   CTVDSPFG
CTVF1PTR EQU   CTVDSPAC+10
CTVF1TME EQU   CTVDSPAC+2
CTVDSPLF EQU   CTVDSPSN+1
CTVDSPCV EQU   CTVDSPSN
CTVSMBIT EQU   CTVSPMAP+4
CTVSMLEN EQU   CTVSPMAP+2
CTVSMLF  EQU   CTVSMSN+1
CTVSMCV  EQU   CTVSMSN
CTVEGOPT EQU   CTVRCTRL+6
CTVEXRCT EQU   CTVRCTRL+5
@NM00152 EQU   CTVEXRPT+3
CTVEXGCI EQU   CTVEXRPT
CTVGOSEQ EQU   CTVGOPT+4
CTVGOGC  EQU   CTVGOGCI
CTVGODEL EQU   CTVGOGCI
CTVGOEXT EQU   CTVGOGCI
CTVGODSP EQU   CTVGOCI+1
CTVGOFLG EQU   CTVGOCI
CTVSPSXC EQU   CTVDSDIR+2
CTVSPSSN EQU   CTVDSDIR
CTVDSXCT EQU   CTVDSGRP+7
@NM00151 EQU   CTVDSDFL
CTVDSDCN EQU   CTVDSDFL
CTVDSCID EQU   CTVDSGRP+3
CTVDSNEX EQU   CTVDSGRP+2
CTVDSGLF EQU   CTVDSGRP+1
CTVDSGCV EQU   CTVDSGRP
CTVMAP   EQU   CTVDESGP+14
CTVMAPLN EQU   CTVDESGP+12
CTVDESHD EQU   CTVDESGP+10
CTVDESTK EQU   CTVDESGP+8
CTVSTHH  EQU   CTVSTDES+2
CTVSTCC  EQU   CTVSTDES
CTVDESUU EQU   CTVDESGP+2
CTVDESLF EQU   CTVDESGP+1
CTVDESCV EQU   CTVDESGP
CTVSPSQT EQU   CTVSPHDR+20
CTVSPSPO EQU   CTVSPHDR+19
CTVSPNEX EQU   CTVSPHDR+18
CTVSPNDS EQU   CTVSPHDR+16
@NM00150 EQU   CTVSPFLG
CTVSPCDF EQU   CTVSPFLG
CTVSPMCT EQU   CTVSPFLG
CTVSPUCT EQU   CTVSPFLG
CTVSPAUT EQU   CTVSPFLG
CTVSPUNQ EQU   CTVSPFLG
CTVF1ADR EQU   CTVSPHDR+10
CTVF1TIM EQU   CTVSPHDR+2
CTVSPHLF EQU   CTVSPHDR+1
CTVSPHCV EQU   CTVSPHDR
@NM00149 EQU   CTVOLRCD+74
CTVSYEDS EQU   CTVOLRCD+73
CTVOLFLG EQU   CTVOLRCD+72
CTVTLFAC EQU   CTVDVCHR+18
CTVTLFLG EQU   CTVDVFLG
@NM00148 EQU   CTVDVFLG
CTVABFLG EQU   CTVDVFLG
@NM00147 EQU   CTVDVFLG
CTVBONK  EQU   CTVDVCHR+16
CTVBKLB  EQU   CTVBOKAB+1
CTVBKNLB EQU   CTVBOKAB
CTVTRKSZ EQU   CTVDVCHR+12
CTVNOTRK EQU   CTVDVCHR+10
CTVNOCYL EQU   CTVDVCHR+8
CTVMXBLK EQU   CTVDVCHR+4
CTVOLTIM EQU   CTVOLRCD+44
CTVOLNME EQU   CTVOLRCD
PRLPAR2  EQU   PRELENTF+1
PRLPAR1  EQU   PRELENTF
PRLLN    EQU   PRLIST
SALAXWA  EQU   SALPARL+22
SALVLIST EQU   SALPARL+18
@NM00146 EQU   SALPARMS+7
SALMXEXT EQU   SALPARMS+6
SALUNITS EQU   SALPARMS+4
SALBLKLN EQU   SALPARMS+2
SALCALN  EQU   SALPARMS
SALDSCIN EQU   SALPARL+3
SALSOURC EQU   SALPARL+2
@NM00145 EQU   SALPARL+1
SALOPTNS EQU   SALPARL
CUMRC    EQU   CUMWA+148
@NM00144 EQU   CUMWA+146
CUMFMWA  EQU   CUMWA+58
CUMWCI2  EQU   CUMWASS2+7
CUMWTYP2 EQU   CUMWASS2+6
CUMWCI   EQU   CUMWASS+1
CUMTYPE  EQU   CUMWTYP
CUMWREL  EQU   CUMWASS2
CUMFN2   EQU   CUMWA+40
CUMFN1   EQU   CUMWA+32
CUMDY    EQU   CUMWA+29
@NM00143 EQU   CUMWA+28
CUMSRID  EQU   CUMWA+25
@NM00142 EQU   CUMWA+24
CUMRABD  EQU   CUMWA+20
CUMRAB2  EQU   CUMWA+16
CUMRAB1  EQU   CUMWA+12
CUMRABB  EQU   CUMWA+8
CUMURAB  EQU   CUMWA+4
CUMBCI   EQU   CUMWA+1
@NM00141 EQU   CUMFLAG
CUMEXIT  EQU   CUMFLAG
CUMICI   EQU   CUMPL+5
CUMDCI   EQU   CUMPL+2
@NM00140 EQU   CUMOUT
CUMNE    EQU   CUMOUT
CUMDUP   EQU   CUMOUT
@NM00139 EQU   CUMIN
CUMFUNC  EQU   CUMIN
CUMNRG   EQU   CUMIN
CUMFDEL  EQU   CUMIN
CMBYTAU  EQU   CMSWA+500
CMBYTTRK EQU   CMSWA+496
CMSCTREC EQU   CMSWA+416
@NM00138 EQU   CMSWA+413
CMDEFACI EQU   CMUCATCI
CMBLPTKS EQU   CMSWA+408
CMSDSPTB EQU   CMSWA+344
@NM00137 EQU   DCWPLCDS+27
DCWPLCDV EQU   DCWPLCDS+24
DCWPLCDA EQU   DCWPLCDL+16
DCWPLCDH EQU   DCWPLCDL
DCWPLARV EQU   DCWPLARS+24
DCWPLARA EQU   DCWPLARL+16
DCWPLARH EQU   DCWPLARL
@NM00136 EQU   DCWPLEDS+27
DCWPLEDV EQU   DCWPLEDS+24
DCWPLEDA EQU   DCWPLEDL+16
DCWPLEDH EQU   DCWPLEDL
DCWPLBFV EQU   DCWPLBFS+24
DCWPLBFA EQU   DCWPLBFL+16
DCWPLBFH EQU   DCWPLBFL
@NM00135 EQU   DCWPLSPS+31
DCWPLSPV EQU   DCWPLSPS+24
DCWPLSPA EQU   DCWPLSPL+16
DCWPLSPH EQU   DCWPLSPL
DCWFPLPT EQU   CMSWA+196
DCWAREPT EQU   CMSWA+192
@NM00134 EQU   CMSWA+190
DCWIX    EQU   CMSWA+188
CMWPAD   EQU   CMWGENAM+35
CMWTIME2 EQU   CMWTIME+11
CMWDELM2 EQU   CMWTIME+9
CMWTIME1 EQU   CMWTIME+2
CMWDELM1 EQU   CMWTIME
CMWDAY   EQU   CMWDATE+2
CMWYEAR  EQU   CMWDATE
CMWFIXID EQU   CMWGENAM
CMNCILL  EQU   CMSPCQTY
CMNCITL  EQU   CMIXFANS
CMWT     EQU   CMIXFANO
CMDEFSWA EQU   CMSWA+128
CMSRCCOR EQU   CMSWA+124
CMEXTLST EQU   CMSWA+120
WORKPROC EQU   CMSWA+118
@NM00133 EQU   CMSWA+116
CMFPLIDX EQU   CMSWA+112
CMCNVNO  EQU   CMSWA+110
CMCNVLEN EQU   CMSWA+108
CMTRKCYL EQU   CMSPCATR+12
CMTRKPCA EQU   CMSPCATR+10
CMBLKTRK EQU   CMSPCATR+8
CMSWADTY EQU   CMSPCATR+4
CMPHYBLK EQU   CMSPCATR
CMTOTVOL EQU   CMSWA+74
CMVLVOL  EQU   CMVLLIST+4
CMVLRT2  EQU   CMVLRTCD+1
CMVLRT1  EQU   CMVLRTCD
CMVLLTLN EQU   CMVLLIST
@NM00132 EQU   CMSWA+62
CMSCRADT EQU   CMSWA+58
CMSCRAVI EQU   CMSWA+52
CMSDEFCI EQU   CMSDFSPC+1
CMSWAFLG EQU   CMSDFSPC
CMSPCFVT EQU   CMSWA+44
CMRMVVOL EQU   CMVOLCTR
CMADDVOL EQU   CMRNGCTR
SPACINDC EQU   CMSWA+38
PROCESS  EQU   CMSWA+36
CMDTAFPL EQU   CMHIXFPL
CMTSTFPL EQU   CMHDTFPL
CMRNMLST EQU   CMLDTFPL
CMEXTFLS EQU   CMCPLFVT
CMASCFPL EQU   CMSWA+16
CMWFVTPT EQU   CMSWA+12
CMWACI   EQU   CMSWA+3
CMAMDRNG EQU   CMWRKATR
CMAMDORD EQU   CMWRKATR
CMAMDRPL EQU   CMWRKATR
CMAMDSDT EQU   CMWRKATR
CMAMDWCK EQU   CMWRKATR
CMAMDDST EQU   CMWRKATR
CMCISREQ EQU   CMSWA+1
CMPROC   EQU   CMWFLAGS
CMPROCM  EQU   CMWFLAGS
CMFGDLSC EQU   CMWFLAGS
DSNPHYBS EQU   DSPTBL+30
DSPHYBPT EQU   DSPTBL+22
DSMPHYBS EQU   DSPTBL+20
DSDEVCHA EQU   DSPTBL
AMDEXCP  EQU   AMDSTAT+44
AMDNCAS  EQU   AMDSTAT+40
AMDNCIS  EQU   AMDSTAT+36
AMDASPA  EQU   AMDSTAT+32
AMDRETR  EQU   AMDSTAT+28
AMDUPR   EQU   AMDSTAT+24
AMDIREC  EQU   AMDSTAT+20
AMDDELR  EQU   AMDSTAT+16
AMDNLR   EQU   AMDSTAT+12
AMDNEXT  EQU   AMDSTAT+10
AMDNIL   EQU   AMDSTAT+8
AMDSTSP  EQU   AMDSTAT
@NM00131 EQU   IDAAMDSB+41
@NM00130 EQU   AMDATTR3
AMDLM    EQU   AMDATTR3
AMDWAIT  EQU   AMDATTR3
AMDBIND  EQU   AMDATTR3
AMDFAULT EQU   AMDATTR3
AMDUNQ   EQU   AMDATTR3
AMDPARDB EQU   IDAAMDSB+36
AMDMAXRR EQU   AMDSSRBA
AMDNSLOT EQU   AMDHLRBA
AMDLRECL EQU   IDAAMDSB+24
AMDCINV  EQU   IDAAMDSB+20
AMDFSCI  EQU   IDAAMDSB+16
AMDFSCA  EQU   IDAAMDSB+14
AMDCIPCA EQU   IDAAMDSB+12
AMDPCTCI EQU   IDAAMDSB+11
AMDPCTCA EQU   IDAAMDSB+10
AMDKEYLN EQU   IDAAMDSB+8
AMDRKP   EQU   IDAAMDSB+6
AMDAXRKP EQU   AMDNEST
AMDLEN   EQU   IDAAMDSB+2
AMDSPAN  EQU   AMDATTR
AMDRRDS  EQU   AMDATTR
AMDRANGE EQU   AMDATTR
AMDORDER EQU   AMDATTR
AMDREPL  EQU   AMDATTR
AMDSDT   EQU   AMDATTR
AMDWCK   EQU   AMDATTR
AMDDST   EQU   AMDATTR
AMDSBID  EQU   IDAAMDSB
RTTOLFCT EQU   DEVCHARS+18
RTTOLFLG EQU   RTDVFLGS
@NM00129 EQU   RTDVFLGS
RTKABFLG EQU   RTDVFLGS
@NM00128 EQU   RTDVFLGS
RTBONK   EQU   DEVCHARS+16
RTBOKLB  EQU   RTBOKAB+1
RTBOKNLB EQU   RTBOKAB
RTTRKSIZ EQU   DEVCHARS+12
RTNOTRKS EQU   DEVCHARS+10
RTNOCYLS EQU   DEVCHARS+8
RTMXDBLK EQU   DEVCHARS+4
RTCLSTYP EQU   RTDEVUCB+2
@NM00127 EQU   RTDEVUCB
@NM00126 EQU   RGATTSG1
RGATSUP1 EQU   RGATTSG1
@NM00125 EQU   RGATTR1
RGATTUPG EQU   RGATTR1
CTGDSNUS EQU   CTGATR2
@NM00124 EQU   CTGATR2
CTGDSSSH EQU   CTGATR2
CTGDSISH EQU   CTGATR2
CTGTRKOV EQU   CTGATR1
CTGDSTPX EQU   CTGATR1
CTGDSINH EQU   CTGATR1
CTGDSREC EQU   CTGATR1
CTGDSERA EQU   CTGATR1
CTGDSREU EQU   CTGATR1
CTGDSUNQ EQU   CTGATR1
CTGDSSPD EQU   CTGATR1
SPCROUND EQU   SPCOPTNS
SPCALXRQ EQU   SPCOPTNS
SPCMXIGR EQU   SPCOPTNS
SPCCNTIG EQU   SPCOPTNS
@NM00123 EQU   SPCOPTNS
SPCRQTYP EQU   SPCOPTNS
SPCSECDQ EQU   SPACEPRM+3
SPCPRIMQ EQU   SPACEPRM
LTVOLSER EQU   LTENTRY+2
LTRETCD2 EQU   LTRETCOD+1
LTRETCD1 EQU   LTRETCOD
LTLENGTH EQU   USERLIST
USERAREV EQU   USERAREC+2
USERAREL EQU   USERAREC
USVRMDUL EQU   PASSGO+42
PASSATMP EQU   PASSGO+40
PASSPRMT EQU   PASSGO+32
READPW   EQU   PASSWORD+24
UPDATEPW EQU   PASSWORD+16
CIPW     EQU   PASSWORD+8
MASTERPW EQU   PASSWORD
ASCI     EQU   ASGO+1
ASTYPE   EQU   ASGO
F4WCCW3  EQU   F4WCCW+16
F4WCCW2  EQU   F4WCCW+8
F4WCCW1  EQU   F4WCCW
F4WSEEK  EQU   IGGMF4WA+88
@NM00115 EQU   F4WIOB+24
F4WIDCB  EQU   F4WIOB+20
F4WSCP   EQU   F4WIOB+16
@NM00114 EQU   F4WIOB+8
F4WIECB  EQU   F4WIOB+4
@NM00113 EQU   F4WIOB
@NM00112 EQU   F4WECB+1
F4WECMP  EQU   F4WECB
F4WDEBP  EQU   IGGMF4WA+48
F4WNTK   EQU   F4WDEB+46
F4WECC   EQU   F4WDEB+42
F4WSCC   EQU   F4WDEB+38
F4WDBB   EQU   F4WDEB+36
F4WDMOD  EQU   F4WDEB+32
F4WDAPP  EQU   F4WDEB+29
F4WDEXS  EQU   F4WDEB+28
F4WDDCB  EQU   F4WDEB+25
F4WDID   EQU   F4WDEB+24
@NM00111 EQU   F4WDEB+17
F4WEXT   EQU   F4WDEB+16
@NM00110 EQU   F4WDEB
DS4END   EQU   IECSDSL4+96
@NM00109 EQU   IECSDSL4+71
DS4VTOCE EQU   IECSDSL4+61
DS4F6PTR EQU   IECSDSL4+56
@NM00108 EQU   IECSDSL4+51
DS4R2TIM EQU   IECSDSL4+43
DS4VSCRA EQU   DS4AMCAT+1
@NM00107 EQU   DS4VSIND
DS4VSREF EQU   DS4VSIND
DS4AMTIM EQU   IECSDSL4+32
DS4DEVDB EQU   DS4DEVCT+13
DS4DEVDT EQU   DS4DEVCT+12
DS4DEVTL EQU   DS4DEVCT+10
DS4DEVFG EQU   DS4DEVCT+9
DS4DEVK  EQU   DS4DEVCT+8
DS4DEVL  EQU   DS4DEVOV+1
DS4DEVI  EQU   DS4DEVOV
DS4DEVTK EQU   DS4DEVCT+4
DS4DEVSZ EQU   DS4DEVCT
@NM00106 EQU   IECSDSL4+16
DS4NOEXT EQU   IECSDSL4+15
DS4VTOCI EQU   IECSDSL4+14
DS4NOATK EQU   IECSDSL4+12
DS4HCCHH EQU   IECSDSL4+8
DS4DSREC EQU   IECSDSL4+6
DS4HPCHR EQU   IECSDSL4+1
@NM00105 EQU   IECSDSF4
TIOTFEND EQU   POOLSTAR+16
TIOPSLOT EQU   POOLSTAR+13
TIOPSTTB EQU   POOLSTAR+12
TIOPPOOL EQU   POOLSTAR+4
TIOPNSRT EQU   POOLSTAR+3
@NM00104 EQU   POOLSTAR+2
TIOPNSLT EQU   POOLSTAR+1
@NM00103 EQU   POOLSTAR
TIOSVERF EQU   TIOESTTB
TIOSUNLD EQU   TIOESTTB
TIOSMNTD EQU   TIOESTTB
TIOSSETU EQU   TIOESTTB
TIOSVLSR EQU   TIOESTTB
TIOSPVIO EQU   TIOESTTB
TIOSREQD EQU   TIOESTTB
TIOSUSED EQU   TIOESTTB
TIOSBALS EQU   TIOESTTC
TIOSBALP EQU   TIOESTTC
TIOSVOLS EQU   TIOESTTC
TIOSVOLP EQU   TIOESTTC
TIOSAFFS EQU   TIOESTTC
TIOSAFFP EQU   TIOESTTC
TIOSDEFR EQU   TIOESTTC
TIOSDKCR EQU   TIOESTTC
TIOEJFCB EQU   TIOENTRY+12
TIOTREM  EQU   TIOELINK
TIOESSDS EQU   TIOESYOT
TIOESYIN EQU   TIOELINK
TIOEQNAM EQU   TIOELINK
TIOEDYNM EQU   TIOELINK
TIOTTERM EQU   TIOELINK
TIOTRV01 EQU   TIOELINK
TIOSYOUT EQU   TIOELINK
TIOEWTCT EQU   TIOERLOC
TIOSDSP2 EQU   TIOESTTA
TIOSDSP1 EQU   TIOESTTA
TIOSLABL EQU   TIOESTTA
TIOSDADS EQU   TIOESTTA
TIOSJBLB EQU   TIOESTTA
TIOSPLTS EQU   TIOESTTA
TIOSPLTP EQU   TIOESTTA
TIOSLTYP EQU   TIOESTTA
TIOCSTEP EQU   TIOT1+8
TIOCNJOB EQU   TIOT1
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBFCBPE EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBINHIO EQU   UCBFLP1
UCBNSWAP EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00102
UCBHALI  EQU   @NM00102
UCBRSV09 EQU   @NM00102
UCBRSV08 EQU   @NM00102
UCBRSV07 EQU   @NM00102
UCBRSV06 EQU   @NM00102
UCBRSV05 EQU   @NM00102
UCBRSV04 EQU   @NM00102
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBMMSGP EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00099 EQU   UCB
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00098 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00097 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVPWD EQU   CTGFV+84
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVATR EQU   CTGFV+60
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVVLT EQU   CTGFV+40
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVENT EQU   CTGFV+20
CTGFVIND EQU   CTGFV+16
CTGFVVCH EQU   CTGFV+12
CTGFVICH EQU   CTGFV+8
CTGFVDCH EQU   CTGFV+4
@NM00096 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00095 EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXCCA   EQU   IGGCAXWA+104
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00094 EQU   COPTS
CENLST   EQU   COPTS
@NM00093 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXHACI  EQU   CAXCCR
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00092 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00091 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2REC EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00090 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00087 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00086 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00085 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00084 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00083 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00082 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00081 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00080 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00079 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00078 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00053 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00052 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00051 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00050 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00049 EQU   CVTFIX+248
@NM00048 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
CNTVAR   EQU   CNTRLINF
VARINFO  EQU   VARFIELD+2
VARLEN   EQU   VARFIELD
REPGOPT  EQU   REPCNTRL+6
REPCNT   EQU   REPCNTRL+5
@NM00047 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
NREPCV   EQU   CATRCD+47
RCDSIZ   EQU   CATRCD+45
@NM00046 EQU   CATRCD+26
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRACI EQU   CATRCD+11
RCDRELID EQU   CATRCD+4
RCDKEYTY EQU   CATRCD
CATGOGC  EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOEXT EQU   CATGOGC1
CATGODSP EQU   CATGOCI+1
@NM00045 EQU   CATGOFLG
CCACPE4  EQU   CCARAB+16
CCACPE3  EQU   CCARAB+12
@NM00044 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00043 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
DIC2LC   EQU   DIC2ENT+2
DIC2ST   EQU   DIC2ENT+1
@NM00042 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2VAR  EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
DICTLC   EQU   DICTENT+2
DICTST   EQU   DICTENT+1
@NM00041 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
WKALEN1  EQU   USERWKA
CTGFLNG  EQU   CTGFLDAT
CTGFLDTS EQU   CTGFLDRE
@NM00040 EQU   CTGFLDRE
CTGFLDNO EQU   CTGFL
CTGPSWD  EQU   CTGJSCB
@NM00038 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
CTGTYPE  EQU   CTGPL+18
@NM00037 EQU   CTGDSORG
CTGOPTNS EQU   CTGDSORG
@NM00036 EQU   CTGOPTN4
CTGTIOT  EQU   CTGOPTN4
CTGBYPMT EQU   CTGOPTN4
CTGCOIN  EQU   CTGOPTN4
@NM00035 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGFUNC  EQU   CTGOPTN3
@NM00034 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1536
@NM00033 EQU   IGGCCA+1496
CCAOCPL  EQU   IGGCCA+1492
CCASAVMN EQU   CCADGDGA
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
@NM00032 EQU   CCAFLG10
CCADEFUN EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00031 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
CCATNQCT EQU   IGGCCA+1416
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00030 EQU   CCAREGS
@NM00029 EQU   CCAFLG11
CCAF11B6 EQU   CCAFLG11
CCAF11B5 EQU   CCAFLG11
@NM00028 EQU   CCAFLG11
@NM00027 EQU   IGGCCA+1057
@NM00026 EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNADR EQU   CCAMNCAT+252
CCAMNLEN EQU   CCAMNCAT+249
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00025 EQU   MNATFLGS
MNATFCLS EQU   MNATFLGS
@NM00024 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00023 EQU   CCAMNAT+1
@NM00022 EQU   MNATTOP
MNATFULL EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00021 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00020 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00019 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
CCASAVID EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCAGVEXT EQU   IGGCCA+488
CCANEVV  EQU   IGGCCA+486
CCAGVCT  EQU   IGGCCA+484
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00018 EQU   CCAMSFLG
CCAGDGUY EQU   CCAMSFLG
CCASKYSS EQU   CCAMSFLG
CCACPLOK EQU   CCAMSFLG
CCACICIN EQU   CCAMSFLG
CCAUSKEY EQU   IGGCCA+400
CCASN1   EQU   CCASN
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCARABPT EQU   IGGCCA+368
CCATFLPT EQU   CCAFLPT
CCAILNG  EQU   IGGCCA+360
CCASL    EQU   IGGCCA+358
CCAGOPLN EQU   IGGCCA+356
CCACPE71 EQU   IGGCCA+352
CCAIDPT  EQU   CCACPE7
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCARPRM  EQU   IGGCCA+312
@NM00017 EQU   CCAMSSPL+10
CCAMNSPL EQU   CCAMSSPL+9
@NM00016 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00015 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCI  EQU   IGGCCA+271
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
CCATQDB  EQU   CCATIQRN+2
CCATASID EQU   CCATIQRN
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
CCAR5REC EQU   CCARAB5+4
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCAR5UR  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
CCAR4REC EQU   CCARAB4+4
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCAR4UR  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
CCAR3REC EQU   CCARAB3+4
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
CCAR1REC EQU   CCARAB1+4
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAMOD   EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCASUPFD EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNC  EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
CCACD2   EQU   IGGCCA+13
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCAMODID EQU   CCAPROB
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
@NM00077 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00076 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00075 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00074 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSAULCMS EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00073 EQU   FLCFSA
@NM00072 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00071 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00070 EQU   FLCIOA
@NM00069 EQU   FLCMCLA+15
@NM00068 EQU   FLCMCLA+14
@NM00067 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00066 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00065 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00064 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00063 EQU   FLCPER
@NM00062 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00061 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00060 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00059 EQU   FLCPIILC
@NM00058 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00057 EQU   FLCSVILC
@NM00056 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00055 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00054 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@PB00004 EQU   @EL00001
@PB00003 EQU   @PB00004
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IGG0CLBZ,(C'PLS1414',0701,78174)
