         TITLE 'IGG0CLB6 VSAM TSO INTERFACE FOR SECURITY               *
                        '
IGG0CLB6 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLB6  78.090'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
JSCBDISP EQU 188
JSCBAOS1 EQU  72
JSCBAOS2 EQU 192
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPWTSO'
         EJECT
         B     @PB00002                                            0129
IGGPWTSO DS    0H                                                  0130
         ENTRY IGGPWTSO
         DROP @15
Z003     DS    0H                                                  0132
Z003WTSO DS    0H                                                  0133
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
*   IF UPTNPRM=ON                   /* NO PROMPTING TO TERMINAL      */
*       ×ASCBTSB=NULL THEN          /* OR NOT A TS JOB         Y02020*/
         L     @10,CVTPTR                                          0142
         L     @10,CVTTCBP(,@10)                                   0142
         L     @10,TCBPTR(,@10)                                    0142
         L     @10,TCBJSCB(,@10)                                   0142
         L     @10,JSCBACT(,@10)                                   0142
         L     @10,PSCBPTR(,@10)                                   0142
         L     @10,PSCBUPT(,@10)                                   0142
         TM    UPTNPRM(@10),B'01000000'                            0142
         BO    @RT00142                                            0142
         L     @10,PSAAOLD                                         0142
         ICM   @05,15,ASCBTSB(@10)                                 0142
         BNZ   @RF00142                                            0142
@RT00142 DS    0H                                                  0143
*     DO;                           /* ERROR SITUATION               */
*                                                                  0143
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='B6', CCAREASN=RSN10, CCARETRN=RCSEC         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0144
*       CCAPROB=IGGSEGID+(RSN10*K256)+RCSEC;/* SET ERROR CODE      0144
*                                                            @Y30SSSB*/
         MVC   CCAPROB(4,R11),@CF03821                             0144
*       CALL EXIT;                  /* ERROR EXIT                    */
         BAL   @14,EXIT                                            0145
*     END;                                                         0146
*   ELSE                                                           0147
*     ;                             /* TERMINAL PROMPTS OKAY         */
*                                                                  0147
@RF00142 DS    0H                                                  0148
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR FIRST TIME CHECK AND IF THERE IS A LOGON PSWD       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0148
*   IF TSBPSWD^=NOPASSWD&           /* VALID LOGON P.W. &      Y02020*/
*       (CKAUATMP=CKWAATMP×         /* FIRST PROMPT ATTEMPT          */
*       (CKAUBDPW=ON&CKAUATMP=CKWAATMP+INCR1)) THEN                0148
         L     @10,PSAAOLD                                         0148
         L     @10,ASCBTSB(,@10)                                   0148
         CLC   TSBPSWD(8,@10),NOPASSWD                             0148
         BE    @RF00148                                            0148
         L     @10,CCAR5REC(,R11)                                  0148
         LH    @05,CKAUATMP+216(,@10)                              0148
         SLR   @15,@15                                             0148
         IC    @15,CKWAATMP(,@10)                                  0148
         CR    @05,@15                                             0148
         BE    @RT00148                                            0148
         TM    CKAUBDPW(@10),B'01000000'                           0148
         BNO   @RF00148                                            0148
         AH    @15,@CH00038                                        0148
         CR    @05,@15                                             0148
         BNE   @RF00148                                            0148
@RT00148 DS    0H                                                  0149
*     DO;                           /* TRY TO USE LOGON PASSWORD     */
*       CKAUPSWK=TSBPSWD;           /* SET LOGON PASSWORD      Y02020*/
         L     @10,CCAR5REC(,R11)                                  0150
         L     @05,PSAAOLD                                         0150
         L     @05,ASCBTSB(,@05)                                   0150
         MVC   CKAUPSWK(8,@10),TSBPSWD(@05)                        0150
*       CALL EXIT;                  /* RETURN FOR VERIFY TRY         */
         BAL   @14,EXIT                                            0151
*     END;                                                         0152
*   ELSE                                                           0153
*     ;                             /* NOT FIRST TRY OR LOGON      0153
*                                      PASSWORD INVALID              */
@RF00148 DS    0H                                                  0154
*   IF CKAUATMP=CKWAATMP×           /* FIRST PROMPT ATTEMPT OR       */
*       (TSBPSWD^=NOPASSWD&         /* LOGON PASSWORD AND      Y02020*/
*       CKAUATMP=CKWAATMP+INCR2)×   /* FST SEC PROMPT ATTEMPT        */
*       (TSBPSWD=NOPASSWD&CKAUATMP=CKWAATMP+INCR1) THEN/*      Y02020*/
         L     @10,CCAR5REC(,R11)                                  0154
         LH    @05,CKAUATMP+216(,@10)                              0154
         SLR   @15,@15                                             0154
         IC    @15,CKWAATMP(,@10)                                  0154
         CR    @05,@15                                             0154
         BE    @RT00154                                            0154
         L     @10,PSAAOLD                                         0154
         L     @10,ASCBTSB(,@10)                                   0154
         CLC   TSBPSWD(8,@10),NOPASSWD                             0154
         BE    @GL00005                                            0154
         AH    @15,@CH00056                                        0154
         CR    @05,@15                                             0154
         BE    @RT00154                                            0154
@GL00005 L     @10,PSAAOLD                                         0154
         L     @10,ASCBTSB(,@10)                                   0154
         CLC   TSBPSWD(8,@10),NOPASSWD                             0154
         BNE   @RF00154                                            0154
         L     @10,CCAR5REC(,R11)                                  0154
         LA    @05,1                                               0154
         SLR   @15,@15                                             0154
         IC    @15,CKWAATMP(,@10)                                  0154
         ALR   @05,@15                                             0154
         CH    @05,CKAUATMP+216(,@10)                              0154
         BNE   @RF00154                                            0154
@RT00154 DS    0H                                                  0155
*     DO;                           /* WRITE FIRST TSO MESSAGE       */
*       CKAUMSG=FRSTMSG;            /* SET FIRST MESSAGE TEXT        */
         L     @10,CCAR5REC(,R11)                                  0156
         LA    @05,36                                              0156
         ALR   @05,@10                                             0156
         MVI   CKAUMSG+36(@05),C' '                                0156
         MVC   CKAUMSG+37(47,@05),CKAUMSG+36(@05)                  0156
         MVC   CKAUMSG(36,@05),FRSTMSG                             0156
*       R4=LENGTH(FRSTMSG)+INCR1;   /* FIRST TSO MESSAGE SIZE        */
*                                                                  0157
         LA    R4,37                                               0157
*       /*************************************************************/
*       /*                                                           */
*       /* SET DATA SET NAME OR PROMPTING NAME IN MESSAGE            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0158
*       IF CKAUPRMT=NULLPRMT THEN   /* NO PROMPTING NAME             */
         CLC   CKAUPRMT+216(8,@10),NULLPRMT                        0158
         BNE   @RF00158                                            0158
*         DO;                       /* USE DSNAME IN MESSAGE TXT     */
*           CKAUMSG(R4:R4+LENGTH(CKAUEDSN))=CKAUEDSN;/* SET THE DATA
*                                      SET NAME                      */
         LR    @01,@05                                             0160
         ALR   @01,R4                                              0160
         MVI   CKAUMSG+43(@01),C' '                                0160
         MVC   CKAUMSG-1(44,@01),CKAUEDSN(@10)                     0160
*           CKAUMGSZ=R4-INCR1+LENGTH(CKAUEDSN);/* MSG LNG            */
         LA    @10,43                                              0161
         ALR   @10,R4                                              0161
         STH   @10,CKAUMGSZ(,@05)                                  0161
*         END;                                                     0162
*       ELSE                        /* PROMPTING NAME PRESENT        */
*         DO;                       /* USE PROMPTING NAME VALUE      */
         B     @RC00158                                            0163
@RF00158 DS    0H                                                  0164
*           CKAUMSG(R4:R4+LENGTH(CKAUPRMT))=CKAUPRMT;/* SET PROMPTING
*                                      NAME IN MSG                   */
         L     @10,CCAR5REC(,R11)                                  0164
         LA    @05,36                                              0164
         ALR   @05,@10                                             0164
         LR    @01,@05                                             0164
         ALR   @01,R4                                              0164
         MVI   CKAUMSG+7(@01),C' '                                 0164
         MVC   CKAUMSG-1(8,@01),CKAUPRMT+216(@10)                  0164
*           CKAUMGSZ=R4-INCR1+LENGTH(CKAUPRMT);/* MSG LNG            */
         LA    @10,7                                               0165
         ALR   @10,R4                                              0165
         STH   @10,CKAUMGSZ(,@05)                                  0165
*         END;                                                     0166
*                                                                  0166
*       /*************************************************************/
*       /*                                                           */
*       /* FIND THE FIRST BLANK CHARACTER IN THE NAME, IF ANY        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0167
*       DO CKAUMGSZ=CKAUMGSZ BY-INCR1 WHILE(NAMECHAR(CKAUMGSZ)=BLNKCHAR
*             );                                                   0167
@RC00158 B     @DE00167                                            0167
@DL00167 DS    0H                                                  0168
*       END;                                                       0168
         L     @05,CCAR5REC(,R11)                                  0168
         SLR   @10,@10                                             0168
         BCTR  @10,0                                               0168
         AH    @10,CKAUMGSZ+36(,@05)                               0168
         L     @05,CCAR5REC(,R11)                                  0168
         STH   @10,CKAUMGSZ+36(,@05)                               0168
@DE00167 L     @10,CCAR5REC(,R11)                                  0168
         LA    @05,36                                              0168
         ALR   @05,@10                                             0168
         LH    @15,CKAUMGSZ(,@05)                                  0168
         AH    @10,@CH00127                                        0168
         ST    @15,@TF00001                                        0168
         ALR   @15,@10                                             0168
         BCTR  @15,0                                               0168
         CLI   NAMECHAR(@15),C' '                                  0168
         BE    @DL00167                                            0168
*       CKAUMGSZ=CKAUMGSZ+INCR2;    /* SET LENGTH TO 1ST BLNK        */
         LA    @15,2                                               0169
         AL    @15,@TF00001                                        0169
         STH   @15,CKAUMGSZ(,@05)                                  0169
*       NAMECHAR(CKAUMGSZ)=BYPSPRNT;/* SET BYPASS PRINT              */
         SLR   @14,@14                                             0170
         IC    @14,BYPSPRNT                                        0170
         BCTR  @10,0                                               0170
         STC   @14,NAMECHAR(@15,@10)                               0170
*       RFY                                                        0171
*        (R0,                                                      0171
*         R1) RSTD;                                                0171
*       R0=CKAUMGSZ;                /* SET MESSAGE TEXT LENGTH       */
         LR    R0,@15                                              0172
*       R1=ADDR(CKAUMSG);           /* MESSAGE LOCATION              */
         LA    R1,CKAUMSG(,@05)                                    0173
*       IF UPTMID=OFF THEN          /* NO PRINT OF MESSAGE ID        */
         L     @10,CVTPTR                                          0174
         L     @10,CVTTCBP(,@10)                                   0174
         L     @10,TCBPTR(,@10)                                    0174
         L     @10,TCBJSCB(,@10)                                   0174
         L     @10,JSCBACT(,@10)                                   0174
         L     @10,PSCBPTR(,@10)                                   0174
         L     @10,PSCBUPT(,@10)                                   0174
         TM    UPTMID(@10),B'00100000'                             0174
         BNZ   @RF00174                                            0174
*         DO;                       /* UPDATE MESSAGE INFO           */
*           R0=R0-LNGMSGID;         /* UPDATE MESSAGE LENGTH         */
         LA    @10,8                                               0176
         SLR   R0,@10                                              0176
*           R1=R1+LNGMSGID;         /* UPDATE MESSAGE ADDRESS        */
         ALR   R1,@10                                              0177
*         END;                                                     0178
*       ELSE                                                       0179
*         ;                         /* PRINT MESSAGE WITH ID         */
@RF00174 DS    0H                                                  0180
*Z005GTSO:                                                         0180
*       CALL IGGPGTSO;              /* PERFORM THE TSO SVCS          */
Z005GTSO BAL   @14,IGGPGTSO                                        0180
*       RFY                                                        0181
*        (R0,                                                      0181
*         R1) UNRSTD;                                              0181
*     END;                                                         0182
*   ELSE                            /* RE-PROMPT OF TERMINAL         */
*     DO;                           /* SEND RE-PROMPT MESSAGE        */
         B     @RC00154                                            0183
@RF00154 DS    0H                                                  0184
*       CKAUMSG=R1PMTMSG;           /* SET REPROMPT MESSAGE TXT      */
         L     @10,CCAR5REC(,R11)                                  0184
         LA    @05,36                                              0184
         ALR   @05,@10                                             0184
         MVI   CKAUMSG+25(@05),C' '                                0184
         MVC   CKAUMSG+26(58,@05),CKAUMSG+25(@05)                  0184
         MVC   CKAUMSG(25,@05),R1PMTMSG                            0184
*       CCACD2=INCR1;               /* INDICATE TPUT ONLY            */
         MVI   CCACD2(R11),X'01'                                   0185
*       RFY                                                        0186
*        (R0,                                                      0186
*         R1) RSTD;                                                0186
*       R0=LENGTH(R1PMTMSG);        /* SET MESSAGE LENGTH            */
         LA    R0,25                                               0187
*       NAMECHAR(R0)=NEWLCHAR;      /* SET NEW LINE CONTROL CHAR     */
         SLR   @15,@15                                             0188
         IC    @15,NEWLCHAR                                        0188
         LR    @14,R0                                              0188
         STC   @15,NAMECHAR+51(@14,@10)                            0188
*       R1=ADDR(CKAUMSG);           /* SET MESSAGE ADDRESS           */
         LA    R1,CKAUMSG(,@05)                                    0189
*       IF UPTMID=OFF THEN          /* MESSAGE ID NOT NEEDED         */
         L     @10,CVTPTR                                          0190
         L     @10,CVTTCBP(,@10)                                   0190
         L     @10,TCBPTR(,@10)                                    0190
         L     @10,TCBJSCB(,@10)                                   0190
         L     @10,JSCBACT(,@10)                                   0190
         L     @10,PSCBPTR(,@10)                                   0190
         L     @10,PSCBUPT(,@10)                                   0190
         TM    UPTMID(@10),B'00100000'                             0190
         BNZ   @RF00190                                            0190
*         DO;                       /* UPDATE MESSAGE INFORMATON     */
*           R0=R0-LNGMSGID;         /* RE-SET MESSAGE LENGTH         */
         LA    @10,8                                               0192
         SLR   R0,@10                                              0192
*           R1=R1+LNGMSGID;         /* RE-SET MESSAGE LOCATION       */
         ALR   R1,@10                                              0193
*         END;                                                     0194
*       ELSE                                                       0195
*         ;                         /* PRINT MESSAGE WITH ID         */
@RF00190 DS    0H                                                  0196
*Z006GTSO:                                                         0196
*       CALL IGGPGTSO;              /* PERFORM THE TSO SVC           */
Z006GTSO BAL   @14,IGGPGTSO                                        0196
*       CKAUMSG=R2PMTMSG;           /* SET 2ND REPROMPT MSG TEXT     */
         L     @10,CCAR5REC(,R11)                                  0197
         LA    @05,36                                              0197
         ALR   @05,@10                                             0197
         MVI   CKAUMSG+17(@05),C' '                                0197
         MVC   CKAUMSG+18(66,@05),CKAUMSG+17(@05)                  0197
         MVC   CKAUMSG(17,@05),R2PMTMSG                            0197
*       CCACD2=OKAY;                /* CLEAR SHORT PROC INDICATE     */
         MVI   CCACD2(R11),X'00'                                   0198
*       R0=LENGTH(R2PMTMSG);        /* SET MESSAGE LENGTH            */
         LA    R0,17                                               0199
*       NAMECHAR(R0)=BYPSPRNT;      /* SET BYPASS PRINT CHAR         */
         SLR   @15,@15                                             0200
         IC    @15,BYPSPRNT                                        0200
         LR    @14,R0                                              0200
         STC   @15,NAMECHAR+51(@14,@10)                            0200
*       R1=ADDR(CKAUMSG);           /* SET MESSAGE LOCATION          */
         LA    R1,CKAUMSG(,@05)                                    0201
*       IF UPTMID=OFF THEN          /* MESSAGE ID NOT NEEDED         */
         L     @10,CVTPTR                                          0202
         L     @10,CVTTCBP(,@10)                                   0202
         L     @10,TCBPTR(,@10)                                    0202
         L     @10,TCBJSCB(,@10)                                   0202
         L     @10,JSCBACT(,@10)                                   0202
         L     @10,PSCBPTR(,@10)                                   0202
         L     @10,PSCBUPT(,@10)                                   0202
         TM    UPTMID(@10),B'00100000'                             0202
         BNZ   @RF00202                                            0202
*         DO;                       /* UPDATE MESSAGE INFO           */
*           R0=R0-LNGMSGID;         /* RE-SET MESSAGE LENGTH         */
         LA    @10,8                                               0204
         SLR   R0,@10                                              0204
*           R1=R1+LNGMSGID;         /* UPDATE ADDR TO SKIP ID        */
         ALR   R1,@10                                              0205
*         END;                                                     0206
*       ELSE                                                       0207
*         ;                         /* PRINT MESSAGE ID              */
@RF00202 DS    0H                                                  0208
*Z007GTSO:                                                         0208
*       CALL IGGPGTSO;              /* PERFORM THE TSO SVCS          */
Z007GTSO BAL   @14,IGGPGTSO                                        0208
*       RFY                                                        0209
*        (R0,                                                      0209
*         R1) UNRSTD;                                              0209
*     END;                                                         0210
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RC00154 BAL   @14,EXIT                                            0211
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPGTSO');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPGTSO'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0214
@EF00002 DS    0H                                                  0214
@ER00002 BR    @14                                                 0214
@PB00002 DS    0H                                                  0215
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0216
*/********************************************************************/
*/*                                                                  */
*/*        IGGPGTSO  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0216
*IGGPGTSO:                                                         0216
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00003                                            0216
IGGPGTSO DS    0H                                                  0217
*Z008:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z008GTSO:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0217
*    (R5,                                                          0217
*     R6,                                                          0217
*     R7,                                                          0217
*     R8,                                                          0217
*     R9,                                                          0217
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z008     DS    0H                                                  0217
Z008GTSO DS    0H                                                  0218
*   RFY                                                            0218
*    (R2,                                                          0218
*     R3,                                                          0218
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
*                                                                  0220
         LA 13,12(13)
*   /*****************************************************************/
*   /*                                                               */
*   /* IGGPGTSO - THIS IS AN INTER(AL PROCEDURE THAT ISSUES THE      */
*   /* APPROPRIATE TSO SVC REQUESTS. TGETS TO RECEIVE TERMINAL       */
*   /* REPLIES AND TPUTS TO SEND MESSAGES TO THE TSO TERMINAL.       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0221
*   RFY                                                            0221
*    (R0,                                                          0221
*     R1) RSTD;                                                    0221
*   IF CCACD2=OKAY THEN             /* NORMAL MESSAGE SEQUENCE       */
         CLI   CCACD2(R11),0                                       0222
         BNE   @RF00222                                            0222
*     DO;                           /* TPUT MSG & TGET REPLY         */
*       R1=R1×TPUTASIS;             /* SET TPUT ASIS OPTION          */
         O     R1,TPUTASIS                                         0224
*       GEN(TPUT (1),(0),R);        /* TPUT THE MESSAGE TEXT         */
*                                                                  0225
         TPUT (1),(0),R
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLA3                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0226
*Z009RPLF:                                                         0226
*       CALL IGGPRPLF;              /* FREE CAT RESOURCE     @Y30SSSB*/
Z009RPLF L     @15,@CV03739                                        0226
         BALR  @14,@15                                             0226
*       R0=LENGTH(CKAUPSWK);        /* REPLY LENGTH                  */
         LA    R0,8                                                0227
*       R1=ADDR(CKAUPSWK)×TGETWAIT; /* REPLY LOCATION & OPTS         */
         L     R1,CCAR5REC(,R11)                                   0228
         LA    R1,CKAUPSWK(,R1)                                    0228
         O     R1,TGETWAIT                                         0228
*       GEN(TGET (1),(0),R);        /* TGET THE REPLY                */
         TGET (1),(0),R
*       RFY                                                        0230
*        (R15) RSTD;                                               0230
*       IF R15^=NONE THEN           /* CHECK FOR AN ERROR CODE       */
*                                                                  0231
         LTR   R15,R15                                             0231
         BZ    @RF00231                                            0231
*         /***********************************************************/
*         /*                                                         */
*         /* SET CCAMODID='B6', CCAREASN=RSN12, CCARETRN=RCSEC       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0232
*         CCAPROB=IGGSEGID+(RSN12*K256)+RCSEC;/* SET ERROR CODE    0232
*                                                            @Y30SSSB*/
         MVC   CCAPROB(4,R11),@CF03828                             0232
*       ELSE                                                       0233
*         ;                         /* NO ERROR PRESENT              */
@RF00231 DS    0H                                                  0234
*       RFY                                                        0234
*        (R15) UNRSTD;                                             0234
*       CCAPROBX=CCAPROB;           /* SAVE ERROR CODES      @Y30SSSB*/
         MVC   CCAPROBX(4,R11),CCAPROB(R11)                        0235
*       CCAPROB=NONE;               /* CLEAR ERROR CODE      @Y30SSSB*/
*                                                                  0236
         SLR   @10,@10                                             0236
         ST    @10,CCAPROB(,R11)                                   0236
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLA3                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0237
*Z011RPLM:                                                         0237
*       CALL IGGPRPLM;              /* GET CAT RESOURCE      @Y30SSSB*/
Z011RPLM L     @15,@CV03740                                        0237
         BALR  @14,@15                                             0237
*       IF CCACD1=RCS THEN          /* NO ERRORS             @Y30SSSB*/
         CLI   CCACD1(R11),0                                       0238
         BNE   @RF00238                                            0238
*         CCAPROB=CCAPROBX;         /* RESTORE ANY CODES     @Y30SSSB*/
         MVC   CCAPROB(4,R11),CCAPROBX(R11)                        0239
*       ELSE                                                       0240
*         ;                         /* PASS CODE BACK        @Y30SSSB*/
@RF00238 DS    0H                                                  0241
*       CKAUPSWK=CKAUPSWK×BLANKNME; /* FOLD REPLY TO UPPER           */
         L     @10,CCAR5REC(,R11)                                  0241
         OC    CKAUPSWK(8,@10),@CC03599                            0241
*       CKAUMSG(1:1)=RESTCHAR;      /* SET RESTORE CHAR IN BUFFR     */
         AH    @10,@CH00119                                        0242
         MVC   CKAUMSG(1,@10),RESTCHAR                             0242
*       R0=INCR1;                   /* SET LENGTH                    */
         LA    R0,1                                                0243
*       R1=ADDR(CKAUMSG);           /* SET ADDRESS                   */
         LA    R1,CKAUMSG(,@10)                                    0244
*     END;                                                         0245
*   ELSE                                                           0246
*     ;                             /* PUT MESSAGE SEQUENCE ONLY     */
@RF00222 DS    0H                                                  0247
*   R1=R1×TPUTASIS;                 /* SET TPUT ASIS OPTION          */
         O     R1,TPUTASIS                                         0247
*   GEN(TPUT (1),(0),R);            /* TPUT THE MESSAGE              */
         TPUT (1),(0),R
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0249
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPSPSC');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPSPSC'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00003 DS    0H                                                  0252
@EF00003 DS    0H                                                  0252
@ER00003 BR    @14                                                 0252
@PB00003 DS    0H                                                  0253
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0254
*/********************************************************************/
*/*                                                                  */
*/*        IGGPSPSC  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0254
*IGGPSPSC:                                                         0254
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00004                                            0254
IGGPSPSC DS    0H                                                  0255
*   GEN(ENTRY IGGPSPSC );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPSPSC
*Z012:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z012SPSC:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0256
*    (R5,                                                          0256
*     R6,                                                          0256
*     R7,                                                          0256
*     R8,                                                          0256
*     R9,                                                          0256
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z012     DS    0H                                                  0256
Z012SPSC DS    0H                                                  0257
*   RFY                                                            0257
*    (R2,                                                          0257
*     R3,                                                          0257
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPSPSC                                          *
**                                                                    *
**   DESCRIPTIVE NAME =  SPECIAL SITUATION CHECK                      *
**                                                                    *
**   COPYRIGHT =  NONE                                                *
**                                                                    *
**   STATUS =  RELEASE 1, LEVEL 0                                     *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS EXTERNAL PROCEDURE EXAMINES THE CALLER PROVIDED CPL AND  *
**      DETERMINES IF THIS IS A REQUEST IN WHICH VERIFICATION IS NOT  *
**      REQUIRED OR IF THE CATALOG RECORD IS NEEDED FOR VERIFICATION  *
**      (DEFINE). FOLLOWING ITEMS ARE THE BASE ASSUMPTIONS FOR THIS   *
**      SPECIAL CHECKING AND HANDLING:                                *
**      A. NO VERIFICATION IS REQUIRED FOR THE FOLLWING:              *
**         1. LOCATE ON ALIEN OBJECTS.                                *
**         2. NON-VSAM LOCATE ON ALIEN OBJECTS                        *
**         3. LOCATE ON VOLUME ENTRY RECORDS                          *
**         4. DEFINE OF MASTER CATALOGS                               *
**      B. SPECIAL PROCESSING FOR CMS FUNCTIONS:                      *
**         1. DELETE OF ALIEN OR VOLUME RECORD ENTRIES REQUIRES THAT  *
**            CATALOG SECURITY BE VERIFIED.                           *
**         2. DEFINE OF ANYTHING OTHER THAN MASTER CATALOGS REQUIRES  *
**            THAT CATALOG SECURITY BE VERIFIED.                      *
**         3. THE ABOVE SITUATIONS ARE HANDLED BY SAVING THE CI OF    *
**            THE ORIGINAL RECORD, IF ONE EXISTS, AND READING THE     *
**            CATALOG RECORD THAT MAY CONTAIN SECURITY INFORMATION    *
**            IF IT EXISTS.                                           *
**      C. IF SECURITY VERIFICATION IS NOT REQUIRED A NON-ZERO VALUE  *
**         WILL BE RETURNED IN CCACD2.                                *
**                                                                    *
**   INPUT =                                                          *
**      CCA                                                           *
**        CCACPL - USER PROVIDED CATALOG PARAMETER LIST               *
**          CTGFUNC - FUNCTION TYPE                                   *
**          CTGAM0  - VSAM REQUEST BIT                                *
**          CTGOPTNS - CMS FUNCTION TYPE                              *
**          CTGTYPE  - ENTRY TYPE                                     *
**      CCAURAB                                                       *
**        CCACPE1                                                     *
**          RCDID - RECORD TYPE INDENTIFICATION                       *
**          RCDCINO - RECORD CI NUMBER                                *
**                                                                    *
**   OUTPUT =                                                         *
**      CCA                                                           *
**        CCAR5REC                                                    *
**          CKAUWKA                                                   *
**            REGETCI - RE-GET RECORD CI VALUE                        *
**        CCACD2 - NO VERIFICATION REQUIRED INDICATOR                 *
**        CCASRCIN                                                    *
**                                                                    *
**     MESSAGES =  NONE                                               *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0263
*   /*****************************************************************/
*   /*                                                               */
*   /* IGGPSPSC - THIS IS AN EXTERNAL PROCEDURE THAT CHECKS FOR      */
*   /* SPECIAL SITUATIONS AND DETERMINES WHAT LEVELS OF SECURITY NEED*/
*   /* TO BE VERIFIED AND ON WHICH ENTITY SECURITY VERIFICATION IS TO*/
*   /* TAKE PLACE. ALSO, IT CHECKS FOR CASES IN WHICH VERIFICATION IS*/
*   /* NOT REQUIRED                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0263
*   CKAUCATC=OFF;                   /* ASSUME NO CAT CHK     @Z40RSRC*/
*                                                                  0263
         L     @10,CCAR5REC(,R11)                                  0263
         NI    CKAUCATC(@10),B'11110111'                           0263
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE IF CATALOG IS RAC DEFINED                   @Z40RSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0264
*   IF CAXRACP=NONE THEN            /* IF NOT YET CHK'D      @Z40RSRC*/
         L     @10,CCAACB(,R11)                                    0264
         L     @10,ACBUAPTR(,@10)                                  0264
         ICM   @05,15,CAXRACP(@10)                                 0264
         BNZ   @RF00264                                            0264
*     DO;                           /*                       @Z40RSRC*/
*                                                                  0265
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBM                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0266
*Z013CKCC:                                                         0266
*       CALL IGGPCKCC;              /* CHK IF RAC DEF'D      @Z40RSRC*/
Z013CKCC BAL   @14,IGGPCKCC                                        0266
*       IF CAXRAC=OFF THEN          /* IF NOT RAC DEF'D      @Z40RSRC*/
         L     @10,CCAACB(,R11)                                    0267
         L     @10,ACBUAPTR(,@10)                                  0267
         TM    CAXRAC(@10),B'00010000'                             0267
         BNZ   @RF00267                                            0267
*         CAXRACP=INCR1;            /* INDICATED CHECKED     @Z40RSRC*/
         MVC   CAXRACP(4,@10),@CF00038                             0268
*       ELSE                                                       0269
*         ;                         /* CAXRACP WILL BE FILLED IN   0269
*                                      AFTER 1ST RACHECK     @Z40RSRC*/
@RF00267 DS    0H                                                  0270
*     END;                          /*                       @Z40RSRC*/
*   ELSE                                                           0271
*     ;                             /* RAC ALREADY CHK'D     @Z40RSRC*/
@RF00264 DS    0H                                                  0272
*   CCACD2=INCR1;                   /* SET EARLY RETURN CODE         */
*                                                                  0272
         MVI   CCACD2(R11),X'01'                                   0272
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR SPECIAL LOCATE SITUATIONS                   @Z40RSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0273
*   IF CTGFUNC=CTGLOC&              /* LOCATE FUNCTION       @Y30DSSB*/
*       CTGMAST=OFF&CTGCI=OFF&      /* NOT REQUEST TO        @Y30SSSB*/
*       CTGUPD=OFF&CTGREAD=OFF&     /* VERIFY SECURITY       @Z40RSRC*/
*       CCAGC4=OFF THEN             /* NOT LOC SECURE DATA   @Y30SSSB*/
         L     @10,CCACPL(,R11)                                    0273
         TM    CTGFUNC(@10),B'00100000'                            0273
         BNO   @RF00273                                            0273
         TM    CTGFUNC(@10),B'11000000'                            0273
         BNZ   @RF00273                                            0273
         TM    CTGMAST(@10),B'01111000'                            0273
         BNZ   @RF00273                                            0273
         TM    CCAGC4(R11),B'01000000'                             0273
         BNZ   @RF00273                                            0273
*     CALL EXIT;                    /* RETURN                @Y30SSSB*/
         BAL   @14,EXIT                                            0274
*   ELSE                                                           0275
*     ;                             /* NON-LOCATE FUNCTION   @Y30SSSB*/
*                                                                  0275
@RF00273 DS    0H                                                  0276
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR LOCATE ON A VOLUME ENTRY RECORD                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0276
*   IF CTGFUNC=CTGLOC&              /* LOCATE REQUEST                */
*       RCDID=CTGTVOL&              /* VOLUME ENTRY RECORD           */
*       CTGMAST=OFF THEN            /* VERIFY MASTER OK      @Y30LSSB*/
         L     @10,CCACPL(,R11)                                    0276
         TM    CTGFUNC(@10),B'00100000'                            0276
         BNO   @RF00276                                            0276
         TM    CTGFUNC(@10),B'11000000'                            0276
         BNZ   @RF00276                                            0276
         L     @05,CCAURAB(,R11)                                   0276
         L     @05,CCACPE1(,@05)                                   0276
         CLI   RCDID(@05),C'V'                                     0276
         BNE   @RF00276                                            0276
         TM    CTGMAST(@10),B'01000000'                            0276
         BNZ   @RF00276                                            0276
*     CALL EXIT;                    /* NO SECURITY EXIT              */
         BAL   @14,EXIT                                            0277
*   ELSE                                                           0278
*     ;                                                            0278
@RF00276 DS    0H                                                  0279
*   IF CCAF11B6=ON&                 /* IF NO UPDATE PSWD     @ZA30975*/
*       CAXRAC=OFF&                 /* & NOT RAC DEF'D       @Z40RSRC*/
*       CTGFUNC=CTGCMS&CTGOPTNS=CTGDEFIN THEN/* & DEF        @Z30TSBM*/
         TM    CCAF11B6(R11),B'00000100'                           0279
         BNO   @RF00279                                            0279
         L     @10,CCAACB(,R11)                                    0279
         L     @10,ACBUAPTR(,@10)                                  0279
         TM    CAXRAC(@10),B'00010000'                             0279
         BNZ   @RF00279                                            0279
         L     @10,CCACPL(,R11)                                    0279
         TM    CTGFUNC(@10),B'10000000'                            0279
         BNO   @RF00279                                            0279
         TM    CTGFUNC(@10),B'01100000'                            0279
         BNZ   @RF00279                                            0279
         TM    CTGOPTNS(@10),B'00001000'                           0279
         BNO   @RF00279                                            0279
         TM    CTGOPTNS(@10),B'11110000'                           0279
         BNZ   @RF00279                                            0279
*     CALL EXIT;                    /* NO SECURITY EXIT      @Z30TSBM*/
*                                                                  0280
         BAL   @14,EXIT                                            0280
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF THE CALLER OF THIS CALLER WAS PRIVILEGED             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0281
*   RFY                                                            0281
*    (R1) RSTD;                                                    0281
@RF00279 DS    0H                                                  0282
*   R1=CCARB->XRBLNK->XRBLNK;       /* GET ADDRESS OF SVRB           */
         L     @10,CCARB(,R11)                                     0282
         L     @10,XRBLNK(,@10)                                    0282
         L     R1,XRBLNK(,@10)                                     0282
*   IF(R1^=CCATCB&((CTGFUNC=CTGLOC)×(CTGOPTNS=CTGDELET&CTGENT->ENTRYNM2
*       =STGINDX)×(CTGOPTNS=CTGDEFIN&CTGFVT->CTGFVENT->ENTRYNM2=STGINDX
*       )))&CTGBYPMT=OFF            /*                       @YM43286*/
*     THEN                          /* CHECK FOR NOT TCB ADDR      0283
*                                                            @ZA06709
*                                      AND A LOCATE REQ      @ZA06709
*                                      OR DELETE OF SYS1.STGINDEX OR
*                                      DEFINE OF SYS1.STGINDEX     0283
*                                                            @ZA06709
*                                      AND BYPASS PROMPTING OFF    0283
*                                                            @YM43286*/
         C     R1,CCATCB(,R11)                                     0283
         BE    @RF00283                                            0283
         L     @10,CCACPL(,R11)                                    0283
         TM    CTGFUNC(@10),B'00100000'                            0283
         BNO   @GL00019                                            0283
         TM    CTGFUNC(@10),B'11000000'                            0283
         BZ    @GL00016                                            0283
@GL00019 L     @10,CCACPL(,R11)                                    0283
         TM    CTGOPTNS(@10),B'00011000'                           0283
         BNO   @GL00018                                            0283
         TM    CTGOPTNS(@10),B'11100000'                           0283
         BNZ   @GL00018                                            0283
         L     @10,CTGENT(,@10)                                    0283
         CLC   ENTRYNM2(13,@10),@CC03622                           0283
         BE    @GL00016                                            0283
@GL00018 L     @10,CCACPL(,R11)                                    0283
         TM    CTGOPTNS(@10),B'00001000'                           0283
         BNO   @RF00283                                            0283
         TM    CTGOPTNS(@10),B'11110000'                           0283
         BNZ   @RF00283                                            0283
         L     @10,CTGFVT(,@10)                                    0283
         L     @10,CTGFVENT(,@10)                                  0283
         CLC   ENTRYNM2(13,@10),@CC03622                           0283
         BNE   @RF00283                                            0283
@GL00016 L     @10,CCACPL(,R11)                                    0283
         TM    CTGBYPMT(@10),B'00001000'                           0283
         BNZ   @RF00283                                            0283
*     IF RBRPSWPK='0000'B×          /* CHECK FOR KEY ZERO USER       */
*         RBRPSWPS=OFF THEN         /* CHECK FOR PRIVILEGED STAT     */
         LA    @10,16                                              0284
         ALR   @10,R1                                              0284
         TM    RBRPSWPK(@10),B'11110000'                           0284
         BZ    @RT00284                                            0284
         TM    RBRPSWPS(@10),B'00000001'                           0284
         BNZ   @RF00284                                            0284
@RT00284 DS    0H                                                  0285
*       DO;                         /* BYPASS VERIFY         @Y30SSSB*/
*         CCASUPFD=ON;              /* SET BYPASS INDIC      @Y30SSSB*/
         OI    CCASUPFD(R11),B'00001000'                           0286
*         CALL EXIT;                /* RETURN                @Y30SSSB*/
         BAL   @14,EXIT                                            0287
*       END;                        /* NO BYPASS VERIFY      @Y30SSSB*/
*     ELSE                                                         0289
*       ;                           /* NOT PRIVILEGED OR KEY 0       */
@RF00284 DS    0H                                                  0290
*   ELSE                                                           0290
*     ;                             /* NOT LOCATE OR PROPER TASK     */
@RF00283 DS    0H                                                  0291
*   RFY                                                            0291
*    (R1) UNRSTD;                                                  0291
*                                                                  0291
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR CATALOG-ONLY VERIFICATION SITUATIONS.       @Z40RSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0292
*   CCACD2=OKAY;                    /* CLEAR THE SIGNAL BYTE         */
         MVI   CCACD2(R11),X'00'                                   0292
*   IF CTGFUNC=CTGCMS×              /* CMS TYPE FUNCTION     @Z40RSRC*/
*       (CTGFUNC=CTGLOC&            /* LOCATE OF VOL REC     @Z40RSRC*/
*       RCDID=CTGTVOL) THEN         /* WITH MPWD REQUEST     @Z40RSRC*/
         L     @01,CCACPL(,R11)                                    0293
         TM    CTGFUNC(@01),B'10000000'                            0293
         BNO   @GL00023                                            0293
         TM    CTGFUNC(@01),B'01100000'                            0293
         BZ    @RT00293                                            0293
@GL00023 L     @01,CCACPL(,R11)                                    0293
         TM    CTGFUNC(@01),B'00100000'                            0293
         BNO   @RF00293                                            0293
         TM    CTGFUNC(@01),B'11000000'                            0293
         BNZ   @RF00293                                            0293
         L     @01,CCAURAB(,R11)                                   0293
         L     @01,CCACPE1(,@01)                                   0293
         CLI   RCDID(@01),C'V'                                     0293
         BNE   @RF00293                                            0293
@RT00293 DS    0H                                                  0294
*     DO;                           /* CHECK FOR CATALOG VERIFY      */
*       IF((CTGOPTNS=CTGDELET)      /* DELETE FUNCTION FOR           */
*           &(CTGTYPE=CTGTVOL))×    /* VOLUME RECORD         @Z40RSRC*/
*           (CTGOPTNS=CTGDEFIN&     /* OR SPACE DEFINE REQ     Y02020*/
*           (CTGFVT->CTGFVTYP=CTGTVOL)&/* VOLUME RECORD DEF          */
*           CCACPE2^=NONE&CCACPE3^=NONE)×(CTGFUNC=CTGLOC&/* LOCATE 0295
*                                      REQUEST AND           @Y30LSSB*/
*           RCDID=CTGTVOL)          /* VOL RECORD-CNVTV      @Y30LSSB*/
*         THEN                      /* VALID BASE RECORD     @Z40RSRC*/
         L     @10,CCACPL(,R11)                                    0295
         TM    CTGOPTNS(@10),B'00011000'                           0295
         BNO   @GL00026                                            0295
         TM    CTGOPTNS(@10),B'11100000'                           0295
         BNZ   @GL00026                                            0295
         CLI   CTGTYPE(@10),C'V'                                   0295
         BE    @RT00295                                            0295
@GL00026 L     @10,CCACPL(,R11)                                    0295
         TM    CTGOPTNS(@10),B'00001000'                           0295
         BNO   @GL00025                                            0295
         TM    CTGOPTNS(@10),B'11110000'                           0295
         BNZ   @GL00025                                            0295
         L     @01,CTGFVT(,@10)                                    0295
         CLI   CTGFVTYP(@01),C'V'                                  0295
         BNE   @GL00025                                            0295
         SLR   @10,@10                                             0295
         L     @05,CCAURAB(,R11)                                   0295
         C     @10,CCACPE2(,@05)                                   0295
         BE    @GL00025                                            0295
         C     @10,CCACPE3(,@05)                                   0295
         BNE   @RT00295                                            0295
@GL00025 L     @01,CCACPL(,R11)                                    0295
         TM    CTGFUNC(@01),B'00100000'                            0295
         BNO   @RF00295                                            0295
         TM    CTGFUNC(@01),B'11000000'                            0295
         BNZ   @RF00295                                            0295
         L     @01,CCAURAB(,R11)                                   0295
         L     @01,CCACPE1(,@01)                                   0295
         CLI   RCDID(@01),C'V'                                     0295
         BNE   @RF00295                                            0295
@RT00295 DS    0H                                                  0296
*         CKAUCATC=ON;              /* INDICATE CAT CHK      @Z40RSRC*/
         L     @01,CCAR5REC(,R11)                                  0296
         OI    CKAUCATC(@01),B'00001000'                           0296
*       ELSE                        /* NOT VOLUME OP         @Z40RSRC*/
*                                                                  0297
*         /***********************************************************/
*         /*                                                         */
*         /* CHECK FOR SITUATIONS WHERE CATALOG-ONLY VERIFICATION IS */
*         /* IN EFFECT UNLESS THE CATALOG IS RAC-DEFINED, IN WHICH   */
*         /* CASE RAC DEFINITION IS IMPLIED FOR THE ENTITY BEING     */
*         /* CHECKED.                                        @Z40RSRC*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0297
*         IF(CTGOPTNS=CTGDELET      /* IF DELETING           @Z40RSRC*/
*             &(RCDID=CTGTALIN      /* NONVSAM               @Z40RSRC*/
*             ×RCDID=CTGTUCAT       /* OR UCAT CONNECTOR     @Z40RSRC*/
*             ×RCDID=CTGTANM        /* OR ALIAS              @Z40RSRC*/
*             ×RCDID=CTGTGBS))      /* OR GDG BASE           @Z40RSRC*/
*             ×(CTGOPTNS=CTGALTER   /* OR ALTERING           @Z40RSRC*/
*             &(RCDID=CTGTALIN      /* NONVSAM               @Z40RSRC*/
*             ×RCDID=CTGTGBS)) THEN /* OR GDG BASE           @Z40RSRC*/
         B     @RC00295                                            0297
@RF00295 L     @01,CCACPL(,R11)                                    0297
         TM    CTGOPTNS(@01),B'00011000'                           0297
         BNO   @GL00032                                            0297
         TM    CTGOPTNS(@01),B'11100000'                           0297
         BNZ   @GL00032                                            0297
         L     @01,CCAURAB(,R11)                                   0297
         L     @10,CCACPE1(,@01)                                   0297
         CLI   RCDID(@10),C'A'                                     0297
         BE    @RT00297                                            0297
         CLI   RCDID(@10),C'U'                                     0297
         BE    @RT00297                                            0297
         CLI   RCDID(@10),C'X'                                     0297
         BE    @RT00297                                            0297
         CLI   RCDID(@10),C'B'                                     0297
         BE    @RT00297                                            0297
@GL00032 L     @01,CCACPL(,R11)                                    0297
         TM    CTGOPTNS(@01),B'00010000'                           0297
         BNO   @RF00297                                            0297
         TM    CTGOPTNS(@01),B'11101000'                           0297
         BNZ   @RF00297                                            0297
         L     @01,CCAURAB(,R11)                                   0297
         L     @10,CCACPE1(,@01)                                   0297
         CLI   RCDID(@10),C'A'                                     0297
         BE    @RT00297                                            0297
         CLI   RCDID(@10),C'B'                                     0297
         BNE   @RF00297                                            0297
@RT00297 DS    0H                                                  0298
*           DO;                     /*                       @Z40RSRC*/
*             CKAUCATC=ON;          /* POSSIBLE CAT CHK      @Z40RSRC*/
*             CKAUIMPL=ON;          /* POSS. IMPLICIT        @Z40RSRC*/
         L     @01,CCAR5REC(,R11)                                  0300
         OI    CKAUCATC(@01),B'10001000'                           0300
*           END;                    /*                       @Z40RSRC*/
*         ELSE                                                     0302
*           ;                       /* NO IMPLICIT RAC       @Z40RSRC*/
*                                                                  0302
@RF00297 DS    0H                                                  0303
*       /*************************************************************/
*       /*                                                           */
*       /* IF THE CATALOG IS NOT RAC-DEFINED, SAVE THE CURRENT       */
*       /* RECORD, PREPARATORY TO READING IN THE CONTAINING CATALOG'S*/
*       /* ENTRY AND EXTRACTING ITS PASSWORD INFO.                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0303
*       IF CKAUCATC=ON THEN         /* IF CAT CHK            @Z40RSRC*/
@RC00295 L     @10,CCAR5REC(,R11)                                  0303
         TM    CKAUCATC(@10),B'00001000'                           0303
         BNO   @RF00303                                            0303
*         IF CAXRAC=ON THEN         /* IF RAC CATALOG        @Z40RSRC*/
         L     @01,CCAACB(,R11)                                    0304
         L     @01,ACBUAPTR(,@01)                                  0304
         TM    CAXRAC(@01),B'00010000'                             0304
         BNO   @RF00304                                            0304
*           IF CKAUIMPL=ON THEN     /* IF IMPLICIT PROT      @Z40RSRC*/
         TM    CKAUIMPL(@10),B'10000000'                           0305
         BNO   @RF00305                                            0305
*             DO;                   /*                       @Z40RSRC*/
*               RCDEXSEC=ON;        /* SET RAC BIT ON        @Z40RSRC*/
         L     @01,CCAURAB(,R11)                                   0307
         L     @01,CCACPE1(,@01)                                   0307
         OI    RCDEXSEC(@01),B'10000000'                           0307
*               CKAUPRBO=ON;        /* INDICATE RAC PROTECTION IS  0308
*                                      ONLY AN ASSUMPTION. THE BIT 0308
*                                      MUST BE CLEARED LATER.      0308
*                                                            @Z40RSRC*/
*               CKAUCATC=OFF;       /* NOT CAT-ONLY CHK      @Z40RSRC*/
         OI    CKAUPRBO(@10),B'00000001'                           0309
         NI    CKAUCATC(@10),B'11110111'                           0309
*             END;                  /*                       @Z40RSRC*/
*           ELSE                                                   0311
*             ;                     /* NO IMPLICIT RAC       @Z40RSRC*/
@RF00305 DS    0H                                                  0312
*         ELSE                      /* CAT NOT RAC DEF'D     @Z40RSRC*/
*           DO;                     /*                       @Z40RSRC*/
         B     @RC00304                                            0312
@RF00304 DS    0H                                                  0313
*             CKAUCATC=OFF;         /* ALLOW P/W EXTRCT      @Z40RSRC*/
*             CKAUIMPL=OFF;         /* NO IMPLIED RAC        @Z40RSRC*/
         L     @10,CCAR5REC(,R11)                                  0314
         NI    CKAUCATC(@10),B'01110111'                           0314
*             REGETCI=RCDCINO;      /* SAVE ORIGINAL RECORD CI       */
         L     @05,CCAURAB(,R11)                                   0315
         L     @01,CCACPE1(,@05)                                   0315
         MVC   REGETCI(3,@10),RCDCINO(@01)                         0315
*             CCAR4REC->CATRECRD(1)=CATRECRD(1);                   0316
         L     @10,CCAR4REC(,R11)                                  0316
         MVC   CATRECRD(256,@10),CATRECRD(@01)                     0316
*             CCAR4REC->CATRECRD(2)=CATRECRD(2);                   0317
         MVC   CATRECRD+256(256,@10),CATRECRD+256(@01)             0317
*             CCARAB4=CCARAB;       /* SAVE THE RAB POINTERS         */
         MVC   CCARAB4(20,R11),CCARAB(@05)                         0318
*           END;                                                   0319
*       ELSE                                                       0320
*         ;                         /* NOT CATLG VERIFY      @Z40RSRC*/
*                                                                  0320
@RF00303 DS    0H                                                  0321
*       /*************************************************************/
*       /*                                                           */
*       /* READ IN THE ENTRY FOR THE CONTAINING CATALOG      @Z40RSRC*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0321
*       IF CTGOPTNS=CTGDEFIN×       /* OBJECT DEFINE OR      @YM05723*/
*           REGETCI^=NONE THEN      /* RE-GET RECORD CI NONZERO      */
@RC00303 L     @01,CCACPL(,R11)                                    0321
         TM    CTGOPTNS(@01),B'00001000'                           0321
         BNO   @GL00039                                            0321
         TM    CTGOPTNS(@01),B'11110000'                           0321
         BZ    @RT00321                                            0321
@GL00039 L     @01,CCAR5REC(,R11)                                  0321
         ICM   @10,7,REGETCI(@01)                                  0321
         BZ    @RF00321                                            0321
@RT00321 DS    0H                                                  0322
*         IF CAXRAC=ON THEN         /* IF CATLG RAC DEFD     @Z40RSRC*/
         L     @01,CCAACB(,R11)                                    0322
         L     @01,ACBUAPTR(,@01)                                  0322
         TM    CAXRAC(@01),B'00010000'                             0322
         BNO   @RF00322                                            0322
*           CKAUCATC=ON;            /* TO SKIP EXTRACT       @Z40RSRC*/
         L     @01,CCAR5REC(,R11)                                  0323
         OI    CKAUCATC(@01),B'00001000'                           0323
*         ELSE                      /* MUST RD CAT REC       @Z40RSRC*/
*           DO;                     /* GET THE CATALOG RECORD        */
         B     @RC00322                                            0324
@RF00322 DS    0H                                                  0325
*             CCASRCIN=CATSECRD;    /* SET CAT RECORD NEEDED CI      */
         MVC   CCASRCIN(3,R11),@CF00056+1                          0325
*             DO;                                                  0326
*               CCAF1KEY=OFF;       /* GET BY CI NO.                 */
*               CCAF1KGE=OFF;       /* NOT GET NEXT                  */
*               CCAF1UP=ON;         /* GET FOR UPD                   */
*                                                                  0329
         OI    CCAF1UP(R11),B'00000010'                            0329
         NI    CCAF1KEY(R11),B'11100111'                           0329
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLBI                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0330
*Z015GET:                                                          0330
*               CALL IGGPGET;       /* GET RECORD                    */
Z015GET  L     @15,@CV03736                                        0330
         BALR  @14,@15                                             0330
*             END;                  /* GET THE RECORD W/PSWDS        */
*           END;                                                   0332
*       ELSE                                                       0333
*         ;                         /* NO NEED TO GET CATLG REC      */
@RF00321 DS    0H                                                  0334
*     END;                                                         0334
*   ELSE                                                           0335
*     ;                             /* NOT CMS TYPE FUNCTION         */
*                                                                  0335
@RF00293 DS    0H                                                  0336
*   /*****************************************************************/
*   /*                                                               */
*   /* EXTRACT PASSWORD GROUP OCCURRENCE.                    @Z40RSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0336
*   IF CKAUCATC=ON                  /* IF CAT-ONLY CHK       @Z40RSRC*/
*       ×CKAUPRBO=ON THEN                                          0336
@RC00293 L     @01,CCAR5REC(,R11)                                  0336
         TM    CKAUCATC(@01),B'00001001'                           0336
         BNZ   @RT00336                                            0336
*     ;                             /* OR NOTH TO EXTR       @Z40RSRC*/
*   ELSE                            /* A VALID, CHECKABLE RECORD   0338
*                                      EXISTS IN THE RAB     @Z40RSRC*/
*     DO;                           /*                       @Z40RSRC*/
*                                                                  0338
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBM                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0339
*Z016CKEX:                                                         0339
*       CALL IGGPCKEX;              /* EXTRACT SECURITY      @Z40RSRC*/
Z016CKEX L     @15,@CV03737                                        0339
         BALR  @14,@15                                             0339
*       IF RCDEXSEC=ON THEN         /* IF RAC INDICATED      @Z40RSRC*/
         L     @01,CCAURAB(,R11)                                   0340
         L     @01,CCACPE1(,@01)                                   0340
         TM    RCDEXSEC(@01),B'10000000'                           0340
         BNO   @RF00340                                            0340
*         CCACD2=OKAY;              /* NO EARLY EXIT IF P/W'S DON'T
*                                      EXIST                 @Z40RSRC*/
         MVI   CCACD2(R11),X'00'                                   0341
*       ELSE                                                       0342
*         ;                         /* NOT RAC INDICATED     @Z40RSRC*/
@RF00340 DS    0H                                                  0343
*     END;                          /*                       @Z40RSRC*/
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RT00336 BAL   @14,EXIT                                            0344
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPINMD');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPINMD'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00004 DS    0H                                                  0347
@EF00004 DS    0H                                                  0347
@ER00004 BR    @14                                                 0347
@PB00004 DS    0H                                                  0348
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0349
*/********************************************************************/
*/*                                                                  */
*/*        IGGPINMD  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0349
*IGGPINMD:                                                         0349
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00005                                            0349
IGGPINMD DS    0H                                                  0350
*   GEN(ENTRY IGGPINMD );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPINMD
*Z017:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z017INMD:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0351
*    (R5,                                                          0351
*     R6,                                                          0351
*     R7,                                                          0351
*     R8,                                                          0351
*     R9,                                                          0351
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z017     DS    0H                                                  0351
Z017INMD DS    0H                                                  0352
*   RFY                                                            0352
*    (R2,                                                          0352
*     R3,                                                          0352
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPINMD                                          *
**                                                                    *
**   DESCRIPTIVE NAME =  USVR INTERFACE BUILDER AND PROCESSOR         *
**                                                                    *
**   COPYRIGHT =  NONE                                                *
**                                                                    *
**   STATUS =  RELEASE 1, LEVEL 0                                     *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS EXTERNAL PROCEDURE INTERFACES WITH THE USVR.  IF A NON-  *
**      MASTER LEVEL OF PASSWORD WAS VERIFIED AND A USVR EXISTS, THIS *
**      PROCEDURE RECEIVES CONTROL TO INTERFACE WITH THE USVR.  THE   *
**      FOLLOWING STEPS OUTLINE THE GENERAL PROCEDURE:                *
**      1. GET STORAGE TO CONTAIN THE INFORMATION TO BE PASSED TO THE *
**         USVR.                                                      *
**      2. CONSTRUCT THE USVR INPUT PARAMETER LIST                    *
**      3. CLEAR THE IN CORE RECORDS.                                 *
**      4. LOAD THE USER SPECIFIED VERIFICATION ROUTINE FROM          *
**         SYS1.LINKLIB.                                              *
**      5. SYNCH TO THE LOADED MODULE.                                *
**      6. EXAMINE THE RETURN CODE                                    *
**      7. FREE THE INPUT PARAMETER LIST STORAGE                      *
**      8. RETURN TO THE INVOKER OF THIS PROCEDURE.                   *
**                                                                    *
**   INPUT =                                                          *
**      CCA                                                           *
**        CCAR5REC                                                    *
**          CKAUWKA                                                   *
**            CKAUINFO                                                *
**            CKAUPRMT                                                *
**        CCAR1REC                                                    *
**          RCDCINO                                                   *
**          CNAME                                                     *
**          COWNID                                                    *
**                                                                    *
**   OUTPUT =                                                         *
**      CCA                                                           *
**        CCAR5REC                                                    *
**          CKAUWKA                                                   *
**            CKUSVRPT                                                *
**            CKBASECI                                                *
**            CKAUINFO                                                *
**        CCASRCIN                                                    *
**      USVRPWKA                                                      *
**                                                                    *
**     MESSAGES =  NONE                                               *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0358
*   /*****************************************************************/
*   /*                                                               */
*   /* IGGPINMD - THIS IS AN EXTERNAL ROUTINE THAT BUILDS THE LIST OF*/
*   /* INFORMATION TO PASS TO THE USVR MODULE, LOADS THE USVR MODULE */
*   /* FROM SYS1.LINKLIB AND TRANSFERS CONTROL TO THE USVR VIA A     */
*   /* SYNCH MACRO. WHEN CONTROL IS RETURNED FROM THE USVR, A RETURN */
*   /* CODE IS SET IN REGISTER 15 INDICATING THE CONTINUATION STATUS.*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0358
*   CCAMNLEN=LENGTH(USVRPWKA)+LENUSAR+SAVEASIZ;/* CORE SIZE FOR USVR
*                                      PARM L                        */
         MVC   CCAMNLEN(3,R11),@CF03830+1                          0358
*   RFY                                                            0359
*    (R1) RSTD;                     /* AND USVR REG SAVE AREA        */
*                                                                  0359
*   /*****************************************************************/
*   /*                                                               */
*   /* GET CORE FOR PARM LIST                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0360
*   R1=ADDR(CCAMSSPL);              /* POINT TO MSS PL               */
         LA    R1,CCAMSSPL(,R11)                                   0360
*   CCAMNSPL=USERSTG;               /* USER STG SUBPOOL NO.          */
         MVI   CCAMNSPL(R11),X'FB'                                 0361
*   GEN(GETMAIN LC,MF=(E,(1)));     /* GET USER KEY STORAGE          */
         GETMAIN LC,MF=(E,(1))
*   GEN(LR R1,R15);                 /* PICK UP RETURN CODE           */
         LR R1,R15
*   IF R1^=NONE THEN                /* GET STORAGE OKAY?             */
         LTR   R1,R1                                               0364
         BZ    @RF00364                                            0364
*     DO;                           /* ERROR GETTING STORAGE         */
*                                                                  0365
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='B6', CCAREASN=RSN2, CCARETRN=RCINSSWA       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0366
*       CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/* SET ERROR CODE    0366
*                                                            @Y30SSSB*/
         MVC   CCAPROB(4,R11),@CF03832                             0366
*       CALL EXIT;                  /* ERROR EXIT                    */
         BAL   @14,EXIT                                            0367
*     END;                                                         0368
*   ELSE                                                           0369
*     ;                             /* NO GET STORAGE ERROR          */
@RF00364 DS    0H                                                  0370
*   RFY                                                            0370
*    (R1) UNRSTD;                                                  0370
*   CKUSVRPT=CCAMNADR;              /* SAVE PARM LIST ADDRESS        */
         L     @01,CCAR5REC(,R11)                                  0371
         L     @10,CCAMNADR(,R11)                                  0371
         ST    @10,CKUSVRPT(,@01)                                  0371
*   USVRPDSN=CNAME;                 /* SET OBJECT NAME               */
         L     @01,CCAURAB(,R11)                                   0372
         L     @05,CCACPE1(,@01)                                   0372
         MVC   USVRPDSN(44,@10),CNAME(@05)                         0372
*   IF COWNID=NULLPRMT THEN         /* NULL OWNER ID                 */
         CLC   COWNID(8,@05),NULLPRMT                              0373
         BNE   @RF00373                                            0373
*     USVRPOWN=USVRPOWN&&USVRPOWN;  /* ZERO FIELD                    */
         XC    USVRPOWN(8,@10),USVRPOWN(@10)                       0374
*   ELSE                            /* VALID OWNER ID                */
*     USVRPOWN=COWNID;              /* PASS VALID OWNER ID           */
         B     @RC00373                                            0375
@RF00373 L     @01,CCAR5REC(,R11)                                  0375
         L     @01,CKUSVRPT(,@01)                                  0375
         L     @10,CCAURAB(,R11)                                   0375
         L     @10,CCACPE1(,@10)                                   0375
         MVC   USVRPOWN(8,@01),COWNID(@10)                         0375
*   IF CKAUPRMT=NULLPRMT THEN       /* NULL PROMPTING NAME           */
@RC00373 L     @10,CCAR5REC(,R11)                                  0376
         CLC   CKAUPRMT+216(8,@10),NULLPRMT                        0376
         BNE   @RF00376                                            0376
*     USVRPRMT=USVRPRMT&&USVRPRMT;  /* ZERO PROMPT FIELD             */
         L     @01,CKUSVRPT(,@10)                                  0377
         XC    USVRPRMT(8,@01),USVRPRMT(@01)                       0377
*   ELSE                            /* VALID PROMPTING NAME          */
*     USVRPRMT=CKAUPRMT;            /* PASS PROMPTING NAME           */
         B     @RC00376                                            0378
@RF00376 L     @10,CCAR5REC(,R11)                                  0378
         L     @01,CKUSVRPT(,@10)                                  0378
         MVC   USVRPRMT(8,@01),CKAUPRMT+216(@10)                   0378
*   USVRPSWD=CKAUPSWK;              /* PASS PASSWORD VERIFIED        */
@RC00376 L     @10,CCAR5REC(,R11)                                  0379
         L     @05,CKUSVRPT(,@10)                                  0379
         MVC   USVRPSWD(8,@05),CKAUPSWK(@10)                       0379
*   USVRPLEN=CKAUVRLN;              /* SET USAR INFO LENGTH          */
         LA    @01,216                                             0380
         ALR   @01,@10                                             0380
         LH    @15,CKAUVRLN(,@01)                                  0380
         STH   @15,USVRPLEN(,@05)                                  0380
*   USVRPDTA(1:CKAUVRLN)=CKAUAREC(1:CKAUVRLN);/* PASS USAR           */
         BCTR  @15,0                                               0381
         EX    @15,@SM03850                                        0381
*   CKAUPSWD=CKAUPSWD&&CKAUPSWD;    /* CLEAR IN CORE PASSWORDS       */
         XC    CKAUPSWD(32,@01),CKAUPSWD(@01)                      0382
*   CKBASECI=RCDCINO;               /* SAVE BASE RECORD CI VALUE     */
         L     @01,CCAURAB(,R11)                                   0383
         L     @01,CCACPE1(,@01)                                   0383
         MVC   CKBASECI(3,@10),RCDCINO(@01)                        0383
*   CKAUNOSV=ON;                    /* SET RECORD NOT SAVED          */
         OI    CKAUNOSV(@10),B'01000000'                           0384
*   CCAR4REC=CCAR3REC+CTRECSIZ;     /* SET RECORD AREA POINTER       */
*                                                                  0385
         LA    @10,512                                             0385
         AL    @10,CCAR3REC(,R11)                                  0385
         ST    @10,CCAR4REC(,R11)                                  0385
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR ALL IN CORE RECORDS                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0386
*   R2=CCAR1REC;                    /* FIRST RECORD AREA             */
         L     R2,CCAR1REC(,R11)                                   0386
*   R3=NORABS*CTRECSIZ;             /* TOTAL AREA LENGTH             */
         LA    R3,2048                                             0387
*   RFY                                                            0388
*    (R5) RSTD;                                                    0388
*   R5=NONE;                        /* SET PADDING CHARACTER         */
         SLR   R5,R5                                               0389
*   GEN(MVCL R2,R4);                /* CLEAR THE RECORD AREAS        */
         MVCL R2,R4
*   RFY                                                            0391
*    (R5) UNRSTD;                                                  0391
*                                                                  0391
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD THE USERS MODULE FROM LINKLIB                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0392
*   R2=ADDR(CKAUMDUL);              /* MODULE NAME LOCATION          */
         L     R2,CCAR5REC(,R11)                                   0392
         LA    R2,CKAUMDUL+216(,R2)                                0392
*   R3=CVTLINK;                     /* GET SYS1.LINKLIB DCB ADDR     */
         L     @10,CVTPTR                                          0393
         L     R3,CVTLINK(,@10)                                    0393
*   GEN(LOAD EPLOC=(R2),DCB=(R3));  /* LOAD THE USVR MODULE          */
*                                                                  0394
         LOAD EPLOC=(R2),DCB=(R3)
*   /*****************************************************************/
*   /*                                                               */
*   /* PASS CONTROL TO THE USVR MODULE                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0395
*   RFY                                                            0395
*    (R0,                                                          0395
*     R1,                                                          0395
*     R15) RSTD;                                                   0395
*   R1=CKUSVRPT;                    /* SET USVR INPUT ADDRESS        */
         L     @14,CCAR5REC(,R11)                                  0396
         L     R1,CKUSVRPT(,@14)                                   0396
*   R15=R0;                         /* GET USVR ENTRY POINT ADDR     */
         LR    R15,R0                                              0397
*   RFY                                                            0398
*     RBBASIC BASED(SVRBPTR);                                      0398
*   GEN(STM  11,13,12(13));         /* SAVE REGS 11,12,13 IN CCA     */
         STM  11,13,12(13)
*   SAVEREGL=XRBXSAV;               /* GET FIRST WORD OF EXT S A     */
         L     @14,CVTPTR                                          0400
         L     @14,CVTTCBP(,@14)                                   0400
         L     @14,TCBPTR(,@14)                                    0400
         LA    @10,96                                              0400
         AL    @10,SVRBPTR(,@14)                                   0400
         MVC   SAVEREGL(4,R13),XRBXSAV(@10)                        0400
*   XRBXSAV=R13;                    /* SAVE REGISTER 13 IN EXT       */
         ST    R13,XRBXSAV(,@10)                                   0401
*   R13=CCAMNLEN-SAVEASIZ+R1;       /* FETCH REG SAVE AREA ADDR      */
         SLR   R13,R13                                             0402
         ICM   R13,7,CCAMNLEN(R11)                                 0402
         SH    R13,@CH00137                                        0402
         ALR   R13,R1                                              0402
*   GEN(SYNCH (15));                /* PASS CONTROL TO THE USVR      */
         SYNCH (15)
*   R13=XRBXSAV;                    /* RESTORE REGISTER 13           */
         L     @14,CVTPTR                                          0404
         L     @14,CVTTCBP(,@14)                                   0404
         L     @14,TCBPTR(,@14)                                    0404
         LA    @10,96                                              0404
         AL    @10,SVRBPTR(,@14)                                   0404
         L     R13,XRBXSAV(,@10)                                   0404
*   XRBXSAV=SAVEREGL;               /* RESTORE FIRST SAVE AR WRD     */
         MVC   XRBXSAV(4,@10),SAVEREGL(R13)                        0405
*   GEN(LM    11,13,12(13));        /* LOAD REGISTER FROM CCA        */
         LM    11,13,12(13)
*   RFY                                                            0407
*    (R0,                                                          0407
*     R1) UNRSTD;                                                  0407
*                                                                  0407
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN FROM THE USVR MODULE - CODE IN REGISTER 15             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0408
*   IF R15^=NONE THEN               /* ERROR RETURN FROM USVR        */
*                                                                  0408
         LTR   R15,R15                                             0408
         BZ    @RF00408                                            0408
*     /***************************************************************/
*     /*                                                             */
*     /* SET CCAMODID='B6', CCAREASN=RSN8, CCARETRN=RCSEC            */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0409
*     CCAPROB=IGGSEGID+(RSN8*K256)+RCSEC;/* SET ERROR CODE   @Y30SSSB*/
         MVC   CCAPROB(4,R11),@CF03835                             0409
*   ELSE                                                           0410
*     ;                             /* NO ERROR FORM USVR            */
@RF00408 DS    0H                                                  0411
*   R2=ADDR(CKAUMDUL);              /* USVR MODULE ADDRESS           */
         L     R2,CCAR5REC(,R11)                                   0411
         LA    R2,CKAUMDUL+216(,R2)                                0411
*   GEN(DELETE EPLOC=(R2));                                        0412
         DELETE EPLOC=(R2)
*   CCASRCIN=CKBASECI;              /* SET PROPER CI VALUE           */
         L     @14,CCAR5REC(,R11)                                  0413
         MVC   CCASRCIN(3,R11),CKBASECI(@14)                       0413
*   DO;                                                            0414
*     CCAF1KEY=OFF;                 /* GET BY CI NO.                 */
*     CCAF1KGE=OFF;                 /* NOT GET NEXT                  */
*     CCAF1UP=ON;                   /* GET FOR UPD                   */
*                                                                  0417
         OI    CCAF1UP(R11),B'00000010'                            0417
         NI    CCAF1KEY(R11),B'11100111'                           0417
*     /***************************************************************/
*     /*                                                             */
*     /* CALL TO MODULE IGG0CLBI                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0418
*Z021GET:                                                          0418
*     CALL IGGPGET;                 /* GET RECORD                    */
Z021GET  L     @15,@CV03736                                        0418
         BALR  @14,@15                                             0418
*   END;                                                           0419
*   RFY                                                            0420
*    (R15) UNRSTD;                                                 0420
*                                                                  0420
*   /*****************************************************************/
*   /*                                                               */
*   /* FREE THE GOTTEN STORAGE                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0421
*   RFY                                                            0421
*    (R1) RSTD;                                                    0421
*   R1=ADDR(CCAMSSPL);              /* POINT TO MSS PL               */
         LA    R1,CCAMSSPL(,R11)                                   0422
*   CCAMNSPL=USERSTG;               /* STORE SUBPOOL NO.     @Y30SSSB*/
         MVI   CCAMNSPL(R11),X'FB'                                 0423
*   GEN(FREEMAIN L,MF=(E,(1)));     /* FREE THE USER KEY STORAGE     */
         FREEMAIN L,MF=(E,(1))
*   RFY                                                            0425
*    (R1) UNRSTD;                                                  0425
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0426
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPCKCC');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPCKCC'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00005 DS    0H                                                  0429
@EF00005 DS    0H                                                  0429
@ER00005 BR    @14                                                 0429
@PB00005 DS    0H                                                  0430
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0431
*/********************************************************************/
*/*                                                                  */
*/*        IGGPCKCC  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0431
*IGGPCKCC:                                                         0431
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00006                                            0431
IGGPCKCC DS    0H                                                  0432
*   GEN(ENTRY IGGPCKCC );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPCKCC
*Z022:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z022CKCC:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0433
*    (R5,                                                          0433
*     R6,                                                          0433
*     R7,                                                          0433
*     R8,                                                          0433
*     R9,                                                          0433
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z022     DS    0H                                                  0433
Z022CKCC DS    0H                                                  0434
*   RFY                                                            0434
*    (R2,                                                          0434
*     R3,                                                          0434
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */
*                                                                  0439
         SR 12,15
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Z40RSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0440
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPCKCC                                          *
**                                                                    *
**   DESCRIPTIVE NAME =  GET AND CHECK CATALOG RECORD FOR SECURITY    *
**                                                                    *
**   COPYRIGHT =  NONE                                                *
**                                                                    *
**   STATUS =  RELEASE 1, LEVEL 0                                     *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS INTERNAL PROCEDURE READS THE CATALOG CLUSTER RECORD AND  *
**      CHECKS TO SEE IF IT IS SECURITY PROTECTED.  IF NOT PROTECTED, *
**      THE ORIGINAL BASE RECORD IS RE-READ.                          *
**      1. CLEAR THE CATALOG SECURITY CHECK INDICATOR AND SAVE THE    *
**         ORIGINAL BASE RECORD CI.                                   *
**      2. GET THE CATALOG RECORD THAT CONTAINS SECURITY DATA IF IT   *
**         EXISTS.                                                    *
**      3. CALL INTERNAL PROCEDURE IGGPCKEX TO EXTRACT SECURITY DATA. *
**      4. IF THE CATALOG IS NOT SECURITY PROTECTED:                  *
**         A. THE ORIGINAL RECORD IS RE-READ.                         *
**         B. IF ALTER OR DELETE FUNCTIONS AND THE ORIGINAL BASE WAS  *
**            NOT SECURITY PROTECTED, SET NO VERIFICATION REQUIRED    *
**            CODE.                                                   *
**      5. RETURN                                                     *
**                                                                    *
**   INPUT =                                                          *
**      CCA                                                           *
**        CCAR5REC                                                    *
**          CKAUWKA                                                   *
**            CKAUNPAL                                                *
**          CCAURAB                                                   *
**            CCACPE1                                                 *
**              RCDCINO                                               *
**                                                                    *
**   OUTPUT =                                                         *
**      CCA                                                           *
**        CCAR5REC                                                    *
**          CKAUWKA                                                   *
**            REGETCI                                                 *
**            CKAUBASE                                                *
**            CKAUSTOP                                                *
**          CCACD1                                                    *
**          CCACD2                                                    *
**          CCASRCIN                                                  *
**                                                                    *
**     MESSAGES =  NONE                                               *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0440
*   /*****************************************************************/
*   /*                                                               */
*   /* IGGPCKCC - THIS ROUTINE GETS THE CATALOG RECORD AND CHECKS TO */
*   /* SEE IF IT IS SECURITY PROTECTED BY CALLING IGGPCKEX. IF NOT   */
*   /* PROTECTED AND USED FOR AN UNPROTECTED ALTER REQUEST, THE MAIN */
*   /* RECORD IS RE-READ.                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0440
*   CCACD2=OKAY;                    /* CLEAR THE INDICATOR BYTE      */
         MVI   CCACD2(R11),X'00'                                   0440
*   REGETCI=RCDCINO;                /* SAVE BASE RECORD CI NO.       */
         L     @10,CCAR5REC(,R11)                                  0441
         L     @05,CCAURAB(,R11)                                   0441
         L     @15,CCACPE1(,@05)                                   0441
         MVC   REGETCI(3,@10),RCDCINO(@15)                         0441
*   CKAUBASE=ON;                    /* SET FLAG TO RE-GET BASE       */
         OI    CKAUBASE(@10),B'00010000'                           0442
*   CCASRCIN=CATSECRD;              /* SET CATALOG RECORD CI         */
         MVC   CCASRCIN(3,R11),@CF00056+1                          0443
*   CKAUNOSV=OFF;                   /* INDICATE REC SAVED      Y02020*/
         NI    CKAUNOSV(@10),B'10111111'                           0444
*   CCAR4REC->CATRECRD(1)=CATRECRD(1);/* SAVE THE RECORD             */
         L     @14,CCAR4REC(,R11)                                  0445
         MVC   CATRECRD(256,@14),CATRECRD(@15)                     0445
*   CCAR4REC->CATRECRD(2)=CATRECRD(2);/* SAVE THE RECORD             */
         MVC   CATRECRD+256(256,@14),CATRECRD+256(@15)             0446
*   CCARAB4=CCARAB;                 /* SAVE THE CPE POINTERS         */
         MVC   CCARAB4(20,R11),CCARAB(@05)                         0447
*   CKAUNOSV=OFF;                   /* INDICATE RECORD SAVED         */
         NI    CKAUNOSV(@10),B'10111111'                           0448
*   DO;                                                            0449
*     CCAF1KEY=OFF;                 /* GET BY CI NO.                 */
*     CCAF1KGE=OFF;                 /* NOT GET NEXT                  */
*     CCAF1UP=OFF;                  /* NOT GET UPD                   */
*                                                                  0452
         NI    CCAF1KEY(R11),B'11100101'                           0452
*     /***************************************************************/
*     /*                                                             */
*     /* CALL TO MODULE IGG0CLBI                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0453
*Z024GET:                                                          0453
*     CALL IGGPGET;                 /* GET RECORD                    */
Z024GET  L     @15,@CV03736                                        0453
         BALR  @14,@15                                             0453
*   END;                                                           0454
*   IF CCACD1=OKAY THEN             /* NO ERRORS                     */
         CLI   CCACD1(R11),0                                       0455
         BNE   @RF00455                                            0455
*     IF CAXRACP=NONE THEN          /* IF RAC STATUS NOT CHECKED   0456
*                                      ALREADY               @Z40RSRC*/
         L     @10,CCAACB(,R11)                                    0456
         L     @10,ACBUAPTR(,@10)                                  0456
         ICM   @05,15,CAXRACP(@10)                                 0456
         BNZ   @RF00456                                            0456
*       DO;                         /*                       @Z40RSRC*/
*         IF RCDEXSEC=ON THEN       /* IF CATALOG IS RAC-INDICATED 0458
*                                                            @Z40RSRC*/
         L     @05,CCAURAB(,R11)                                   0458
         L     @05,CCACPE1(,@05)                                   0458
         TM    RCDEXSEC(@05),B'10000000'                           0458
         BNO   @RF00458                                            0458
*           CAXRAC=ON;              /* SHOW IS RAC CAT       @Z40RSRC*/
         OI    CAXRAC(@10),B'00010000'                             0459
*         ELSE                                                     0460
*           ;                       /* NOT A RAC CATLG       @Z40RSRC*/
*                                                                  0460
@RF00458 DS    0H                                                  0461
*         /***********************************************************/
*         /*                                                         */
*         /* CALL TO MODULE IGG0CLBM                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0461
*Z025BSGT:                                                         0461
*         CALL IGGPBSGT;            /* REGET BASE REC        @Z40RSRC*/
Z025BSGT L     @15,@CV03808                                        0461
         BALR  @14,@15                                             0461
*       END;                        /*                       @Z40RSRC*/
*     ELSE                          /* ALREADY CHKED RAC     @Z40RSRC*/
*       DO;                         /* GET CAT RCRD SECURITY         */
*                                                                  0463
         B     @RC00456                                            0463
@RF00456 DS    0H                                                  0464
*         /***********************************************************/
*         /*                                                         */
*         /* CALL TO MODULE IGG0CLBM                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0464
*Z026CKEX:                                                         0464
*         CALL IGGPCKEX;            /* EXTRACT SECURITY DATA         */
Z026CKEX L     @15,@CV03737                                        0464
         BALR  @14,@15                                             0464
*         IF CCACD1=OKAY&           /* NO MAJOR ERRORS               */
*             CCACD2^=OKAY THEN     /* NOT SECURITY PROTECTED        */
         CLI   CCACD1(R11),0                                       0465
         BNE   @RF00465                                            0465
         CLI   CCACD2(R11),0                                       0465
         BE    @RF00465                                            0465
*           DO;                     /* RE-GET ORIGINAL RECORD        */
*             CKAUSTOP=ON;          /* SET TO STOP RECORD CHANGE     */
*                                                                  0467
         L     @10,CCAR5REC(,R11)                                  0467
         OI    CKAUSTOP(@10),B'00001000'                           0467
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLBM                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0468
*Z027BSGT:                                                         0468
*             CALL IGGPBSGT;        /* RE-GET RECORD                 */
Z027BSGT L     @15,@CV03808                                        0468
         BALR  @14,@15                                             0468
*             CKAUVFMT=ON;          /* INDICATE ALL ACCESSABLE       */
*             CKAUVFST=ON;          /* STOP VERIFY PROCESS           */
         L     @10,CCAR5REC(,R11)                                  0470
         OI    CKAUVFMT(@10),B'10100000'                           0470
*           END;                                                   0471
*         ELSE                                                     0472
*           ;                                                      0472
@RF00465 DS    0H                                                  0473
*       END;                                                       0473
*   ELSE                                                           0474
*     ;                             /* ERRORS IN THE PROCESSING      */
@RF00455 DS    0H                                                  0475
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RC00455 BAL   @14,EXIT                                            0475
*   END;                            /* END OF INNER PROCEDURE        */
@EL00006 DS    0H                                                  0476
@EF00006 DS    0H                                                  0476
@ER00006 BR    @14                                                 0476
@PB00006 DS    0H                                                  0477
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0478
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0478
*EXIT:                                                             0478
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00007                                            0478
EXIT     DS    0H                                                  0479
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            0482
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00007 DS    0H                                                  0483
@EF00007 DS    0H                                                  0483
@ER00007 BR    @14                                                 0483
*   END                                                            0484
*                                                                  0484
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*/*%INCLUDE SYSLIB  (ICHACHKL)                                       */
*/*%INCLUDE SYSLIB  (ICHRDDFL)                                       */
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */
*/*%INCLUDE SYSLIB  (IHARB   )                                       */
*/*%INCLUDE SYSLIB  (IEZXRB  )                                       */
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                       */
*                                                                  0484
*       ;                                                          0484
@EL00001 DS    0H                                                  0484
@EF00001 DS    0H                                                  0484
@ER00001 BR    @14                                                 0484
@DATA    DS    0H
@CH00119 DC    H'36'
@CH00127 DC    H'52'
@CH00137 DC    H'72'
@SM03850 MVC   USVRPDTA(0,@05),CKAUAREC(@01)
@DATD    DSECT
         DS    0F
@TF00001 DS    F
IGG0CLB6 CSECT
         DS    0F
@CF00038 DC    F'1'
@CH00038 EQU   @CF00038+2
@CF00056 DC    F'2'
@CH00056 EQU   @CF00056+2
@CF03830 DC    F'398'
@CF03832 DC    F'-1024064860'
@CF03835 DC    F'-1024063432'
@CF03821 DC    F'-1024062920'
@CF03828 DC    F'-1024062408'
@DATD    DSECT
         DS    0D
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLB6 CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV03736 DC    V(IGGPGET)
@CV03737 DC    V(IGGPCKEX)
@CV03739 DC    V(IGGPRPLF)
@CV03740 DC    V(IGGPRPLM)
@CV03808 DC    V(IGGPBSGT)
         DS    0D
TGETWAIT DC    XL4'80000000'
TPUTASIS DC    XL4'01000000'
RESTCHAR DC    XL1'14'
NEWLCHAR DC    XL1'15'
BYPSPRNT DC    XL1'24'
@CC03622 DC    C'SYS1.STGINDEX'
@CC03599 DC    C'        '
NULLPRMT DC    X'FFFFFFFFFFFFFFFF'
NOPASSWD DC    X'0000000000000000'
FRSTMSG  DC    CL36'IEC113A ENTER PASSWORD FOR DATA SET '
R1PMTMSG DC    CL25'IEC115I INVALID PASSWORD '
R2PMTMSG DC    CL17'IEC116A REENTER- '
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
RWA      EQU   @02
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R15      EQU   @15
XRBPTR   EQU   @02
CDBPTR   EQU   @02
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R14      EQU   @14
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCACD2   EQU   IGGCCA+13
CCAFLG1  EQU   IGGCCA+14
CCAF1KEY EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAFLG2  EQU   IGGCCA+15
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCAGC4   EQU   CCAFLG3
CCAFLG4  EQU   IGGCCA+17
CCAFLG5  EQU   IGGCCA+18
CCAFLG6  EQU   IGGCCA+19
CCASUPFD EQU   CCAFLG6
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCASRCIN EQU   CCASRID
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1REC EQU   CCARAB1+4
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3REC EQU   CCARAB3+4
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4REC EQU   CCARAB4+4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5REC EQU   CCARAB5+4
CCAR5SEG EQU   CCARAB5+8
CCATIQRN EQU   IGGCCA+212
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAMSSPL EQU   IGGCCA+300
CCAMNSPL EQU   CCAMSSPL+9
CCACMS   EQU   IGGCCA+316
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAFLPT  EQU   IGGCCA+364
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCAIDPT3 EQU   IGGCCA+480
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCAFLG7  EQU   IGGCCA+552
CCAFLG8  EQU   IGGCCA+553
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFLGS EQU   CCAMNAT+240
CCAMNLEN EQU   CCAMNCAT+249
CCAMNADR EQU   CCAMNCAT+252
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAFLG11 EQU   IGGCCA+1059
CCAF11B6 EQU   CCAFLG11
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CCADGDGA EQU   IGGCCA+1488
CCAREQDQ EQU   IGGCCA+1492
CCAREDOP EQU   CCAREQDQ+2
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGMAST  EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGRCATN EQU   CTGVMNT
CTGOPTN3 EQU   CTGPL+2
CTGFUNC  EQU   CTGOPTN3
CTGOPTN4 EQU   CTGPL+3
CTGBYPMT EQU   CTGOPTN4
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGOPTNS EQU   CTGDSORG
CTGTYPE  EQU   CTGPL+18
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFIELD EQU   CTGPL+28
CTGFL    EQU   0
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLDAT EQU   CTGFL+16
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
FIELDNM  EQU   0
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CCACPE3  EQU   CCARAB+12
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGOGC1 EQU   CATGOPT+3
CATGOSEQ EQU   CATGOPT+4
CATRCD   EQU   0
RCDCINO  EQU   CATRCD+1
RCDSECF  EQU   CATRCD+26
RCDEXSEC EQU   RCDSECF
RCDID    EQU   CATRCD+44
NREPLF   EQU   CATRCD+48
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
VARFIELD EQU   0
CNTRLINF EQU   0
LENFIX   EQU   CNTRLINF+1
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTLINK  EQU   CVTMAP+8
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBTIO   EQU   TCB+12
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBXSCT  EQU   TCB+240
TCBXSCT1 EQU   TCBXSCT
TCBFOE   EQU   TCB+244
TCBSTAWA EQU   TCB+252
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBDVIND EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBINFL1 EQU   ACBINFLG
ACBVVIC  EQU   ACBINFL1
ACBINFL2 EQU   ACBINFLG+1
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
NOBASE   EQU   0
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXFLG3  EQU   IGGCAXWA+10
CAXRAC   EQU   CAXFLG3
CAXCCR   EQU   IGGCAXWA+32
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CAXCCA   EQU   IGGCAXWA+104
CAXRACP  EQU   IGGCAXWA+116
CAXECB   EQU   IGGCAXWA+120
CAXECBHB EQU   CAXECB
CAXHRPLW EQU   IGGCAXWA+128
CTGFV    EQU   0
CTGFVTYP EQU   CTGFV
CTGFVPRO EQU   CTGFV+1
CTGFVENT EQU   CTGFV+20
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGFVPWD EQU   CTGFV+84
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
ACHKLIST EQU   0
ACHKINSW EQU   ACHKLIST
ACHKENTW EQU   ACHKLIST+4
ACHKFLG1 EQU   ACHKENTW
ACHKENT  EQU   ACHKENTW+1
ACHKCLNW EQU   ACHKLIST+8
ACHKFLG2 EQU   ACHKCLNW
ACHKVOLW EQU   ACHKLIST+12
ACHKFLG3 EQU   ACHKVOLW
RDDFLIST EQU   0
RDDFINSW EQU   RDDFLIST
RDDFENTW EQU   RDDFLIST+4
RDDFFLGS EQU   RDDFENTW
RDDFOVOL EQU   RDDFLIST+8
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
PSCB     EQU   0
PSCBATR1 EQU   PSCB+16
PSCBUPT  EQU   PSCB+52
IEZJSCB  EQU   0
JSCBSEC1 EQU   IEZJSCB+188
JSCHPCE  EQU   JSCBSEC1+4
JSCBDCB  EQU   JSCBSEC1+36
JSCBOPTS EQU   JSCBSEC1+48
JSCBSWT1 EQU   JSCBSEC1+55
JSCBWTP  EQU   JSCBSEC1+64
JSCBWTFG EQU   JSCBWTP
JSCBEND1 EQU   IEZJSCB+260
UPT      EQU   0
UPTSWS   EQU   UPT+12
UPTNPRM  EQU   UPTSWS
UPTMID   EQU   UPTSWS
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBRSM  EQU   ASCB+52
ASCBRSMF EQU   ASCBRSM
ASCBTSB  EQU   ASCB+60
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
TSB      EQU   0
TSBASCBA EQU   TSB
TSBSTAT  EQU   TSBASCBA
TSBFLG1  EQU   TSB+4
TSBFLG2  EQU   TSB+16
TSBFLG3  EQU   TSB+24
TSBTERMC EQU   TSB+26
TSBTERM1 EQU   TSBTERMC
TSBTERM2 EQU   TSBTERMC+1
TSBSTCC  EQU   TSB+34
TSBFLG4  EQU   TSB+41
TSBRCB   EQU   TSB+64
TSBLINKA EQU   TSBRCB+4
TSBTPOST EQU   TSB+72
TSBTPFLG EQU   TSBTPOST
TSBMINL  EQU   TSB+84
TSBPSWD  EQU   TSB+88
TIOT1    EQU   0
RBPRFX   EQU   0
RBBASIC  EQU   0
RBEXRTNM EQU   RBBASIC
RBTMFLD  EQU   RBEXRTNM
RBSTAB   EQU   RBBASIC+10
XSTAB    EQU   RBSTAB
RBSTAB1  EQU   XSTAB
XSTAB1   EQU   RBSTAB1
RBFTCKPT EQU   XSTAB1
RBSTAB2  EQU   XSTAB+1
XSTAB2   EQU   RBSTAB2
RBTCBNXT EQU   XSTAB2
RBFACTV  EQU   XSTAB2
RBFDYN   EQU   XSTAB2
RBECBWT  EQU   XSTAB2
RBOPSW   EQU   RBBASIC+16
XRBPSW   EQU   RBOPSW
RBOPSWB2 EQU   XRBPSW+1
RBLINK   EQU   RBBASIC+28
XRBLNK   EQU   RBLINK
RBWCF    EQU   XRBLNK
RBLINKB  EQU   XRBLNK+1
RBGRSAVE EQU   RBBASIC+32
XRBREG   EQU   RBGRSAVE
RBGRS0   EQU   XRBREG
RBGRS1   EQU   XRBREG+4
RBGRS2   EQU   XRBREG+8
RBGRS3   EQU   XRBREG+12
RBGRS4   EQU   XRBREG+16
RBGRS5   EQU   XRBREG+20
RBGRS6   EQU   XRBREG+24
RBGRS7   EQU   XRBREG+28
RBGRS8   EQU   XRBREG+32
RBGRS9   EQU   XRBREG+36
RBGRS10  EQU   XRBREG+40
RBGRS11  EQU   XRBREG+44
RBGRS12  EQU   XRBREG+48
RBGRS13  EQU   XRBREG+52
RBGRS14  EQU   XRBREG+56
RBGRS15  EQU   XRBREG+60
XRBESA   EQU   RBBASIC+96
XRBPRFX  EQU   0
XRBPRFX1 EQU   0
XRB      EQU   0
@NM00152 EQU   XRB+10
@NM00153 EQU   @NM00152
XRBLRBFX EQU   @NM00153
@NM00155 EQU   @NM00152+1
@NM00156 EQU   @NM00155
@NM00157 EQU   @NM00155
XRBWTL   EQU   XRB+12
XRBEP    EQU   XRBWTL
@NM00160 EQU   XRB+16
XRTLPRB  EQU   @NM00160+4
XRBLOCK  EQU   XRTLPRB
XRBFLAG1 EQU   XRBLOCK
@NM00163 EQU   XRB+28
CDB      EQU   0
CDBMDAD  EQU   CDB
CDBMDSZ  EQU   CDB+4
CATRECRD EQU   0
ASGO     EQU   1
PASSGO   EQU   1
PASSWORD EQU   PASSGO
USERAREC EQU   PASSGO+50
USERLIST EQU   0
LTENTRY  EQU   USERLIST+2
LTRETCOD EQU   LTENTRY
SPACEPRM EQU   0
SPCOPTNS EQU   SPACEPRM+6
CTGDSATR EQU   0
CTGATR1  EQU   CTGDSATR
CTGATR2  EQU   CTGDSATR+1
RGATTRFL EQU   0
RGATTR1  EQU   RGATTRFL
RGATTSG1 EQU   RGATTRFL+1
DEVCHARS EQU   0
RTDEVUCB EQU   DEVCHARS
RTBOKAB  EQU   DEVCHARS+14
RTDVFLGS EQU   DEVCHARS+17
RBRPSW   EQU   0
@NM00183 EQU   RBRPSW+1
RBRPSWPK EQU   @NM00183
RBRPSWPS EQU   @NM00183
SAVEREGL EQU   24
SVRBPTR  EQU   0
XRBXSAV  EQU   0
JSCBACTV EQU   0
PSCBPTR  EQU   JSCBACTV+264
ENTRYNM2 EQU   0
NAMECHAR EQU   0
CKAUINFO EQU   0
CKAUPSWD EQU   CKAUINFO
CKAUPRMT EQU   CKAUINFO+32
CKAUATMP EQU   CKAUINFO+40
CKAUMDUL EQU   CKAUINFO+42
CKAUVRLN EQU   CKAUINFO+50
CKAUAREC EQU   CKAUINFO+52
USVRPWKA EQU   0
USVRPDSN EQU   USVRPWKA
USVRPRMT EQU   USVRPWKA+44
USVRPOWN EQU   USVRPWKA+52
USVRPSWD EQU   USVRPWKA+60
USVRPLEN EQU   USVRPWKA+68
USVRPDTA EQU   USVRPWKA+70
CKAUWKA  EQU   0
CKAUWKWD EQU   CKAUWKA
CKWAATMP EQU   CKAUWKWD
REGETCI  EQU   CKAUWKWD+1
CKAUPSWK EQU   CKAUWKA+4
CKAUFLGS EQU   CKAUWKA+12
CKAUVFST EQU   CKAUFLGS
CKAUBDPW EQU   CKAUFLGS
CKAUVFMT EQU   CKAUFLGS
CKAUBASE EQU   CKAUFLGS
CKAUSTOP EQU   CKAUFLGS
CKAUFLG1 EQU   CKAUWKA+13
CKAUNOSV EQU   CKAUFLG1
CKBASECI EQU   CKAUWKA+17
CKUSVRPT EQU   CKAUWKA+20
CKAUCPL  EQU   CKAUWKA+36
CKAURF1  EQU   CKAUWKA+174
CKAUIMPL EQU   CKAURF1
CKAUCATC EQU   CKAURF1
CKAUPRBO EQU   CKAURF1
CKAUVLTY EQU   CKAUWKA+196
CKAUDATA EQU   CKAUWKA+216
CKAUEDSN EQU   CKAUWKA+268
CKAUINWA EQU   0
CKAUMGAR EQU   CKAUINWA+12
CKAUMGSZ EQU   CKAUMGAR
CKAUMSG  EQU   CKAUMGAR+4
BUFSIZE  EQU   0
CATSN    EQU   0
CI       EQU   0
CTGVLDSP EQU   0
DATEFLD  EQU   0
ENTRYNAM EQU   0
EXCPNAME EQU   0
LRECL    EQU   0
OWNIDFLD EQU   0
PSWDARRY EQU   0
TNAM     EQU   0
@NM00038 EQU   CTGDDNM
CTGPROB  EQU   @NM00038
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
JSCBSEC2 EQU   JSCBEND1
JSCBSEC3 EQU   JSCBEND1
JSCBJCT  EQU   JSCBSEC3
JSCBJCTA EQU   JSCBJCT+1
JSCBASID EQU   JSCBSEC3+8
JSCBFBYT EQU   JSCBSEC3+10
JSCBJNL  EQU   JSCBSEC3+28
JSCBJJSB EQU   JSCBJNL
JSCBSUB  EQU   JSCBSEC3+40
JSCSCT   EQU   JSCBSEC3+68
JSCBACT  EQU   JSCBSEC3+88
JSCRSV45 EQU   JSCBSEC3+112
JSCRSV46 EQU   JSCRSV45
JSCRSV47 EQU   JSCRSV45+2
TIOENTRY EQU   TIOT1+24
TIOESTTA EQU   TIOENTRY+1
TIOERLOC EQU   TIOENTRY+2
TIOELINK EQU   TIOERLOC+1
TIOESYOT EQU   TIOELINK
TIOESTTC EQU   TIOENTRY+15
TIOESTTB EQU   TIOENTRY+16
POOLSTAR EQU   TIOENTRY+20
TIOEDEVE EQU   TIOESTTB
TIOSTTB  EQU   TIOEDEVE
CTGRBASE EQU   NREPLF+1
CNAME    EQU   CTGRBASE
COWNID   EQU   CTGRBASE+44
CATTR    EQU   CTGRBASE+58
CATTR1   EQU   CATTR
CATTR2   EQU   CATTR+1
COPEN    EQU   CTGRBASE+60
CSPACPRM EQU   CTGRBASE+65
@NM00170 EQU   CATTR1
CCATTR   EQU   @NM00170
@NM00171 EQU   CCATTR
@NM00173 EQU   CATTR1
CRGATTR  EQU   @NM00173
CUPG     EQU   CRGATTR
ACHKPROF EQU   ACHKENT
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00174 EQU   CRGATTR
CUPD     EQU   CUPG
CPGSP    EQU   @NM00171
CSWAPSPC EQU   @NM00171
@NM00172 EQU   @NM00171
CEXT     EQU   CTGRBASE+86
CDOSUINF EQU   CTGRBASE+84
CLRECL   EQU   CTGRBASE+80
CHIA     EQU   CTGRBASE+76
CHIU     EQU   CTGRBASE+72
CSORT    EQU   CSPACPRM+6
CSEC     EQU   CSPACPRM+3
CPRIM    EQU   CSPACPRM
CBUF     EQU   CTGRBASE+61
@NM00169 EQU   COPEN
COPENDS  EQU   COPEN
CNUS     EQU   CATTR2
CATTISDS EQU   CATTR2
@NM00168 EQU   CATTR2
CATTRSSH EQU   CATTR2
CATTRISH EQU   CATTR2
CTRKOV   EQU   CATTR1
CTEMP    EQU   CATTR1
CINHIB   EQU   CATTR1
CRECOV   EQU   CATTR1
CERASE   EQU   CATTR1
CREUSE   EQU   CATTR1
CUNIQ    EQU   CATTR1
CSP      EQU   CATTR1
CEXP     EQU   CTGRBASE+55
CCRE     EQU   CTGRBASE+52
TIOUCBP  EQU   TIOEDEVE+1
TIOVERF  EQU   TIOSTTB
TIOUNLD  EQU   TIOSTTB
TIOMNTD  EQU   TIOSTTB
TIOSETU  EQU   TIOSTTB
TIOVLSR  EQU   TIOSTTB
TIOPVIO  EQU   TIOSTTB
TIOREQD  EQU   TIOSTTB
TIOUSED  EQU   TIOSTTB
TIOTFEND EQU   POOLSTAR+16
TIOPSLOT EQU   POOLSTAR+13
TIOPSTTB EQU   POOLSTAR+12
TIOPPOOL EQU   POOLSTAR+4
TIOPNSRT EQU   POOLSTAR+3
@NM00140 EQU   POOLSTAR+2
TIOPNSLT EQU   POOLSTAR+1
@NM00139 EQU   POOLSTAR
TIOEFSRT EQU   TIOENTRY+17
TIOSVERF EQU   TIOESTTB
TIOSUNLD EQU   TIOESTTB
TIOSMNTD EQU   TIOESTTB
TIOSSETU EQU   TIOESTTB
TIOSVLSR EQU   TIOESTTB
TIOSPVIO EQU   TIOESTTB
TIOSREQD EQU   TIOESTTB
TIOSUSED EQU   TIOESTTB
TIOSBALS EQU   TIOESTTC
TIOSBALP EQU   TIOESTTC
TIOSVOLS EQU   TIOESTTC
TIOSVOLP EQU   TIOESTTC
TIOSAFFS EQU   TIOESTTC
TIOSAFFP EQU   TIOESTTC
TIOSDEFR EQU   TIOESTTC
TIOSDKCR EQU   TIOESTTC
TIOEJFCB EQU   TIOENTRY+12
TIOEDDNM EQU   TIOENTRY+4
TIOTREM  EQU   TIOELINK
TIOESSDS EQU   TIOESYOT
TIOESYIN EQU   TIOELINK
TIOEQNAM EQU   TIOELINK
TIOEDYNM EQU   TIOELINK
TIOTTERM EQU   TIOELINK
TIOTRV01 EQU   TIOELINK
TIOSYOUT EQU   TIOELINK
TIOEWTCT EQU   TIOERLOC
TIOSDSP2 EQU   TIOESTTA
TIOSDSP1 EQU   TIOESTTA
TIOSLABL EQU   TIOESTTA
TIOSDADS EQU   TIOESTTA
TIOSJBLB EQU   TIOESTTA
TIOSPLTS EQU   TIOESTTA
TIOSPLTP EQU   TIOESTTA
TIOSLTYP EQU   TIOESTTA
TIOELNGH EQU   TIOENTRY
JSCBEND3 EQU   JSCBSEC3+120
JSCRSV52 EQU   JSCBSEC3+116
JSCRSV51 EQU   JSCRSV47+1
JSCRSV50 EQU   JSCRSV47
JSCRSV49 EQU   JSCRSV46+1
JSCRSV48 EQU   JSCRSV46
JSCRSV44 EQU   JSCBSEC3+108
JSCRSV43 EQU   JSCBSEC3+104
JSCRSV42 EQU   JSCBSEC3+100
JSCBASWA EQU   JSCBSEC3+96
JSCBUFPT EQU   JSCBSEC3+92
JSCBSWSP EQU   JSCBSEC3+87
JSCRSV33 EQU   JSCBSEC3+86
JSCDDNUM EQU   JSCBSEC3+84
JSCRSV53 EQU   JSCBSEC3+82
JSCDDNNO EQU   JSCBSEC3+80
JSCBVATA EQU   JSCBSEC3+76
JSCTMCOR EQU   JSCBSEC3+72
JSCSCTP  EQU   JSCSCT+1
JSCRSV55 EQU   JSCSCT
JSCRSV54 EQU   JSCBSEC3+64
JSCDSABQ EQU   JSCBSEC3+60
JSCBSSIB EQU   JSCBSEC3+56
JSCBFRBA EQU   JSCBSEC3+48
JSCRSV28 EQU   JSCBSEC3+46
JSCBSONO EQU   JSCBSEC3+44
JSCBSUBA EQU   JSCBSUB+1
JSCRSV31 EQU   JSCBSUB
JSCBSMLR EQU   JSCBSEC3+36
JSCBJNLR EQU   JSCBSEC3+32
JSCBJNLA EQU   JSCBJNL+1
JSCBJSBT EQU   JSCBJJSB
JSCBJSBX EQU   JSCBJJSB
JSCBJSBA EQU   JSCBJJSB
JSCBJSBI EQU   JSCBJJSB
@NM00121 EQU   JSCBJJSB
JSCBJNLE EQU   JSCBJJSB
JSCBJNLF EQU   JSCBJJSB
JSCBJNLN EQU   JSCBJJSB
@NM00120 EQU   JSCBSEC3+24
JSCBJRBA EQU   JSCBSEC3+16
JSCBIECB EQU   JSCBSEC3+12
JSCBRV08 EQU   JSCBSEC3+11
JSCBRV07 EQU   JSCBFBYT
JSCBRV06 EQU   JSCBFBYT
JSCBRV05 EQU   JSCBFBYT
JSCBRV04 EQU   JSCBFBYT
JSCBRV03 EQU   JSCBFBYT
JSCBRV02 EQU   JSCBFBYT
JSCBADSP EQU   JSCBFBYT
JSCBRV01 EQU   JSCBFBYT
JSCBTJID EQU   JSCBASID
JSCBPSCB EQU   JSCBSEC3+4
JSCJCTP  EQU   JSCBJCTA
JSCRSV24 EQU   JSCBJCT
JSCBEND2 EQU   JSCBSEC2
@NM00091 EQU   MCATDSTR+1
@NM00090 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
CKAUMGFG EQU   CKAUMGAR+2
CKAUPRML EQU   CKAUINWA+4
CKAUECB  EQU   CKAUINWA
CKAUDTLN EQU   CKAUWKA+212
@NM00192 EQU   CKAUWKA+211
@NM00191 EQU   CKAUVLTY+12
CKAUVOLS EQU   CKAUVLTY+6
CKAUDVTP EQU   CKAUVLTY+2
@NM00190 EQU   CKAUVLTY
CKAUVTLN EQU   CKAUWKA+192
CKAURCMC EQU   CKAUWKA+176
@NM00189 EQU   CKAUWKA+175
CKAURACX EQU   CKAURF1
CKAUGLOB EQU   CKAURF1
CKAUVFRD EQU   CKAURF1
CKAURACV EQU   CKAURF1
CKAUDOUB EQU   CKAURF1
CKAUTCIN EQU   CKAUWKA+171
CKAUTTYP EQU   CKAUWKA+170
CKAUTREP EQU   CKAUWKA+168
CKAULNDT EQU   CKAUWKA+164
CKAUTFN2 EQU   CKAUWKA+156
CKAUTLP2 EQU   CKAUWKA+148
CKAUTFP2 EQU   CKAUWKA+132
CKAUTFN1 EQU   CKAUWKA+124
CKAUTLP1 EQU   CKAUWKA+116
CKAUTFP1 EQU   CKAUWKA+100
CKAUFLNM EQU   CKAUWKA+92
CKAULNPT EQU   CKAUWKA+84
CKAUFPL  EQU   CKAUWKA+68
CKAUFLPT EQU   CKAUWKA+64
CKAUSVLV EQU   CKAUWKA+32
CKAURACL EQU   CKAUWKA+28
CKAULEVL EQU   CKAUWKA+24
CKAUBSCI EQU   CKAUWKA+14
@NM00188 EQU   CKAUFLG1
CKAUCKPW EQU   CKAUFLG1
CKAUPTST EQU   CKAUFLG1
CKAUNULL EQU   CKAUFLG1
CKAUNRC1 EQU   CKAUFLGS
CKAULVRQ EQU   CKAUFLGS
CKAULPSW EQU   CKAUFLGS
CKAUREAD EQU   CKAUPSWD+24
CKAUUPDT EQU   CKAUPSWD+16
CKAUCI   EQU   CKAUPSWD+8
CKAUMSTR EQU   CKAUPSWD
@NM00187 EQU   JSCBACTV+260
@NM00186 EQU   JSCBACTV+188
@NM00185 EQU   JSCBACTV
@NM00184 EQU   @NM00183
@NM00182 EQU   RBRPSW
RTTOLFCT EQU   DEVCHARS+18
RTTOLFLG EQU   RTDVFLGS
@NM00181 EQU   RTDVFLGS
RTKABFLG EQU   RTDVFLGS
@NM00180 EQU   RTDVFLGS
RTBONK   EQU   DEVCHARS+16
RTBOKLB  EQU   RTBOKAB+1
RTBOKNLB EQU   RTBOKAB
RTTRKSIZ EQU   DEVCHARS+12
RTNOTRKS EQU   DEVCHARS+10
RTNOCYLS EQU   DEVCHARS+8
RTMXDBLK EQU   DEVCHARS+4
RTCLSTYP EQU   RTDEVUCB+2
@NM00179 EQU   RTDEVUCB
@NM00178 EQU   RGATTSG1
RGATSUP1 EQU   RGATTSG1
@NM00177 EQU   RGATTR1
RGATTUPG EQU   RGATTR1
CTGDSNUS EQU   CTGATR2
@NM00176 EQU   CTGATR2
CTGDSSSH EQU   CTGATR2
CTGDSISH EQU   CTGATR2
CTGTRKOV EQU   CTGATR1
CTGDSTPX EQU   CTGATR1
CTGDSINH EQU   CTGATR1
CTGDSREC EQU   CTGATR1
CTGDSERA EQU   CTGATR1
CTGDSREU EQU   CTGATR1
CTGDSUNQ EQU   CTGATR1
CTGDSSPD EQU   CTGATR1
SPCROUND EQU   SPCOPTNS
SPCALXRQ EQU   SPCOPTNS
SPCMXIGR EQU   SPCOPTNS
SPCCNTIG EQU   SPCOPTNS
@NM00175 EQU   SPCOPTNS
SPCRQTYP EQU   SPCOPTNS
SPCSECDQ EQU   SPACEPRM+3
SPCPRIMQ EQU   SPACEPRM
LTVOLSER EQU   LTENTRY+2
LTRETCD2 EQU   LTRETCOD+1
LTRETCD1 EQU   LTRETCOD
LTLENGTH EQU   USERLIST
USERAREV EQU   USERAREC+2
USERAREL EQU   USERAREC
USVRMDUL EQU   PASSGO+42
PASSATMP EQU   PASSGO+40
PASSPRMT EQU   PASSGO+32
READPW   EQU   PASSWORD+24
UPDATEPW EQU   PASSWORD+16
CIPW     EQU   PASSWORD+8
MASTERPW EQU   PASSWORD
ASCI     EQU   ASGO+1
ASTYPE   EQU   ASGO
CDBMDSZA EQU   CDBMDSZ+1
CDBSUBPL EQU   CDBMDSZ
CDBMDADA EQU   CDBMDAD+1
CDBNLSZ  EQU   CDBMDAD
XSVRBEND EQU   XRB+152
@NM00167 EQU   XRB+96
XSIRBEND EQU   XRB+96
XIRBEND  EQU   XRB+96
@NM00166 EQU   XRB+32
XLPRBEND EQU   XRB+32
XPRBEND  EQU   XRB+32
@NM00165 EQU   @NM00163+1
@NM00164 EQU   @NM00163
XRBQ     EQU   XRB+24
XFRBEND  EQU   XRB+24
@NM00162 EQU   XRTLPRB+1
XRBWTIS  EQU   XRBFLAG1
@NM00161 EQU   XRBFLAG1
XRBSRSW  EQU   XRBFLAG1
XRBPFSW  EQU   XRBFLAG1
XRREQ    EQU   @NM00160
XLRBEND  EQU   XRB+16
XRBEPA   EQU   XRBEP+1
XRBUSE   EQU   XRBEP
@NM00159 EQU   @NM00155
@NM00158 EQU   @NM00155
XRBIRBBT EQU   @NM00155
XRBREUS  EQU   @NM00155
XRBRSREG EQU   @NM00155
XRBGTMAN EQU   @NM00157
XRBNRENT EQU   @NM00156
XRBREFR  EQU   @NM00153
XRBETXR  EQU   XRBLRBFX
@NM00154 EQU   @NM00153
XRBSVRES EQU   @NM00153
XRBTYPF  EQU   @NM00153
XRBSZY   EQU   XRB+9
XRBCDBPY EQU   XRB+8
XRBNM    EQU   XRB
XRBPFXND EQU   XRBPRFX1+8
XRBPRE   EQU   XRBPRFX1+4
XRBSUC   EQU   XRBPRFX1
XRBQMAJ  EQU   XRBPRFX+4
@NM00151 EQU   XRBPRFX
RBEXSAVE EQU   XRBESA
XRBREG15 EQU   RBGRS15
XRBREG14 EQU   RBGRS14
XRBREG13 EQU   RBGRS13
XRBREG12 EQU   RBGRS12
XRBREG11 EQU   RBGRS11
XRBREG10 EQU   RBGRS10
XRBREG9  EQU   RBGRS9
XRBREG8  EQU   RBGRS8
XRBREG7  EQU   RBGRS7
XRBREG6  EQU   RBGRS6
XRBREG5  EQU   RBGRS5
XRBREG4  EQU   RBGRS4
XRBREG3  EQU   RBGRS3
XRBREG2  EQU   RBGRS2
XRBREG1  EQU   RBGRS1
XRBREG0  EQU   RBGRS0
XRBLNKA  EQU   RBLINKB
XRBWT    EQU   RBWCF
@NM00150 EQU   RBBASIC+24
RBOPSWPS EQU   RBOPSWB2
@NM00149 EQU   RBOPSWB2
@NM00148 EQU   XRBPSW
@NM00147 EQU   RBBASIC+12
XRBWAIT  EQU   RBECBWT
XRBFRRB  EQU   RBFDYN
@NM00146 EQU   XSTAB2
XRBACTV  EQU   RBFACTV
XRBTCBP  EQU   RBTCBNXT
@NM00145 EQU   XSTAB1
XRBCKPT  EQU   RBFTCKPT
@NM00144 EQU   XSTAB1
@NM00143 EQU   RBBASIC+8
@NM00142 EQU   RBEXRTNM+1
RBTMIND3 EQU   RBTMFLD
RBTMIND2 EQU   RBTMFLD
RBTMCMP  EQU   RBTMFLD
RBWLIM   EQU   RBTMFLD
RBRSV005 EQU   RBTMFLD
RBTMTOD  EQU   RBTMFLD
RBTMQUE  EQU   RBTMFLD
@NM00141 EQU   RBPRFX
TIOCSTEP EQU   TIOT1+8
TIOCNJOB EQU   TIOT1
TSBLECB  EQU   TSBMINL
TSBLINE  EQU   TSB+82
TSBSTAX  EQU   TSB+81
TSBATTNC EQU   TSB+80
TSBF1V   EQU   TSBTPOST+7
TSBF1M   EQU   TSBTPOST+6
TSBF2V   EQU   TSBTPOST+5
TSBF2M   EQU   TSBTPOST+4
TSBFLAGV EQU   TSBTPOST+3
TSBFLAGM EQU   TSBTPOST+2
@NM00138 EQU   TSBTPOST+1
@NM00137 EQU   TSBTPFLG
@NM00136 EQU   TSBTPFLG
@NM00135 EQU   TSBTPFLG
@NM00134 EQU   TSBTPFLG
TSBNEWID EQU   TSBTPFLG
TSBTPAYI EQU   TSBTPFLG
TSBTPQCB EQU   TSBTPFLG
TSBPOSTO EQU   TSBTPFLG
TSBLINKB EQU   TSBLINKA+1
TSBPRI   EQU   TSBLINKA
TSBRQCB  EQU   TSBRCB
TSBCTCB  EQU   TSB+60
TSBERSDS EQU   TSB+56
TSBAUTOI EQU   TSB+52
TSBAUTOS EQU   TSB+48
TSBATNCC EQU   TSB+44
TSBASRCE EQU   TSB+42
TSBHLDL  EQU   TSBFLG4
TSBGETBF EQU   TSBFLG4
TSBCANC  EQU   TSBFLG4
TSBHOLD  EQU   TSBFLG4
TSBHUNG  EQU   TSBFLG4
TSBOWAIT EQU   TSBFLG4
TSBIWAIT EQU   TSBFLG4
TSBOCAB  EQU   TSBFLG4
TSBLNNO  EQU   TSB+40
TSBATNTC EQU   TSB+38
TSBATNLC EQU   TSB+36
TSBCHDCC EQU   TSBSTCC+1
TSBLNDCC EQU   TSBSTCC
TSBWTJID EQU   TSB+32
TSBECB   EQU   TSB+28
TSBC1050 EQU   TSBTERM2
@NM00133 EQU   TSBTERM2
@NM00132 EQU   TSBTERM2
@NM00131 EQU   TSBTERM2
@NM00130 EQU   TSBTERM2
TSBCTWX  EQU   TSBTERM2
@NM00129 EQU   TSBTERM2
@NM00128 EQU   TSBTERM2
@NM00127 EQU   TSBTERM1
@NM00126 EQU   TSBTERM1
@NM00125 EQU   TSBTERM1
TSBC2741 EQU   TSBTERM1
TSBC5041 EQU   TSBTERM1
TSBCATTN EQU   TSBTERM1
TSBCBRK  EQU   TSBTERM1
TSBCIHBN EQU   TSBTERM1
@NM00124 EQU   TSB+25
TSBNFLOP EQU   TSBFLG3
TSBNOBRK EQU   TSBFLG3
TSBTPUT  EQU   TSBFLG3
TSBAWOIP EQU   TSBFLG3
TSBNBKSP EQU   TSBFLG3
TSBSPIT  EQU   TSBFLG3
TSBTJMSG EQU   TSBFLG3
TSBATTN  EQU   TSBFLG3
TSBIBFP  EQU   TSB+21
TSBNIBF  EQU   TSB+20
TSBITBFP EQU   TSB+17
TSBSATN2 EQU   TSBFLG2
TSBSATN1 EQU   TSBFLG2
TSBSTAUT EQU   TSBFLG2
TSBAUTOC EQU   TSBFLG2
TSBAULST EQU   TSBFLG2
TSBBRKIN EQU   TSBFLG2
TSBAUTON EQU   TSBFLG2
TSBBIPI  EQU   TSBFLG2
TSBOBFP  EQU   TSB+13
TSBNOBF  EQU   TSB+12
TSBOTBFP EQU   TSB+9
TSBLNSZ  EQU   TSB+8
TSBWTCB  EQU   TSB+5
TSBTJBF  EQU   TSBFLG1
TSBTJIP  EQU   TSBFLG1
TSBTJOW  EQU   TSBFLG1
TSBIFLSH EQU   TSBFLG1
TSBWOWIP EQU   TSBFLG1
TSBOWIP  EQU   TSBFLG1
TSBOFLSH EQU   TSBFLG1
TSBANSR  EQU   TSBFLG1
TSBASCB  EQU   TSBASCBA+1
TSBATNLD EQU   TSBSTAT
TSB3270  EQU   TSBSTAT
TSBDISC  EQU   TSBSTAT
TSBITOFF EQU   TSBSTAT
TSBNOBUF EQU   TSBSTAT
TSBDSPLY EQU   TSBSTAT
TSBLWAIT EQU   TSBSTAT
TSBINUSE EQU   TSBSTAT
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBRV44 EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBCSCB EQU   ASCB+56
ASCBRSMA EQU   ASCBRSM+1
ASCBRV54 EQU   ASCBRSMF
ASCBRV53 EQU   ASCBRSMF
ASCBRV52 EQU   ASCBRSMF
ASCBRV51 EQU   ASCBRSMF
ASCBVEQR EQU   ASCBRSMF
ASCBN2LP EQU   ASCBRSMF
ASCB1LPU EQU   ASCBRSMF
ASCB2LPU EQU   ASCBRSMF
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
UPTPREFL EQU   UPT+23
UPTPREFX EQU   UPT+16
@NM00123 EQU   UPT+15
UPTLDEL  EQU   UPT+14
UPTCDEL  EQU   UPT+13
UPTWTP   EQU   UPTSWS
UPTMODE  EQU   UPTSWS
UPTALD   EQU   UPTSWS
UPTPAUS  EQU   UPTSWS
UPTNCOM  EQU   UPTSWS
UPTRCVR  EQU   UPTSWS
UPTUSER  EQU   UPT+2
@NM00122 EQU   UPT
JSCBCSCB EQU   JSCBSEC1+68
JSCBPMG  EQU   JSCBWTP+2
JSCBWTSP EQU   JSCBWTP+1
JSCRSV23 EQU   JSCBWTFG
JSCRSV22 EQU   JSCBWTFG
JSCRSV21 EQU   JSCBWTFG
JSCRSV20 EQU   JSCBWTFG
JSCRSV19 EQU   JSCBWTFG
JSCRSV18 EQU   JSCBWTFG
JSCBRET  EQU   JSCBWTFG
JSCBIOFG EQU   JSCBWTFG
@NM00119 EQU   JSCBSEC1+60
JSCBQMPI EQU   JSCBSEC1+56
JSCBPMSG EQU   JSCBSWT1
JSCRSV16 EQU   JSCBSWT1
JSCRSV15 EQU   JSCBSWT1
JSCRSV14 EQU   JSCBSWT1
JSCRSV13 EQU   JSCBSWT1
JSCRSV12 EQU   JSCBSWT1
JSCRSV11 EQU   JSCBSWT1
JSCBPASS EQU   JSCBSWT1
JSCBTTTR EQU   JSCBSEC1+52
JSCRSV10 EQU   JSCBSEC1+49
JSCBAUTH EQU   JSCBOPTS
JSCSIOTS EQU   JSCBOPTS
JSCRSV08 EQU   JSCBOPTS
JSCRSV07 EQU   JSCBOPTS
JSCRSV06 EQU   JSCBOPTS
JSCBLONG EQU   JSCBOPTS
JSCRSV05 EQU   JSCBOPTS
JSCRSV04 EQU   JSCBOPTS
JSCBSECB EQU   JSCBSEC1+44
JSCRSV03 EQU   JSCBSEC1+41
JSCBSTEP EQU   JSCBSEC1+40
JSCBDCBA EQU   JSCBDCB+1
JSCRSV02 EQU   JSCBDCB
JSCBID   EQU   JSCBSEC1+32
JSCBDBTB EQU   JSCBSEC1+28
JSCBIJSC EQU   JSCBSEC1+24
JSCBTCBP EQU   JSCBSEC1+20
JSCBPCC  EQU   JSCBSEC1+16
JSCBTCP  EQU   JSCBSEC1+12
JSCBSHR  EQU   JSCBSEC1+8
JSCHPCEA EQU   JSCHPCE+1
JSCRSV32 EQU   JSCHPCE
JSCRSV01 EQU   JSCBSEC1
@NM00118 EQU   IEZJSCB
PSCBU    EQU   PSCB+64
PSCBRSZ  EQU   PSCB+60
PSCBLINE EQU   PSCB+59
PSCBCHAR EQU   PSCB+58
PSCBUPTL EQU   PSCB+56
PSCBRLGB EQU   PSCB+48
PSCBDEST EQU   PSCB+40
@NM00117 EQU   PSCB+36
@NM00116 EQU   PSCB+32
PSCBSOUT EQU   PSCB+31
PSCBSUBM EQU   PSCB+30
PSCBSUBC EQU   PSCB+29
PSCBSUBH EQU   PSCB+28
PSCBLTI2 EQU   PSCB+24
PSCBLTIM EQU   PSCB+20
PSCBATR2 EQU   PSCB+18
@NM00115 EQU   PSCBATR1
@NM00114 EQU   PSCBATR1
PSCBRCVR EQU   PSCBATR1
PSCBATTN EQU   PSCBATR1
PSCBVMNT EQU   PSCBATR1
PSCBJCL  EQU   PSCBATR1
PSCBACCT EQU   PSCBATR1
PSCBCTRL EQU   PSCBATR1
PSCBGPNM EQU   PSCB+8
PSCBUSRL EQU   PSCB+7
PSCBUSER EQU   PSCB
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00113 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
RDDFVSER EQU   RDDFLIST+12
RDDFNNAM EQU   RDDFOVOL
RDDFENT  EQU   RDDFENTW+1
@NM00112 EQU   RDDFFLGS
RDDFDSTV EQU   RDDFFLGS
@NM00111 EQU   RDDFFLGS
RDDFNEWN EQU   RDDFFLGS
RDDFOLDV EQU   RDDFFLGS
RDDFTADV EQU   RDDFFLGS
RDDFTDEL EQU   RDDFFLGS
RDDFINST EQU   RDDFINSW+1
RDDFLENG EQU   RDDFINSW
ACHKVOLS EQU   ACHKVOLW+1
@NM00110 EQU   ACHKFLG3
ACHKVOL  EQU   ACHKFLG3
@NM00109 EQU   ACHKFLG3
ACHKPRF  EQU   ACHKFLG3
@NM00108 EQU   ACHKFLG3
ACHKCLN  EQU   ACHKCLNW+1
@NM00107 EQU   ACHKFLG2
ACHKTRD  EQU   ACHKFLG2
ACHKTUPD EQU   ACHKFLG2
ACHKTCTL EQU   ACHKFLG2
@NM00106 EQU   ACHKFLG2
ACHKTALT EQU   ACHKFLG2
ACHKCSA  EQU   ACHKFLG1
ACHKLOGN EQU   ACHKFLG1
ACHKLOGF EQU   ACHKFLG1
@NM00105 EQU   ACHKFLG1
ACHKDSTV EQU   ACHKFLG1
@NM00104 EQU   ACHKFLG1
@NM00103 EQU   ACHKFLG1
@NM00102 EQU   ACHKFLG1
ACHKINST EQU   ACHKINSW+1
ACHKLENG EQU   ACHKINSW
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00101 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVCPP EQU   CTGFVPWD
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVATR EQU   CTGFV+60
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVVLT EQU   CTGFV+40
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVIND EQU   CTGFV+16
CTGFVVCH EQU   CTGFV+12
CTGFVICH EQU   CTGFV+8
CTGFVDCH EQU   CTGFV+4
@NM00100 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00099 EQU   CTGFVPRO
CTGFVROF EQU   CTGFVPRO
CTGFVRON EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CAXWNQID EQU   CAXHRPLW+2
CAXHRPLC EQU   CAXHRPLW
CAXASCBP EQU   IGGCAXWA+124
@NM00098 EQU   CAXECB+1
@NM00097 EQU   CAXECBHB
CAXECBPB EQU   CAXECBHB
CAXECBWB EQU   CAXECBHB
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXPLOCK EQU   CAXCCA
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00096 EQU   COPTS
CENLST   EQU   COPTS
@NM00095 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXUCB   EQU   IGGCAXWA+28
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00094 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00093 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2REC EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00092 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00089 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
@NM00088 EQU   ACBINFL2
ACBCBIC  EQU   ACBINFL2
@NM00087 EQU   ACBINFL2
ACBBYPSS EQU   ACBINFL1
ACBSDS   EQU   ACBVVIC
ACBUCRA  EQU   ACBINFL1
ACBSCRA  EQU   ACBINFL1
ACBCAT   EQU   ACBINFL1
ACBIJRQE EQU   ACBINFL1
ACBJEPS  EQU   ACBINFL1
@NM00086 EQU   ACBINFL1
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00085 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00084 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00083 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00082 EQU   ACBDSORG
ACBOPTJ  EQU   ACBDVIND
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00081 EQU   ACBCCTYP
ACBTRCID EQU   ACBCCTYP
@NM00080 EQU   ACBRECFM
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00079 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00078 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00077 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00052 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00051 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBRV327 EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBRV326 EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBSTAFX EQU   TCBSTAWA
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBCCPVI EQU   TCBXSCT+2
TCBRV325 EQU   TCBXSCT+1
TCBRV324 EQU   TCBXSCT1
TCBRV323 EQU   TCBXSCT1
TCBRV322 EQU   TCBXSCT1
TCBRV321 EQU   TCBXSCT1
TCBRV320 EQU   TCBXSCT1
TCBRV319 EQU   TCBXSCT1
TCBS3A   EQU   TCBXSCT1
TCBACTIV EQU   TCBXSCT1
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00050 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00049 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00048 EQU   CVTFIX+248
@NM00047 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
CNTVAR   EQU   CNTRLINF
VARINFO  EQU   VARFIELD+2
VARLEN   EQU   VARFIELD
REPGOPT  EQU   REPCNTRL+6
REPCNT   EQU   REPCNTRL+5
@NM00046 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
NREPCV   EQU   CATRCD+47
RCDSIZ   EQU   CATRCD+45
@NM00045 EQU   CATRCD+27
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRADT EQU   CATRCD+14
RCDCRACI EQU   CATRCD+11
RCDCRAVL EQU   CATRCD+5
RCDRELID EQU   CATRCD+4
RCDKEYTY EQU   CATRCD
CATGOGC  EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOEXT EQU   CATGOGC1
CATGODSP EQU   CATGOCI+1
@NM00044 EQU   CATGOFLG
CCACPE4  EQU   CCARAB+16
@NM00043 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00042 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
DIC2LC   EQU   DIC2ENT+2
DIC2ST   EQU   DIC2ENT+1
@NM00041 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2VAR  EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
DICTLC   EQU   DICTENT+2
DICTST   EQU   DICTENT+1
@NM00040 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
WKALEN1  EQU   USERWKA
CTGFLNG  EQU   CTGFLDAT
CTGFLCHN EQU   CTGFL+12
CTGFLDTS EQU   CTGFLDRE
@NM00039 EQU   CTGFLDRE
CTGFLDCD EQU   CTGFL+1
CTGFLDNO EQU   CTGFL
CTGPSWD  EQU   CTGJSCB
@NM00037 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
@NM00036 EQU   CTGDSORG
@NM00035 EQU   CTGOPTN4
CTGTIOT  EQU   CTGOPTN4
CTGCOIN  EQU   CTGOPTN4
CTGNPROF EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
@NM00034 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGSWAP  EQU   CTGRCATN
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGNAME  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1508
@NM00033 EQU   IGGCCA+1504
CCARMINN EQU   CCAREQDQ+8
CCARMAJN EQU   CCAREQDQ+4
CCAREDRC EQU   CCAREQDQ+3
@NM00032 EQU   CCAREDOP
CCAREDSH EQU   CCAREDOP
CCAREDLN EQU   CCAREQDQ+1
CCAREDFF EQU   CCAREQDQ
CCASAVMN EQU   CCADGDGA
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
@NM00031 EQU   CCAFLG10
CCADEFUN EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00030 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
CCATNQCT EQU   IGGCCA+1416
CCACUMPL EQU   IGGCCA+1412
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00029 EQU   CCAREGS
@NM00028 EQU   CCAFLG11
CCAF11B5 EQU   CCAFLG11
@NM00027 EQU   CCAFLG11
@NM00026 EQU   IGGCCA+1057
@NM00025 EQU   CCARVFG1
RVWG     EQU   CCARVFG1
RVRPLMFG EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00024 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00023 EQU   CCAMNAT+1
@NM00022 EQU   MNATTOP
MNATFULL EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00021 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00020 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00019 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
CCASAVID EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCAGVEXT EQU   IGGCCA+488
CCANEVV  EQU   IGGCCA+486
CCAGVCT  EQU   IGGCCA+484
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00018 EQU   IGGCCA+400
CCASN1   EQU   CCASN
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCARABL  EQU   IGGCCA+388
CCARABF  EQU   IGGCCA+384
CCARABB  EQU   IGGCCA+380
CCAMCPL  EQU   CCAXCPL
CCARABPT EQU   IGGCCA+368
CCATFLPT EQU   CCAFLPT
CCAILNG  EQU   IGGCCA+360
CCASL    EQU   IGGCCA+358
CCAGOPLN EQU   IGGCCA+356
CCACPE71 EQU   IGGCCA+352
CCAIDPT  EQU   CCACPE7
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCACMSWA EQU   CCACMS
CCARPRM  EQU   IGGCCA+312
@NM00017 EQU   CCAMSSPL+10
@NM00016 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00015 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCI  EQU   IGGCCA+271
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCARPL1  EQU   IGGCCA+220
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
CCATQDB  EQU   CCATIQRN+2
CCATASID EQU   CCATIQRN
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCAR5UR  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCAR4UR  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
CCAR0REC EQU   CCARAB0+4
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAMOD   EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCAREUSE EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNC  EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2NVC EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCAMODID EQU   CCAPROB
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
@NM00076 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00075 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00074 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00073 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00072 EQU   FLCFSA
@NM00071 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00070 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00069 EQU   FLCIOA
@NM00068 EQU   FLCMCLA+15
@NM00067 EQU   FLCMCLA+14
@NM00066 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00065 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00064 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00063 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00062 EQU   FLCPER
@NM00061 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00060 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00059 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00058 EQU   FLCPIILC
@NM00057 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00056 EQU   FLCSVILC
@NM00055 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00054 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00053 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00304 EQU   @RC00303
@RC00321 EQU   @RC00293
@RC00456 EQU   @RC00455
@PB00007 EQU   @EL00001
@RC00322 EQU   @RC00321
@ENDDATA EQU   *
         END   IGG0CLB6,(C'PLS1355',0701,78090)
