    TITLE '***** IDCCDLR - LISTCRA COMMAND DESCRIPTOR *****'
*/********************************************************************/
*/*                                                                  */
*/*  MODULE NAME - IDCCDLR                                           */
*/*                                                                  */
*/*  DESCRIPTIVE NAME - 'LISTCRA ' COMMAND DESCRIPTOR                */
*/*                                                                  */
*/*  COPYRIGHT - NONE                                                */
*/*                                                                  */
*/*  STATUS - RELEASE 2, LEVEL 0                                     */
*/*                                                                  */
*/*  FUNCTION - UPON RECOGNITION OF THE 'LISTCRA ' VERBNAME          */
*/*             (OR AN ALLOWABLE ABBREVIATION), THIS MODULE          */
*/*             IS LOADED BY THE IDCAMS READER/INTERPRETER.          */
*/*             THE INFORMATION CONTAINED IN THIS MODULE IS USED TO  */
*/*             SCAN THE INPUT COMMAND AND PERFORM SYNTACTIC AND     */
*/*             SEMANTIC CHECKING ON THE PARAMETERS SPECIFIED, AND   */
*/*             TO BUILD THE FUNCTION DATA TABLE (FDT) WHICH IS      */
*/*             PASSED TO THE 'LISTCRA ' FUNCTION SUPPORT ROUTINE    */
*/*             (IDCLR01 ).                                          */
*/*                                                                  */
*/*  NOTES -                                                         */
*/*                                                                  */
*/*     DEPENDENCIES - THE CHARACTER CODES CONTAINED IN THIS TABLE   */
*/*                    MUST MATCH THOSE OF THE INPUT COMMAND.        */
*/*                    THE CURRENT CHARACTER CODE IS 'EBCDIC'.       */
*/*                                                                  */
*/*     RESTRICTIONS - N/A                                           */
*/*                                                                  */
*/*     REGISTER CONVENTIONS - N/A                                   */
*/*                                                                  */
*/*     PATCH LABEL - N/A                                            */
*/*                                                                  */
*/*  MODULE TYPE - TABLE                                             */
*/*                                                                  */
*/*     PROCESSOR - ASSEMBLER                                        */
*/*                                                                  */
*/*     MODULE SIZE -    0 DECIMAL BYTES                             */
*/*                                                                  */
*/*     ATTRIBUTES - READ ONLY                                       */
*/*                                                                  */
*/*  ENTRY POINT - N/A                                               */
*/*                                                                  */
*/*     PURPOSE - N/A                                                */
*/*                                                                  */
*/*     LINKAGE - N/A                                                */
*/*                                                                  */
*/*  INPUT - N/A                                                     */
*/*                                                                  */
*/*  OUTPUT - N/A                                                    */
*/*                                                                  */
*/*  EXIT NORMAL - N/A                                               */
*/*                                                                  */
*/*  EXIT ERROR - N/A                                                */
*/*                                                                  */
*/*  EXTERNAL REFERENCES - N/A                                       */
*/*                                                                  */
*/*     ROUTINES - N/A                                               */
*/*                                                                  */
*/*     DATA AREAS - N/A                                             */
*/*                                                                  */
*/*     CONTROL BLOCKS - N/A                                         */
*/*                                                                  */
*/*  TABLES - N/A                                                    */
*/*                                                                  */
*/*  MACROS - N/A                                                    */
*/*                                                                  */
*/*  CHANGE ACTIVITY - NONE                                          */
*/*                                                                  */
*/********************************************************************/
         PRINT DATA
IDCCDLR  CSECT
         DC    C'CDLR©
         DC    C'
         DC    C'LE	IFILE
         DC    C'
         DC    C'
         DC    C'·
         DC    C'
         DC    C'
         DC    C'
         DC    C'OUTFILE	OFILE
         DC    C'MP	SDUMP
PLR00000 IKJPARM DSECT=DLR00000
IFILE00  IKJKEYWD
         IKJNAME 'INFILE',ALIAS=('IFILE'),SUBFLD=@IFILE01
CMPR00   IKJKEYWD
         IKJNAME 'COMPARE',ALIAS=('CMPR')
         IKJNAME 'NOCOMPARE',ALIAS=('NCMPR')
DUMP00   IKJKEYWD
         IKJNAME 'DUMP'
         IKJNAME 'NAME'
         IKJNAME 'SEQUENTIALDUMP',ALIAS=('SDUMP')
CAT00    IKJKEYWD
         IKJNAME 'CATALOG',ALIAS=('CAT'),SUBFLD=@CAT01
MRPW00   IKJKEYWD
         IKJNAME 'MASTERPW',ALIAS=('MRPW'),SUBFLD=@MRPW01
OFILE00  IKJKEYWD
         IKJNAME 'OUTFILE',ALIAS=('OFILE'),SUBFLD=@OFILE01
@IFILE01 IKJSUBF
IFILE01  IKJIDENT 'INPUT FILE DNAMES OF CRAS',HEX,LIST,PROMPT='INPUT FI*
               LE DNAMES OF CRAS',                                     *
               HELP=('DNAME OF JCL STATEMENT FOR CRA VOLUMES TO BE LIST*
               ED')
@CAT01   IKJSUBF
CATNM01  IKJPOSIT DSNAME,USID,PROMPT='CATALOG NAME AND OPTIONAL PASSWOR*
               D',                                                     *
               HELP=('NAME AND AUTHORIZATION FOR CATALOG TO BE COMPARED*
               ')
CATDN01  IKJIDENT 'CATALOG FILE DNAME',HEX,PROMPT='CATALOG FILE DNAME',*
               HELP=('DNAME OF JCL STATEMENT FOR OPENING CATALOG TO BE *
               COMPARED')
@MRPW01  IKJSUBF
MRPW01   IKJIDENT 'MASTER CATALOG''S MASTER PASSWORD',HEX,PROMPT='MASTE*
               R CATALOG''S MASTER PASSWORD',                          *
               HELP=('MASTER PASSWORD OF THE SYSTEM MASTER CATALOG')
@OFILE01 IKJSUBF
OFILE01  IKJIDENT 'ALTERNATE OUTPUT FILE DNAME',HEX,PROMPT='ALTERNATE O*
               UTPUT FILE DNAME',                                      *
               HELP=('DNAME OF JCL STATEMENT FOR ALTERNATE OUTPUT DATA *
               SET')
         IKJENDP
PLR00006 IKJPARM DSECT=DLR00006
CATNM02  IKJPOSIT DSNAME,USID,PROMPT='CATALOG NAME AND OPTIONAL PASSWOR*
               D',                                                     *
               HELP=('NAME AND AUTHORIZATION FOR CATALOG TO BE COMPARED*
               ')
CATDN02  IKJIDENT 'CATALOG FILE DNAME',HEX,PROMPT='CATALOG FILE DNAME',*
               HELP=('DNAME OF JCL STATEMENT FOR OPENING CATALOG TO BE *
               COMPARED')
         IKJENDP
         END
