         TITLE '***** IDCCDLC - LIST CATALOG COMMAND DESCRIPTOR *****'
*/********************************************************************/
*/*                                                                  */
*/*  MODULE NAME - IDCCDLC                                           */
*/*                                                                  */
*/*  DESCRIPTIVE NAME - 'LISTCAT ' COMMAND DESCRIPTOR                */
*/*                                                                  */
*/*  COPYRIGHT - NONE                                                */
*/*                                                                  */
*/*  STATUS - RELEASE = 2, LEVEL = 0                                 */
*/*                                                                  */
*/*  FUNCTION - UPON RECOGNITION OF THE 'LISTCAT ' VERBNAME          */
*/*             (OR AN ALLOWABLE ABBREVIATION), THIS MODULE          */
*/*             IS LOADED BY THE IDCAMS READER/INTERPRETER.          */
*/*             THE INFORMATION CONTAINED IN THIS MODULE IS USED TO  */
*/*             SCAN THE INPUT COMMAND AND PERFORM SYNTACTIC AND     */
*/*             SEMANTIC CHECKING ON THE PARAMETERS SPECIFIED, AND   */
*/*             TO BUILD THE FUNCTION DATA TABLE (FDT) WHICH IS      */
*/*             PASSED TO THE 'LISTCAT ' FUNCTION SUPPORT ROUTINE    */
*/*             (IDCLC01 ).                                          */
*/*                                                                  */
*/*  NOTES -                                                         */
*/*                                                                  */
*/*     DEPENDENCIES - THE CHARACTER CODES CONTAINED IN THIS TABLE   */
*/*                    MUST MATCH THOSE OF THE INPUT COMMAND.        */
*/*                    THE CURRENT CHARACTER CODE IS 'EBCDIC'.       */
*/*                                                                  */
*/*     RESTRICTIONS - N/A                                           */
*/*                                                                  */
*/*     REGISTER CONVENTIONS - N/A                                   */
*/*                                                                  */
*/*     PATCH LABEL - N/A                                            */
*/*                                                                  */
*/*  MODULE TYPE - TABLE                                             */
*/*                                                                  */
*/*     PROCESSOR - ASSEMBLER                                        */
*/*                                                                  */
*/*     MODULE SIZE -    0 DECIMAL BYTES                             */
*/*                                                                  */
*/*     ATTRIBUTES - READ ONLY                                       */
*/*                                                                  */
*/*  ENTRY POINT - N/A                                               */
*/*                                                                  */
*/*     PURPOSE - N/A                                                */
*/*                                                                  */
*/*     LINKAGE - N/A                                                */
*/*                                                                  */
*/*  INPUT - N/A                                                     */
*/*                                                                  */
*/*  OUTPUT - N/A                                                    */
*/*                                                                  */
*/*  EXIT NORMAL - N/A                                               */
*/*                                                                  */
*/*  EXIT ERROR - N/A                                                */
*/*                                                                  */
*/*  EXTERNAL REFERENCES - N/A                                       */
*/*                                                                  */
*/*     ROUTINES - N/A                                               */
*/*                                                                  */
*/*     DATA AREAS - N/A                                             */
*/*                                                                  */
*/*     CONTROL BLOCKS - N/A                                         */
*/*                                                                  */
*/*  TABLES - N/A                                                    */
*/*                                                                  */
*/*  MACROS - N/A                                                    */
*/*                                                                  */
*/*  CHANGE ACTIVITY - NONE                                          */
*/*                                                                  */
*/********************************************************************/
         PRINT DATA
IDCCDLC  CSECT
         DC    C'CDLC}
         DC    C'
         DC    C'
         DC    C'
         DC    C'
         DC    C'ENTRIES	ENTRYENT
         DC    C'
         DC    C'
         DC    C'
         DC    C'NONVSAM	NVSAM
         DC    C'UCAT
         DC    C'GENERATIONDATAGROUPGDG
         DC    C'SPACE	PGSPC
         DC    C'
         DC    C'SABLENUS
         DC    C'ON	CREAT
         DC    C'ON	EXPIR
         DC    C'
         DC    C'§°
         DC    C'
PLC00000 IKJPARM DSECT=DLC00000
CAT00    IKJKEYWD
         IKJNAME 'CATALOG',ALIAS=('CAT'),SUBFLD=@CAT01
OUTDD00  IKJKEYWD
         IKJNAME 'OUTFILE',ALIAS=('OFILE'),SUBFLD=@OUTDD01
ENT00    IKJKEYWD
         IKJNAME 'ENTRIES',ALIAS=('ENTRY','ENT'),SUBFLD=@ENT01
         IKJNAME 'LEVEL',ALIAS=('LVL'),SUBFLD=@LVL01
CLUST00  IKJKEYWD
         IKJNAME 'CLUSTER',ALIAS=('CL')
DATUM00  IKJKEYWD
         IKJNAME 'DATA'
INDEX00  IKJKEYWD
         IKJNAME 'INDEX',ALIAS=('IX')
SPACE00  IKJKEYWD
         IKJNAME 'SPACE',ALIAS=('SPC')
ALIEN00  IKJKEYWD
         IKJNAME 'NONVSAM',ALIAS=('NVSAM')
UCAT00   IKJKEYWD
         IKJNAME 'USERCATALOG',ALIAS=('UCAT')
ALIAS00  IKJKEYWD
         IKJNAME 'ALIAS'
GDG00    IKJKEYWD
         IKJNAME 'GENERATIONDATAGROUP',ALIAS=('GDG')
PGSPC00  IKJKEYWD
         IKJNAME 'PAGESPACE',ALIAS=('PGSPC')
AIX00    IKJKEYWD
         IKJNAME 'ALTERNATEINDEX',ALIAS=('AIX')
PATH00   IKJKEYWD
         IKJNAME 'PATH'
NUSE00   IKJKEYWD
         IKJNAME 'NOTUSABLE',ALIAS=('NUS')
CREAT00  IKJKEYWD
         IKJNAME 'CREATION',ALIAS=('CREAT'),SUBFLD=@CREAT01
EXPIR00  IKJKEYWD
         IKJNAME 'EXPIRATION',ALIAS=('EXPIR'),SUBFLD=@EXPIR01
HIST00   IKJKEYWD
         IKJNAME 'NAMES',ALIAS=('NAME')
         IKJNAME 'ALL'
         IKJNAME 'VOLUMES',ALIAS=('VOLUME','VOL')
         IKJNAME 'ALLOCATION',ALIAS=('ALLOC')
         IKJNAME 'HISTORY',ALIAS=('HIST')
@CAT01   IKJSUBF
CATNM01  IKJPOSIT DSNAME,USID,PROMPT='''CATALOG'' CATALOGNAME/PASSWORD *
               VALUE',                                                 *
               HELP=('CATALOGNAME TO BE SEARCHED, PASSWORD IS OPTIONAL'*
               )
CATDD01  IKJIDENT '''CATALOG'' DNAME VALUE',HEX
@OUTDD01 IKJSUBF
OUTDD01  IKJIDENT 'OUTPUT FILE DNAME',HEX,PROMPT='OUTPUT FILE DNAME',  *
               HELP=('LABEL OF DD STATEMENT IDENTIFING OUTPUT FILE')
@ENT01   IKJSUBF
ENT01    IKJPOSIT DSTHING,USID,VOLSER,LIST,PROMPT='''ENTRIES'' PARAMETE*
               R',                                                     *
               HELP=('NAME OF ENTRY (EG. DSNAME, GDG NAME  ETC.)')
@LVL01   IKJSUBF
LVL01    IKJPOSIT DSTHING,PROMPT='LEVEL NAME',                         *
               HELP=('LEVEL NAME, INCLUDE USERID IF APPLICABLE')
@CREAT01 IKJSUBF
CREAT01  IKJIDENT '''CREATION'' PARAMETER',INTEG,PROMPT='''CREATION'' P*
               ARAMETER',                                              *
               HELP=('CREATION PARAMETER DECIMAL VALUE (0 - 9999)')
@EXPIR01 IKJSUBF
EXPIR01  IKJIDENT '''EXPIRATION'' PARAMETER',INTEG,PROMPT='''EXPIRATION*
               '' PARAMETER',                                          *
               HELP=('EXPIRATION PARAMETER DECIMAL VALUE (0 - 9999)')
         IKJENDP
         END
