         TITLE 'IEDQRS - SNA RESPONSE GENERATION PROGRAM               *
                        '
IEDQRS   CSECT ,                                                   0001
@PROLOG  DS    0H                                                  0002
         USING *,RBASE
IEDQRS   IEDHJN AFTERHJN,HJN
         LA    RLCB,0(RLCB)
*                                                                  0448
*/********************************************************************/
*/*                                                                  */
*/*      M A I N   C O D E   S E G M E N T                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  0448
*   STM(R0,R15,SAVEREGS);           /* SAVE REGS                     */
         STM   R0,R15,SAVEREGS                                     0448
*   IF R0^=0 THEN                   /* IEDQUI (IEDRESP ISSUED IN   0449
*                                      INHDR OR INBUF) OR IEDQA4   0449
*                                      ENTRY                         */
         SLR   @10,@10                                             0449
         CR    R0,@10                                              0449
         BE    @RF00449                                            0449
*     DO;                           /* YES                           */
*       IF RPARM=0 THEN             /* ENTRY FROM IEDQA4             */
         CR    RPARM,@10                                           0451
         BNE   @RF00451                                            0451
*         DO;                       /* YES                           */
*           CALL QA4ENTRY;          /* IEDQA4 ENTRY PROCESSING       */
         BAL   @14,QA4ENTRY                                        0453
*           LM(R0,R15,SAVEREGS);    /* RESTORE REGS                  */
         LM    R0,R15,SAVEREGS                                     0454
*           RETURN;                 /* RETURN TO QA4                 */
@EL00001 DS    0H                                                  0455
@EF00001 DS    0H                                                  0455
@ER00001 BR    @14                                                 0455
*         END;                                                     0456
*       ELSE                        /* IEDQUI ENTRY                  */
*         DO;                                                      0457
@RF00451 DS    0H                                                  0458
*           PARM=RPARM;             /* SET UP IEDRESP MACRO PARAMTER
*                                      LIST POINTER                  */
         ST    RPARM,PARM                                          0458
*           SAVE13=R13;             /* SAVE R13                      */
         ST    R13,SAVE13                                          0459
*           R13=R9+LENGTH(SAVEREGS);/* ADDR OF AVTSAVE2              */
         LA    R13,72                                              0460
         ALR   R13,R9                                              0460
*           CALL QUIENTRY;          /* IEDQUI ENTRY PROCESSING       */
         BAL   @14,QUIENTRY                                        0461
*           R15=RC;                 /* SET UP RETURN CODE            */
         L     R15,RC                                              0462
*           R14=AVTUI+4;            /* RETURN TO 2ND ENTRY IN IEDQUI */
         LA    R14,4                                               0463
         AL    R14,AVTUI(,IEDQAPTR)                                0463
*           R13=SAVE13;             /* RESTORE R13                   */
         L     R13,SAVE13                                          0464
*           RETURN;                 /* RETURN TO IEDQUI              */
         B     @EL00001                                            0465
*         END;                                                     0466
*     END;                                                         0467
*   ELSE                            /* IEDQBD ENTRY                  */
*     DO;                                                          0468
@RF00449 DS    0H                                                  0469
*       LCBERBLK=RPARM;             /* SET UP POST LIST              */
         STCM  RPARM,7,LCBERBLK(IEDQLPTR)                          0469
*       IF R9=0 THEN                /* 'DEFAULT' ENTRY (FROM IEDQBD
*                                      AFTER ALL INMSG MACROS HAVE 0470
*                                      BEEN EXECUTED)                */
         LTR   R9,R9                                               0470
         BNZ   @RF00470                                            0470
*         CALL DEFAULT;             /* 'DEFAULT' ENTRY PROCESSING    */
         BAL   @14,DEFAULT                                         0471
*       ELSE                        /* ENTRY AS A RESULT OF IEDRESP
*                                      MACRO ISSUED IN INMSG SUBGROUP*/
*         DO;                                                      0472
         B     @RC00470                                            0472
@RF00470 DS    0H                                                  0473
*           PARM=R8;                /* ADDR OF IEDRESP MACRO PARAMTER
*                                      LIST                          */
         ST    R8,PARM                                             0473
*           CALL INMSG;             /* DO INMSG IEDRESP PROCESSING   */
         BAL   @14,INMSG                                           0474
*         END;                                                     0475
*                                                                  0475
*/*                                                                  */
*                                                                  0476
*       LCBERBQB=IEDQBD;            /* SET ERB UP IEDQBD TPOST     0476
*                                      ADDRESS                       */
@RC00470 L     @10,AVTMSGS-1(,IEDQAPTR)                            0476
         MVC   LCBERBQB(3,IEDQLPTR),IEDQBD+1(@10)                  0476
*       LCBERBPY=PRIEDISP;          /* SET TPOST PRIORITY            */
         MVI   LCBERBPY(IEDQLPTR),X'E0'                            0477
*       RPARM=ADDR(LCBERB);         /* ELEMENT ADDRESS = ERB         */
         LA    RPARM,LCBERB(,IEDQLPTR)                             0478
*       RDISP=AVTEA;                /* DISPATCHER BASE               */
         L     RDISP,AVTEA(,IEDQAPTR)                              0479
*       CALL DSPCHAIN;              /* TPOST ERB BACK TO IEDQBD      */
         LA    @15,DSPCHAIN(,RDISP)                                0480
         BALR  @14,@15                                             0480
*     END;                                                         0481
*                                                                  0481
*/********************************************************************/
*/*  END OF MAIN ROUTINE                                             */
*/********************************************************************/
*                                                                  0482
*                                                                  0482
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE GETS A BUFFER UNIT BY EITHER STEALING IT OR IF THAT */
*/* FAILS  POSTING AN ERB.                                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  0482
*ALLOCBUF:                                                         0482
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0482
         B     @EL00001                                            0482
ALLOCBUF DS    0H                                                  0483
*   DCL                                                            0483
*     BFRQCB LABEL GEND;            /* IEDQRS'S INTERNAL RETURN QCB  */
*   LCBLINK=R14;                    /* SAVE RETURN REG               */
         STCM  R14,7,LCBLINK(IEDQLPTR)                             0484
*   R0=1;                           /* ONE UNIT PER BUFFER           */
         LA    @10,1                                               0485
         LR    R0,@10                                              0485
*   RPARM=1;                        /* ONE BUFFER                    */
         LR    RPARM,@10                                           0486
*   CALL IEDQGA02;                  /* TRY TO STEAL A BUFFER         */
         L     @15,AVTSTEAL(,IEDQAPTR)                             0487
         BALR  @14,@15                                             0487
*   IF R15^=0 THEN                  /* GOT ONE                       */
         LTR   R15,R15                                             0488
         BZ    @RF00488                                            0488
*     RPRF=R15;                     /* SET BUFFER ADDRESSABILITY     */
         LR    RPRF,R15                                            0489
*   ELSE                            /* DID NOT GET ONE               */
*     DO;                                                          0490
         B     @RC00488                                            0490
@RF00488 DS    0H                                                  0491
*       LCBDLNKN=OFF;               /* SHOW ERB IN USE               */
         NI    LCBDLNKN(IEDQLPTR),B'11111110'                      0491
*       LCBRCQCB=ADDR(BFRQCB);      /* RETURN QCB ADDRESS            */
         LA    @10,BFRQCB                                          0492
         ST    @10,LCBRCQCB(,IEDQLPTR)                             0492
*       LCBERBQB=ADDR(AVTBFREB);    /* ADDRESS OF BUFFER REQUEST QCB */
         LA    @10,AVTBFREB(,IEDQAPTR)                             0493
         STCM  @10,7,LCBERBQB(IEDQLPTR)                            0493
*       LCBERBPY=PRIINTRQ;          /* TPOST PRIORITY                */
         MVI   LCBERBPY(IEDQLPTR),X'E4'                            0494
*       LCBRBCT1=1;                 /* # BUFFERS                     */
         MVI   LCBRBCT1(IEDQLPTR),X'01'                            0495
*       LCBRBCT2=1;                 /* # UNITS PER BUFFER            */
         MVI   LCBRBCT2(IEDQLPTR),X'01'                            0496
*       LCBPRCPG=ON;                /* INDICATE APPLICATION TYPE   0497
*                                      BUFFER REQUEST                */
         OI    LCBPRCPG(IEDQLPTR),B'00000010'                      0497
*       RPARM=ADDR(LCBERB);         /* ELEMENT ADDRESS FOR POST      */
         LA    RPARM,LCBERB(,IEDQLPTR)                             0498
*       RDISP=AVTEA;                /* SET DISPATCHER BASE           */
         L     RDISP,AVTEA(,IEDQAPTR)                              0499
*       CALL DSPCHAIN;              /* TPOST ERB                     */
         LA    @15,DSPCHAIN(,RDISP)                                0500
         BALR  @14,@15                                             0500
*                                                                  0501
*       /*************************************************************/
*       /*                                                           */
*       /* THE FOLLOWING GEN BUILDS THE QCB TO WHICH THE ERB IS      */
*       /* TPOSTED AFTER THE BUFFER IS ALLOCATED. THE STCB LINK      */
*       /* POINTER IS THE LAST 3 BYTES OF THE 4 BYTE STCB. THE CODE  */
*       /* IMMEDIATELY FOLLOWING THE STCB GETS CONTROL WHEN THE ERB  */
*       /* IS RETURNED. ENTRY CONDITIONS ARE THEN RESET TO LOOK AS IF*/
*       /* IEDQBD ENTRY AND NON-USER REQUEST. NOTE THAT ALL LOCAL    */
*       /* STORAGE AS WELL AS ALL REGISTERS MUST BE RESTORED IF      */
*       /* NEEDED. THIS IS BECAUSE WHILE THIS INMSG ENTRY IS OFF     */
*       /* GETTING BUFFERS ANOTHER INMSG IN ANOTHER MH COULD BE      */
*       /* CAUSING IEDQRS TO GET CONTROL WHICH WILL RESULT IN LOCAL  */
*       /* STORAGE GETTING CHANGED.                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0501
*       GEN CODE DEFS(BFRQCB) REFS(RBASE);                         0501
ADDRQRS  DC    A(IEDQRS)                IEDQRS BASE ADDRESS
         ORG *-8
         USING *,7
BFRQCB   EQU   *                        BUFFER RETURN QCB ADDRESS
         ORG
         DC    AL1(06)                  STCB VTO
         DC    AL3(*-1)                 STCB POINTER
REENTRY  L     RBASE,ADDRQRS            RESET PROGRAM BASE
         DROP  7
         USING IEDQRS,RBASE
*       RLCB=RPARM-(ADDR(LCBERB)-ADDR(IEDQLCB));/* PLCB ADDRESS      */
         LR    @10,RPARM                                           0502
         SL    @10,@CF02040                                        0502
         LR    RLCB,@10                                            0502
*       LCBERBLK=0;                 /* ZERO POSTLIST POINTER, WE'VE
*                                      ALREADY SENT IT       @YM09027*/
         SLR   @10,@10                                             0503
         STCM  @10,7,LCBERBLK(IEDQLPTR)                            0503
*       GEN(LA    RLCB,0(RLCB));    /* CLEAR HIGH ORDER BYTE         */
         LA    RLCB,0(RLCB)
*       RPRF=LCBERBCH;              /* SA ADDRESS OF ALLOCATED UNIT  */
         L     RPRF,LCBERBCH-1(,IEDQLPTR)                          0505
         LA    RPRF,0(,RPRF)                                       0505
*       LCBERBCH=0;                 /* RESET ERB BUFFER ADDRESS      */
         SLR   @10,@10                                             0506
         STCM  @10,7,LCBERBCH(IEDQLPTR)                            0506
*       LCBDLNKN=ON;                /* MARK ERB AVAILABLE            */
*       LCBPRCPG=OFF;               /* TURN OFF APPLICATION REQUEST
*                                      BIT                           */
         OI    LCBDLNKN(IEDQLPTR),B'00000001'                      0508
         NI    LCBPRCPG(IEDQLPTR),B'11111101'                      0508
*       LCBRCQCB=0;                 /* RESET RETURN QCB ADDRESS      */
         ST    @10,LCBRCQCB(,IEDQLPTR)                             0509
*     END;                                                         0510
*                                                                  0510
*/*                                                                  */
*                                                                  0511
*   R14=LCBLINK;                    /* RESTORE RETURN REG            */
@RC00488 L     R14,LCBLINK-1(,IEDQLPTR)                            0511
         LA    R14,0(,R14)                                         0511
*   RETURN;                                                        0512
@EL00002 DS    0H                                                  0512
@EF00002 DS    0H                                                  0512
@ER00002 BR    @14                                                 0512
*   END ALLOCBUF;                                                  0513
*                                                                  0514
*/********************************************************************/
*/*                                                                  */
*/*  THIS ROUTINE LOCATES THE SENSE BYTES AND VALIDATES THEM.        */
*/*     INPUT:                                                       */
*/*          CMDBYTE - CONTAINS THE DATA FLOW CONTROL COMMAND OR 0   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0514
*CKSNS:                                                            0514
*   PROC OPTIONS(SAVE(R14));                                       0514
CKSNS    ST    @14,@SA00003                                        0514
*   IF RLCB^=SAVTSLCB THEN          /* SSCP FLOW                     */
         L     @10,AVTSAVTP(,IEDQAPTR)                             0515
         C     RLCB,SAVTSLCB(,@10)                                 0515
         BE    @RF00515                                            0515
*     DO;                           /* NO- DO VALIDITY CHECKING      */
*       RPARM=PARM;                 /* ADDR OF PARM LIST             */
         L     RPARM,PARM                                          0517
*       IF PLMASKI=ON THEN          /* ON-NO MASK PRESENT            */
         TM    PLMASKI(RPARM),B'00000001'                          0518
         BNO   @RF00518                                            0518
*         RPARM=RPARM-4;            /* ADJUST PARM LIST PTR          */
         SL    RPARM,@CF00255                                      0519
*       IF PLQAENDX=0 THEN          /* SENSE IN OPTION FIELD         */
@RF00518 CLI   PLQAENDX(RPARM),0                                   0520
         BNE   @RF00520                                            0520
*         DO;                       /* NO                            */
*           IF PLCOUNT=OFF THEN     /* 'COUNT=' SPECIFIED            */
         TM    PLCOUNT,B'10000000'                                 0522
         BNZ   @RF00522                                            0522
*             RPARM=RPARM-8;        /* NO, ADJUST PARM LIST PTR      */
         SL    RPARM,@CF00044                                      0523
*           LCBLUSNS=PLSNS;         /* MOVE SENSE TO LCB             */
@RF00522 MVC   LCBLUSNS(4,IEDQLPTR),PLSNS(RPARM)                   0524
*           CALL SNSER;             /* VALIDATE SENSE                */
         BAL   @14,SNSER                                           0525
*         END;                                                     0526
*       ELSE                        /* SENSE BYTES ARE IN OPTION   0527
*                                      FIELD                         */
*         DO;                                                      0527
         B     @RC00520                                            0527
@RF00520 DS    0H                                                  0528
*           QAEOPNO=PLOPNO;         /* SET OPTION NUMBER IN QAE PARM
*                                      LIST                          */
         IC    @10,PLOPNO(,RPARM)                                  0528
         STC   @10,QAEOPNO                                         0528
*           R15=(AVTMSGS+PLQAENDX)->PTR31;/* IEDQAE(OPTION LOOK UP)
*                                      ADDRESS                       */
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0529
         LA    @10,0(,@10)                                         0529
         SLR   @07,@07                                             0529
         IC    @07,PLQAENDX(,RPARM)                                0529
         ALR   @10,@07                                             0529
         L     R15,PTR31(,@10)                                     0529
*           R2=R13;                 /* SAVE AVT ADDRESS      @YM09013*/
         LR    R2,R13                                              0530
*           R13=ADDR(AVTSAVE4);     /* SAVE AREA FOR IEDQAE  @YM09013*/
         LA    @10,AVTSAVE4(,IEDQAPTR)                             0531
         LR    R13,@10                                             0531
*           RPARM=ADDR(QAEPL);      /* PARM LIST ADDR IN REG1        */
         LA    RPARM,QAEPL                                         0532
*           GEN(BAL  R14,4(R15));   /* GET OPTION FIELD CONTAINING 0533
*                                      SENSE                         */
         BAL  R14,4(R15)
*           R13=R2;                 /* RESTORE AVT ADDRESS   @YM09013*/
         LR    R13,R2                                              0534
*           IF R15=0 THEN           /* GOT OPTION FIELD O.K.         */
         LTR   R15,R15                                             0535
         BNZ   @RF00535                                            0535
*             DO;                   /* YES                           */
*               LCBLUSNS=RPARM->CHAR4;/* MOVE SENSE TO LCB           */
         MVC   LCBLUSNS(4,IEDQLPTR),CHAR4(RPARM)                   0537
*               CALL SNSER;         /* VALIDATE SENSE                */
         BAL   @14,SNSER                                           0538
*             END;                                                 0539
*           ELSE                    /* OPTION NOT FOUND              */
*             RC=INVLOPTN;          /* SET INVALID OPTION RETURN CODE*/
         B     @RC00535                                            0540
@RF00535 MVC   RC(4),@CF00044                                      0540
*         END;                                                     0541
*     END;                                                         0542
*   RETURN;                                                        0543
@EL00003 DS    0H                                                  0543
@EF00003 DS    0H                                                  0543
@ER00003 L     @14,@SA00003                                        0543
         BR    @14                                                 0543
*   END CKSNS;                                                     0544
         B     @EL00003                                            0544
*                                                                  0545
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE HANDLES DEFAULT RESPONSES.                          */
*/*                                                                  */
*/********************************************************************/
*                                                                  0545
*DEFAULT:                                                          0545
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0545
DEFAULT  DS    0H                                                  0546
*   LCBQCBA=R14;                    /* SAVE RETURN ADDRESS           */
         STCM  R14,7,LCBQCBA(IEDQLPTR)                             0546
*   IF LCBRESP=ON THEN              /* RSP STILL NEEDED FOR THIS   0547
*                                      CHAIN                         */
         TM    LCBRESP(IEDQLPTR),B'00000001'                       0547
         BNO   @RF00547                                            0547
*     DO;                           /* YES                           */
*       LCBRESP=OFF;                /* INDICATE RSP NOT NEEDED     0549
*                                      ANYMORE                       */
         NI    LCBRESP(IEDQLPTR),B'11111110'                       0549
*       RHLCB=ADDR(LCBRHSV);        /* ADDR OF RH OF REQUEST WE ARE
*                                      RESPONDING TO                 */
         LA    RHLCB,LCBRHSV(,IEDQLPTR)                            0550
*       IF RHLCB->TRHDR1=ON×        /* A REQUEST ASKING FOR...       */
*           RHLCB->TRHDR2=ON THEN   /* SOME KIND OF RESPONSE         */
         TM    TRHDR1(RHLCB),B'10100000'                           0551
         BZ    @RF00551                                            0551
*         DO;                       /* YES                           */
*           IF RHLCB->TRHRUCAT=TRHDFC THEN/* DATA FLOW CONTROL     0553
*                                      COMMAND                       */
         TM    TRHRUCAT(RHLCB),B'01000000'                         0553
         BNO   @RF00553                                            0553
         TM    TRHRUCAT(RHLCB),B'00100000'                         0553
         BNZ   @RF00553                                            0553
*             CMDBYTE=LCBDFCMD;     /* SET UP COMMAND BYTE           */
         MVC   CMDBYTE(1),LCBDFCMD(IEDQLPTR)                       0554
*           ELSE                    /* NOT DFC                       */
*             CMDBYTE=0;            /* SET COMMAND BYTE TO ZERO      */
         B     @RC00553                                            0555
@RF00553 MVI   CMDBYTE,X'00'                                       0555
*/*                                                                  */
*                                                                  0556
*           IF LCBRSRH=ON THEN      /* HAS A RESPONSE BEEN PREVIOUSLY
*                                      GENERATED BUT NOT SENT        */
@RC00553 TM    LCBRSRH(IEDQLPTR),B'01000000'                       0556
         BNO   @RF00556                                            0556
*             DO;                   /* YES                           */
*               CALL ALLOCBUF;      /* ALLOCATE A BUFFER UNIT        */
         BAL   @14,ALLOCBUF                                        0558
*               EXCPRSP=ON;         /* INDICATE AN EXCEPTION RESPONSE
*                                      IS TO BE SENT                 */
         OI    EXCPRSP,B'10000000'                                 0559
*               CALL SENDRESP;      /* SEND THE GENERATED RESPONSE   */
         BAL   @14,SENDRESP                                        0560
*             END;                                                 0561
*           ELSE                    /* RSP NOT PREVIOUSLY GENERATED  */
*             DO;                                                  0562
         B     @RC00556                                            0562
@RF00556 DS    0H                                                  0563
*               IF CMDBYTE^=CD1CANCL&/* NOT CANCEL COMMAND AND..     */
*                   CMDBYTE^=CD1RTR&/* NOT RTR COMMAND AND...        */
*                   RHLCB->TRHER=OFF THEN/* REQUEST IS ASKING FOR  0563
*                                      DEFINITE RESPONSE             */
         CLI   CMDBYTE,X'83'                                       0563
         BE    @RF00563                                            0563
         CLI   CMDBYTE,X'05'                                       0563
         BE    @RF00563                                            0563
         TM    TRHER(RHLCB),B'00010000'                            0563
         BNZ   @RF00563                                            0563
*                 DO;               /* YES                           */
*                   CALL ALLOCBUF;  /* ALLOCATE A BUFFER UNIT        */
         BAL   @14,ALLOCBUF                                        0565
*                   EXCPRSP=OFF;    /* INDICATE A POSITIVE RESPONSE
*                                      IS TO BE SENT                 */
         NI    EXCPRSP,B'01111111'                                 0566
*                   CALL SENDRESP;  /* SEND A POSITIVE RESPONSE      */
         BAL   @14,SENDRESP                                        0567
*                 END;                                             0568
*             END;                                                 0569
@RF00563 DS    0H                                                  0570
*         END;                                                     0570
@RC00556 DS    0H                                                  0571
*     END;                                                         0571
*                                                                  0571
@RF00551 DS    0H                                                  0572
*/*                                                                  */
*                                                                  0572
*   IF LCBCANXT=ON THEN             /* RESPONSE OWED TO CANCEL       */
@RF00547 TM    LCBCANXT(IEDQLPTR),B'10000000'                      0572
         BNO   @RF00572                                            0572
*     DO;                           /* YES                           */
*       LCBCANXT=OFF;               /* INDICATE RSP SENT TO CANCEL   */
         NI    LCBCANXT(IEDQLPTR),B'01111111'                      0574
*       LCBRSRH=OFF;                /* INDICATE +RSP (FOR ERRORMSG)
*                                                            @YM07705*/
         NI    LCBRSRH(IEDQLPTR),B'10111111'                       0575
*       LCBTHSQ=LCBCANTH;           /* CANCEL SEQUENCE NUMBER        */
         MVC   LCBTHSQ(2,IEDQLPTR),LCBCANTH(IEDQLPTR)              0576
*       LCBRHSV=CANCELRH;           /* CANCEL RH                     */
         MVC   LCBRHSV(3,IEDQLPTR),@CB01934                        0577
*       LCBDFCMD=CD1CANCL;          /* CANCEL COMMAND BYTE           */
         MVI   LCBDFCMD(IEDQLPTR),X'83'                            0578
*       LCBEXPI=OFF;                /* NORMAL FLOW                   */
         NI    LCBEXPI(IEDQLPTR),B'01111111'                       0579
*/*                                                                  */
*                                                                  0580
*       CALL ALLOCBUF;              /* GET BUF UNIT FOR RESPONSE     */
         BAL   @14,ALLOCBUF                                        0580
*       EXCPRSP=OFF;                /* INDICATE POSITIVE RESPONSE IS
*                                      TO BE SENT                    */
         NI    EXCPRSP,B'01111111'                                 0581
*       CALL SENDRESP;              /* SEND A POS. RESPONSE TO CANCEL*/
         BAL   @14,SENDRESP                                        0582
*     END;                                                         0583
*                                                                  0583
*/*                                                                  */
*                                                                  0584
*   R14=LCBQCBA;                    /* RESTORE RETURN ADDRESS        */
@RF00572 L     R14,LCBQCBA-1(,IEDQLPTR)                            0584
         LA    R14,0(,R14)                                         0584
*   RETURN;                                                        0585
@EL00004 DS    0H                                                  0585
@EF00004 DS    0H                                                  0585
@ER00004 BR    @14                                                 0585
*   END DEFAULT;                                                   0586
*                                                                  0587
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE HANDLES PROCESSING FOR IEDRESP MACRO ISSUED IN      */
*/* INMSG SUBGROUP.                                                  */
*/*                                                                  */
*/********************************************************************/
*                                                                  0587
*INMSG:                                                            0587
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0587
INMSG    DS    0H                                                  0588
*   LCBQCBA=R14;                    /* SAVE RETURN ADDRESS           */
         STCM  R14,7,LCBQCBA(IEDQLPTR)                             0588
*/*                                                                  */
*                                                                  0589
*   IF LCBFLAG1=0&                  /* PLCB AND...                   */
*       LCBLUNIT=ON THEN            /* SNA LOGICAL UNIT      @YM08571*/
         CLI   LCBFLAG1(IEDQLPTR),0                                0589
         BNE   @RF00589                                            0589
         TM    LCBLUNIT(IEDQLPTR),B'01000000'                      0589
         BNO   @RF00589                                            0589
*     DO;                           /*                       @YM08571*/
*       IF LCBRESP=ON THEN          /* RESPONSE STILL NEEDED @YM08571*/
         TM    LCBRESP(IEDQLPTR),B'00000001'                       0591
         BNO   @RF00591                                            0591
*         DO;                       /* YES                           */
*           IF LCBRSRH=OFF THEN     /* RSP NOT PREVIOUSLY GENERATED  */
         TM    LCBRSRH(IEDQLPTR),B'01000000'                       0593
         BNZ   @RF00593                                            0593
*             DO;                   /* YES                           */
*               RC=0;               /* INIT RETURN CODE TO ZERO      */
         SLR   @10,@10                                             0595
         ST    @10,RC                                              0595
*               CALL TESTCOND;      /* TEST TO SEE IF IEDRESP SHOULD
*                                      BE EXECUTED                   */
         BAL   @14,TESTCOND                                        0596
*               IF RC=0 THEN        /* IEDRESP SHOULD BE EXECUTED    */
         L     @10,RC                                              0597
         LTR   @10,@10                                             0597
         BNZ   @RF00597                                            0597
*                 DO;               /* YES                           */
*                   RHLCB=ADDR(LCBRHSV);/* ADDR OF RH OF REQUEST WE
*                                      ARE RESPONDING TO             */
         LA    RHLCB,LCBRHSV(,IEDQLPTR)                            0599
*/*                                                                  */
*                                                                  0600
*                   IF RHLCB->TRHDR1=ON×RHLCB->TRHDR2=ON THEN/*    0600
*                                      REQUEST ASKING FOR SOME     0600
*                                      RESPONSE                      */
         TM    TRHDR1(RHLCB),B'10100000'                           0600
         BZ    @RF00600                                            0600
*                     DO;           /* YES                           */
*                       IF RHLCB->TRHRUCAT=TRHDFC THEN/* DATA FLOW 0602
*                                      CTRL.                         */
         TM    TRHRUCAT(RHLCB),B'01000000'                         0602
         BNO   @RF00602                                            0602
         TM    TRHRUCAT(RHLCB),B'00100000'                         0602
         BNZ   @RF00602                                            0602
*                         CMDBYTE=LCBDFCMD;/* YES, SET DFC COMMAND   */
         MVC   CMDBYTE(1),LCBDFCMD(IEDQLPTR)                       0603
*                       ELSE        /* NOT DFC                       */
*                         CMDBYTE=0;/* SET COMMAND TO 0              */
         B     @RC00602                                            0604
@RF00602 MVI   CMDBYTE,X'00'                                       0604
*/*                                                                  */
*                                                                  0605
*                       IF PLSNSI=OFF THEN/* POSITIVE RESPONSE       */
@RC00602 TM    PLSNSI,B'00100000'                                  0605
         BNZ   @RF00605                                            0605
*                         DO;       /* YES                           */
*                           IF CMDBYTE^=CD1RTR&/* NOT RTR (WHEN QRS
*                                      IS ENTERED BEFORE THE 1ST   0607
*                                      MSGGEN MACRO IN INMSG IT IS 0607
*                                      NOT KNOWN WHETHER THE MSGGEN
*                                      WILL BE SENT. THEREFORE A   0607
*                                      POSITIVE RESPONSE TO RTR MUST
*                                      NOT BE SENT)                  */
*                               RHLCB->TRHER=OFF THEN/* REQUEST IS 0607
*                                      ASKING FOR POSITIVE RESPONSE  */
         CLI   CMDBYTE,X'05'                                       0607
         BE    @RF00607                                            0607
         TM    TRHER(RHLCB),B'00010000'                            0607
         BNZ   @RF00607                                            0607
*                             DO;   /* YES                           */
*                               IF CMDBYTE=CD1CANCL&/* CANCEL AND... */
*                                   LCBCANXT=ON THEN/* RESPONSE    0609
*                                      INFORMATION SET UP FOR CANCEL */
         CLI   CMDBYTE,X'83'                                       0609
         BNE   @RF00609                                            0609
         TM    LCBCANXT(IEDQLPTR),B'10000000'                      0609
         BNO   @RF00609                                            0609
*                                 DO;/* YES                          */
*                                   LCBCANXT=OFF;/* RESET RSP NEEDED */
         NI    LCBCANXT(IEDQLPTR),B'01111111'                      0611
*                                   LCBTHSQ=LCBCANTH;/* CANCEL SEQ # */
         MVC   LCBTHSQ(2,IEDQLPTR),LCBCANTH(IEDQLPTR)              0612
*                                   LCBRHSV=CANCELRH;/* CANCEL RH    */
         MVC   LCBRHSV(3,IEDQLPTR),@CB01934                        0613
*                                   LCBDFCMD=CD1CANCL;/* SET DFC   0614
*                                      COMMAND                       */
         MVI   LCBDFCMD(IEDQLPTR),X'83'                            0614
*                                   LCBEXPI=OFF;/* NORMAL FLOW       */
         NI    LCBEXPI(IEDQLPTR),B'01111111'                       0615
*                                 END;                             0616
*                                                                  0616
*/*                                                                  */
*                                                                  0617
*                               CALL ALLOCBUF;/* GET BUFFER UNIT FOR
*                                      RSP                           */
@RF00609 BAL   @14,ALLOCBUF                                        0617
*                               EXCPRSP=OFF;/* INDICATE POSITIVE RSP
*                                      IS TO BE SENT                 */
         NI    EXCPRSP,B'01111111'                                 0618
*                               CALL SENDRESP;/* SEND POSITIVE     0619
*                                      RESPONSE                      */
         BAL   @14,SENDRESP                                        0619
*                             END;                                 0620
*                         END;                                     0621
*                       ELSE        /* EXCEPTION RESPONSE            */
*                         DO;                                      0622
         B     @RC00605                                            0622
@RF00605 DS    0H                                                  0623
*                           CALL CKSNS;/* CHECK FOR VALID SENSE      */
         BAL   @14,CKSNS                                           0623
*                           IF RC=0 THEN/* SENSE VALID               */
         L     @10,RC                                              0624
         LTR   @10,@10                                             0624
         BNZ   @RF00624                                            0624
*                             DO;   /* YES                           */
*                               LCBRSRH=ON;/* INDICATE EXCEPTION   0626
*                                      RESPONSE (FOR ERRORMSG)     0626
*                                                            @YM07705*/
         OI    LCBRSRH(IEDQLPTR),B'01000000'                       0626
*                               CALL ALLOCBUF;/* GET A BUFFER UNIT   */
         BAL   @14,ALLOCBUF                                        0627
*                               EXCPRSP=ON;/* INDICATE AN EXCEPTION
*                                      RESPONSE IS TO BE SENT        */
         OI    EXCPRSP,B'10000000'                                 0628
*                               CALL SENDRESP;/* SEND A -RSP         */
         BAL   @14,SENDRESP                                        0629
*                             END;                                 0630
*                         END;                                     0631
*                     END;                                         0632
*                 END;                                             0633
*             END;                                                 0634
*           ELSE                    /* RESPONSE PREVIOUSLY GENERATED */
*             DO;                                                  0635
         B     @RC00593                                            0635
@RF00593 DS    0H                                                  0636
*               LCBRESP=OFF;        /* INDICATE RESPONSE SENT        */
         NI    LCBRESP(IEDQLPTR),B'11111110'                       0636
*               RHLCB=ADDR(LCBRHSV);/* ADDR OF RH OF REQUEST WE ARE
*                                      RESPONDING TO                 */
         LA    RHLCB,LCBRHSV(,IEDQLPTR)                            0637
*               IF RHLCB->TRHDR1=ON×RHLCB->TRHDR2=ON THEN/* REQUEST
*                                      ASKING FOR SOME RESPONSE    0638
*                                                            @OY20636*/
         TM    TRHDR1(RHLCB),B'10100000'                           0638
         BZ    @RF00638                                            0638
*                 DO;               /* YES                           */
*                   CALL ALLOCBUF;  /* GET A BUFFER UNIT             */
         BAL   @14,ALLOCBUF                                        0640
*                   EXCPRSP=ON;     /* INDICATE AN EXCEPTION RESPONSE
*                                      IS TO BE BUILT                */
         OI    EXCPRSP,B'10000000'                                 0641
*                   CALL SENDRESP;  /* SEND EXCEPTION RESPONSE       */
         BAL   @14,SENDRESP                                        0642
*                 END;                                             0643
*                                                                  0643
*/*                                                                  */
*                                                                  0644
*               IF LCBCANXT=ON THEN /* IS RESPONSE OWED TO CANCEL    */
@RF00638 TM    LCBCANXT(IEDQLPTR),B'10000000'                      0644
         BNO   @RF00644                                            0644
*                 DO;               /* YES                           */
*                   LCBCANXT=OFF;   /* RESET RESPONSE OWED TO CANCEL */
         NI    LCBCANXT(IEDQLPTR),B'01111111'                      0646
*                   LCBRSRH=OFF;    /* INDICATE +RSP(FOR ERRORMSG)   */
         NI    LCBRSRH(IEDQLPTR),B'10111111'                       0647
*                   LCBTHSQ=LCBCANTH;/* CANCEL SEQUENCE NUMBER       */
         MVC   LCBTHSQ(2,IEDQLPTR),LCBCANTH(IEDQLPTR)              0648
*                   LCBRHSV=CANCELRH;/* CANCEL REPSONSE RH           */
         MVC   LCBRHSV(3,IEDQLPTR),@CB01934                        0649
*                   LCBDFCMD=CD1CANCL;/* CANCEL COMMAND CODE         */
         MVI   LCBDFCMD(IEDQLPTR),X'83'                            0650
*                   LCBEXPI=OFF;    /* 'NORMAL' FLOW                 */
         NI    LCBEXPI(IEDQLPTR),B'01111111'                       0651
*                   CALL ALLOCBUF;  /* GET A BUFFER UNIT             */
         BAL   @14,ALLOCBUF                                        0652
*                   EXCPRSP=OFF;    /* INDICATE POSITIVE RESPONSE IS
*                                      TO BE BUILT                   */
         NI    EXCPRSP,B'01111111'                                 0653
*                   CALL SENDRESP;  /* SEND +RSP TO CANCEL           */
         BAL   @14,SENDRESP                                        0654
*                 END;                                             0655
*             END;                                                 0656
*         END;                                                     0657
*       ELSE                        /* RESPONSE TO FM DATA ALREADY 0658
*                                      SENT                  @YM08571*/
*         DO;                       /*                       @YM08571*/
         B     @RC00591                                            0658
@RF00591 DS    0H                                                  0659
*           IF LCBCANXT=ON THEN     /* IS RSP OWED TO CANCEL @YM08571*/
         TM    LCBCANXT(IEDQLPTR),B'10000000'                      0659
         BNO   @RF00659                                            0659
*             DO;                   /* YES                   @YM08571*/
*               LCBCANXT=OFF;       /* RESET RSP OWED TO CANCEL    0661
*                                                            @YM08571*/
         NI    LCBCANXT(IEDQLPTR),B'01111111'                      0661
*               LCBRSRH=OFF;        /* INDICATE +RSP(FOR ERRORMSG) 0662
*                                                            @YM08571*/
         NI    LCBRSRH(IEDQLPTR),B'10111111'                       0662
*               LCBTHSQ=LCBCANTH;   /* CANCEL SEQUENCE NUMBER      0663
*                                                            @YM08571*/
         MVC   LCBTHSQ(2,IEDQLPTR),LCBCANTH(IEDQLPTR)              0663
*               LCBRHSV=CANCELRH;   /* CANCEL REPSONSE RH    @YM08571*/
         MVC   LCBRHSV(3,IEDQLPTR),@CB01934                        0664
*               LCBDFCMD=CD1CANCL;  /* CANCEL COMMAND CODE   @YM08571*/
         MVI   LCBDFCMD(IEDQLPTR),X'83'                            0665
*               LCBEXPI=OFF;        /* 'NORMAL' FLOW         @YM08571*/
         NI    LCBEXPI(IEDQLPTR),B'01111111'                       0666
*               CALL ALLOCBUF;      /* GET A BUFFER UNIT     @YM08571*/
         BAL   @14,ALLOCBUF                                        0667
*               EXCPRSP=OFF;        /* INDICATE POSITIVE RESPONSE IS
*                                      TO BE BUILT           @YM08571*/
         NI    EXCPRSP,B'01111111'                                 0668
*               CALL SENDRESP;      /* SEND +RSP TO CANCEL   @YM08571*/
         BAL   @14,SENDRESP                                        0669
*             END;                  /*                       @YM08571*/
*         END;                      /*                       @YM08571*/
@RF00659 DS    0H                                                  0672
*     END;                          /*                       @YM08571*/
@RC00591 DS    0H                                                  0673
*/*                                                                  */
*                                                                  0673
*   R14=LCBQCBA;                    /* RESTORE RETURN ADDRESS        */
@RF00589 L     R14,LCBQCBA-1(,IEDQLPTR)                            0673
         LA    R14,0(,R14)                                         0673
*   RETURN;                                                        0674
@EL00005 DS    0H                                                  0674
@EF00005 DS    0H                                                  0674
@ER00005 BR    @14                                                 0674
*   END INMSG;                                                     0675
*                                                                  0676
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE GETS CONTROL ON ENTRY FOR IEDQA4 TO SEND PREVIOUSLY */
*/* GENERATED RESPONSES.                                             */
*/*                                                                  */
*/********************************************************************/
*                                                                  0676
*QA4ENTRY:                                                         0676
*   PROC OPTIONS(SAVE(R14));                                       0676
QA4ENTRY ST    @14,@SA00006                                        0676
*   RHLCB=ADDR(LCBRHSV);            /* ADDR OF RH OF REQUEST WE ARE
*                                      RESPONDING TO                 */
         LA    RHLCB,LCBRHSV(,IEDQLPTR)                            0677
*   IF RHLCB->TRHDR1=OFF&RHLCB->TRHDR2=OFF THEN/* REQUEST ASKING FOR
*                                      NO RESPONSE                   */
         TM    TRHDR1(RHLCB),B'10100000'                           0678
         BNZ   @RF00678                                            0678
*     LCBRESP=OFF;                  /* YES, INDICATE RSP NO LONGER 0679
*                                      NEEDED FOR THIS CHAIN         */
         NI    LCBRESP(IEDQLPTR),B'11111110'                       0679
*   ELSE                            /* RESPONSE IS REQUESTED         */
*     DO;                                                          0680
         B     @RC00678                                            0680
@RF00678 DS    0H                                                  0681
*       R0=1;                       /* ONE UNIT PER BUFFER           */
         LA    @10,1                                               0681
         LR    R0,@10                                              0681
*       RPARM=1;                    /* ONE BUFFER                    */
         LR    RPARM,@10                                           0682
*       CALL IEDQGA02;              /* TRY TO STEAL A BUFFER         */
         L     @15,AVTSTEAL(,IEDQAPTR)                             0683
         BALR  @14,@15                                             0683
*       IF R15^=0 THEN              /* SUCCESSFUL                    */
         LTR   R15,R15                                             0684
         BZ    @RF00684                                            0684
*         DO;                       /* YES                           */
*           RPRF=R15;               /* SET BUFFER ADDRESS            */
         LR    RPRF,R15                                            0686
*           EXCPRSP=ON;             /* INDICATE AN EXCEPTION RESPONSE
*                                      IS TO BE SENT                 */
         OI    EXCPRSP,B'10000000'                                 0687
*           CALL SENDRESP;          /* SEND A -RSP                   */
         BAL   @14,SENDRESP                                        0688
*         END;                                                     0689
*     END;                                                         0690
*   RETURN;                                                        0691
@EL00006 DS    0H                                                  0691
@EF00006 DS    0H                                                  0691
@ER00006 L     @14,@SA00006                                        0691
         BR    @14                                                 0691
*   END QA4ENTRY;                                                  0692
         B     @EL00006                                            0692
*                                                                  0693
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE DOES PROCESSING FOR IEDRESP MACRO ISSUED IN INHDR OR*/
*/* IN BUF SUBGOUPS.                                                 */
*/*                                                                  */
*/********************************************************************/
*                                                                  0693
*QUIENTRY:                                                         0693
*   PROC OPTIONS(SAVE(R14));                                       0693
QUIENTRY ST    @14,@SA00007                                        0693
*   IF LCBFLAG1=0&                  /* PLCB AND...                   */
*       LCBLUNIT=ON THEN            /* SNA LOGOCAL UNIT              */
         CLI   LCBFLAG1(IEDQLPTR),0                                0694
         BNE   @RF00694                                            0694
         TM    LCBLUNIT(IEDQLPTR),B'01000000'                      0694
         BNO   @RF00694                                            0694
*     DO;                           /* YES                           */
*       IF LCBRESP=ON&              /* RSP STILL NEEDED AND ...      */
*           LCBRSRH=OFF THEN        /* RSP NOT PREVIOUSLY GENERATED  */
         TM    LCBRESP(IEDQLPTR),B'00000001'                       0696
         BNO   @RF00696                                            0696
         TM    LCBRSRH(IEDQLPTR),B'01000000'                       0696
         BNZ   @RF00696                                            0696
*         DO;                       /* YES                           */
*           RC=0;                   /* INIT RETURN CODE TO ZERO      */
         SLR   @10,@10                                             0698
         ST    @10,RC                                              0698
*           CALL TESTCOND;          /* TEST CONDITIONAL EXECUTION    */
         BAL   @14,TESTCOND                                        0699
*           IF RC=0 THEN            /* SHOULD WE EXECUTE             */
         L     @10,RC                                              0700
         LTR   @10,@10                                             0700
         BNZ   @RF00700                                            0700
*             DO;                   /* YES                           */
*               RPRF=AVTADBUF;      /* BUFFER ADDRESS                */
         L     RPRF,AVTADBUF(,IEDQAPTR)                            0702
*               RHPRF1=ADDR(PRF1RH);/* RH ADDRESS                    */
         LR    RHPRF1,IEDQPPTR                                     0703
         SL    RHPRF1,@CF00044                                     0703
*               IF RHPRF1->TRHDR1=OFF&RHPRF1->TRHDR2=OFF THEN/*    0704
*                                      REQUEST ASKING FOR NO RESPONSE*/
         TM    TRHDR1(RHPRF1),B'10100000'                          0704
         BNZ   @RF00704                                            0704
*                 RC=CANTRESP;      /* YES, SET CAN'T RESPOND RET  0705
*                                      CODE                          */
         MVC   RC(4),@CF01939                                      0705
*               ELSE                /* REQUEST ASKING FOR A RESPONSE */
*                 DO;                                              0706
         B     @RC00704                                            0706
@RF00704 DS    0H                                                  0707
*                   IF RHPRF1->TRHRUCAT=TRHDFC THEN/* DATA FLOW    0707
*                                      CONTROL                       */
         TM    TRHRUCAT(RHPRF1),B'01000000'                        0707
         BNO   @RF00707                                            0707
         TM    TRHRUCAT(RHPRF1),B'00100000'                        0707
         BNZ   @RF00707                                            0707
*                     CMDBYTE=LCBDFCMD;/* YES, SET UP DFC COMMAND  0708
*                                      BYTE                          */
         MVC   CMDBYTE(1),LCBDFCMD(IEDQLPTR)                       0708
*                   ELSE            /* NOT DFC                       */
*                     CMDBYTE=0;    /* SET COMMAND BYTE TO ZERO      */
         B     @RC00707                                            0709
@RF00707 MVI   CMDBYTE,X'00'                                       0709
*/*                                                                  */
*                                                                  0710
*                   CALL CKSNS;     /* VALIDATE SENSE                */
@RC00707 BAL   @14,CKSNS                                           0710
*                   IF RC=0 THEN    /* SENSE O.K.                    */
         L     @10,RC                                              0711
         LTR   @10,@10                                             0711
         BNZ   @RF00711                                            0711
*                     CALL SETRINFO;/* GENERATE RESPONSE INFORMATION */
         BAL   @14,SETRINFO                                        0712
*                 END;                                             0713
*             END;                                                 0714
*         END;                                                     0715
*       ELSE                        /* RESPONSE ALREADY SENT OR    0716
*                                      GENERATED                     */
*         RC=RESPSENT;              /* SET RETURN CODE FOR RESPONSE
*                                      ALREADY SENT                  */
         B     @RC00696                                            0716
@RF00696 MVC   RC(4),@CF00174                                      0716
*     END;                                                         0717
*   ELSE                            /* NOT PLCB OR NOT SNA LU        */
*     RC=NOTSNALU;                  /* SET RETURN CODE               */
         B     @RC00694                                            0718
@RF00694 MVC   RC(4),@CF00075                                      0718
*/*                                                                  */
*                                                                  0719
*   RETURN;                                                        0719
@EL00007 DS    0H                                                  0719
@EF00007 DS    0H                                                  0719
@ER00007 L     @14,@SA00007                                        0719
         BR    @14                                                 0719
*   END QUIENTRY;                                                  0720
         B     @EL00007                                            0720
*                                                                  0721
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE BUILDS A RSP PIU AND POSTS IT TO IEDDFOUT(DATA FLOW */
*/* CONTROL OUTBOUND).                                               */
*/*     INPUT-                                                       */
*/*          EXCPRSP -  ON MEANS AN EXCEPTION RESPONSE IS TO BE BUILT*/
*/*                     OFF MEANS A POSITIVE RESPONSE IS TO BE BUILT */
*/*          LCB     -  ALL NECESSARY RESPONSE INFORMATION MUST BE   */
*/*                     SET UP IN LCB                                */
*/*          RPRF    -  MUST CONTAIN ADDRESS OF BUFFER UNIT INTO     */
*/*                     WHICH RESPONSE WILL BE BUILT                 */
*/*                                                                  */
*/********************************************************************/
*                                                                  0721
*SENDRESP:                                                         0721
*   PROC OPTIONS(SAVE(R14));                                       0721
SENDRESP ST    @14,@SA00008                                        0721
*   IEDPF2=''B;                     /* INIT PREFIX TO ZERO           */
         LR    @10,IEDQPPTR                                        0722
         SL    @10,@CF00044                                        0722
         XC    IEDPF2(8,@10),IEDPF2(@10)                           0722
*   PRF2TNTI=ON;                    /* INDICATE OAF AND DAF ARE TNT
*                                      OFFSETS                       */
         OI    PRF2TNTI(@10),B'10000000'                           0723
*   PRFPIUO=1;                      /* SET PIU OFFSET VALUE TO 1     */
         LA    @10,1                                               0724
         STC   @10,PRFPIUO(,IEDQPPTR)                              0724
*   PIUPTR=ADDR(PRFPIUO)+PRFPIUO;   /* PIU ADDRESSABILITY            */
         LA    PIUPTR,PRFPIUO(,IEDQPPTR)                           0725
         ALR   PIUPTR,@10                                          0725
*   IEDPIU=''B;                     /* INIT PIU TO ZERO              */
         XC    IEDPIU(13,PIUPTR),IEDPIU(PIUPTR)                    0726
*   TTHFTYPE=TTHFID1;               /* FID1 TH TYPE                  */
         NI    TTHFTYPE(PIUPTR),B'00011111'                        0727
         OI    TTHFTYPE(PIUPTR),B'00010000'                        0727
*   TTHBBIU=ON;                     /* BEGINNING OF BIU AND ...      */
*   TTHEBIU=ON;                     /* END OF BIU                    */
         OI    TTHBBIU(PIUPTR),B'00001100'                         0729
*   IF LCBEXPI=ON THEN              /* EXPIDITED FLOW                */
         TM    LCBEXPI(IEDQLPTR),B'10000000'                       0730
         BNO   @RF00730                                            0730
*     TTHEFI=ON;                    /* YES, MARK TH EXPIDITED        */
         OI    TTHEFI(PIUPTR),B'00000001'                          0731
*   TTHDAF=LCBTTCIN;                /* SET DESTINATION TNT OFFSET    */
@RF00730 LH    @10,LCBTTCIN(,IEDQLPTR)                             0732
         N     @10,@CF02057                                        0732
         STCM  @10,3,TTHDAF(PIUPTR)                                0732
*/*                                                                  */
*                                                                  0733
*   RPARM=LCBTTCIN;                 /* TNT OFFSET                    */
         LR    RPARM,@10                                           0733
*   CALL IEDQTNT;                   /* GET DESTINATION'S TERMINAL  0734
*                                      ENTRY                         */
         L     @15,AVTRNMPT(,IEDQAPTR)                             0734
         BALR  @14,@15                                             0734
*   RTRM=RPARM;                     /* TRM ADDRESSABILITY            */
         LR    RTRM,RPARM                                          0735
*   IF RLCB=SAVTSLCB THEN           /* SSCP FLOW             @YM08151*/
         L     @10,AVTSAVTP(,IEDQAPTR)                             0736
         C     RLCB,SAVTSLCB(,@10)                                 0736
         BNE   @RF00736                                            0736
*     TTHOAF=SAVTSCPT;              /* YES - SET OAF=SSCP    @YM08151*/
         MVC   TTHOAF(2,PIUPTR),SAVTSCPT(@10)                      0737
*   ELSE                            /* NOT SSCP FLOW         @YM08151*/
*     TTHOAF=SIBINDEX;              /* SET OAF TNT OFFSET FROM LU-LU
*                                      SIB                   @YM08151*/
         B     @RC00736                                            0738
@RF00736 LR    @10,IEDQTPTR                                        0738
         AL    @10,@CF02058                                        0738
         SLR   @07,@07                                             0738
         ICM   @07,7,TRMSIBPT-7(@10)                               0738
         MVC   TTHOAF(2,PIUPTR),SIBINDEX(@07)                      0738
*/*                                                                  */
*                                                                  0739
*   TTHSNF=LCBTHSQ;                 /* SET SEQUENCE NUMBER(OR EXP ID)*/
@RC00736 MVC   TTHSNF(2,PIUPTR),LCBTHSQ(IEDQLPTR)                  0739
*   IEDRH=LCBRHSV;                  /* THE REQUEST RH WHICH WE ARE 0740
*                                      RESPONDING TO                 */
         LA    @10,10                                              0740
         ALR   @10,PIUPTR                                          0740
         MVC   IEDRH(3,@10),LCBRHSV(IEDQLPTR)                      0740
*   TRHTYPE=ON;                     /* SET RESPONSE INDICATOR        */
*   TRHBC=ON;                       /* BEGIN CHAIN AND ...           */
*   TRHEC=ON;                       /* END CHAIN                     */
         OI    TRHTYPE(@10),B'10000011'                            0743
*/*                                                                  */
*                                                                  0744
*   CALL SETRUDCF;                  /* SET UP THE RU AND DATA COUNT
*                                      FIELD FOR BOTH POSITIVE AND 0744
*                                      EXCEPTION RESPONSES           */
         BAL   @14,SETRUDCF                                        0744
*   IF TRHRUCAT=TRHDFC&             /* DATA FLOW CONTROL AND...      */
*       LCBDFCMD=CD1RTR THEN        /* RTR COMMAND                   */
         TM    TRHRUCAT+10(PIUPTR),B'01000000'                     0745
         BNO   @RF00745                                            0745
         TM    TRHRUCAT+10(PIUPTR),B'00100000'                     0745
         BNZ   @RF00745                                            0745
         CLI   LCBDFCMD(IEDQLPTR),X'05'                            0745
         BNE   @RF00745                                            0745
*     LCBRTRRO=OFF;                 /* RESET RESPONSE OWED TO RTR SO
*                                      SCHEDULERS WON'T TRY TO SEND
*                                      ONE                           */
         NI    LCBRTRRO(IEDQLPTR),B'11111011'                      0746
*/*                                                                  */
*                                                                  0747
*   PRFPRI=PRIOUTBD;                /* POST PRIORITY                 */
@RF00745 MVI   PRFPRI(IEDQPPTR),X'E4'                              0747
*   PRFQCBA=SAVTDFCO;               /* IEDDFOUT'S QCB                */
         L     @10,AVTSAVTP(,IEDQAPTR)                             0748
         MVC   PRFQCBA(3,IEDQPPTR),SAVTDFCO+1(@10)                 0748
*   RDISP=AVTEA;                    /* DISPATCHER ADDRESS            */
         L     RDISP,AVTEA(,IEDQAPTR)                              0749
*   RPARM=RPRF;                     /* ADDR OF RESPONSE PIU BUFFER   */
         LR    RPARM,RPRF                                          0750
*   CALL DSPPOSTR;                  /* POST RSP TO IEDDFOUT QCB      */
         LA    @15,DSPPOSTR(,RDISP)                                0751
         BALR  @14,@15                                             0751
*   LCBRESP=OFF;                    /* INDICATE RESPONSE IS NO LONGER
*                                      NEEDED FOR THIS CHAIN         */
         NI    LCBRESP(IEDQLPTR),B'11111110'                       0752
*   RETURN;                                                        0753
@EL00008 DS    0H                                                  0753
@EF00008 DS    0H                                                  0753
@ER00008 L     @14,@SA00008                                        0753
         BR    @14                                                 0753
*   END SENDRESP;                                                  0754
*                                                                  0755
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE SETS UP THE RU AND THE DATA COUNT FIELD FOR         */
*/* RESPONSES.                                                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0755
*SETRUDCF:                                                         0755
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0755
SETRUDCF DS    0H                                                  0756
*   IF EXCPRSP=ON THEN              /* SHOULD EXCEPTION RESPONSE BE
*                                      BUILT                         */
         TM    EXCPRSP,B'10000000'                                 0756
         BNO   @RF00756                                            0756
*     DO;                           /* YES                           */
*       TRHSDI=ON;                  /* SET SENSE DATA INCLUDED       */
         LA    @10,10                                              0758
         LR    @07,PIUPTR                                          0758
         ALR   @07,@10                                             0758
         OI    TRHSDI(@07),B'00000100'                             0758
*       TRHER=ON;                   /* SET ERROR INDICATOR           */
         OI    TRHER(@07),B'00010000'                              0759
*       RU(1:4)=LCBLUSNS;           /* MOVE IN SENSE BYTES           */
         LA    @05,13                                              0760
         ALR   @05,PIUPTR                                          0760
         MVC   RU(4,@05),LCBLUSNS(IEDQLPTR)                        0760
*       IF RLCB=SAVTSLCB THEN       /* SSCP FLOW                     */
         L     @10,AVTSAVTP(,IEDQAPTR)                             0761
         C     RLCB,SAVTSLCB(,@10)                                 0761
         BNE   @RF00761                                            0761
*         DO;                       /* YES                           */
*           IF TRHRUCAT=TRHFMD THEN /* FM DATA                       */
         TM    TRHRUCAT(@07),B'01100000'                           0763
         BNZ   @RF00763                                            0763
*             DO;                   /* YES                           */
*               IF TRHFI=ON THEN    /* FORMATTED                     */
         TM    TRHFI(@07),B'00001000'                              0765
         BNO   @RF00765                                            0765
*                 DO;               /* YES                           */
*                   RU(5:7)=LCBSCPRS;/* MOVE 3 BYTE COMMAND INTO RU  */
         MVC   RU+4(3,@05),LCBSCPRS(IEDQLPTR)                      0767
*                   TTHDCF=10;      /* SET DATA COUNT                */
         LA    @10,10                                              0768
         STCM  @10,3,TTHDCF(PIUPTR)                                0768
*                 END;                                             0769
*               ELSE                /* NOT FORMATTED                 */
*                 TTHDCF=7;         /* SET DATA COUNT                */
         B     @RC00765                                            0770
@RF00765 MVC   TTHDCF(2,PIUPTR),@CH00581                           0770
*             END;                                                 0771
*           ELSE                    /* NOT FM DATA                   */
*             DO;                                                  0772
         B     @RC00763                                            0772
@RF00763 DS    0H                                                  0773
*               RU(5)=LCBDFCMD;     /* MOVE 1 BYTE COMMAND INTO RU   */
         MVC   RU+17(1,PIUPTR),LCBDFCMD(IEDQLPTR)                  0773
*               TTHDCF=8;           /* SET DATA COUNT                */
         MVC   TTHDCF(2,PIUPTR),@CH00044                           0774
*             END;                                                 0775
*         END;                                                     0776
*       ELSE                        /* NOT SSCP FLOW                 */
*         DO;                                                      0777
         B     @RC00761                                            0777
@RF00761 DS    0H                                                  0778
*           IF TRHRUCAT=TRHFMD THEN /* FM DATA                       */
         TM    TRHRUCAT+10(PIUPTR),B'01100000'                     0778
         BNZ   @RF00778                                            0778
*             TTHDCF=7;             /* SET DATA COUNT                */
         MVC   TTHDCF(2,PIUPTR),@CH00581                           0779
*           ELSE                    /* NOT FM DATA                   */
*             DO;                                                  0780
         B     @RC00778                                            0780
@RF00778 DS    0H                                                  0781
*               RU(5)=LCBDFCMD;     /* MOVE 1 BYTE COMMAND INTO RU   */
         MVC   RU+17(1,PIUPTR),LCBDFCMD(IEDQLPTR)                  0781
*               TTHDCF=8;           /* SET DATA COUNT FIELD          */
         MVC   TTHDCF(2,PIUPTR),@CH00044                           0782
*             END;                                                 0783
*         END;                                                     0784
*     END;                                                         0785
*   ELSE                            /* POSITIVE RESPONSE             */
*     DO;                                                          0786
         B     @RC00756                                            0786
@RF00756 DS    0H                                                  0787
*       TRHSDI=OFF;                 /* SENSE INCLUDED OFF            */
         LA    @10,10                                              0787
         ALR   @10,PIUPTR                                          0787
         NI    TRHSDI(@10),B'11111011'                             0787
*       TRHER=OFF;                  /* ERROR OFF                     */
         NI    TRHER(@10),B'11101111'                              0788
*       IF RLCB=SAVTSLCB THEN       /* SSCP FLOW                     */
         L     @07,AVTSAVTP(,IEDQAPTR)                             0789
         C     RLCB,SAVTSLCB(,@07)                                 0789
         BNE   @RF00789                                            0789
*         DO;                       /* YES                           */
*           IF TRHRUCAT=TRHFMD THEN /* FM DATA                       */
         TM    TRHRUCAT(@10),B'01100000'                           0791
         BNZ   @RF00791                                            0791
*             DO;                   /* YES                           */
*               IF TRHFI=ON THEN    /* FORMATTED                     */
         TM    TRHFI(@10),B'00001000'                              0793
         BNO   @RF00793                                            0793
*                 DO;               /* YES                           */
*                   RU(1:3)=LCBSCPRS;/* MOVE 3 BYTE COMMAND INTO RU  */
         MVC   RU+13(3,PIUPTR),LCBSCPRS(IEDQLPTR)                  0795
*                   TTHDCF=6;       /* SET DATA COUNT                */
         MVC   TTHDCF(2,PIUPTR),@CH00058                           0796
*                 END;                                             0797
*               ELSE                /* NOT FORMATTED                 */
*                 TTHDCF=3;         /* SET DATA COUNT                */
         B     @RC00793                                            0798
@RF00793 MVC   TTHDCF(2,PIUPTR),@CH00073                           0798
*             END;                                                 0799
*           ELSE                    /* NOT FM DATA                   */
*             DO;                                                  0800
         B     @RC00791                                            0800
@RF00791 DS    0H                                                  0801
*               RU(1)=LCBDFCMD;     /* MOVE 1 BYTE COMMAND INTO RU   */
         MVC   RU+13(1,PIUPTR),LCBDFCMD(IEDQLPTR)                  0801
*               TTHDCF=4;           /* SET DATA COUNT                */
         MVC   TTHDCF(2,PIUPTR),@CH00255                           0802
*             END;                                                 0803
*         END;                                                     0804
*       ELSE                        /* NOT SSCP FLOW                 */
*         DO;                                                      0805
         B     @RC00789                                            0805
@RF00789 DS    0H                                                  0806
*           IF TRHRUCAT=TRHFMD THEN /* FM DATA                       */
         TM    TRHRUCAT+10(PIUPTR),B'01100000'                     0806
         BNZ   @RF00806                                            0806
*             TTHDCF=3;             /* SET DATA COUNT                */
         MVC   TTHDCF(2,PIUPTR),@CH00073                           0807
*           ELSE                    /* NOT FM DATA                   */
*             DO;                                                  0808
         B     @RC00806                                            0808
@RF00806 DS    0H                                                  0809
*               RU(1)=LCBDFCMD;     /* MOVE 1 BYTE COMMAND INTO RU   */
         MVC   RU+13(1,PIUPTR),LCBDFCMD(IEDQLPTR)                  0809
*               TTHDCF=4;           /* SET DATA COUNT                */
         MVC   TTHDCF(2,PIUPTR),@CH00255                           0810
*             END;                                                 0811
*         END;                                                     0812
*     END;                                                         0813
*   RETURN;                                                        0814
@EL00009 DS    0H                                                  0814
@EF00009 DS    0H                                                  0814
@ER00009 BR    @14                                                 0814
*   END SETRUDCF;                                                  0815
         B     @EL00009                                            0815
*                                                                  0816
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE SETS UP SOME INFORMATION FOR GENERATING A RESPONSE. */
*/*                                                                  */
*/********************************************************************/
*                                                                  0816
*SETRINFO:                                                         0816
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0816
SETRINFO DS    0H                                                  0817
*   LCBRHSV=PRF1RH;                 /* SAVE RH OF REQUEST WHICH IS TO
*                                      BE RESPONDED TO               */
         LR    @10,IEDQPPTR                                        0817
         SL    @10,@CF00044                                        0817
         MVC   LCBRHSV(3,IEDQLPTR),PRF1RH(@10)                     0817
*   LCBRSRH=ON;                     /* SET FLAG WHICH SAYS RESPONSE
*                                      IS GENERATED                  */
         OI    LCBRSRH(IEDQLPTR),B'01000000'                       0818
*   LCBTHSQ=PRF1SQID;               /* SAVE SEQUENCE # OF REQUEST  0819
*                                      WHICH IS BEING RESPONDED TO   */
         LH    @07,PRF1SQID(,@10)                                  0819
         N     @07,@CF02057                                        0819
         STH   @07,LCBTHSQ(,IEDQLPTR)                              0819
*   IF PRF1EXPI=ON THEN             /* EXPIDITED                     */
         TM    PRF1EXPI(@10),B'01000000'                           0820
         BNO   @RF00820                                            0820
*     LCBEXPI=ON;                   /* YES, SET EXP INDICATOR        */
         OI    LCBEXPI(IEDQLPTR),B'10000000'                       0821
*   RETURN;                                                        0822
@EL00010 DS    0H                                                  0822
@EF00010 DS    0H                                                  0822
@ER00010 BR    @14                                                 0822
*   END SETRINFO;                                                  0823
         B     @EL00010                                            0823
*                                                                  0824
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE VALIDATES THE SENSE BYTES(IN LCBLUSNS).             */
*/*    INPUT:                                                        */
*/*         CMDBYTE - CONTAINS THE DATA FLOW CONTROL COMMAND OR 0(FOR*/
*/*                   FM DATA)                                       */
*/*         LCBLUSNS- CONTAINS THE 4 BYTES OF SNA SENSE              */
*/*                                                                  */
*/********************************************************************/
*                                                                  0824
*SNSER:                                                            0824
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0824
SNSER    DS    0H                                                  0825
*   IF CMDBYTE=CD1CANCL THEN        /* CANCEL COMMAND                */
         CLI   CMDBYTE,X'83'                                       0825
         BNE   @RF00825                                            0825
*     RC=CANTRESP;                  /* SET 'NOT ALLOWED TO RESPOND'
*                                      CODE                          */
         MVC   RC(4),@CF01939                                      0826
*   ELSE                            /* NOT CANCEL                    */
*     DO;                                                          0827
         B     @RC00825                                            0827
@RF00825 DS    0H                                                  0828
*       SNSPTR=ADDR(LCBLUSNS);      /* ADDRESS OF SENSE              */
         LA    SNSPTR,LCBLUSNS(,IEDQLPTR)                          0828
*       R2=ADDR(SNSCODES);          /* ADDR OF ALLOWABLE MAJOR SENSE
*                                      CODES                         */
         LA    R2,SNSCODES                                         0829
*       FOUNDSW=OFF;                /* INIT FOUND SWITCH TO OFF      */
         NI    FOUNDSW,B'10111111'                                 0830
*       DO WHILE(R2->BIT8^='FF'X&   /* NOT END OF TABLE AND...       */
*             FOUNDSW=OFF);         /* MAJOR SENSE CODE NOT FOUND YET*/
         B     @DE00831                                            0831
@DL00831 DS    0H                                                  0832
*         IF R2->BIT8=SNSMAJ THEN   /* SENSE CODE FOUND IN TABLE     */
         CLC   BIT8(1,R2),SNSMAJ(SNSPTR)                           0832
         BNE   @RF00832                                            0832
*           FOUNDSW=ON;             /* YES, SET FOUND SWITCH         */
         OI    FOUNDSW,B'01000000'                                 0833
*         ELSE                      /* NOT FOUND                     */
*           R2=R2+1;                /* INCREMENT TO NEXT TABLE ENTRY */
         B     @RC00832                                            0834
@RF00832 AL    R2,@CF00060                                         0834
*       END;                                                       0835
*                                                                  0835
@RC00832 DS    0H                                                  0835
@DE00831 CLI   BIT8(R2),X'FF'                                      0835
         BE    @DC00831                                            0835
         TM    FOUNDSW,B'01000000'                                 0835
         BZ    @DL00831                                            0835
@DC00831 DS    0H                                                  0836
*/*                                                                  */
*                                                                  0836
*       IF FOUNDSW=OFF THEN         /* MAJOR SENSE CODE FOUND IN   0836
*                                      TABLE                         */
         TM    FOUNDSW,B'01000000'                                 0836
         BNZ   @RF00836                                            0836
*         RC=INVLRESP;              /* NO, SET 'INVALID SENSE' CODE  */
         MVC   RC(4),@CF00244                                      0837
*     END;                                                         0838
*   RETURN;                                                        0839
@EL00011 DS    0H                                                  0839
@EF00011 DS    0H                                                  0839
@ER00011 BR    @14                                                 0839
*   END SNSER;                                                     0840
         B     @EL00011                                            0840
*                                                                  0841
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE TEST FOR CONDITIONAL EXECUTION.  THE 'COUNT='       */
*/* OPERAND ON THE IEDRESP MACRO IS USED TO CONTROL EXECUTION.       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0841
*TESTCOND:                                                         0841
*   PROC OPTIONS(SAVE(R14));                                       0841
TESTCOND ST    @14,@SA00012                                        0841
*   RPARM=PARM;                     /* ADDR OF PARM LIST             */
         L     RPARM,PARM                                          0842
*   IF PLMASKI=ON THEN              /* MASK PRESENT                  */
         TM    PLMASKI(RPARM),B'00000001'                          0843
         BNO   @RF00843                                            0843
*     RPARM=RPARM-4;                /* NO, ADJUST PARM LIST PTR      */
         SL    RPARM,@CF00255                                      0844
*   PARMFLAG=PLFLAGS;               /* GET FLAG BYTE                 */
@RF00843 MVC   PARMFLAG(1),PLFLAGS(RPARM)                          0845
*   IF PLCOUNT=ON THEN              /* 'COUNT=' SPECIFIED            */
         TM    PLCOUNT,B'10000000'                                 0846
         BNO   @RF00846                                            0846
*     DO;                           /* YES                           */
*       R2=RPARM;                   /* SAVE PARMLIST POINTER         */
         LR    R2,RPARM                                            0848
*       RPARM=LCBTTCIN;             /* TNT OFFSET                    */
         LH    RPARM,LCBTTCIN(,IEDQLPTR)                           0849
         N     RPARM,@CF02057                                      0849
*       CALL IEDQTNT;               /* GET TERMINAL ENTRY            */
         L     @15,AVTRNMPT(,IEDQAPTR)                             0850
         BALR  @14,@15                                             0850
*       RTRM=RPARM;                 /* SET TRM ADDRESSABILITY        */
         LR    RTRM,RPARM                                          0851
*       RPARM=R2;                   /* RESTORE PARMLIST POINTER      */
         LR    RPARM,R2                                            0852
*/*                                                                  */
*                                                                  0853
*       STM(R0,RBASE,SAVEREGS);     /* SAVE REGS                     */
         STM   R0,RBASE,SAVEREGS                                   0853
*       R2=ADDR(PLQBJPL);           /* IEDQBJ'S PARM LIST ADDR       */
         LA    R2,PLQBJPL(,RPARM)                                  0854
*       R15=(AVTMSGS+PLQBJNDX)->PTR31;/* ADDRESS OF IEDQBJ           */
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0855
         LA    @10,0(,@10)                                         0855
         SLR   @07,@07                                             0855
         IC    @07,PLQBJNDX(,RPARM)                                0855
         ALR   @10,@07                                             0855
         L     R15,PTR31(,@10)                                     0855
*       RPARM=RTRM;                 /* TERMINAL ENTRY                */
         LR    RPARM,RTRM                                          0856
*       GEN(BALR  R14,R15);         /* BALR TO IEDQBJ TO CHECK FOR 0857
*                                      CONDITIONAL EXECUTION         */
         BALR  R14,R15
*       RC=R15;                     /* SET RETURN CODE... POSSIBLE 0858
*                                      RETURN CODES ARE: 0-MEANS   0858
*                                      EXECUTE, 4-MEANS DO NOT     0858
*                                      EXECUTE, 8-MEANS OPTION FIELD
*                                      NOT FOUND                     */
         ST    R15,RC                                              0858
*       LM(R0,RBASE,SAVEREGS);      /* RESTORE REGS                  */
         LM    R0,RBASE,SAVEREGS                                   0859
*     END;                                                         0860
*   RETURN;                                                        0861
@EL00012 DS    0H                                                  0861
@EF00012 DS    0H                                                  0861
@ER00012 L     @14,@SA00012                                        0861
         BR    @14                                                 0861
*   END TESTCOND;                                                  0862
         B     @EL00012                                            0862
*   END IEDQRS                                                     0863
*                                                                  0863
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */
*/*%INCLUDE SYSLIB  (TRHD    )                                       */
*/*%INCLUDE SYSLIB  (TSCBD   )                                       */
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */
*/*%INCLUDE SYSLIB  (TSNSD   )                                       */
*/*%INCLUDE SYSLIB  (TTHD    )                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*                                                                  0863
*       ;                                                          0863
@DATA    DS    0H
@CH00073 DC    H'3'
@CH00058 DC    H'6'
@CH00581 DC    H'7'
         DS    0F
@SA00006 DS    1F
@SA00007 DS    1F
@SA00003 DS    1F
@SA00008 DS    1F
@SA00012 DS    1F
         DS    0F
@CF00060 DC    F'1'
@CF00255 DC    F'4'
@CH00255 EQU   @CF00255+2
@CF00044 DC    F'8'
@CH00044 EQU   @CF00044+2
@CF00244 DC    F'12'
@CF00174 DC    F'16'
@CF01939 DC    F'20'
@CF00075 DC    F'24'
@CF02040 DC    F'76'
@CF02058 DC    F'-7'
@CF02057 DC    XL4'0000FFFF'
         DS    0D
RC       DS    F
PARM     DS    A
SAVE13   DS    A
@CB01934 DC    X'CB8000'
FLGBYTE1 DS    BL1
         ORG   FLGBYTE1
EXCPRSP  DS    BL1
FOUNDSW  EQU   FLGBYTE1+0
@NM00182 EQU   FLGBYTE1+0
         ORG   FLGBYTE1+1
CMDBYTE  DS    CL1
PARMFLAG DS    BL1
         ORG   PARMFLAG
PLCOUNT  DS    BL1
@NM00183 EQU   PARMFLAG+0
PLSNSI   EQU   PARMFLAG+0
@NM00184 EQU   PARMFLAG+0
         ORG   PARMFLAG+1
QAEPL    DS    CL3
         ORG   QAEPL
@NM00185 DC    X'FF04'
QAEOPNO  DS    CL1
         ORG   QAEPL+3
         DS    CL3
SAVEREGS DS    CL72
SNSCODES DS    CL6
         ORG   SNSCODES
@NM00186 DC    X'40'
@NM00187 DC    X'20'
@NM00188 DC    X'10'
@NM00189 DC    X'08'
@NM00190 DC    X'00'
@NM00191 DC    X'FF'
         ORG   SNSCODES+6
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RHPRF1   EQU   @03
RHLCB    EQU   @03
PIUPTR   EQU   @03
SNSPTR   EQU   @03
IEDQAPTR EQU   @13
RDISP    EQU   @11
IEDQLPTR EQU   @04
LCBXPTR  EQU   @05
IEDQPPTR EQU   @06
IEDQTPTR EQU   @08
R0       EQU   @00
RPARM    EQU   @01
R2       EQU   @02
RLCB     EQU   @04
RPRF     EQU   @06
R8       EQU   @08
RTRM     EQU   @08
R9       EQU   @09
RBASE    EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
R10      EQU   @10
R3       EQU   @03
R5       EQU   @05
R7       EQU   @07
IEDQAVTD EQU   0
AVTSAVE4 EQU   IEDQAVTD+144
AVTSAVEX EQU   IEDQAVTD+216
AVTREADD EQU   IEDQAVTD+308
AVTBUFSW EQU   IEDQAVTD+312
@NM00004 EQU   IEDQAVTD+316
AVTCKFLG EQU   @NM00004
AVTBASE  EQU   IEDQAVTD+340
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+352
AVTOSECB EQU   IEDQAVTD+420
AVTECB1  EQU   AVTOSECB
AVTUI    EQU   IEDQAVTD+448
AVTHG02  EQU   IEDQAVTD+456
AVTEA    EQU   IEDQAVTD+476
AVTDISP  EQU   IEDQAVTD+480
AVTHD    EQU   IEDQAVTD+484
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+540
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+580
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+608
AVTCKBYT EQU   IEDQAVTD+619
AVTHG01  EQU   IEDQAVTD+620
AVTCKLNK EQU   IEDQAVTD+624
AVTCRELE EQU   IEDQAVTD+636
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+644
AVTADBUF EQU   IEDQAVTD+648
AVTSYSER EQU   IEDQAVTD+656
AVTMSGS  EQU   IEDQAVTD+657
AVTBFREB EQU   IEDQAVTD+708
AVTBFRFG EQU   IEDQAVTD+712
AVTCKPQB EQU   IEDQAVTD+732
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+744
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+756
AVTCWFL1 EQU   IEDQAVTD+852
AVTCWFL2 EQU   IEDQAVTD+853
AVTSUBT  EQU   IEDQAVTD+876
AVTIOTR  EQU   IEDQAVTD+877
AVTBIT1  EQU   IEDQAVTD+978
AVTBIT2  EQU   IEDQAVTD+979
AVTBIT3  EQU   IEDQAVTD+980
AVTSTEAL EQU   IEDQAVTD+988
AVTBIT4  EQU   IEDQAVTD+1064
@NM00086 EQU   IEDQAVTD+1160
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTLUSQ EQU   IEDNSVTD+88
SAVTSLCB EQU   IEDNSVTD+104
SAVTDFCO EQU   IEDNSVTD+200
SAVTTCPU EQU   IEDNSVTD+238
SAVTSCPT EQU   SAVTTCPU
SAVTZELM EQU   IEDNSVTD+270
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
IEDQDISP EQU   0
DSPCHAIN EQU   12
DSPPOSTR EQU   28
IEDQLCB  EQU   0
LCBRCB   EQU   IEDQLCB
LCBQCBA  EQU   LCBRCB+1
LCBLINK  EQU   LCBRCB+5
LCBTSOB  EQU   IEDQLCB+19
LCBCHAIN EQU   IEDQLCB+20
LCBSCRNN EQU   LCBCHAIN
LCBTETEN EQU   LCBCHAIN
LCBINSRC EQU   IEDQLCB+21
LCBLKMDE EQU   LCBINSRC+2
LCBNTXT  EQU   IEDQLCB+24
LCBSTAT4 EQU   LCBNTXT
LCBPHASE EQU   LCBSTAT4
LCBSCBDA EQU   IEDQLCB+25
LCBMHA   EQU   IEDQLCB+29
LCBFLAG1 EQU   IEDQLCB+32
LCBIOBSN EQU   IEDQLCB+33
LCBSNS   EQU   LCBIOBSN+1
LCBSENS0 EQU   LCBSNS
LCBLOSDT EQU   LCBSENS0
LCBTMOUT EQU   LCBSENS0
LCBFLAG3 EQU   LCBIOBSN+7
LCBCSW   EQU   LCBIOBSN+8
LCBCSWST EQU   LCBCSW+3
LCBCSWUS EQU   LCBCSWST
LCBCSWCS EQU   LCBCSWST+1
LCBSIOCC EQU   LCBIOBSN+15
LCBDCBPT EQU   IEDQLCB+52
LCBRCQCB EQU   IEDQLCB+56
LCBRESTR EQU   LCBRCQCB
LCBTHSQ  EQU   IEDQLCB+60
LCBINCAM EQU   LCBTHSQ
LCBERRCT EQU   IEDQLCB+62
LCBLSPCI EQU   IEDQLCB+65
LCBRCBFR EQU   LCBLSPCI
LCBSTATE EQU   IEDQLCB+70
LCBSTAT1 EQU   LCBSTATE
LCBSTAT2 EQU   LCBSTATE+1
LCBBEOTN EQU   LCBSTAT2
LCBSYNC  EQU   LCBSTAT2
LCBDIAL  EQU   LCBSTAT2
LCBRESP  EQU   LCBSTAT2
LCBTSTSW EQU   IEDQLCB+72
LCBERB   EQU   IEDQLCB+76
LCBERBQB EQU   LCBERB+1
LCBERBPY EQU   IEDQLCB+80
LCBERBLK EQU   IEDQLCB+81
LCBERBST EQU   IEDQLCB+84
LCBPRCPG EQU   LCBERBST
LCBDLNKN EQU   LCBERBST
LCBERBCH EQU   IEDQLCB+85
LCBERBCT EQU   IEDQLCB+88
LCBRBCT1 EQU   LCBERBCT
LCBRBCT2 EQU   LCBERBCT+1
LCBTTCIN EQU   IEDQLCB+90
LCBMSGFM EQU   IEDQLCB+92
LCBSCBA  EQU   IEDQLCB+93
LCBOBRCH EQU   IEDQLCB+96
LCBINVPT EQU   LCBOBRCH+1
LCBBFRW  EQU   LCBINVPT
LCBTPCD  EQU   IEDQLCB+100
LCBSTAT5 EQU   LCBTPCD
LCBLUNIT EQU   LCBSTAT5
LCBSTAT6 EQU   LCBTPCD+4
LCBRTRRO EQU   LCBSTAT6
LCBRSPSV EQU   LCBTPCD+8
LCBSAVSN EQU   IEDQLCB+112
LCBERCCW EQU   IEDQLCB+120
LCBCPA   EQU   IEDQLCB+144
LCBCCW5  EQU   LCBCPA+32
LCBATTEL EQU   LCBCCW5
LCBQEBPL EQU   LCBATTEL
IEDQLCBX EQU   0
LCBXCON  EQU   IEDQLCBX
LCBXFLAG EQU   LCBXCON
LCBXDCT  EQU   LCBXCON+1
LCBXRADR EQU   LCBXCON+4
IEDPIU   EQU   0
PIUTH    EQU   IEDPIU
PIURH    EQU   IEDPIU+10
PIURU    EQU   IEDPIU+13
IEDQPRF  EQU   0
PRFRCB   EQU   IEDQPRF
PRFKEY   EQU   PRFRCB
PRFQCBA  EQU   PRFRCB+1
PRFPRI   EQU   PRFRCB+4
PRFLINK  EQU   PRFRCB+5
PRFTIC   EQU   IEDQPRF+8
PRFTICC  EQU   PRFTIC
PRFNBUNT EQU   IEDQPRF+12
PRFSUNIT EQU   PRFNBUNT
PRFPLQCB EQU   PRFSUNIT
PRFPIUO  EQU   PRFPLQCB
@NM00153 EQU   IEDQPRF+16
PRFSVFFO EQU   @NM00153
PRFSTAT1 EQU   IEDQPRF+20
PRFEOFN  EQU   PRFSTAT1
PRFCORE  EQU   IEDQPRF+21
PRFXTRA  EQU   PRFCORE
PRFSCAN  EQU   IEDQPRF+24
PRFTQBCK EQU   IEDQPRF+26
PRFNTXT  EQU   PRFTQBCK
PRFEOBOF EQU   PRFNTXT
PRFCHDR  EQU   IEDQPRF+32
PRFHQBCK EQU   IEDQPRF+35
IEDPF1   EQU   0
PRF1RH   EQU   IEDPF1
PRF1FLG1 EQU   IEDPF1+3
PRF1EXPI EQU   PRF1FLG1
PRF1WD2  EQU   IEDPF1+4
PRF1SEQP EQU   PRF1WD2
PRF1SQID EQU   PRF1SEQP
PRF1TAG1 EQU   PRF1SQID
IEDPF2   EQU   0
PRF2FLG2 EQU   IEDPF2
PRF2TNTI EQU   PRF2FLG2
PRF2WD2  EQU   IEDPF2+4
IEDRH    EQU   0
TRHBYTE0 EQU   IEDRH
TRHTYPE  EQU   TRHBYTE0
TRHRUCAT EQU   TRHBYTE0
TRHFI    EQU   TRHBYTE0
TRHSDI   EQU   TRHBYTE0
TRHBC    EQU   TRHBYTE0
TRHEC    EQU   TRHBYTE0
TRHBYTE1 EQU   IEDRH+1
TRHDR1   EQU   TRHBYTE1
TRHDR2   EQU   TRHBYTE1
TRHER    EQU   TRHBYTE1
TRHBYTE2 EQU   IEDRH+2
IEDQSCB  EQU   0
SCBSTATE EQU   IEDQSCB
SCBSEQIN EQU   SCBSTATE
SCBRCVCT EQU   IEDQSCB+4
SCBMBHEN EQU   IEDQSCB+5
SCBBKFCT EQU   IEDQSCB+9
SCBEOBSZ EQU   SCBBKFCT+1
SCBSALEV EQU   IEDQSCB+12
SCBQTYPE EQU   SCBSALEV
SCBERRST EQU   IEDQSCB+16
SCBERR1  EQU   SCBERRST
SCBHDRRN EQU   SCBERR1
SCBORIGN EQU   SCBERR1
SCBNOTRM EQU   SCBERR1
SCBSEQHN EQU   SCBERR1
SCBSEQLN EQU   SCBERR1
SCBCUTFN EQU   SCBERR1
SCBERR2  EQU   SCBERRST+1
SCBABRTN EQU   SCBERR2
SCBERR3  EQU   SCBERRST+2
SCBLOSTN EQU   SCBERR3
SCBTMIDN EQU   SCBERR3
SCBFORMN EQU   SCBERR3
SCBATTN  EQU   SCBERR3
SCBXCEPN EQU   SCBERR3
SCBERR4  EQU   SCBERRST+3
SCBTXTTN EQU   SCBERR4
SCBCTLUN EQU   SCBERR4
SCBCHANN EQU   SCBERR4
SCBDLPTR EQU   IEDQSCB+22
SCBEOBAC EQU   SCBDLPTR
SCBCTBAC EQU   SCBEOBAC
SCBBSCFM EQU   IEDQSCB+24
SCBDATEN EQU   SCBBSCFM
SCBITBSZ EQU   IEDQSCB+40
SCBCTBSV EQU   SCBITBSZ
SCBDNSEG EQU   IEDQSCB+41
SCBCLSEG EQU   IEDQSCB+45
SCBITBAC EQU   IEDQSCB+48
SCBCTBFL EQU   SCBITBAC
SCBBLKCT EQU   SCBCTBFL
SCBDCSEG EQU   IEDQSCB+49
SCBSTAT1 EQU   IEDQSCB+60
SCBCORE  EQU   IEDQSCB+61
SCBSCAN  EQU   IEDQSCB+64
SCBNTXT  EQU   IEDQSCB+66
SCBCHDR  EQU   IEDQSCB+72
SCBCCSEG EQU   IEDQSCB+75
SCBEND   EQU   IEDQSCB+84
IEDSIBD  EQU   0
SIBINDEX EQU   IEDSIBD+8
SIBSESSN EQU   IEDSIBD+10
SIBPACIN EQU   IEDSIBD+11
SIBSEQN  EQU   IEDSIBD+12
SIBSTAT1 EQU   IEDSIBD+16
SIBSTAT2 EQU   IEDSIBD+17
SIBBIND  EQU   IEDSIBD+20
SIBBIND1 EQU   SIBBIND
SIBBIND2 EQU   SIBBIND+1
SIBBIND3 EQU   SIBBIND+2
SIBSTAT0 EQU   IEDSIBD+23
IEDSNSD  EQU   0
SNSSYSTM EQU   IEDSNSD
SNSMAJ   EQU   SNSSYSTM
SNSUSER  EQU   IEDSNSD+2
IEDTH    EQU   0
TTHBYTE0 EQU   IEDTH
TTHFTYPE EQU   TTHBYTE0
TTHBBIU  EQU   TTHBYTE0
TTHEBIU  EQU   TTHBYTE0
TTHEFI   EQU   TTHBYTE0
TTHDAF   EQU   IEDTH+2
TTHOAF   EQU   IEDTH+4
TTHSNF   EQU   IEDTH+6
TTHTAG   EQU   TTHSNF
TTHTAG1  EQU   TTHTAG
TTHDCF   EQU   IEDTH+8
IEDQTRM  EQU   0
TRMSTATE EQU   IEDQTRM
TRMLOG   EQU   TRMSTATE
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMALTD  EQU   IEDQTRM+8
TRMDEVFL EQU   IEDQTRM+10
TRMSTAT  EQU   IEDQTRM+12
IEDNTRM  EQU   0
TRMBYTE4 EQU   IEDNTRM
TRMBYTE3 EQU   IEDNTRM+1
TRMBYTE2 EQU   IEDNTRM+2
TRMINPG  EQU   TRMBYTE2
TRMBYTE1 EQU   IEDNTRM+3
TRMSCPRQ EQU   TRMBYTE1
TRMBYTE0 EQU   IEDNTRM+6
TRMSIBPT EQU   IEDNTRM+7
IEDQTNT  EQU   0
IEDQGA02 EQU   0
IEDQBD   EQU   0
RU       EQU   0
PL       EQU   0
PLINDEX1 EQU   PL
PLMASKI  EQU   PLINDEX1
PLQAENDX EQU   PL+8
PLFLAGS  EQU   PL+9
PLOPNO   EQU   PL+10
PLQBJPL  EQU   PL+12
PLQBJNDX EQU   PLQBJPL
PLSNS    EQU   PL+20
CHAR4    EQU   0
PTR31    EQU   0
BIT8     EQU   0
CHAR2    EQU   0
DSPBYPAS EQU   20
DSPDISP  EQU   4
DSPLIFO  EQU   56
DSPLIFOR EQU   60
DSPLIST  EQU   8
DSPPOST  EQU   24
DSPPRIO  EQU   48
DSPPRIOR EQU   52
DSPTRACE EQU   64
DSPTSTQ  EQU   32
DSPTSTQR EQU   36
DSPUNAV  EQU   40
DSPUNAVR EQU   44
DSPWAIT  EQU   16
LCBRSPIN EQU   LCBIOBSN
LCBRHSV  EQU   LCBRSPIN+2
LCBLUSNS EQU   LCBRSPIN+5
LCBSCPRS EQU   LCBRSPIN+9
LCBDFCMD EQU   LCBSCPRS
LCBCSWU1 EQU   LCBSCPRS+2
LCBRSPFG EQU   LCBRSPIN+15
LCBEXPI  EQU   LCBRSPFG
LCBRSRH  EQU   LCBRSPFG
LCBCOREQ EQU   LCBTPCD
@NM00133 EQU   LCBCPA+40
LCBQNX   EQU   LCBERCCW
LCBQNXMN EQU   LCBQNX
LCBCANCL EQU   LCBSAVSN
LCBCANFG EQU   LCBCANCL
LCBCANXT EQU   LCBCANFG
LCBCANTH EQU   LCBCANCL+1
IEDQSPTR EQU   LCBSCBA
TRMPRE1  EQU   TRMBYTE4
TRMNCP1  EQU   TRMBYTE4
TRMPRE   EQU   TRMBYTE3
TRMNCP   EQU   TRMBYTE3
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
PRFSHDR  EQU   IEDQPRF+42
SCBRGSAV EQU   SCBEND
TRMOPT   EQU   IEDQTRM+20
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00181 EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMLULOG EQU   TRMLU
TRMINERR EQU   TRMLU
TRMLUREQ EQU   TRMLU
TRMSESRQ EQU   TRMLU
TRMTDIFF EQU   TRMLU
TRMLUTM  EQU   TRMLU
TRMLUIT  EQU   TRMLU
TRMAUTO  EQU   TRMLU
TRMPCONT EQU   TRMPU
@NM00180 EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMNCPCL EQU   TRMNCP
TRMIPLDM EQU   TRMNCP
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMSTMM  EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
@NM00179 EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMSESSN EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
@NM00141 EQU   LCBCANCL+3
@NM00140 EQU   LCBCANFG
LCBCANCD EQU   LCBCANFG
@NM00139 EQU   LCBCANFG
LCBCANEB EQU   LCBCANFG
LCBUNADD EQU   LCBQNX+21
LCBUASZE EQU   LCBQNX+20
LCBDSTEA EQU   LCBQNX+16
@NM00138 EQU   LCBQNX+8
LCBIOSBS EQU   LCBQNX+5
@NM00137 EQU   LCBQNX+4
LCBSTSAV EQU   LCBQNX+1
@NM00136 EQU   LCBQNXMN
LCBNX509 EQU   LCBQNXMN
LCBNX162 EQU   LCBQNXMN
LCBNX142 EQU   LCBQNXMN
LCBNX064 EQU   LCBQNXMN
@NM00135 EQU   @NM00133+4
LCBNCPPT EQU   @NM00133+1
@NM00134 EQU   @NM00133
LCBWRSCH EQU   LCBCOREQ+8
LCBCQLNK EQU   LCBCOREQ+4
LCBCQELE EQU   LCBCOREQ
LCBPAKCH EQU   LCBRSPIN+16
@NM00132 EQU   LCBRSPFG
@NM00131 EQU   LCBRSPIN+12
LCBUSUE1 EQU   LCBCSWU1
@NM00130 EQU   LCBCSWU1
@NM00129 EQU   LCBSCPRS+1
LCBUSER  EQU   LCBLUSNS+2
LCBSMIN  EQU   LCBLUSNS+1
LCBSMAJ  EQU   LCBLUSNS
LCBSNS0  EQU   LCBRSPIN+1
@NM00128 EQU   LCBRSPIN
@NM00193 EQU   PL+11
PLMASK   EQU   PL+3
PLINDEX2 EQU   PL+2
PLLEN    EQU   PL+1
@NM00192 EQU   PLINDEX1
TRMSUBST EQU   IEDNTRM+12
TRMTYPE  EQU   IEDNTRM+11
TRMRLMCT EQU   IEDNTRM+10
TRMCOHTG EQU   TRMSIBPT+1
TRMGPCNT EQU   TRMSIBPT
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
@NM00178 EQU   TRMBYTE0
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMUDEF  EQU   TRMBYTE0
TRMCOHRT EQU   IEDNTRM+4
TRMSTOTE EQU   TRMBYTE1
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMREMB  EQU   TRMBYTE2
TRMRSACT EQU   TRMBYTE2
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMSENSE EQU   TRMSTAT+3
TRMTEMPR EQU   TRMSTAT+2
TRMSIO   EQU   TRMSTAT
@NM00177 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
TRMNCPI  EQU   TRMDEVFL+1
TRMRNTRM EQU   TRMDEVFL+1
@NM00176 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMADDC  EQU   TRMDEVFL
TRMDDIG  EQU   TRMDEVFL
TRMBUFS  EQU   TRMDEVFL
TRMPRILK EQU   TRMALTD
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TLISTCNT
TRMDESTQ EQU   IEDQTRM+1
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMLINE  EQU   TRMSTATE
TTHTAG2  EQU   TTHTAG+1
@NM00175 EQU   TTHTAG1
TTHTAGS  EQU   TTHTAG1
TTHBYTE1 EQU   IEDTH+1
@NM00174 EQU   TTHBYTE0
SNSUSR2  EQU   SNSUSER+1
SNSUSR1  EQU   SNSUSER
SNSMIN   EQU   SNSSYSTM+1
SIBLUTYP EQU   SIBSTAT0
SIBCD    EQU   SIBSTAT0
@NM00173 EQU   SIBBIND3
SIBCRES  EQU   SIBBIND3
SIBSPKR  EQU   SIBBIND3
SIBRECOV EQU   SIBBIND3
SIBFMODE EQU   SIBBIND3
SIBALT   EQU   SIBBIND2
SIBBTERM EQU   SIBBIND2
SIBBRACK EQU   SIBBIND2
SIBFMUSE EQU   SIBBIND2
SIBSEBI  EQU   SIBBIND2
SIBSCMP  EQU   SIBBIND2
SIBSEXC  EQU   SIBBIND2
SIBSDEF  EQU   SIBBIND2
SIBSRQM  EQU   SIBBIND1
SIBSCHNG EQU   SIBBIND1
SIBPEBI  EQU   SIBBIND1
SIBPCMP  EQU   SIBBIND1
SIBPEXC  EQU   SIBBIND1
SIBPDEF  EQU   SIBBIND1
SIBPRQM  EQU   SIBBIND1
SIBPCHN  EQU   SIBBIND1
SIBFMPRO EQU   IEDSIBD+19
SIBTSPRO EQU   IEDSIBD+18
@NM00172 EQU   SIBSTAT2
SIBDACLU EQU   SIBSTAT2
SIBRDSCN EQU   SIBSTAT2
SIBTERM  EQU   SIBSTAT2
SIBUSS   EQU   SIBSTAT2
SIBBSTAT EQU   SIBSTAT1
SIBRTRP  EQU   SIBSTAT1
SIBFTERM EQU   SIBSTAT1
SIBRQEND EQU   SIBSTAT1
SIBRQSHT EQU   SIBSTAT1
SIBSEQO  EQU   SIBSEQN+2
SIBSEQI  EQU   SIBSEQN
SIBNCNT  EQU   SIBPACIN
SIBMCNT  EQU   SIBPACIN
SIBDSTAT EQU   SIBSESSN
SIBSSTAT EQU   SIBSESSN
SIBINBIU EQU   SIBSESSN
SIBSHUTC EQU   SIBSESSN
SIBLGOFF EQU   SIBSESSN
SIBCHAIN EQU   IEDSIBD+4
SIBRUSEG EQU   IEDSIBD
SCBTRANS EQU   IEDQSCB+81
SCBUNTCT EQU   IEDQSCB+80
SCBEOB   EQU   IEDQSCB+78
SCBNXCPB EQU   SCBCCSEG
SCBNHDR  EQU   SCBCHDR
SCBCRCD  EQU   IEDQSCB+69
SCBTQBCK EQU   SCBNTXT
SCBOSEQ  EQU   SCBSCAN
SCBXTRA  EQU   SCBCORE
SCBNOPST EQU   SCBSTAT1
SCBNIDLE EQU   SCBSTAT1
SCBCEND  EQU   SCBSTAT1
SCBCBGN  EQU   SCBSTAT1
SCBSIZE  EQU   IEDQSCB+58
SCBSRCE  EQU   IEDQSCB+56
SCBDEOB  EQU   IEDQSCB+52
SCBFEFO  EQU   SCBDCSEG
SCBCTBND EQU   SCBBLKCT
SCBSCHDR EQU   SCBCLSEG
SCBHBFNO EQU   IEDQSCB+44
SCBSCSEG EQU   SCBDNSEG
SCBBCTR  EQU   SCBCTBSV
SCBCCHDR EQU   IEDQSCB+37
SCBDESTL EQU   IEDQSCB+36
SCBDCHDR EQU   IEDQSCB+33
SCBCPBNO EQU   IEDQSCB+32
SCBMBSSA EQU   IEDQSCB+25
SCBMLMTN EQU   SCBBSCFM
SCBNOEOT EQU   SCBBSCFM
@NM00171 EQU   SCBBSCFM
SCBNPDTR EQU   SCBDATEN
SCBCNTEN EQU   SCBBSCFM
SCBRCVTX EQU   SCBBSCFM
SCBNONTR EQU   SCBBSCFM
SCBTRNSP EQU   SCBBSCFM
SCBENDCR EQU   SCBCTBAC+1
SCBCRLEN EQU   SCBCTBAC
SCBMRFSD EQU   IEDQSCB+20
SCBUNDFN EQU   SCBERR4
SCBSTERN EQU   SCBCHANN
SCBCPMEN EQU   SCBCTLUN
@NM00170 EQU   SCBERR4
SCBTRMLN EQU   SCBERR4
SCBCONNN EQU   SCBERR4
SCBAPERR EQU   SCBTXTTN
SCBSLCTN EQU   SCBERR4
SCBPERRN EQU   SCBXCEPN
SCBTHRSN EQU   SCBATTN
SCBFIERN EQU   SCBFORMN
SCBUSERN EQU   SCBERR3
SCBSATTN EQU   SCBERR3
SCBTMINN EQU   SCBERR3
SCBXPD   EQU   SCBTMIDN
SCBXPI   EQU   SCBLOSTN
SCBSOHE  EQU   SCBERR2
SCBFRWDN EQU   SCBERR2
SCBRRJN  EQU   SCBABRTN
SCBOLTR  EQU   SCBERR2
SCBALN   EQU   SCBERR2
SCBCODER EQU   SCBERR2
SCBCRMAX EQU   SCBERR2
SCBCRMIN EQU   SCBERR2
SCBRVISL EQU   SCBCUTFN
SCBNOBFN EQU   SCBERR1
@NM00169 EQU   SCBERR1
SCBNOVAC EQU   SCBSEQLN
SCBNOTSO EQU   SCBSEQHN
SCBRVITX EQU   SCBNOTRM
SCBHANG  EQU   SCBORIGN
SCBNOLOG EQU   SCBHDRRN
SCBMRFPL EQU   IEDQSCB+13
SCBBFMM  EQU   SCBQTYPE
SCBBBFTM EQU   SCBQTYPE
SCBNOFF  EQU   SCBQTYPE
SCBCONC  EQU   SCBQTYPE
SCBNREUS EQU   SCBQTYPE
SCBREUS  EQU   SCBQTYPE
SCBCOREQ EQU   SCBQTYPE
SCBNORCL EQU   SCBQTYPE
SCBCTBSZ EQU   SCBEOBSZ
@NM00168 EQU   SCBBKFCT
SCBPRI   EQU   IEDQSCB+8
SCBMACR  EQU   SCBMBHEN
SCBSNDCT EQU   SCBRCVCT
SCBDESTQ EQU   IEDQSCB+1
SCBCODE  EQU   SCBSTATE
SCBPRER  EQU   SCBSTATE
SCBCKPT  EQU   SCBSTATE
SCBMSGLN EQU   SCBSTATE
SCBERSDS EQU   SCBSTATE
SCBLCK1N EQU   SCBSTATE
SCBMGFMN EQU   SCBSEQIN
SCBTRANP EQU   SCBSTATE
@NM00167 EQU   TRHBYTE2
@NM00166 EQU   TRHBYTE2
@NM00165 EQU   TRHBYTE2
TRHCSI   EQU   TRHBYTE2
@NM00164 EQU   TRHBYTE2
TRHCDI   EQU   TRHBYTE2
TRHEB    EQU   TRHBYTE2
TRHBB    EQU   TRHBYTE2
TRHPI    EQU   TRHBYTE1
@NM00163 EQU   TRHBYTE1
@NM00162 EQU   TRHBYTE1
@NM00161 EQU   TRHBYTE1
@NM00160 EQU   TRHBYTE1
@NM00159 EQU   TRHBYTE0
PRF2SEQP EQU   PRF2WD2
@NM00158 EQU   IEDPF2+1
@NM00157 EQU   PRF2FLG2
PRF2TERM EQU   PRF2FLG2
PRF2SMI  EQU   PRF2FLG2
PRF2FORM EQU   PRF2FLG2
PRF1RULN EQU   PRF1SEQP+2
PRF1TAG2 EQU   PRF1SQID+1
@NM00156 EQU   PRF1TAG1
PRF1TAGS EQU   PRF1TAG1
@NM00155 EQU   PRF1FLG1
PRF1LOGD EQU   PRF1FLG1
PRF1USS  EQU   PRF1FLG1
PRF1FORM EQU   PRF1FLG1
PRF1FIDI EQU   PRF1FLG1
PRFDEST  EQU   IEDQPRF+40
PRFISEQ  EQU   IEDQPRF+38
PRFSTXT  EQU   PRFHQBCK
PRFNHDR  EQU   PRFCHDR
PRFCRCD  EQU   IEDQPRF+29
PRFSVSEQ EQU   PRFNTXT+1
PRFSVPRI EQU   PRFEOBOF
PRFISIZE EQU   PRFSCAN+1
@NM00154 EQU   PRFSCAN
PRFEOB   EQU   PRFXTRA+1
PRFSTSO  EQU   PRFXTRA
PRFNHDRN EQU   PRFSTAT1
PRFNLSTN EQU   PRFSTAT1
PRFLOCK  EQU   PRFEOFN
PRFDUPLN EQU   PRFSTAT1
PRFTSMSG EQU   PRFSTAT1
PRFITCPN EQU   PRFSTAT1
PRFERMGN EQU   PRFSTAT1
PRFCNCLN EQU   PRFSTAT1
PRFSVFLG EQU   @NM00153+3
PRFSIZE  EQU   PRFSVFFO+2
PRFSRCE  EQU   PRFSVFFO
PRFLCB   EQU   IEDQPRF+13
PRFTI0   EQU   PRFTIC+1
@NM00152 EQU   PRFTICC
@NM00151 EQU   PRFTICC
@NM00150 EQU   PRFTICC
PRFTICON EQU   PRFTICC
@NM00149 EQU   PRFTICC
@NM00148 EQU   PRFTICC
PRFBFMM  EQU   PRFTICC
PRFEOMSG EQU   PRFTICC
PRFCOUNT EQU   PRFLINK+1
@NM00147 EQU   PRFLINK
PRFFLAGS EQU   PRFPRI
PRFIOADR EQU   PRFQCBA
PRFOPCDE EQU   PRFKEY
LCBERADR EQU   LCBXRADR+1
LCBPCIRC EQU   LCBXRADR
LCBDCT3  EQU   LCBXDCT+2
LCBDCT2  EQU   LCBXDCT+1
LCBDCT1  EQU   LCBXDCT
@NM00146 EQU   LCBXFLAG
LCBERPND EQU   LCBXFLAG
LCBSRCPF EQU   LCBXFLAG
LCBGPCTV EQU   LCBXFLAG
@NM00145 EQU   LCBXFLAG
@NM00144 EQU   LCBXFLAG
@NM00143 EQU   LCBXFLAG
@NM00142 EQU   LCBXFLAG
LCBCCW10 EQU   LCBCPA+72
LCBCCW9  EQU   LCBCPA+64
LCBCCW8  EQU   LCBCPA+56
LCBCCW7  EQU   LCBCPA+48
LCBCCW6  EQU   LCBCPA+40
LCBCP    EQU   LCBQEBPL+4
LCBIOSB  EQU   LCBQEBPL+1
LCBSIO   EQU   LCBQEBPL
LCBCCW4  EQU   LCBCPA+24
LCBCCW3  EQU   LCBCPA+16
LCBCCW2  EQU   LCBCPA+8
LCBCCW1  EQU   LCBCPA
@NM00127 EQU   LCBERCCW+16
LCBATL05 EQU   LCBERCCW+8
@NM00126 EQU   LCBERCCW
LCBCSWSV EQU   LCBSAVSN+1
LCBSNSV  EQU   LCBSAVSN
LCBBFSNS EQU   LCBRSPSV
LCBWAITC EQU   LCBTPCD+5
LCBINPAK EQU   LCBSTAT6
LCBMHBID EQU   LCBSTAT6
LCBHDRPD EQU   LCBSTAT6
LCBCHN   EQU   LCBSTAT6
LCBBFRSV EQU   LCBTPCD+1
@NM00125 EQU   LCBSTAT5
LCBLUS   EQU   LCBSTAT5
LCBPERM  EQU   LCBSTAT5
LCBNXCMD EQU   LCBBFRW
LCBERMSK EQU   LCBOBRCH
LCBOLT   EQU   LCBMSGFM
LCBEOT   EQU   LCBMSGFM
LCBENQ   EQU   LCBMSGFM
LCBTTD   EQU   LCBMSGFM
LCBRSTRT EQU   LCBMSGFM
LCBVSTRT EQU   LCBMSGFM
LCBACKI  EQU   LCBMSGFM
LCBNAK   EQU   LCBMSGFM
@NM00124 EQU   LCBRBCT2
LCBDCNT  EQU   LCBRBCT2
LCBCOMPL EQU   LCBDLNKN
LCBERROR EQU   LCBERBST
LCBLOGDV EQU   LCBERBST
LCBINQ   EQU   LCBERBST
LCBRDERR EQU   LCBERBST
LCBEOMSG EQU   LCBERBST
LCBMSG   EQU   LCBERBST
LCBERBKY EQU   LCBERB
LCBRECAD EQU   IEDQLCB+73
@NM00123 EQU   LCBTSTSW
@NM00122 EQU   LCBTSTSW
@NM00121 EQU   LCBTSTSW
@NM00120 EQU   LCBTSTSW
@NM00119 EQU   LCBTSTSW
@NM00118 EQU   LCBTSTSW
@NM00117 EQU   LCBTSTSW
LCBCONCT EQU   LCBTSTSW
LCBBFRAV EQU   LCBDIAL
LCBATTN  EQU   LCBSYNC
LCBNEGRP EQU   LCBSTAT2
LCBSNDPR EQU   LCBSTAT2
LCBCONNN EQU   LCBBEOTN
LCBMSGNN EQU   LCBSTAT2
LCBTRACE EQU   LCBSTAT2
LCBSENDN EQU   LCBSTAT1
LCBRECVN EQU   LCBSTAT1
LCBFREEN EQU   LCBSTAT1
LCBCONT  EQU   LCBSTAT1
LCBINITN EQU   LCBSTAT1
LCBOCNI  EQU   LCBSTAT1
LCBOCWTN EQU   LCBSTAT1
LCBRCLLN EQU   LCBSTAT1
LCBRECOF EQU   IEDQLCB+68
LCBRDBFR EQU   LCBRCBFR
LCBUCBX  EQU   IEDQLCB+64
LCBTTBIN EQU   LCBERRCT
@NM00116 EQU   LCBINCAM
LCBGETMN EQU   LCBINCAM
@NM00115 EQU   LCBRESTR+1
LCBCMDSV EQU   LCBRESTR
LCBPCILK EQU   LCBDCBPT
LCBSTART EQU   LCBIOBSN+16
LCBAP4OL EQU   LCBSIOCC
LCBAP3OL EQU   LCBSIOCC
LCBAP2OL EQU   LCBSIOCC
LCBAP1OL EQU   LCBSIOCC
LCBSIOC2 EQU   LCBSIOCC
LCBSIOC1 EQU   LCBSIOCC
@NM00114 EQU   LCBSIOCC
LCBCSWRC EQU   LCBCSW+5
LCBCSCHC EQU   LCBCSWCS
LCBCSICC EQU   LCBCSWCS
LCBCSCCC EQU   LCBCSWCS
LCBCSCDC EQU   LCBCSWCS
LCBCSPTC EQU   LCBCSWCS
LCBCSPGC EQU   LCBCSWCS
LCBCSIL  EQU   LCBCSWCS
LCBCSPCI EQU   LCBCSWCS
LCBUSUE  EQU   LCBCSWUS
LCBUSUC  EQU   LCBCSWUS
LCBUSDE  EQU   LCBCSWUS
LCBUSCE  EQU   LCBCSWUS
LCBUSBSY EQU   LCBCSWUS
LCBUSCUE EQU   LCBCSWUS
LCBUSSM  EQU   LCBCSWUS
LCBUSAT  EQU   LCBCSWUS
LCBCSWCA EQU   LCBCSW
LCBOBR   EQU   LCBFLAG3
LCBOBRRD EQU   LCBFLAG3
LCBIOMSG EQU   LCBFLAG3
LCBSOHC  EQU   LCBFLAG3
LCBRLAD  EQU   LCBFLAG3
LCBSOHR  EQU   LCBFLAG3
@NM00113 EQU   LCBFLAG3
LCBECBPT EQU   LCBIOBSN+4
LCBECBCC EQU   LCBIOBSN+3
LCBSENS1 EQU   LCBSNS+1
LCBABORT EQU   LCBTMOUT
LCBNOTIN EQU   LCBLOSDT
LCBOVRUN EQU   LCBSENS0
LCBDATCK EQU   LCBSENS0
LCBEQUCK EQU   LCBSENS0
LCBBUSCK EQU   LCBSENS0
LCBINTRQ EQU   LCBSENS0
LCBCMDRJ EQU   LCBSENS0
LCBFLAG2 EQU   LCBIOBSN
@NM00112 EQU   LCBFLAG1
LCBUNREL EQU   LCBFLAG1
LCBEXCPN EQU   LCBFLAG1
@NM00111 EQU   LCBFLAG1
LCBERPIN EQU   LCBFLAG1
@NM00110 EQU   LCBFLAG1
LCBFSBFR EQU   LCBMHA
LCBISZE  EQU   IEDQLCB+28
LCBLNENT EQU   LCBSCBDA+1
@NM00109 EQU   LCBSCBDA
LCBCPGMH EQU   LCBSTAT4
LCBREAL  EQU   LCBPHASE
@NM00108 EQU   LCBSTAT4
LCBACTRQ EQU   LCBSTAT4
LCBIPLRQ EQU   LCBSTAT4
LCBDACRQ EQU   LCBSTAT4
LCBDMPRQ EQU   LCBSTAT4
@NM00107 EQU   LCBLKMDE
LCBLOCKI EQU   LCBLKMDE
LCBLOCKR EQU   LCBLKMDE
LCBHMFLG EQU   LCBLKMDE
LCBBDFLG EQU   LCBLKMDE
@NM00106 EQU   LCBINSRC
LCBABRTN EQU   LCBCHAIN
LCBCTLMD EQU   LCBTETEN
LCBBFRSZ EQU   LCBCHAIN
LCBUREQN EQU   LCBCHAIN
LCBNORTY EQU   LCBCHAIN
LCBERMSG EQU   LCBCHAIN
LCBEXCP  EQU   LCBCHAIN
LCBINVRQ EQU   LCBSCRNN
LCB2741N EQU   LCBTSOB
LCBINHBN EQU   LCBTSOB
LCBCIRCD EQU   LCBTSOB
LCBPREP  EQU   LCBTSOB
LCBSOPL  EQU   LCBTSOB
LCBSATRD EQU   LCBTSOB
LCBTSBUF EQU   LCBTSOB
LCBWRBRK EQU   LCBTSOB
LCBTDL   EQU   IEDQLCB+18
LCBEOLTD EQU   IEDQLCB+16
LCBRSLNK EQU   IEDQLCB+13
LCBRSPRI EQU   IEDQLCB+12
LCBSTCBA EQU   IEDQLCB+9
LCBRSKEY EQU   IEDQLCB+8
LCBPRI   EQU   LCBRCB+4
LCBKEY   EQU   LCBRCB
SAVTLLCB EQU   IEDNSVTD+316
SAVTBITN EQU   IEDNSVTD+312
@NM00105 EQU   SAVTCKQB+8
@NM00104 EQU   SAVTCKEC+1
@NM00103 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00102 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00101 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00100 EQU   IEDNSVTD+273
SAVTSUBL EQU   IEDNSVTD+272
@NM00099 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTTNTX EQU   IEDNSVTD+252
SAVTNAX  EQU   IEDNSVTD+248
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTRQTG EQU   IEDNSVTD+236
SAVTRQCH EQU   IEDNSVTD+232
SAVTMAND EQU   IEDNSVTD+228
SAVTSPLN EQU   IEDNSVTD+224
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTSCLU EQU   IEDNSVTD+168
SAVTXTRQ EQU   IEDNSVTD+164
SAVTMVBF EQU   IEDNSVTD+160
@NM00098 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00097 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00096 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00095 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTLUSR EQU   IEDNSVTD+100
@NM00094 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00093 EQU   IEDNSVTD+84
SAVTSAT  EQU   IEDNSVTD+80
SAVTNAT  EQU   IEDNSVTD+76
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00092 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPREQ EQU   IEDNSVTD+16
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTCPBNO EQU   IEDQAVTD+1172
AVTHRESS EQU   IEDQAVTD+1171
@NM00091 EQU   IEDQAVTD+1170
@NM00090 EQU   IEDQAVTD+1169
@NM00089 EQU   IEDQAVTD+1168
@NM00088 EQU   IEDQAVTD+1165
@NM00087 EQU   IEDQAVTD+1164
AVTHRESE EQU   @NM00086
AVTRADDR EQU   IEDQAVTD+1156
AVTNADDR EQU   IEDQAVTD+1152
AVTHRESN EQU   IEDQAVTD+1148
AVTVOLRN EQU   IEDQAVTD+1144
AVTTOTNN EQU   IEDQAVTD+1140
AVTTRCYN EQU   IEDQAVTD+1136
AVTRCTRN EQU   IEDQAVTD+1132
AVTNOVON EQU   IEDQAVTD+1128
AVTADEBN EQU   IEDQAVTD+1124
AVTVOLRR EQU   IEDQAVTD+1120
AVTTOTNR EQU   IEDQAVTD+1116
AVTTRCYR EQU   IEDQAVTD+1112
AVTRCTRR EQU   IEDQAVTD+1108
AVTNOVOR EQU   IEDQAVTD+1104
AVTADEBR EQU   IEDQAVTD+1100
AVTLODPT EQU   IEDQAVTD+1096
AVTIOBN  EQU   IEDQAVTD+1092
AVTIOBR  EQU   IEDQAVTD+1088
AVTCPBPT EQU   IEDQAVTD+1084
AVTFCPB  EQU   IEDQAVTD+1080
@NM00085 EQU   IEDQAVTD+1076
AVTINCPQ EQU   IEDQAVTD+1072
@NM00084 EQU   IEDQAVTD+1068
@NM00083 EQU   IEDQAVTD+1065
@NM00082 EQU   AVTBIT4
@NM00081 EQU   AVTBIT4
@NM00080 EQU   AVTBIT4
@NM00079 EQU   AVTBIT4
@NM00078 EQU   AVTBIT4
@NM00077 EQU   AVTBIT4
@NM00076 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00075 EQU   IEDQAVTD+1060
AVTNOBFQ EQU   IEDQAVTD+1056
@NM00074 EQU   IEDQAVTD+1052
AVTDKENQ EQU   IEDQAVTD+1048
@NM00073 EQU   IEDQAVTD+1044
AVTDKAPQ EQU   IEDQAVTD+1040
AVTCOPY  EQU   IEDQAVTD+1036
AVTIA    EQU   IEDQAVTD+1032
AVTFL    EQU   IEDQAVTD+1028
@NM00072 EQU   IEDQAVTD+1024
AVTNCPBQ EQU   IEDQAVTD+1020
AVTTOTNC EQU   IEDQAVTD+1016
AVTCMAX  EQU   IEDQAVTD+1012
AVTCMIN  EQU   IEDQAVTD+1008
AVTHM02  EQU   IEDQAVTD+1004
AVTOPCIN EQU   IEDQAVTD+1002
AVTDCTLN EQU   IEDQAVTD+1000
AVTOPMSK EQU   IEDQAVTD+996
AVTDDFT  EQU   IEDQAVTD+992
AVTOPTN  EQU   IEDQAVTD+984
AVTDSKCT EQU   IEDQAVTD+982
AVTCKRST EQU   IEDQAVTD+981
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00071 EQU   AVTBIT2
@NM00070 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+976
AVTDLQX  EQU   IEDQAVTD+974
AVTINTLV EQU   IEDQAVTD+972
AVTSMCNT EQU   IEDQAVTD+970
AVTAVFCT EQU   IEDQAVTD+968
AVTOPCON EQU   IEDQAVTD+966
AVTOPCNT EQU   IEDQAVTD+964
AVTLNCNT EQU   IEDQAVTD+962
AVTKEYLE EQU   IEDQAVTD+960
AVTHA16  EQU   IEDQAVTD+958
AVTHA7   EQU   IEDQAVTD+956
AVTHA4   EQU   IEDQAVTD+954
AVTHA3   EQU   IEDQAVTD+952
AVTHA2   EQU   IEDQAVTD+950
AVTGETMS EQU   IEDQAVTD+949
@NM00069 EQU   IEDQAVTD+948
AVTGETMD EQU   IEDQAVTD+944
AVTGETMN EQU   IEDQAVTD+940
AVTCWTOT EQU   IEDQAVTD+936
AVTCWINT EQU   IEDQAVTD+884
AVTDTRAP EQU   IEDQAVTD+880
@NM00068 EQU   IEDQAVTD+878
@NM00067 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00066 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+872
AVTAFE20 EQU   IEDQAVTD+868
AVTAFE10 EQU   IEDQAVTD+864
AVTCWEC2 EQU   IEDQAVTD+860
AVTCWPM2 EQU   IEDQAVTD+856
AVTCWTS2 EQU   IEDQAVTD+855
AVTCWTS1 EQU   IEDQAVTD+854
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00065 EQU   AVTCWFL2
@NM00064 EQU   AVTCWFL2
@NM00063 EQU   AVTCWFL2
@NM00062 EQU   AVTCWFL2
@NM00061 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00060 EQU   AVTCWFL1
@NM00059 EQU   AVTCWFL1
@NM00058 EQU   AVTCWFL1
@NM00057 EQU   AVTCWFL1
@NM00056 EQU   AVTCWFL1
@NM00055 EQU   AVTCWFL1
@NM00054 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+848
AVTCWPM1 EQU   IEDQAVTD+844
AVTCAREA EQU   IEDQAVTD+840
AVTFZERO EQU   IEDQAVTD+836
AVTCADDR EQU   IEDQAVTD+832
AVTCOREC EQU   IEDQAVTD+828
@NM00053 EQU   IEDQAVTD+820
AVTCPBCB EQU   IEDQAVTD+816
@NM00052 EQU   IEDQAVTD+808
AVTDSIOB EQU   IEDQAVTD+804
@NM00051 EQU   IEDQAVTD+796
AVTCPRMB EQU   IEDQAVTD+792
@NM00050 EQU   IEDQAVTD+784
AVTCLOSB EQU   IEDQAVTD+780
@NM00049 EQU   IEDQAVTD+772
AVTACTIB EQU   IEDQAVTD+768
@NM00048 EQU   IEDQAVTD+764
AVTOLTEB EQU   IEDQAVTD+760
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00047 EQU   AVTOPCQB+8
@NM00046 EQU   AVTOPCEC+1
@NM00045 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00044 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00043 EQU   AVTCKPEC+1
@NM00042 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00041 EQU   IEDQAVTD+724
AVTBFRTB EQU   IEDQAVTD+720
@NM00040 EQU   IEDQAVTD+716
AVTSELCH EQU   IEDQAVTD+713
AVTBFRTN EQU   AVTBFRFG
AVTTIMQ  EQU   IEDQAVTD+704
@NM00039 EQU   IEDQAVTD+700
AVTIMQPS EQU   IEDQAVTD+696
AVTINOUT EQU   IEDQAVTD+694
AVTREFTM EQU   IEDQAVTD+692
@NM00038 EQU   IEDQAVTD+680
AVTDELYB EQU   IEDQAVTD+676
AVTOCQPT EQU   IEDQAVTD+672
AVTTSOPT EQU   IEDQAVTD+668
AVTSUPPT EQU   IEDQAVTD+664
AVTCBQCB EQU   IEDQAVTD+660
@NM00037 EQU   AVTSYSER
@NM00036 EQU   AVTSYSER
@NM00035 EQU   AVTSYSER
@NM00034 EQU   AVTSYSER
@NM00033 EQU   AVTSYSER
@NM00032 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+652
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00031 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+632
AVTDELEM EQU   IEDQAVTD+628
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00030 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00029 EQU   AVTCKBYT
@NM00028 EQU   AVTCKBYT
@NM00027 EQU   AVTCKBYT
@NM00026 EQU   AVTCKBYT
@NM00025 EQU   AVTCKBYT
@NM00024 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+618
AVTOPXCL EQU   IEDQAVTD+616
AVTOPERL EQU   IEDQAVTD+615
@NM00023 EQU   IEDQAVTD+614
AVTCKTIM EQU   IEDQAVTD+612
AVTCKELV EQU   IEDQAVTD+610
AVTCPRCD EQU   IEDQAVTD+609
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00022 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+605
AVTSCBSZ EQU   IEDQAVTD+604
@NM00021 EQU   IEDQAVTD+600
AVTCKELE EQU   IEDQAVTD+596
@NM00020 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+576
AVTHI    EQU   IEDQAVTD+572
AVTIOT   EQU   IEDQAVTD+568
AVTNX    EQU   IEDQAVTD+564
AVTTONE  EQU   IEDQAVTD+560
AVTA3TL  EQU   IEDQAVTD+556
AVTDMECB EQU   IEDQAVTD+552
AVTABEND EQU   IEDQAVTD+546
AVTPLCBN EQU   IEDQAVTD+544
@NM00019 EQU   AVTSAVTP+1
@NM00018 EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
@NM00017 EQU   IEDQAVTD+536
AVTCMBSS EQU   IEDQAVTD+532
AVTRCV   EQU   IEDQAVTD+528
AVTSEND  EQU   IEDQAVTD+524
AVTCSCH  EQU   IEDQAVTD+520
AVTQ1    EQU   IEDQAVTD+516
AVTE7    EQU   IEDQAVTD+512
AVTHB    EQU   IEDQAVTD+508
AVTR1    EQU   IEDQAVTD+504
AVTBZ    EQU   IEDQAVTD+500
AVTEZ    EQU   IEDQAVTD+496
AVTEC    EQU   IEDQAVTD+492
AVTEW    EQU   IEDQAVTD+488
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00016 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTAX    EQU   IEDQAVTD+472
AVTA3    EQU   IEDQAVTD+468
AVTGD    EQU   IEDQAVTD+464
AVTAL    EQU   IEDQAVTD+460
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+452
AVTCOMPT EQU   IEDQAVTD+444
AVTCRSRF EQU   IEDQAVTD+440
@NM00015 EQU   IEDQAVTD+436
AVTKA02  EQU   IEDQAVTD+432
AVTOPTPT EQU   IEDQAVTD+428
AVTPCBPT EQU   IEDQAVTD+424
@NM00014 EQU   AVTECB1
AVTCOMP  EQU   AVTECB1
@NM00013 EQU   AVTECB1
AVTOPECA EQU   IEDQAVTD+416
AVTOLECA EQU   IEDQAVTD+412
AVTCKECA EQU   IEDQAVTD+408
AVTCWECA EQU   IEDQAVTD+404
AVTCWTCB EQU   IEDQAVTD+400
AVTOLTCB EQU   IEDQAVTD+396
AVTOCTCB EQU   IEDQAVTD+392
AVTCKTCB EQU   IEDQAVTD+388
AVTAS    EQU   IEDQAVTD+384
AVTNOLBF EQU   IEDQAVTD+382
AVTNCKPR EQU   IEDQAVTD+381
AVTCIB   EQU   IEDQAVTD+380
AVTSPLPT EQU   IEDQAVTD+376
AVTMVBFR EQU   IEDQAVTD+372
AVTSBTA  EQU   IEDQAVTD+368
AVTRARTN EQU   IEDQAVTD+364
AVTBSCAN EQU   IEDQAVTD+360
AVTRDYA  EQU   IEDQAVTD+356
AVTDISTR EQU   IEDQAVTD+348
AVTPARM3 EQU   IEDQAVTD+344
@NM00012 EQU   AVTPKF
@NM00011 EQU   AVTPKF
@NM00010 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00009 EQU   AVTPKF
@NM00008 EQU   AVTPKF
@NM00007 EQU   AVTPKF
@NM00006 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+336
AVTEXS2A EQU   IEDQAVTD+330
AVTEXA2S EQU   IEDQAVTD+324
AVTOCGET EQU   IEDQAVTD+320
AVTCKAVT EQU   @NM00004+1
@NM00005 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
AVTBUENT EQU   IEDQAVTD+314
@NM00003 EQU   IEDQAVTD+313
AVTFULLT EQU   AVTBUFSW
AVTUNCON EQU   AVTBUFSW
@NM00002 EQU   AVTBUFSW
AVTBUFTR EQU   AVTREADD
AVTREADY EQU   IEDQAVTD+304
AVTRACE  EQU   IEDQAVTD+300
AVTTCB   EQU   IEDQAVTD+296
AVTPASWD EQU   IEDQAVTD+288
AVTCTLCH EQU   IEDQAVTD+280
AVTDOUBL EQU   IEDQAVTD+272
AVTDOUBX EQU   IEDQAVTD+264
AVTDPARM EQU   IEDQAVTD+260
AVTCSTCS EQU   IEDQAVTD+256
AVTDLQ   EQU   AVTSAVEX+32
@NM00001 EQU   AVTSAVEX
AVTSAVE3 EQU   IEDQAVTD+72
AVTSAVE2 EQU   IEDQAVTD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RF00515 EQU   @EL00003
@RC00520 EQU   @EL00003
@RC00535 EQU   @EL00003
@RC00593 EQU   @RC00591
@RF00644 EQU   @RC00591
@RC00678 EQU   @EL00006
@RF00684 EQU   @EL00006
@RC00694 EQU   @EL00007
@RC00756 EQU   @EL00009
@RC00789 EQU   @EL00009
@RC00806 EQU   @EL00009
@RF00820 EQU   @EL00010
@RC00825 EQU   @EL00011
@RF00836 EQU   @EL00011
@RF00846 EQU   @EL00012
@PB00012 EQU   @EL00001
@RF00597 EQU   @RC00593
@RF00600 EQU   @RC00593
@RC00605 EQU   @RC00593
@RF00624 EQU   @RC00593
@RC00696 EQU   @RC00694
@RC00761 EQU   @RC00756
@RC00778 EQU   @RC00756
@RC00791 EQU   @RC00789
@PB00011 EQU   @PB00012
@RF00607 EQU   @RC00605
@RF00700 EQU   @RC00696
@RC00704 EQU   @RC00696
@RF00711 EQU   @RC00696
@RC00763 EQU   @RC00761
@RC00793 EQU   @RC00791
@PB00010 EQU   @PB00011
@RC00765 EQU   @RC00763
@PB00009 EQU   @PB00010
@PB00008 EQU   @PB00009
@PB00007 EQU   @PB00008
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@PB00004 EQU   @PB00005
@PB00003 EQU   @PB00004
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IEDQRS,(C'PLS0742',0701,78129)
