//RPGSMPL JOB MSGLEVEL=1
//     EXEC RPGECLG
//RPG.SYSUT3 DD UNIT=SYSDA
//RPG.SYSUT2 DD UNIT=SYSDA
//RPG.SYSUT1 DD UNIT=SYSDA
//RPG.SYSGO  DD UNIT=SYSDA
//RPG.SYSIN DD *
00000H
01010FINPUT   IPE F  80  80            READ40
01020FOUTPUT  O   V 132 132     OF     PRINTER
01010IINPUT   AA  01   1 Z-
01020I                                        8  29 NAME
01030I                                       30  310MONTH
01040I                                       32  330DAY
01050I                                       34  380INVNO
01060I                                       39  430CUSTNOL1
01070I                                       44  450STATE
01080I                                       46  480CITY
01090I                                       74  802INVAMT
01010C   01      INVAMT    ADD  TOTAL     TOTAL   72
01020C   01      INVAMT    ADD  GRPTOT    GRPTOT  72
01010OOUTPUT  H  201   1P
01020O       OR        OF
01030O                                   53 '      A C C O U N T S  R'
01040O                                   77 ' E C E I V A B L E  R E '
01050O                                   88 'G I S T E R'
01060O        H  1     1P
01070O       OR        OF
01080O                                   25 'CUSTOMER'
01090O                                   80 'LOCATION       INVOICE'
01100O                                  109 'INVOICE DATE    INVOICE'
01110O        H  2     1P
01120O       OR        OF
01130O                                   42 'NUMBER         CUSTOMER '
01140O                                   46 'NAME'
01150O                                   79 ' STATE   CITY     NUMBER'
01160O                                  108 ' MO    DAY     AMOUNT'
02010O        D  2     01
02020O                         CUSTNOZ   23
02030O                         NAME      53
02040O                         STATE Z   59
02050O                         CITY  Z   67
02060O                         INVNO Z   79
02070O                         MONTH Z   90
02080O                         DAY   Z   96
02090O                         INVAMT   109 '$  ,  0.  '
02100O        T  2     L1
02110O                         GRPTOT B 109 '$  ,  0.  '
02120O                                  110 '*'
02130O        T  2     LR
02140O                         TOTAL    109 '$  ,  0.  '
02150O                                  111 '**'
//GO.OUTPUT DD SYSOUT=A
//GO.INPUT DD *
K      AMALGAMATED CORP      1110116031071233 61
K      BROWN WHOLESALE       1228123241131530231
K      BROWN WHOLESALE       1214995881131530231
K      FARM IMPLEMENTS       1018109011189747 77
K      BLACK OIL             11 8115091853016 67
K      BLACK OIL             1223122921853016 67
K      LEATHER BELT CO       11 8115112071636471
K      LEATHER BELT CO       1217122632071636471
K      GENERAL MFG CO        11141161529017 6 63
K      GENERAL MFG CO        11231167629017 6 63
K      A-B-C DIST CO          911 96892905425 39
K      A-B-C DIST CO         1111116052905425 39
K      A-B-C DIST CO         1214122342905425 39
