//WMESS   PROC   V='',VOL=WATFIV
//WPRT   EXEC   PGM=IEBPTPCH
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  VOLUME=SER=&V.&VOL,UNIT=SYSDA,DISP=SHR,
//             DSNAME=WATFIV.MESSAGE
//SYSUT2   DD    SYSOUT=A
//SYSIN    DD  DSNAME=WATFIV.PROCLIB(WPRT),VOLUME=SER=&V.&VOL,
//             UNIT=SYSDA,DISP=SHR
