         TITLE 'IGG019LU, 3886 READ MODULE                             *
                        '
IGG019LU CSECT ,                                                   0001
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @08,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@08                                         0001
*   DECBPT=PLSRG1;                  /* LOAD ADDR OF PARM LIST        */
         LR    DECBPT,PLSRG1                                       0048
*   DCBPTR=DECDCBAD;                /* SETUP PTR FOR THE DCB         */
         L     DCBPTR,DECDCBAD(,DECBPT)                            0049
*   IOBSTPTR=LASTIOB+PREFLNTH;      /* SETUP BASE FOR THE IOB        */
         L     @14,DCBIOBA+52(,DCBPTR)                             0050
         LA    IOBSTPTR,8                                          0050
         SLR   @12,@12                                             0050
         ICM   @12,7,LASTIOB(@14)                                  0050
         ALR   IOBSTPTR,@12                                        0050
*   DECIOBPT=IOBSTPTR;              /* POINT PRM LST TO IOB          */
         ST    IOBSTPTR,DECIOBPT(,DECBPT)                          0051
*   IOBECBPT=DECBPT;                /* POINT IOB TO DECB             */
         ST    DECBPT,IOBECBPT(,IOBSTPTR)                          0052
*   IF DECRDSF=OFF×                 /* RBL TYPE READ                 */
*       DECWRSFR=OFF                /*                               */
*     THEN                          /* NO,GOTO PROBLEM DET           */
         TM    DECRDSF(DECBPT),B'10000001'                         0053
         BO    @RF00053                                            0053
*     DO;                                                          0054
*       GEN;                                                       0055
         DMABCOND 201,DCB=(DCBPTR),SVC=YES
*     END;                                                         0056
*                                                                  0056
*/* SETUP DCB BYTES FOR SCAN COMMAND                                 */
*/*                                                                  */
*                                                                  0057
*   /*****************************************************************/
*   /*                                                               */
*   /* SETUP DOCUMENT LINE NUMBER IN DCB FIELD                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0057
*/*                                                                  */
*                                                                  0057
*RDYDCBLN:                          /* READY DCB LINE NUMBER         */
*   WK1PTR=ADDR(DCBLNNUM);          /* INIT PTR TO LNNUM             */
@RF00053 DS    0H                                                  0057
RDYDCBLN LA    WK1PTR,4                                            0057
         ALR   WK1PTR,DCBPTR                                       0057
*   IF LINNO=NOTSPCFD               /* LINNO NOT SPECIFIED           */
*     THEN                          /* YES,                          */
         ICM   @14,15,LINNO(DECBPT)                                0058
         BNZ   @RF00058                                            0058
*     DCBLNNUM=DCBLNNUM+ONE;        /* INCREMENT LINE NUMBER         */
         LA    @14,1                                               0059
         SLR   @12,@12                                             0059
         IC    @12,DCBLNNUM+4(,DCBPTR)                             0059
         ALR   @14,@12                                             0059
         STC   @14,DCBLNNUM+4(,DCBPTR)                             0059
*   ELSE                            /* NO,IT IS SPECFD               */
*     DO;                                                          0060
         B     @RC00058                                            0060
@RF00058 DS    0H                                                  0061
*       IF LINNO<FWRDZERO           /* LINNO SPCFD AS DIGIT          */
*         THEN                      /* YES,                          */
         ICM   @14,15,LINNO(DECBPT)                                0061
         BNM   @RF00061                                            0061
*         DO;                                                      0062
*           DIGAREA=ABS(LINNO);     /* COMPLEMENT THE DIGITC         */
         L     @14,IOBSTART(,IOBSTPTR)                             0063
         L     @12,LINNO(,DECBPT)                                  0063
         LPR   @12,@12                                             0063
         ST    @12,DIGAREA(,@14)                                   0063
*           WK1PTR=ADDR(DIGAREA)+THREE;/* POINT TO DIGIT             */
         L     WK1PTR,IOBSTART(,IOBSTPTR)                          0064
         LA    WK1PTR,DIGAREA(,WK1PTR)                             0064
         AH    WK1PTR,@CH00136                                     0064
*         END;                                                     0065
*       ELSE                        /* NO,SPCFD AS ADDR              */
*         WK1PTR=DECBLNNM;          /* INIT PTR TO USERS LNNM        */
         B     @RC00061                                            0066
@RF00061 L     WK1PTR,DECBLNNM(,DECBPT)                            0066
*     END;                                                         0067
@RC00061 DS    0H                                                  0068
*   IF LNNUMCMP=ZERO×               /* LINE NO=0 OR                  */
*       DCBEOPFG=ON×                /* EOP ON PREVIOUS READ OR       */
*       LNNUMCMP<DCBLNNUM           /* LT PREVIOUS LINE NO           */
*     THEN                          /* YES,                          */
@RC00058 CLI   LNNUMCMP(WK1PTR),0                                  0068
         BE    @RT00068                                            0068
         TM    DCBEOPFG+4(DCBPTR),B'10000000'                      0068
         BO    @RT00068                                            0068
         CLC   LNNUMCMP(1,WK1PTR),DCBLNNUM+4(DCBPTR)               0068
         BNL   @RF00068                                            0068
@RT00068 DS    0H                                                  0069
*     DO;                           /* ISSUE MESSAGE                 */
*       IEC042I=MESSAGE;            /* PUT MSG IN IOB WORK AREA      */
         L     @14,IOBSTART(,IOBSTPTR)                             0070
         MVC   IEC042I(67,@14),MESSAGE                             0070
*       WK2REG=LNNUMCMP;            /* SETUP REG FOR GEN CONV TO D   */
         SLR   WK2REG,WK2REG                                       0071
         IC    WK2REG,LNNUMCMP(,WK1PTR)                            0071
*       GEN REFS(WK2REG,XXXNO);                                    0072
WKDISP   EQU   88                       DISPLACEMENT INTO MESSAGE
         CVD   WK2REG,WKDISP(IOBSTPTR)  CONVERT NO TO DECIMAL
*       UNPK(XXXNOB,XXXNOC);        /* UNPACK NUMBER IN MSG          */
         L     @14,IOBSTART(,IOBSTPTR)                             0073
         L     @12,IOBSTART(,IOBSTPTR)                             0073
         UNPK  XXXNOB(4,@14),XXXNOC(2,@12)                         0073
*       SIGN=PLUSSIGN;              /* LET NUMBER PRINT              */
         L     @14,IOBSTART(,IOBSTPTR)                             0074
         OI    SIGN(@14),B'11110000'                               0074
*       XXXNOA=BLANKS;              /* BLANK OUT PART OF MSG         */
         L     @14,IOBSTART(,IOBSTPTR)                             0075
         MVC   XXXNOA(4,@14),@CC00725                              0075
*       YYYYTXT=RDLINENO;           /* SETUP MSG FOR LINE NO ERR     */
         L     @14,IOBSTART(,IOBSTPTR)                             0076
         MVC   YYYYTXT(12,@14),@CC00720                            0076
*       PLSRG1=ADDR(IEC042I);       /* SETUP REG 1 FOR WTO           */
         L     PLSRG1,IOBSTART(,IOBSTPTR)                          0077
         LA    PLSRG1,IEC042I(,PLSRG1)                             0077
*       GENERATE;                                                  0078
         WTO   MF=(E,(1))               ISSUE WRITE TO PROGRAMMER
*       IEC042I=IEC042I&&IEC042I;   /* ZERO OUT MSG AREA IN IOB      */
         L     @14,IOBSTART(,IOBSTPTR)                             0079
         XC    IEC042I(67,@14),IEC042I(@14)                        0079
*     END;                                                         0080
*   ELSE                                                           0081
*     ;                                                            0081
@RF00068 DS    0H                                                  0082
*   DCBLNNUM=LNNUMCMP;              /* INIT DCB FIELD WITH LINNO     */
         MVC   DCBLNNUM+4(1,DCBPTR),LNNUMCMP(WK1PTR)               0082
*   DIGAREA=FWRDZERO;               /* ZERO OUT DIGIT AREA         0083
*                                                                    */
         L     @14,IOBSTART(,IOBSTPTR)                             0083
         SLR   @12,@12                                             0083
         ST    @12,DIGAREA(,@14)                                   0083
*                                                                  0084
*/*                                                                  */
*                                                                  0084
*   /*****************************************************************/
*   /*                                                               */
*   /* SETUP LINE FORMAT NUMBER IN DCB FIELD                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0084
*/*                                                                  */
*                                                                  0084
*RDYDCBFN:                          /* READY DCB FORMAT NUMBER       */
*   IF LINFNO=NOTSPCFD              /* AND LINEFMAT KEYWORD SPCFD    */
*     THEN                          /* YES,BOTH CONDITIONS TRUE      */
RDYDCBFN ICM   @14,15,LINFNO(DECBPT)                               0084
         BNZ   @RF00084                                            0084
*     IF DCBLFMAT=INVLDFNO          /* HAS FILE BEEN READ FROM       */
*       THEN                        /* NO, ISSUE MSG                 */
         CLI   DCBLFMAT+4(DCBPTR),255                              0085
         BNE   @RF00085                                            0085
*       DO;                                                        0086
*         IEC042I=MESSAGE;          /* PUT MSG IN IOB WORK AREA      */
         L     @14,IOBSTART(,IOBSTPTR)                             0087
         MVC   IEC042I(67,@14),MESSAGE                             0087
*         XXXNO=XXXNOCT;                                           0088
         L     @14,IOBSTART(,IOBSTPTR)                             0088
         MVC   XXXNO(8,@14),@CC00723                               0088
*         YYYYTXT=NOLINEFM;                                        0089
         L     @14,IOBSTART(,IOBSTPTR)                             0089
         MVC   YYYYTXT(12,@14),@CC00714                            0089
*         PLSRG1=ADDR(IEC042I);     /* SETUP REG 1 FOR WTO           */
         L     PLSRG1,IOBSTART(,IOBSTPTR)                          0090
         LA    PLSRG1,IEC042I(,PLSRG1)                             0090
*         GENERATE;                                                0091
         WTO   MF=(E,(1))               ISSUE WRITE TO PROGRAMMER
*         IEC042I=IEC042I&&IEC042I; /* ZERO OUT MSG AREA IN IOB      */
         L     @14,IOBSTART(,IOBSTPTR)                             0092
         XC    IEC042I(67,@14),IEC042I(@14)                        0092
*       END;                                                       0093
*     ELSE                                                         0094
*       ;                                                          0094
@RF00085 DS    0H                                                  0095
*   ELSE                            /* NO,                           */
*     DO;                                                          0095
         B     @RC00084                                            0095
@RF00084 DS    0H                                                  0096
*       IF LINFNO<FWRDZERO          /* LINEFMAT NO = DIGIT           */
*         THEN                      /* YES,                          */
         ICM   @14,15,LINFNO(DECBPT)                               0096
         BNM   @RF00096                                            0096
*         DO;                                                      0097
*           DIGAREA=ABS(LINFNO)-ONE;/* FIND LINE FMAT NO             */
         L     @14,IOBSTART(,IOBSTPTR)                             0098
         L     @12,LINFNO(,DECBPT)                                 0098
         LPR   @12,@12                                             0098
         BCTR  @12,0                                               0098
         ST    @12,DIGAREA(,@14)                                   0098
*           WK1PTR=ADDR(DIGAREA)+THREE;/* POINT TO DIGIT             */
         L     WK1PTR,IOBSTART(,IOBSTPTR)                          0099
         LA    WK1PTR,DIGAREA(,WK1PTR)                             0099
         AH    WK1PTR,@CH00136                                     0099
*         END;                                                     0100
*       ELSE                        /* ,LINEFMAT = ADDRESS           */
*         WK1PTR=DECBLFMT;          /* INIT PTR TO USERS LFMATNO     */
         B     @RC00096                                            0101
@RF00096 L     WK1PTR,DECBLFMT(,DECBPT)                            0101
*       DCBLFMAT=LNFNOCMP;          /* MOVE NEW FMAT NO TO DCB       */
@RC00096 MVC   DCBLFMAT+4(1,DCBPTR),LNFNOCMP(WK1PTR)               0102
*       DIGAREA=FWRDZERO;           /* ZERO OUT DIGIT AREA           */
         L     @14,IOBSTART(,IOBSTPTR)                             0103
         SLR   @12,@12                                             0103
         ST    @12,DIGAREA(,@14)                                   0103
*       IF DCBLFMAT>FMNOLMT         /* FMAT NO > 63                  */
*         THEN                      /* YES,SETUP & ISSUE MSG         */
         CLI   DCBLFMAT+4(DCBPTR),63                               0104
         BNH   @RF00104                                            0104
*         DO;                                                      0105
*           IEC042I=MESSAGE;        /* PUT MSG IN IOB WORK AREA      */
         L     @14,IOBSTART(,IOBSTPTR)                             0106
         MVC   IEC042I(67,@14),MESSAGE                             0106
*           WK2REG=DCBLFMAT;        /* SETUP REG FOR GEN INSTRUC     */
         SLR   WK2REG,WK2REG                                       0107
         IC    WK2REG,DCBLFMAT+4(,DCBPTR)                          0107
*           GEN REFS(WK2REG,XXXNO);                                0108
         CVD   WK2REG,WKDISP(IOBSTPTR)  CONVERT NO TO DECIMAL
*           UNPK(XXXNOB,XXXNOC);    /* UNPACK - INVLD FMAT NO        */
         L     @14,IOBSTART(,IOBSTPTR)                             0109
         L     @12,IOBSTART(,IOBSTPTR)                             0109
         UNPK  XXXNOB(4,@14),XXXNOC(2,@12)                         0109
*           SIGN=PLUSSIGN;          /* LET NUMBER PRINT              */
         L     @14,IOBSTART(,IOBSTPTR)                             0110
         OI    SIGN(@14),B'11110000'                               0110
*           XXXNOA=BLANKS;          /* BLANK OUT PART OF MSG         */
         L     @14,IOBSTART(,IOBSTPTR)                             0111
         MVC   XXXNOA(4,@14),@CC00725                              0111
*           YYYYTXT=LINEFMAT;       /* MOVE IN MSG TEST              */
         L     @14,IOBSTART(,IOBSTPTR)                             0112
         MVC   YYYYTXT(12,@14),@CC00717                            0112
*           PLSRG1=ADDR(IEC042I);   /* SETUP REG FOR WTO             */
         L     PLSRG1,IOBSTART(,IOBSTPTR)                          0113
         LA    PLSRG1,IEC042I(,PLSRG1)                             0113
*           GENERATE;                                              0114
         WTO   MF=(E,(1))               ISSUE WRITE TO PROGRAMMER
*           IEC042I=IEC042I&&IEC042I;/* ZERO OUT MSG AREA IN IOB     */
         L     @14,IOBSTART(,IOBSTPTR)                             0115
         XC    IEC042I(67,@14),IEC042I(@14)                        0115
*         END;                                                     0116
*       ELSE                                                       0117
*         ;                                                        0117
@RF00104 DS    0H                                                  0118
*     END;                                                         0118
*   DATCOUNT=DCBBLKSI+HDRCNT;       /* SETUP DATA COUNT IN CCW       */
@RC00084 L     @14,IOBSTART(,IOBSTPTR)                             0119
         LA    @12,20                                              0119
         AH    @12,DCBBLKSI+52(,DCBPTR)                            0119
         STH   @12,DATCOUNT(,@14)                                  0119
*   IOBREAD=ON;                     /* TURN ON READ BIT IN IOB       */
         LR    @14,IOBSTPTR                                        0120
         AL    @14,@CF00977                                        0120
         OI    IOBREAD-8(@14),B'00100000'                          0120
*   DCBIOBA=LASTIOB;                /* LOAD ADDR OF IOB IN DCB       */
         L     @14,DCBIOBA+52(,DCBPTR)                             0121
         SLR   @12,@12                                             0121
         ICM   @12,7,LASTIOB(@14)                                  0121
         ST    @12,DCBIOBA+52(,DCBPTR)                             0121
*   IOBSTPTR=IOBSTPTR-PREFLNTH;     /* POINT IOB TO SAM IOB          */
         SH    IOBSTPTR,@CH00032                                   0122
*   ENTERG=DCBEOBRA;                /* SETUP REG FOR EOB BALR        */
         SLR   ENTERG,ENTERG                                       0123
         ICM   ENTERG,7,DCBEOBRA+72(DCBPTR)                        0123
*   CALL EOBROUT;                   /* BALR TO END-OF-BLK ROUTINE    */
         BALR  @14,@15                                             0124
*   END IGG019LU                                                   0125
*                                                                  0125
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSUT5  (TOPSEGMT)                                       */
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */
*/*%INCLUDE SYSUT5  (DECLARES)                                       */
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */
*/*%INCLUDE SYSUT5  (DCLREGCT)                                       */
*/*%INCLUDE SYSLIB  (IHADECB )                                       */
*/*%INCLUDE SYSUT5  (RDYDCBLN)                                       */
*/*%INCLUDE SYSUT5  (RDYDCBFN)                                       */
*                                                                  0125
*       ;                                                          0125
@EL00001 DS    0H                                                  0125
@EF00001 DS    0H                                                  0125
@ER00001 LM    @14,@12,12(@13)                                     0125
         BR    @14                                                 0125
@DATA    DS    0H
@CH00136 DC    H'3'
@CH00032 DC    H'8'
         DS    0F
         DS    0F
@CF00977 DC    F'-8'
         DS    0D
@CC00725 DC    C'    '
@CC00723 DC    C'        '
@CC00714 DC    C'NO LINE FMAT'
@CC00717 DC    C'LINEFMAT    '
@CC00720 DC    C'RD LINENO   '
MTAREA   DS    CL100
IGG019LU CSECT
MESSAGE  WTO   'IEC042I INVALID DATA  - XXXXXXXX SPECIFIED FOR YYYYYYYYX
               YYYY',MF=L,ROUTCDE=11,DESC=6
IGG019LU CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
DCBPTR   EQU   @02
IOBSTPTR EQU   @03
WK1PTR   EQU   @04
ENTERG   EQU   @15
PLSRG1   EQU   @01
WK2REG   EQU   @05
DECBPT   EQU   @06
BASREG   EQU   @08
IHADCB   EQU   0
IHADCS07 EQU   0
DCBWTOID EQU   IHADCS07
IHADCS08 EQU   0
DCBERRCN EQU   IHADCS08
DCBLNNUM EQU   DCBERRCN
DCBERRCA EQU   DCBERRCN+1
DCBLFMAT EQU   DCBERRCA
DCBORFLG EQU   DCBERRCA+1
DCBEOPFG EQU   DCBORFLG
DCBDSPLY EQU   IHADCS08+4
DCBFRID  EQU   DCBDSPLY
DCBRESCN EQU   IHADCS08+8
DCBRDLNE EQU   DCBRESCN
DCBFRTBA EQU   DCBRDLNE
DCBRESCA EQU   DCBFRTBA+1
DCBORBYT EQU   IHADCS08+12
DCBEIB   EQU   IHADCS08+14
IHADCS11 EQU   0
DCBRELB  EQU   IHADCS11
DCBREL   EQU   DCBRELB+1
DCBBUFCB EQU   IHADCS11+4
DCBDSORG EQU   IHADCS11+10
DCBDSRG1 EQU   DCBDSORG
DCBDSRG2 EQU   DCBDSORG+1
DCBIOBAD EQU   IHADCS11+12
DCBODEB  EQU   DCBIOBAD
DCBLNP   EQU   DCBODEB
DCBQSLM  EQU   DCBLNP
DCBIOBAA EQU   DCBODEB+1
IHADCS50 EQU   0
DCBSVCXL EQU   IHADCS50
DCBEODAD EQU   IHADCS50+4
DCBBFALN EQU   DCBEODAD
DCBHIARC EQU   DCBBFALN
DCBBFTEK EQU   DCBHIARC
DCBBFT   EQU   DCBBFTEK
DCBEXLST EQU   IHADCS50+8
DCBRECFM EQU   DCBEXLST
DCBRECLA EQU   DCBRECFM
IHADCS24 EQU   0
DCBOFLGS EQU   IHADCS24+8
DCBOFLWR EQU   DCBOFLGS
DCBIFLG  EQU   IHADCS24+9
DCBMACR  EQU   IHADCS24+10
DCBMACR1 EQU   DCBMACR
DCBMRFE  EQU   DCBMACR1
DCBMRGET EQU   DCBMRFE
DCBMRAPG EQU   DCBMACR1
DCBMRRD  EQU   DCBMRAPG
DCBMRCI  EQU   DCBMACR1
DCBMRMVG EQU   DCBMRCI
DCBMRLCG EQU   DCBMACR1
DCBMRABC EQU   DCBMACR1
DCBMRPT1 EQU   DCBMRABC
DCBMRSBG EQU   DCBMRPT1
DCBMRCRL EQU   DCBMACR1
DCBMRCHK EQU   DCBMRCRL
DCBMRRDX EQU   DCBMRCHK
DCBMRDMG EQU   DCBMACR1
DCBMACR2 EQU   DCBMACR+1
DCBMRPUT EQU   DCBMACR2
DCBMRWRT EQU   DCBMACR2
DCBMRMVP EQU   DCBMACR2
DCBMR5WD EQU   DCBMACR2
DCBMRLDM EQU   DCBMR5WD
DCBMRLCP EQU   DCBMRLDM
DCBMR4WD EQU   DCBMACR2
DCBMRPT2 EQU   DCBMR4WD
DCBMRTMD EQU   DCBMRPT2
DCBMR3WD EQU   DCBMACR2
DCBMRCTL EQU   DCBMR3WD
DCBMRSTK EQU   DCBMRCTL
DCBMR1WD EQU   DCBMACR2
DCBMRSWA EQU   DCBMR1WD
DCBMRDMD EQU   DCBMRSWA
IHADCS25 EQU   0
DCBMACRF EQU   IHADCS25+2
DCBMACF1 EQU   DCBMACRF
DCBMFFE  EQU   DCBMACF1
DCBMFGET EQU   DCBMFFE
DCBMFAPG EQU   DCBMACF1
DCBMFRD  EQU   DCBMFAPG
DCBMFCI  EQU   DCBMACF1
DCBMFMVG EQU   DCBMFCI
DCBMFLCG EQU   DCBMACF1
DCBMFABC EQU   DCBMACF1
DCBMFPT1 EQU   DCBMFABC
DCBMFSBG EQU   DCBMFPT1
DCBMFCRL EQU   DCBMACF1
DCBMFCHK EQU   DCBMFCRL
DCBMFDMG EQU   DCBMACF1
DCBMACF2 EQU   DCBMACRF+1
DCBMFPUT EQU   DCBMACF2
DCBMFWRT EQU   DCBMACF2
DCBMFMVP EQU   DCBMACF2
DCBMF5WD EQU   DCBMACF2
DCBMFLDM EQU   DCBMF5WD
DCBMFLCP EQU   DCBMFLDM
DCBMF4WD EQU   DCBMACF2
DCBMFPT2 EQU   DCBMF4WD
DCBMFTMD EQU   DCBMFPT2
DCBMF3WD EQU   DCBMACF2
DCBMFCTL EQU   DCBMF3WD
DCBMFSTK EQU   DCBMFCTL
DCBMF1WD EQU   DCBMACF2
DCBMFSWA EQU   DCBMF1WD
DCBMFDMD EQU   DCBMFSWA
DCBDEBAD EQU   IHADCS25+4
DCBIFLGS EQU   DCBDEBAD
IHADCS26 EQU   0
DCBWRITE EQU   IHADCS26
DCBREAD  EQU   DCBWRITE
DCBWRITA EQU   DCBREAD+1
IHADCS27 EQU   0
DCBGET   EQU   IHADCS27
DCBPUT   EQU   DCBGET
DCBGETA  EQU   DCBPUT+1
IHADCS36 EQU   0
DCBGERR  EQU   IHADCS36
DCBPERR  EQU   DCBGERR
DCBCHECK EQU   DCBPERR
DCBOPTCD EQU   DCBCHECK
DCBOPTH  EQU   DCBOPTCD
DCBOPTO  EQU   DCBOPTH
DCBOPTZ  EQU   DCBOPTCD
DCBGERRA EQU   DCBCHECK+1
DCBPERRA EQU   DCBGERRA
DCBSYNAD EQU   IHADCS36+4
DCBCIND1 EQU   IHADCS36+8
DCBCIND2 EQU   IHADCS36+9
DCBBLKSI EQU   IHADCS36+10
DCBIOBA  EQU   IHADCS36+16
DCBCICB  EQU   DCBIOBA
IHADCS52 EQU   0
DCBDIRCT EQU   IHADCS52
DCBQSWS  EQU   DCBDIRCT
DCBUSASI EQU   DCBQSWS
DCBQADFS EQU   DCBUSASI
DCBBUFOF EQU   DCBDIRCT+1
IHADCS37 EQU   0
DCBFLAG1 EQU   IHADCS37
IHADCS38 EQU   0
DCBEOBR  EQU   IHADCS38
DCBEOBRA EQU   DCBEOBR+1
DCBPOINT EQU   IHADCS38+12
DCBCNTRL EQU   DCBPOINT
IHADCS40 EQU   0
DCBEOBAD EQU   IHADCS40
DCBCCCW  EQU   IHADCS40+4
DCBRECAD EQU   DCBCCCW
DCBRECBT EQU   DCBRECAD
DCBRCREL EQU   DCBRECBT
@NM00031 EQU   IHADCS40+12
DCBEROPT EQU   @NM00031
IOBSTRNG EQU   0
LASTIOB  EQU   IOBSTRNG+1
IOBPREFX EQU   0
IOBCFLG1 EQU   IOBPREFX
IOBSTDRD EQU   0
IOBFLAG1 EQU   IOBSTDRD
IOBCYCCK EQU   IOBFLAG1
IOBRSTRT EQU   IOBFLAG1
IOBFLAG2 EQU   IOBSTDRD+1
IOBPURGE EQU   IOBFLAG2
IOBRDHA0 EQU   IOBFLAG2
IOBSENS0 EQU   IOBSTDRD+2
IOBS0B7  EQU   IOBSENS0
IOBSENS1 EQU   IOBSTDRD+3
IOBECBPT EQU   IOBSTDRD+4
IOBFLAG3 EQU   IOBSTDRD+8
IOBFL3   EQU   IOBFLAG3
IOBCSW   EQU   IOBSTDRD+9
IOBIOCSW EQU   IOBCSW
IOBSTART EQU   IOBSTDRD+16
IOBDCBPT EQU   IOBSTDRD+20
IOBFLAG4 EQU   IOBDCBPT
IOBRESTR EQU   IOBSTDRD+24
IOBINCAM EQU   IOBSTDRD+28
IOBBTAMF EQU   IOBINCAM
LNNUMCMP EQU   0
LNFNOCMP EQU   0
EOBROUT  EQU   0
CCWSDATA EQU   0
DATCOUNT EQU   CCWSDATA+22
DATAREA  EQU   CCWSDATA+24
DIGAREA  EQU   DATAREA
IEC042I  EQU   DATAREA+4
XXXNO    EQU   IEC042I+28
XXXNOA   EQU   XXXNO
XXXNOB   EQU   XXXNO+4
XXXNOC   EQU   XXXNOB+2
SIGN     EQU   XXXNOC+1
YYYYTXT  EQU   IEC042I+51
DECB     EQU   0
DECBPTR  EQU   DECB+4
DECTYPE  EQU   DECBPTR
DECTYPE1 EQU   DECTYPE
DECTYPE2 EQU   DECTYPE+1
DECRDSF  EQU   DECTYPE2
DECWRSFR EQU   DECTYPE2
DECDCBAD EQU   DECB+8
DECIOBPT EQU   DECB+16
DECNEXT  EQU   DECB+20
DECBS01  EQU   0
DECBECB  EQU   DECBS01
DECBRB   EQU   DECBECB
DECBECBF EQU   DECBRB
DECBTYP1 EQU   DECBS01+4
DECBTYP2 EQU   DECBS01+5
DECBEXC1 EQU   DECBS01+24
DECBEXC2 EQU   DECBS01+25
DECBS02  EQU   0
@NM00047 EQU   DECBS02
DECCC2   EQU   @NM00047+1
DECCC3   EQU   @NM00047+2
@NM00049 EQU   DECBS02+4
@NM00050 EQU   @NM00049
@NM00051 EQU   @NM00049+1
DECTYPRU EQU   @NM00051
DECNA    EQU   DECBS02+28
DECBS03  EQU   0
DECCPOL  EQU   DECBS03+20
@NM00059 EQU   DECBS03+36
DECBS04  EQU   0
@NM00062 EQU   DECBS04+4
@NM00063 EQU   @NM00062
@NM00066 EQU   DECBS04+8
DECBUFCT EQU   @NM00066
DECONLTT EQU   DECBUFCT
DECENTRY EQU   DECBS04+20
DECFLAGS EQU   DECBS04+24
DECWACK  EQU   DECFLAGS
DECREVRS EQU   DECFLAGS
DECERRST EQU   DECBS04+29
DECPOLPT EQU   DECBS04+36
IOBORG01 EQU   IOBPREFX+8
IOBNIOBA EQU   IOBORG01
IOBNFLG1 EQU   IOBNIOBA
IOBREAD  EQU   IOBNFLG1
IOBORG02 EQU   IOBPREFX+8
IOBDQADA EQU   IOBORG02
IOBDEQIN EQU   IOBDQADA
IOBORG03 EQU   IOBPREFX+12
IOBORG04 EQU   IOBINCAM
IOBORG12 EQU   IOBINCAM
IOBFL4   EQU   IOBORG12
IOBEXTEN EQU   IOBSTDRD+32
IOBSEEK  EQU   IOBEXTEN
IOBBB    EQU   IOBSEEK+1
IOBCC    EQU   IOBSEEK+3
IOBHH    EQU   IOBSEEK+5
IOBORG05 EQU   IOBEXTEN
IOBORG06 EQU   IOBEXTEN
IOBNXTPT EQU   IOBORG06+4
IOBSTATA EQU   IOBNXTPT
IOBORG07 EQU   IOBEXTEN+8
W1IEXTEN EQU   IOBORG07
IOBORG08 EQU   IOBEXTEN+8
IOBINDCT EQU   IOBORG08+4
IOBUNSQR EQU   IOBORG08+5
IOBFCHAD EQU   IOBORG08+8
IOBORG09 EQU   IOBEXTEN+8
IOBDPLAD EQU   IOBORG09+4
IOBDTYPE EQU   IOBORG09+8
IOBDTYP2 EQU   IOBORG09+9
IOBDSTAT EQU   IOBORG09+10
IOBSTAT1 EQU   IOBDSTAT
IOBORG10 EQU   IOBEXTEN+8
IOBSEEK2 EQU   IOBORG10
IOBORG11 EQU   IOBEXTEN
IOBERCT  EQU   IOBORG11
IOBUCBXV EQU   IOBERCT
IOBNAME  EQU   IOBORG11+4
DECBS05  EQU   DECNEXT
DECBLNNM EQU   DECBS05+4
DECBLFMT EQU   DECBS05+8
LINNO    EQU   DECBLNNM
LINFNO   EQU   DECBLFMT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
DECBHDRA EQU   DECBS05
IOBCSWSV EQU   IOBORG11+17
IOBSENSV EQU   IOBORG11+16
IOBRCD   EQU   IOBORG11+12
IOBMDREC EQU   IOBORG11+8
IOBNAMEA EQU   IOBNAME+1
IOBNAMSZ EQU   IOBNAME
IOBERCTA EQU   IOBERCT+1
IOBRTYPE EQU   IOBUCBXV
IOBRDCHP EQU   IOBORG10+20
IOBNEXTA EQU   IOBORG10+16
IOBREADA EQU   IOBORG10+12
IOBBUFC  EQU   IOBORG10+8
IOBSK2R  EQU   IOBSEEK2+7
IOBSK2HH EQU   IOBSEEK2+5
IOBSK2CC EQU   IOBSEEK2+3
IOBSK2BB EQU   IOBSEEK2+1
IOBSK2M  EQU   IOBSEEK2
IOBCHNPR EQU   IOBORG09+40
IOBDNCRF EQU   IOBORG09+32
IOBRSV35 EQU   IOBORG09+24
IOBDQPTR EQU   IOBORG09+20
IOBRSV34 EQU   IOBORG09+18
IOBDBYTN EQU   IOBORG09+16
IOBDCPND EQU   IOBORG09+12
IOBSTAT2 EQU   IOBDSTAT+1
IOBSIORT EQU   IOBSTAT1
IOBADDVU EQU   IOBSTAT1
IOBBUFF  EQU   IOBSTAT1
IOBENQUE EQU   IOBSTAT1
IOBPASS2 EQU   IOBSTAT1
IOBSYNCH EQU   IOBSTAT1
IOBNEWVL EQU   IOBSTAT1
IOBABNRM EQU   IOBSTAT1
IOBRELEX EQU   IOBDTYP2
IOBADDTY EQU   IOBDTYP2
IOBTYPE  EQU   IOBDTYP2
IOBRQUST EQU   IOBDTYP2
IOBSUFFX EQU   IOBDTYP2
IOBSBLKL EQU   IOBDTYP2
IOBSKEY  EQU   IOBDTYP2
IOBRELBL EQU   IOBDTYPE
IOBRDEXC EQU   IOBDTYPE
IOBDYNBF EQU   IOBDTYPE
IOBACTAD EQU   IOBDTYPE
IOBFDBCK EQU   IOBDTYPE
IOBEXTSC EQU   IOBDTYPE
IOBOVFLO EQU   IOBDTYPE
IOBVERFY EQU   IOBDTYPE
IOBDPLB  EQU   IOBDPLAD+1
IOBDAYLI EQU   IOBDPLAD
IOBDIOBS EQU   IOBORG09+2
IOBDBYTR EQU   IOBORG09
IOBBCHAD EQU   IOBORG08+12
IOBFCHNB EQU   IOBFCHAD+1
IOBCOUNT EQU   IOBFCHAD
IOBASYN  EQU   IOBORG08+7
IOBAPP   EQU   IOBORG08+6
IOBRSV32 EQU   IOBUNSQR
IOBRSV31 EQU   IOBUNSQR
IOBRSV30 EQU   IOBUNSQR
IOBKNRWR EQU   IOBUNSQR
IOBKNWR  EQU   IOBUNSQR
IOBNTAV2 EQU   IOBUNSQR
IOBNTAV1 EQU   IOBUNSQR
IOBCPBSY EQU   IOBUNSQR
IOBCHNNL EQU   IOBINDCT
IOBRSV29 EQU   IOBINDCT
IOBRSV28 EQU   IOBINDCT
IOBRSV27 EQU   IOBINDCT
IOBKEYAD EQU   IOBINDCT
IOBOVPTR EQU   IOBINDCT
IOBUNSCH EQU   IOBINDCT
IOBDEQCP EQU   IOBINDCT
IOBCCWAD EQU   IOBORG08
W1OEXTEN EQU   W1IEXTEN
IOBCCW   EQU   IOBORG06+8
IOBNXTPB EQU   IOBNXTPT+1
IOBRSV26 EQU   IOBSTATA
IOBRSV25 EQU   IOBSTATA
IOBRSV24 EQU   IOBSTATA
IOBRSV23 EQU   IOBSTATA
IOBRSV22 EQU   IOBSTATA
IOBRSV21 EQU   IOBSTATA
IOBRSV20 EQU   IOBSTATA
IOBAVLFL EQU   IOBSTATA
IOBRSV37 EQU   IOBORG06+1
IOBUCBXG EQU   IOBORG06
IOBCPA   EQU   IOBORG05+32
IOBERINF EQU   IOBORG05+16
IOBERCCW EQU   IOBORG05+8
IOBSNDPT EQU   IOBORG05+7
IOBRCVPT EQU   IOBORG05+6
IOBWORK  EQU   IOBORG05+1
IOBUCBX  EQU   IOBORG05
IOBR     EQU   IOBSEEK+7
IOBHH2   EQU   IOBHH+1
IOBHH1   EQU   IOBHH
IOBCC2   EQU   IOBCC+1
IOBCC1   EQU   IOBCC
IOBBB2   EQU   IOBBB+1
IOBBB1   EQU   IOBBB
IOBM     EQU   IOBSEEK
IOBRSV46 EQU   IOBFL4
IOBRSV47 EQU   IOBFL4
IOBENT   EQU   IOBFL4
IOBEQP   EQU   IOBFL4
IOBBUS   EQU   IOBFL4
IOBDCK   EQU   IOBFL4
IOBREJ   EQU   IOBFL4
IOBOVR   EQU   IOBFL4
IOBCRILC EQU   IOBORG04+1
IOBCRDCC EQU   IOBORG04
IOBGQECB EQU   IOBORG03
IOBSWAP  EQU   IOBORG02+4
IOBDQADB EQU   IOBDQADA+1
IOBRSV13 EQU   IOBDEQIN
IOBRSV12 EQU   IOBDEQIN
IOBRSV11 EQU   IOBDEQIN
IOBRSV10 EQU   IOBDEQIN
IOBRSV09 EQU   IOBDEQIN
IOBRSV08 EQU   IOBDEQIN
IOBRSV07 EQU   IOBDEQIN
IOBDEQ   EQU   IOBDEQIN
IOBNECB  EQU   IOBORG01+4
IOBNIOBB EQU   IOBNIOBA+1
IOBFIRST EQU   IOBNFLG1
IOBUPERR EQU   IOBNFLG1
IOBSPAN  EQU   IOBNFLG1
IOBBKSPC EQU   IOBNFLG1
IOBUPDAT EQU   IOBNFLG1
IOBWRITE EQU   IOBNFLG1
IOBPRTOV EQU   IOBNFLG1
DECWAREA EQU   DECBS04+44
DECWLNG  EQU   DECBS04+42
DECRSV56 EQU   DECBS04+40
DECPOLPA EQU   DECPOLPT+1
DECNDXPL EQU   DECPOLPT
DECADRPT EQU   DECBS04+32
DECCSWST EQU   DECBS04+30
DECRSV55 EQU   DECERRST
DECRSV54 EQU   DECERRST
DECRSV53 EQU   DECERRST
DECDSABL EQU   DECERRST
DECDIAGN EQU   DECERRST
DECERPER EQU   DECERRST
DECUNDEF EQU   DECERRST
DECSIO3  EQU   DECERRST
DECTPCOD EQU   DECBS04+28
DECRESPN EQU   DECBS04+26
DECRLN   EQU   DECBS04+25
DECSTXNQ EQU   DECFLAGS
DECSSMSG EQU   DECREVRS
DECNEGRP EQU   DECFLAGS
DECNOBUF EQU   DECFLAGS
DECBADID EQU   DECFLAGS
DECALTAC EQU   DECFLAGS
DECDIFAC EQU   DECWACK
DECERRMS EQU   DECWACK
DECENTRA EQU   DECENTRY+1
DECCMCOD EQU   DECENTRY
DECCOUNT EQU   DECBS04+18
DECSENS1 EQU   DECBS04+17
DECSENS0 EQU   DECBS04+16
@NM00067 EQU   DECBS04+12
DECDCBAA EQU   @NM00066+1
DECRSV52 EQU   DECONLTT
DECRSV51 EQU   DECONLTT
DECRSV50 EQU   DECONLTT
DECRSV49 EQU   DECONLTT
DECRSV48 EQU   DECONLTT
DECRSV47 EQU   DECONLTT
DECRCVMS EQU   DECONLTT
DECONLTS EQU   DECONLTT
@NM00065 EQU   DECBS04+6
@NM00064 EQU   @NM00062+1
DECSLNTH EQU   @NM00063
DECSAREA EQU   @NM00063
DECSTRME EQU   @NM00063
DECRSV46 EQU   @NM00063
DECRSV45 EQU   @NM00063
DECRSV44 EQU   @NM00063
DECRSV43 EQU   @NM00063
DECRDAPL EQU   @NM00063
@NM00061 EQU   DECBS04
@NM00060 EQU   @NM00059+1
DECRSV42 EQU   @NM00059
DECADRCH EQU   DECBS03+32
DECRSV41 EQU   DECBS03+28
DECRSV40 EQU   DECBS03+26
DECUCBDX EQU   DECBS03+25
DECRSV39 EQU   DECBS03+24
DECCPOLA EQU   DECCPOL+1
DECNMMSG EQU   DECCPOL
DECRSV38 EQU   DECBS03+16
@NM00058 EQU   DECBS03+12
@NM00057 EQU   DECBS03+8
@NM00056 EQU   DECBS03+6
DECOPCOD EQU   DECBS03+5
DECRSV37 EQU   DECBS03+4
LINEDECB EQU   DECBS03
DECNAA   EQU   DECNA+1
DECRSV36 EQU   DECNA
DECRECPT EQU   DECBS02+24
DECKYADR EQU   DECBS02+20
@NM00055 EQU   DECBS02+16
@NM00054 EQU   DECBS02+12
@NM00053 EQU   DECBS02+8
@NM00052 EQU   DECBS02+6
DECRSV35 EQU   @NM00051
DECWRADD EQU   @NM00051
DECSRKEY EQU   @NM00051
DECOPRD  EQU   @NM00051
DECTYPR  EQU   DECTYPRU
DECTYPU  EQU   DECTYPRU
DECBKLNS EQU   @NM00051
DECKEYS  EQU   @NM00051
DECRELBA EQU   @NM00050
DECRDEX  EQU   @NM00050
DECDYNBF EQU   @NM00050
DECACTAD EQU   @NM00050
DECFDBCK EQU   @NM00050
DECEXSRC EQU   @NM00050
DECOFLOW EQU   @NM00050
DECVERFY EQU   @NM00050
DECRSV34 EQU   @NM00047+3
DECCCKFF EQU   DECCC3
DECCCOPT EQU   DECCC3
DECCCSDK EQU   DECCC3
DECCCWDI EQU   DECCC3
DECCCNBK EQU   DECCC3
DECCCEXS EQU   DECCC3
DECCCWRI EQU   DECCC3
DECRSV33 EQU   DECCC3
DECCCREX EQU   DECCC2
DECCCUER EQU   DECCC2
DECCCEOD EQU   DECCC2
DECCCERR EQU   DECCC2
DECCCINV EQU   DECCC2
DECCCNSP EQU   DECCC2
DECCCRLC EQU   DECCC2
DECCCRNF EQU   DECCC2
@NM00048 EQU   @NM00047
DECEXRKU EQU   DECBEXC2
DECEXASR EQU   DECBEXC2
DECRSV32 EQU   DECBEXC2
DECRSV31 EQU   DECBEXC2
DECRSV30 EQU   DECBEXC2
DECRSV29 EQU   DECBEXC2
DECRSV28 EQU   DECBEXC2
DECRSV27 EQU   DECBEXC2
DECEXDUP EQU   DECBEXC1
DECEXOFL EQU   DECBEXC1
DECEXUBK EQU   DECBEXC1
DECEXERR EQU   DECBEXC1
DECEXINV EQU   DECBEXC1
DECEXNSP EQU   DECBEXC1
DECEXRLC EQU   DECBEXC1
DECEXRNF EQU   DECBEXC1
DECBKEY  EQU   DECBS01+20
DECBLOGR EQU   DECBS01+16
DECBAREA EQU   DECBS01+12
DECBDCBA EQU   DECBS01+8
DECBLGTH EQU   DECBS01+6
DECRSV26 EQU   DECBTYP2
DECRSV25 EQU   DECBTYP2
DECBWRKN EQU   DECBTYP2
DECBWRK  EQU   DECBTYP2
DECRSV24 EQU   DECBTYP2
DECBRDKU EQU   DECBTYP2
DECRSV23 EQU   DECBTYP2
DECBRDK  EQU   DECBTYP2
DECBARS  EQU   DECBTYP1
DECBLNS  EQU   DECBTYP1
DECRSV22 EQU   DECBTYP1
DECRSV21 EQU   DECBTYP1
DECRSV20 EQU   DECBTYP1
DECRSV19 EQU   DECBTYP1
DECRSV18 EQU   DECBTYP1
DECRSV17 EQU   DECBTYP1
DECBRBA  EQU   DECBRB+1
DECRSV16 EQU   DECBECBF
DECRSV15 EQU   DECBECBF
DECRSV14 EQU   DECBECBF
DECRSV13 EQU   DECBECBF
DECRSV12 EQU   DECBECBF
DECRSV11 EQU   DECBECBF
DECBPOST EQU   DECBECBF
DECBWAIT EQU   DECBECBF
DECNEXTA EQU   DECNEXT+1
DECRSV10 EQU   DECNEXT
DECAREA  EQU   DECB+12
DECLNGTH EQU   DECBPTR+2
DECRSV09 EQU   DECTYPE2
DECWRSZ  EQU   DECTYPE2
DECRSV08 EQU   DECTYPE2
DECWRSD  EQU   DECTYPE2
DECWRSF  EQU   DECTYPE2
DECRDSB  EQU   DECTYPE2
DECRSV07 EQU   DECTYPE1
DECRSV06 EQU   DECTYPE1
DECRSV05 EQU   DECTYPE1
DECRSV04 EQU   DECTYPE1
DECRSV03 EQU   DECTYPE1
DECRSV02 EQU   DECTYPE1
DECRSV01 EQU   DECTYPE1
DECLNS   EQU   DECTYPE1
DECSDECB EQU   DECB
@NM00046 EQU   DATAREA+71
@NM00045 EQU   IEC042I+63
@NM00044 EQU   IEC042I+36
@NM00043 EQU   XXXNOC+1
@NM00042 EQU   XXXNOC
@NM00041 EQU   XXXNOB
@NM00040 EQU   IEC042I+4
@NM00039 EQU   IEC042I
@NM00038 EQU   CCWSDATA+16
@NM00037 EQU   CCWSDATA+8
@NM00036 EQU   CCWSDATA
IOBERRCT EQU   IOBSTDRD+30
IOBRSV19 EQU   IOBINCAM+1
IOBOLTST EQU   IOBBTAMF
IOBRFTMG EQU   IOBBTAMF
IOBRSV17 EQU   IOBBTAMF
IOBRSV16 EQU   IOBBTAMF
IOBRSV15 EQU   IOBBTAMF
IOBRSV14 EQU   IOBBTAMF
IOBINUSE EQU   IOBBTAMF
IOBPRMER EQU   IOBBTAMF
IOBRSTRB EQU   IOBRESTR+1
IOBREPOS EQU   IOBRESTR
IOBDCBPB EQU   IOBDCBPT+1
IOBRSV44 EQU   IOBFLAG4
IOBRSV43 EQU   IOBFLAG4
IOBRSV42 EQU   IOBFLAG4
IOBRSV41 EQU   IOBFLAG4
IOBRSV40 EQU   IOBFLAG4
IOBRSV39 EQU   IOBFLAG4
IOBRSV38 EQU   IOBFLAG4
IOBGDPOL EQU   IOBFLAG4
IOBSTRTB EQU   IOBSTART+1
IOBSIOCC EQU   IOBSTART
IOBSTBYT EQU   IOBIOCSW+3
IOBCMDA  EQU   IOBIOCSW
IOBLOG   EQU   IOBFL3
IOBICL   EQU   IOBFL3
IOBMSG   EQU   IOBFL3
IOBCNC   EQU   IOBFL3
IOBACU   EQU   IOBFL3
IOBCDC   EQU   IOBFL3
IOBICC   EQU   IOBFL3
IOBCCC   EQU   IOBFL3
IOBECBPB EQU   IOBECBPT+1
IOBECBCC EQU   IOBECBPT
IOBS1B7  EQU   IOBSENS1
IOBS1B6  EQU   IOBSENS1
IOBS1B5  EQU   IOBSENS1
IOBS1B4  EQU   IOBSENS1
IOBS1B3  EQU   IOBSENS1
IOBS1B2  EQU   IOBSENS1
IOBS1B1  EQU   IOBSENS1
IOBS1B0  EQU   IOBSENS1
IOBSNSC9 EQU   IOBS0B7
IOBS0B6  EQU   IOBSENS0
IOBS0B5  EQU   IOBSENS0
IOBS0B4  EQU   IOBSENS0
IOBS0B3  EQU   IOBSENS0
IOBS0B2  EQU   IOBSENS0
IOBS0B1  EQU   IOBSENS0
IOBS0B0  EQU   IOBSENS0
IOBPNCH  EQU   IOBFLAG2
IOBSTATO EQU   IOBFLAG2
IOBSKUPD EQU   IOBFLAG2
IOBALTTR EQU   IOBFLAG2
IOBRRT2  EQU   IOBRDHA0
IOBRRT3  EQU   IOBPURGE
IOBSENSE EQU   IOBFLAG2
IOBHALT  EQU   IOBFLAG2
IOBSPSVC EQU   IOBRSTRT
IOBUNREL EQU   IOBFLAG1
IOBIOERR EQU   IOBFLAG1
IOBFCREX EQU   IOBCYCCK
IOBRPSTN EQU   IOBFLAG1
IOBERRTN EQU   IOBFLAG1
IOBCMDCH EQU   IOBFLAG1
IOBDATCH EQU   IOBFLAG1
IOBCNOPA EQU   IOBPREFX+12
IOBCICB  EQU   IOBPREFX+8
IOBCECB  EQU   IOBPREFX+4
IOBCONOP EQU   IOBPREFX+3
IOBCINOP EQU   IOBPREFX+2
IOBRSV05 EQU   IOBPREFX+1
IOBPCI   EQU   IOBCFLG1
IOBRSTCH EQU   IOBCFLG1
IOBABAPP EQU   IOBCFLG1
IOBPTST  EQU   IOBCFLG1
IOBRSV04 EQU   IOBCFLG1
IOBRSV03 EQU   IOBCFLG1
IOBRSV02 EQU   IOBCFLG1
IOBRSV01 EQU   IOBCFLG1
@NM00035 EQU   IOBSTRNG
DCBEOB   EQU   IHADCS40+20
DCBPRECL EQU   IHADCS40+18
@NM00034 EQU   IHADCS40+16
@NM00033 EQU   @NM00031+1
@NM00032 EQU   DCBEROPT
DCBERABE EQU   DCBEROPT
DCBERSKP EQU   DCBEROPT
DCBERACC EQU   DCBEROPT
@NM00030 EQU   IHADCS40+10
@NM00029 EQU   IHADCS40+9
@NM00028 EQU   IHADCS40+8
DCBRECA  EQU   DCBRECAD+1
@NM00027 EQU   DCBRECBT
DCBRCFGT EQU   DCBRCREL
DCBRCTRU EQU   DCBRCREL
DCBLCCW  EQU   DCBEOBAD
DCBNOTE  EQU   DCBCNTRL
DCBLRECL EQU   IHADCS38+10
@NM00026 EQU   IHADCS38+8
DCBEOBW  EQU   IHADCS38+4
DCBNCP   EQU   DCBEOBR
@NM00025 EQU   DCBFLAG1
DCBSTFLS EQU   DCBFLAG1
DCBSTQCK EQU   DCBFLAG1
DCBDIRCQ EQU   DCBBUFOF
DCBQSTRU EQU   DCBUSASI
@NM00024 EQU   DCBUSASI
DCBQADF3 EQU   DCBQADFS
DCBQADF2 EQU   DCBQADFS
DCBQADF1 EQU   DCBQADFS
DCBBLBP  EQU   DCBUSASI
@NM00023 EQU   DCBUSASI
DCBCICBA EQU   DCBCICB+1
@NM00022 EQU   DCBCICB
DCBOFFSW EQU   IHADCS36+15
DCBOFFSR EQU   IHADCS36+14
DCBWCPL  EQU   IHADCS36+13
DCBWCPO  EQU   IHADCS36+12
DCBCNQSM EQU   DCBCIND2
DCBCNFEO EQU   DCBCIND2
DCBCNCHS EQU   DCBCIND2
DCBCNBFP EQU   DCBCIND2
DCBCNIOE EQU   DCBCIND2
DCBCNCLO EQU   DCBCIND2
DCBCNWRO EQU   DCBCIND2
DCBCNSTO EQU   DCBCIND2
DCBCNEXB EQU   DCBCIND1
@NM00021 EQU   DCBCIND1
DCBCNBRM EQU   DCBCIND1
@NM00020 EQU   DCBCIND1
DCBCNEVA EQU   DCBCIND1
DCBCNEVB EQU   DCBCIND1
DCBCNSRD EQU   DCBCIND1
DCBCNTOV EQU   DCBCIND1
DCBSYNA  EQU   DCBSYNAD+1
DCBIOBL  EQU   DCBSYNAD
DCBCHCKA EQU   DCBPERRA
@NM00019 EQU   DCBOPTCD
DCBOPTT  EQU   DCBOPTCD
DCBSRCHD EQU   DCBOPTZ
DCBOPTQ  EQU   DCBOPTCD
DCBBCKPT EQU   DCBOPTO
DCBOPTC  EQU   DCBOPTCD
DCBOPTU  EQU   DCBOPTCD
DCBOPTW  EQU   DCBOPTCD
DCBPUTA  EQU   DCBGETA
@NM00018 EQU   DCBPUT
DCBREADA EQU   DCBWRITA
@NM00017 EQU   DCBREAD
DCBDEBA  EQU   DCBDEBAD+1
@NM00016 EQU   DCBIFLGS
DCBIFIOE EQU   DCBIFLGS
DCBIFPCT EQU   DCBIFLGS
DCBIFEC  EQU   DCBIFLGS
DCBMFSTI EQU   DCBMFDMD
DCBMFAWR EQU   DCBMFSTK
DCBMFUIP EQU   DCBMFTMD
DCBMFIDW EQU   DCBMFLCP
DCBMFWRK EQU   DCBMFMVP
DCBMFRDQ EQU   DCBMFWRT
DCBMFGTQ EQU   DCBMFPUT
DCBMFSTL EQU   DCBMACF2
DCBMFCK  EQU   DCBMFDMG
DCBMFRDX EQU   DCBMFCHK
DCBMFDBF EQU   DCBMFSBG
DCBMFRDI EQU   DCBMFLCG
DCBMFRDK EQU   DCBMFMVG
DCBMFWRQ EQU   DCBMFRD
DCBMFPTQ EQU   DCBMFGET
DCBMFECP EQU   DCBMACF1
DCBTIOT  EQU   IHADCS25
DCBMRSTI EQU   DCBMRDMD
DCBMRAWR EQU   DCBMRSTK
DCBMRUIP EQU   DCBMRTMD
DCBMRIDW EQU   DCBMRLCP
DCBMRWRK EQU   DCBMRMVP
DCBMRRDQ EQU   DCBMRWRT
DCBMRGTQ EQU   DCBMRPUT
DCBMRSTL EQU   DCBMACR2
DCBMRCK  EQU   DCBMRDMG
DCBPGFXA EQU   DCBMRRDX
DCBMRDBF EQU   DCBMRSBG
DCBMRRDI EQU   DCBMRLCG
DCBMRRDK EQU   DCBMRMVG
DCBMRWRQ EQU   DCBMRRD
DCBMRPTQ EQU   DCBMRGET
DCBMRECP EQU   DCBMACR1
@NM00015 EQU   DCBIFLG
DCBIBIOE EQU   DCBIFLG
DCBIBPCT EQU   DCBIFLG
DCBIBEC  EQU   DCBIFLG
DCBOFIOF EQU   DCBOFLGS
DCBOFUEX EQU   DCBOFLGS
DCBOFTM  EQU   DCBOFLGS
DCBOFPPC EQU   DCBOFLGS
DCBOFOPN EQU   DCBOFLGS
DCBOFEOV EQU   DCBOFLGS
DCBOFLRB EQU   DCBOFLGS
DCBOFIOD EQU   DCBOFLWR
DCBDDNAM EQU   IHADCS24
DCBEXLSA EQU   DCBEXLST+1
DCBRECKL EQU   DCBRECFM
DCBRECCC EQU   DCBRECFM
DCBRECSB EQU   DCBRECFM
DCBRECBR EQU   DCBRECFM
DCBRECTO EQU   DCBRECLA
DCBRECL  EQU   DCBRECLA
DCBEODA  EQU   DCBEODAD+1
DCBBFA   EQU   DCBBFTEK
DCBH0    EQU   DCBBFTEK
DCBBFTKD EQU   DCBBFTEK
DCBBFTE  EQU   DCBBFT
DCBBFTKR EQU   DCBBFT
DCBBFTS  EQU   DCBBFT
DCBH1    EQU   DCBBFTEK
DCBSVCXA EQU   DCBSVCXL+1
@NM00014 EQU   DCBSVCXL
DCBODEBA EQU   DCBIOBAA
@NM00013 EQU   DCBQSLM
DCBUPDBT EQU   DCBQSLM
DCBUPDCM EQU   DCBQSLM
DCB1DVDS EQU   DCBQSLM
@NM00012 EQU   DCBDSRG2
DCBDSGTR EQU   DCBDSRG2
DCBACBM  EQU   DCBDSRG2
@NM00011 EQU   DCBDSRG2
DCBDSGTQ EQU   DCBDSRG2
DCBDSGTX EQU   DCBDSRG2
DCBDSGGS EQU   DCBDSRG2
DCBDSGU  EQU   DCBDSRG1
DCBDSGPO EQU   DCBDSRG1
DCBDSGMQ EQU   DCBDSRG1
DCBDSGCQ EQU   DCBDSRG1
DCBDSGCX EQU   DCBDSRG1
DCBDSGDA EQU   DCBDSRG1
DCBDSGPS EQU   DCBDSRG1
DCBDSGIS EQU   DCBDSRG1
DCBBUFL  EQU   IHADCS11+8
DCBBUFCA EQU   DCBBUFCB+1
DCBBUFNO EQU   DCBBUFCB
DCBDEVT  EQU   DCBREL
DCBKEYLE EQU   DCBRELB
@NM00010 EQU   IHADCS08+15
DCBORDCK EQU   DCBEIB
DCBORHPR EQU   DCBEIB
DCBORWLR EQU   DCBEIB
DCBORECK EQU   DCBEIB
DCBORERR EQU   DCBEIB
DCBORREJ EQU   DCBEIB
DCBORNRM EQU   DCBEIB
@NM00009 EQU   DCBEIB
@NM00008 EQU   IHADCS08+13
@NM00007 EQU   DCBORBYT
DCBORBFP EQU   DCBORBYT
DCBOREOF EQU   DCBORBYT
DCBORSYN EQU   DCBORBYT
DCBRDLNA EQU   DCBRESCA
@NM00006 EQU   DCBFRTBA
DCBDSPLA EQU   DCBFRID+1
@NM00005 EQU   DCBFRID
@NM00004 EQU   DCBERRCA+2
@NM00003 EQU   DCBORFLG
DCBWTOIA EQU   DCBWTOID+1
@NM00002 EQU   DCBWTOID
@NM00001 EQU   IHADCB
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IGG019LU,(C'PL/S-II',0503,74050)
