//EXTEST   JOB (Z904,0012),HERC01,CLASS=S,MSGCLASS=C,MSGLEVEL=(1,1)
//*
//*    EXHIBIT BATCH TEST - NO ASSEMBLY (USE EXHTUCLG)
//*
//* DD3270 BLKSIZE  =0 SYSIN  =2 MILTEN  =5 VTAM (EXORCIST)
//     EXEC PGM=EXORCIST,REGION=2048K,TIME=10,PARM=TEST
//STOPLIB  DD  DISP=SHR,DSN=HERC01.TEST.LOADLIB
//STEPLIB  DD  DISP=SHR,DSN=HERC01.EXH.EXHLIB
//         DD  DISP=SHR,DSN=HERC01.EXH.ESPLIB
//*        DD  DISP=SHR,DSN=
//*OADLIB  DD  DISP=SHR,DSN=HERC01.TEST.LOADLIB
//LOADLIB  DD  DISP=SHR,DSN=HERC01.EXH.EXHLIB
//         DD  DISP=SHR,DSN=HERC01.EXH.ESPLIB
//*        DD  DISP=SHR,DSN=
//DD3270   DD  DUMMY   UNIT=(0C4),DCB=BLKSIZE=5
//SYSPRINT DD  SYSOUT=*
//DEBTRACE DD  SYSOUT=*
//*YSUDUMP DD  SYSOUT=*
PAS
GPP,TSM
SET SYSTEM
SET GAMES
TEST ON00
^
-SNAP
^
-END
//
