)ATTR DEFAULT(%+_)
    % TYPE(TEXT)  INTENS(HIGH) SKIP(ON)
    + TYPE(TEXT)  INTENS(LOW)  SKIP(ON)
    _ TYPE(INPUT)INTENS(HIGH) CAPS(ON) JUST(LEFT)
    @ TYPE(INPUT) INTENS(LOW)  CAPS(ON) JUST(LEFT)
     TYPE(OUTPUT) INTENS(LOW) CAPS(OFF) COLOR(YELLOW)
    ! TYPE(OUTPUT)  INTENS(HIGH)  CAPS(OFF)
)BODY EXPAND(\\)
+\-\%LIBCLEAN UTILITY+\-\
%COMMAND ===>_ZCMD                                            %SCROLL ==
+
+ Specify the libraries to be member list compared.
+ Use single quotes if specifying a fully qualified dsname.
+
+   NEW Library ===>_NEWDSN                                       +
+                                                                 +
+   OLD Library ===>_OLDDSN
+
+   Match option ==>_Z  +(M/U) Display Matched or Unmatched members.
+                         . Matched are member names that exist in both
+                         . Unmatched are in "New" but not "Old".
+    Load module
+         stats? ==>_Z  +(Y/N) Warning - use of this option will greatly
+                              increase the time required to build the m
+                              list. Use of the%S+line command is the
+                              recommended alternative.
+
+      STATMSG
+
+      STATMSG2
)INIT
 .ZVARS='(ZSCROLLD MATCHOPT LMODSTAT)'
 &MATCHOPT = 'M'
 &LMODSTAT = 'N'
)REINIT
 REFRESH(*)
)PROC
 VER(&NEWDSN,NB,DSNAME)
 VER(&OLDDSN,NB,DSNAME)
 VER(&MATCHOPT,LIST,M,U)
)END
ü
