         TITLE '          IEAVTRET RECORDING TASK                      *
                        '
IEAVTRET CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEAVTRET  77.334'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @08,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@08                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @09,@01                                             0001
         USING @DATD,@09                                           0001
         LM    @00,@01,20(@13)                                     0001
HALFREG EQU   16                   /* BITS TO SHIFT FOR HALFREG      */
ZIP     EQU   0                    /* ZERO USED IN GEND CODE         */
*                                                                  0104
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS SECTION OF CODE IS EXECUTED ONLY ONCE DURING THE LIFE OF */
*   /* THE RECORDING TASK. IT S PURPOSE IS TO INITIALIZE THE SRB USED*/
*   /* BY THE NUCLEUS ROUTINE AND TO ESTABLISH ESTAE PROTECTION FOR  */
*   /* THE RECORDING TASK. IF INITIALIZATUIN IS SUCCESSFUL, THE ECB  */
*   /* PASSED BY IEAVTMSI ON THE ATTACH IS POSTED WITH A CODE OF     */
*   /* ZERO. ANY FAILURE TO INITIALIZE (BAD ESTAE RETURN CODE, ENTRY */
*   /* TO ESTAE EXIT DURING INITIALIZATION, ABEND BEFORE ESTAE       */
*   /* ESTABLISHED) WILL CAUSE THE ECB TO BE POSTED WITH A NON-ZERO  */
*   /* RETURN CODE.                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0105
*   PARMLIST=PARMLIST&&PARMLIST;    /* INIT RECOVERY LIST            */
         XC    PARMLIST(72),PARMLIST                               0105
*   RFY                                                            0106
*    (R1,                                                          0106
*     R5) RSTD;                                                    0106
*   R5=R1;                          /* SAVE INPUT ECB ADDR.          */
         LR    R5,R1                                               0107
*   RFY                                                            0108
*    (R1) UNRESTRICTED;                                            0108
*   SVC60LST=MFLESTAE;              /* LIST FORM OF ESTAE            */
         MVC   SVC60LST(16),MFLESTAE                               0109
*   RFY                                                            0110
*    (R1) RSTD;                     /* RESTRICT REG FOR ESTAE PTR    */
*   R1=ADDR(SVC60LST);              /* SET FOR MF = E FORM OF ESTAE  */
         LA    R1,SVC60LST                                         0111
*   GEN(ESTAE PARAM=PARMLIST,MF=(E,(1)));/* GET ESTAE EXIT           */
         ESTAE PARAM=PARMLIST,MF=(E,(1))
*   RFY                                                            0113
*    (R1) UNRSTD;                                                  0113
*                                                                  0113
*   /*****************************************************************/
*   /*                                                               */
*   /* IF ESTAE REQUEST FAILED INFORM IEAVTMSI                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0114
*   GEN SETS(PARMLIST)(STM R8,R7,PARMLIST);/* SAVE FOR EXIT USE      */
         STM R8,R7,PARMLIST
*   RETRYADR=ADDR(BADINIT);         /* SET FIRST RETRY POINT         */
         LA    @14,BADINIT                                         0115
         ST    @14,RETRYADR                                        0115
*   IF R15^=ZERO THEN               /* ESTAE ESTABLISHED...          */
         LTR   R15,R15                                             0116
         BZ    @RF00116                                            0116
*     DO;                           /* NO,ABORT INITIALIZATION       */
*BADINIT:                           /* RETRY LABEL FOR ESTAE         */
*       CVTRTMCT->RTCTRPER=YES;                                    0118
BADINIT  L     @14,CVTPTR                                          0118
         L     @14,CVTRTMCT(,@14)                                  0118
         OI    RTCTRPER(@14),B'01000000'                           0118
*       GEN(POST (R5),4);           /* SHOW INIT FAILURE.            */
         POST (R5),4
*     END;                                                         0120
*   SVC51LST=MFLSDUMP;              /* MOVE SDUMP PARM LIST TO     0121
*                                      AUTOMATIC STORAGE     @ZA13432*/
*                                                                  0121
@RF00116 MVC   SVC51LST(24),MFLSDUMP                               0121
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE THE SRB USED BY NUCLEUS RECORDING ROUTINE          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0122
*   RFY                                                            0122
*     R2 RSTD;                                                     0122
*   R2=ADDR(RCBSRB);                                               0123
         L     @14,CVTPTR                                          0123
         L     @14,CVTRTMCT(,@14)                                  0123
         L     @14,RTCTRCB(,@14)                                   0123
         LA    R2,RCBSRB(,@14)                                     0123
*   SRBPKF=ZERO;                    /* KEY 0 SRB                     */
         MVI   SRBPKF(R2),X'00'                                    0124
*   SRBRMTR=ZERO;                   /* NO RESOURCE MANAGER.          */
         SLR   @12,@12                                             0125
         ST    @12,SRBRMTR(,R2)                                    0125
*   SRBSAVE=ZERO;                   /* NO SAVE AREA.                 */
         ST    @12,SRBSAVE(,R2)                                    0126
*   SRBCPAFF=ZERO;                  /* RUN ON ANY CPU.               */
         STH   @12,SRBCPAFF(,R2)                                   0127
*   SRBFLNK=ZERO;                   /* NO FORWARD CHAIN PTR.         */
         ST    @12,SRBFLNK(,R2)                                    0128
*   SRBPRIOR=ZERO;                  /* PRIORITY ZERO.                */
         MVI   SRBPRIOR(R2),X'00'                                  0129
*   SRBPARM=R9;                     /* PASS DATA REG TO SRB RTN      */
         ST    R9,SRBPARM(,R2)                                     0130
*   SRBID='SRB ';                   /* EBCDIC ID.                    */
         MVC   SRBID(4,R2),@CC02080                                0131
*   SRBASCB=PSAAOLD;                /* MASTERS ASCB ADDRESS          */
         L     @06,PSAAOLD                                         0132
         ST    @06,SRBASCB(,R2)                                    0132
*   SRBPASID=ZERO;                  /* NO TASK AFFINITY              */
         STH   @12,SRBPASID(,R2)                                   0133
*   SRBPTCB=ZERO;                   /* NO TASK AFFINITY              */
         ST    @12,SRBPTCB(,R2)                                    0134
*   SRBEP=ADDR(RETSRBEP);           /* SRBS ENTRY POINT.             */
         LA    @12,RETSRBEP                                        0135
         ST    @12,SRBEP(,R2)                                      0135
*   RFY                                                            0136
*     R2 UNRSTD;                                                   0136
*   RCBSRBIU=NO;                    /* SHOW SRB CAN BE USED.         */
*                                                                  0137
         NI    RCBSRBIU(@14),B'01111111'                           0137
*   /*****************************************************************/
*   /*                                                               */
*   /* SHOW GOOD INITIALIZATION TO IEAVTMSI                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0138
*   GEN( POST (R5),ZIP);            /* CLEAN POST CODE               */
          POST (R5),ZIP
*   RFY                                                            0139
*     R5 UNRSTD;                                                   0139
*   RETINIT=YES;                    /* SHOW TASK IS INITIALIZED IN 0140
*                                      ESTAE PARMLIST                */
         OI    RETINIT,B'10000000'                                 0140
*   RETRYADR=ADDR(AWAKE);           /* NEXT RETRY OUT OF ESTAE       */
         LA    @14,AWAKE                                           0141
         ST    @14,RETRYADR                                        0141
*   GEN SETS(PARMLIST)(STM R8,R7,PARMLIST);/* SAVE FOR EXIT USE      */
         STM R8,R7,PARMLIST
*SLEEP:                             /* ENTER WAIT                    */
*   DO;                             /* WAIT ECB(RTCTRECB)            */
SLEEP    DS    0H                                                  0144
*     RESPECIFY                                                    0144
*      (GPR00P,                                                    0144
*       GPR01P) RESTRICTED;                                        0144
*     GPR00P=1;                     /* LOAD WAIT COUNT               */
         LA    GPR00P,1                                            0145
*     GPR01P=ADDR(RTCTRECB);        /* ADDRESS OF ECB                */
         L     @14,CVTPTR                                          0146
         L     GPR01P,CVTRTMCT(,@14)                               0146
         LA    GPR01P,RTCTRECB(,GPR01P)                            0146
*     SVC(1);                       /* WAIT SVC                      */
         SVC   1                                                   0147
*     RESPECIFY                                                    0148
*      (GPR00P,                                                    0148
*       GPR01P) UNRESTRICTED;                                      0148
*   END;                            /* WAIT ECB(RTCTRECB) WAIT FOR 0149
*                                      RER TO POST                   */
*AWAKE:                             /* FIRST INSTRUCTION AFTER WAIT  */
*   EXTRTN=NO;                      /* SHOW RECORD MAINLINE IN     0150
*                                      CONTROL               @YM02750*/
AWAKE    NI    EXTRTN,B'10111111'                                  0150
*   RETRYADR=ADDR(AWAKE);           /* SET UP CORRECT RETRY ADDRESS
*                                                            @ZA20615*/
         LA    @14,AWAKE                                           0151
         ST    @14,RETRYADR                                        0151
*   RTCTRECB=ZERO;                  /* RESET THE RECORDING ECB       */
         SLR   @14,@14                                             0152
         L     @12,CVTPTR                                          0152
         L     @12,CVTRTMCT(,@12)                                  0152
         ST    @14,RTCTRECB(,@12)                                  0152
*   BUFLENS=BUFLENS&&BUFLENS;       /* ZERO BUFFER LENGTHS   @G17EP5W*/
         XC    BUFLENS(8),BUFLENS                                  0153
*   BUFS=BUFS&&BUFS;                /* ZERO BUFFER ADDRESSES @G17EP5W*/
         XC    BUFS(8),BUFS                                        0154
*   R7=RTCTRCB;                                                    0155
         L     R7,RTCTRCB(,@12)                                    0155
*   RESPECIFY                       /* BASE FOR RCB                  */
*     RCB BASED(R7);                                               0156
*   IF RTCTRTER=YES THEN            /* IF TEMP ERROR SUFFERED        */
         TM    RTCTRTER(@12),B'10000000'                           0157
         BNO   @RF00157                                            0157
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE TEMPERR SEGMENT IS TO CLEANUP & REINITIALIZE  */
*/* THE RCB IF A TEMPORARY ERROR HAS BEEN SUFFERED. IT FIRST CHECKS  */
*/* TO SEE IF BUFFER MANIPULATION IS COMPLETE (RCBACNT = 0).IF SO IT */
*/* WILL POST REQUESTORS WHO MAY BE WAITING AND REINITIALIZE THE RCB */
*/*                                                                  */
*/********************************************************************/
*                                                                  0158
*     DO;                                                          0158
*       IF RCBACNT<=ZERO THEN       /* IF RCB BUFFER AREA IS NOT   0159
*                                      BEING                         */
         CH    @14,RCBACNT(,R7)                                    0159
         BL    @RF00159                                            0159
*         DO;                       /* MANIPULATED BY REQUEST ROUTINE*/
*                                                                  0160
*           /*********************************************************/
*           /*                                                       */
*           /* NOTE - SERIALIZATION OF THE RCB NOT NESESSARY AS AT   */
*           /* THIS POINT NOBODY ELSE IS WORKING WITH IT             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0161
*           RFY                                                    0161
*            (GPR01P) RSTD;         /*                       @ZA13432*/
*           GPR01P=ADDR(SVC51LST);  /* SDUMP PARAMETER LIST  @ZA13432*/
         LA    GPR01P,SVC51LST                                     0162
*           GEN(SDUMP MF=(E,(1)),HDR='RECORD TEMPORARY ERROR');/*  0163
*                                                            @ZA13432*/
         SDUMP MF=(E,(1)),HDR='RECORD TEMPORARY ERROR'
*           RFY                                                    0164
*            (GPR01P) UNRSTD;       /*                       @ZA13432*/
*           RCBTLNG=LENGTH(RCBBUFRS);/* CONTROL POSSIBLE BAD LOOP    */
         MVC   RCBTLNG(2,R7),@CH02223                              0165
*           TRYPOST=YES;            /* INDICATE TRYING TO POST       */
         OI    TRYPOST,B'00100000'                                 0166
*           RETRYADR=ADDR(SKIPPOST);/* RETRY AFTER POST              */
         LA    @14,SKIPPOST                                        0167
         ST    @14,RETRYADR                                        0167
*           DO WHILE(RCBFLNG<RCBTLNG);/* LOOP THRU BUFFER ENTRIES TO
*                                      POSTWAITING REQUESTORS        */
         B     @DE00168                                            0168
@DL00168 DS    0H                                                  0169
*             OLDEST=RCBFREE+RCBFLNG;/* FIND THE OLDEST BUFFER ENTRY */
         LH    @14,RCBFLNG(,R7)                                    0169
         N     @14,@CF02236                                        0169
         AL    @14,RCBFREE(,R7)                                    0169
         ST    @14,OLDEST                                          0169
*             IF OLDEST>=RCBBUFE THEN/* IF BUFFER WAS WRAPPED        */
         C     @14,RCBBUFE(,R7)                                    0170
         BL    @RF00170                                            0170
*               OLDEST=OLDEST-RCBTLNG;/* UPDATE THE REC POINTER      */
         LH    @12,RCBTLNG(,R7)                                    0171
         N     @12,@CF02236                                        0171
         SLR   @14,@12                                             0171
         ST    @14,OLDEST                                          0171
*             RESPECIFY             /* BASE BUFFER ENTRY MAP ON ADDR */
*              (RCBBUF) BASED(OLDEST);/* OF OLDEST BUFFER ENTRY      */
*                                                                  0172
@RF00170 DS    0H                                                  0173
*             /*******************************************************/
*             /*                                                     */
*             /* THIS SEGMENT WILL POST THE USERS ECB TO INDICATE    */
*             /* THAT THE DATA HAS BEEN WRITTEN. POSTING WILL NOT BE */
*             /* DONE IF IT WAS NOT REQUESTED OR IF THE ASID IS      */
*             /* INVALID.                                            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0173
*             RFY                                                  0173
*               ASVT BASED(CVTASVT);                               0173
*             IF RCBBPOST=YES&      /* WANT POSTING...               */
*                 RCBBNBFR=YES THEN /* RECORD UNBUFFED..     @YM02617*/
         L     @14,OLDEST                                          0174
         TM    RCBBPOST(@14),B'00001100'                           0174
         BNO   @RF00174                                            0174
*               DO;                 /* -YES.                         */
*                 IF RCBBASID>ZERO& /* VALID NUMERICAL ASID...       */
*                     RCBBASID<=ASVTMAXU&ASVTAVAL(RCBBASID)=NO THEN/*
*                                      ...AND ASID IN USE...         */
         LH    @12,RCBBASID(,@14)                                  0176
         N     @12,@CF02236                                        0176
         LTR   @12,@12                                             0176
         BNP   @RF00176                                            0176
         L     @06,CVTPTR                                          0176
         L     @06,CVTASVT(,@06)                                   0176
         C     @12,ASVTMAXU(,@06)                                  0176
         BH    @RF00176                                            0176
         SLA   @12,2                                               0176
         ALR   @06,@12                                             0176
         TM    ASVTAVAL-4(@06),B'10000000'                         0176
         BNZ   @RF00176                                            0176
*                   DO;             /* YES,POST THE ECB.             */
*                     RFY                                          0178
*                       R5 RSTD;    /* PTR TO THE ECB TO POST TO   0178
*                                      HANDLE WRAP HEADERS   @ZA19199*/
*                     R5=ADDR(RCBBECB);/* ADDR OF ECB TO POST      0179
*                                                            @ZA19199*/
         LA    R5,RCBBECB(,@14)                                    0179
*                     RFY                                          0180
*                       USERECB BASED(ECBADR);/* TO INSURE PROPER  0180
*                                      ADDRESS OF ECB        @ZA19199*/
*                     IF R5>=RCBBUFE THEN/* DOES THE HDR WRAP      0181
*                                                            @ZA19199*/
         C     R5,RCBBUFE(,R7)                                     0181
         BL    @RF00181                                            0181
*                       R5=R5-RCBTLNG;/* YES - RESET POINTER @ZA19199*/
         LH    @14,RCBTLNG(,R7)                                    0182
         N     @14,@CF02236                                        0182
         SLR   R5,@14                                              0182
*                     ELSE                                         0183
*                       ;           /* HDR DOES NOT WRAP     @ZA19199*/
@RF00181 DS    0H                                                  0184
*                     EXTRTN=YES;   /* SHOW IN EXTERNAL ROUTINE FOR
*                                      RECOVERY                      */
         OI    EXTRTN,B'01000000'                                  0184
*                     RETRYADR=ADDR(AFTPSTA);/* PRESET RETRY ADDR    */
         LA    @14,AFTPSTA                                         0185
         ST    @14,RETRYADR                                        0185
*                     GEN SETS(PARMLIST)(STM R8,R7,PARMLIST);/*    0186
*                                                            @YM02750*/
         STM R8,R7,PARMLIST
*                     DO;           /* POST (USERECB,0) ASCB(ASVTENTY
*                                      (RCBBASID)->UASCBADR)       0187
*                                      ERRET(CVTBRET)                */
*                       I002=I002&&I002;/* INITIALIZE LIST           */
         XC    I002(12),I002                                       0188
*                       I00201=ADDR(USERECB);/* ECB ADDRESS          */
         L     @14,ECBADR(,R5)                                     0189
         ST    @14,I00201                                          0189
*                       I00202=ADDR(ASVTENTY(RCBBASID)->UASCBADR);/*
*                                      ASCB ADDRESS                  */
         L     @14,OLDEST                                          0190
         LH    @14,RCBBASID(,@14)                                  0190
         N     @14,@CF02236                                        0190
         SLA   @14,2                                               0190
         L     @12,CVTPTR                                          0190
         L     @06,CVTASVT(,@12)                                   0190
         L     @14,ASVTENTY-4(@14,@06)                             0190
         ST    @14,I00202                                          0190
*                       I00203=ADDR(CVTBRET);/* ERRET ADDRESS        */
         LA    @14,CVTBRET(,@12)                                   0191
         ST    @14,I00203                                          0191
*                       RESPECIFY                                  0192
*                        (GPR00F,                                  0192
*                         GPR01P) RESTRICTED;                      0192
*                       GPR00F=0;   /* POST CODE IN R0               */
         SLR   GPR00F,GPR00F                                       0193
*                       GPR01P=ADDR(I002);/* PARMLIST ADDR           */
         LA    GPR01P,I002                                         0194
*                       GPR01P=GPR01P×'80000000'X;/* SET LIST FORM 0195
*                                      IND                           */
         O     GPR01P,@CF00108                                     0195
*                       SVC(2);     /* ISSUE POST SVC                */
         SVC   2                                                   0196
*                       RESPECIFY                                  0197
*                        (GPR00F,                                  0197
*                         GPR01P) UNRESTRICTED;                    0197
*                     END;          /* POST (USERECB,0) ASCB(ASVTENTY
*                                      (RCBBASID)->UASCBADR)       0198
*                                      ERRET(CVTBRET)                */
*AFTPSTA:                                                          0199
*                     ;             /* RETRY IF POST FAILURE         */
AFTPSTA  DS    0H                                                  0200
*                     RFY                                          0200
*                       USERECB BASED(RCBBECB);/* REBASE BACK      0200
*                                                            @ZA19199*/
*                     RFY                                          0201
*                       R5 UNRSTD;  /* FREE THE ECB POINTER  @ZA19199*/
*                     EXTRTN=NO;    /* BACK TO RECORD                */
         NI    EXTRTN,B'10111111'                                  0202
*                     RETRYADR=ADDR(AWAKE);/* RESET RETRY ADDR       */
         LA    @14,AWAKE                                           0203
         ST    @14,RETRYADR                                        0203
*                   END;                                           0204
*               END;                                               0205
@RF00176 DS    0H                                                  0206
*             RFY                                                  0206
*               ASVT BASED;                                        0206
@RF00174 DS    0H                                                  0207
*             IF RCBBNBFR=NO THEN   /* RECORD BUFFERED...            */
         L     @14,OLDEST                                          0207
         TM    RCBBNBFR(@14),B'00001000'                           0207
         BNZ   @RF00207                                            0207
*               RCBFLNG=RCBFLNG+    /* YES - RELEASE IT              */
*                   (RCBBLEN+       /* DATA PLUS                     */
*                   CONTLEN+        /* CONTROL INFORMATION           */
*                   SEVEN&          /* ROUNDED TO A DOUBLE WORD      */
*                   'FFF8'X);                                      0208
         LA    @12,23                                              0208
         LH    @14,RCBBLEN(,@14)                                   0208
         N     @14,@CF02236                                        0208
         ALR   @12,@14                                             0208
         N     @12,@CF02103                                        0208
         LH    @14,RCBFLNG(,R7)                                    0208
         N     @14,@CF02236                                        0208
         ALR   @12,@14                                             0208
         STH   @12,RCBFLNG(,R7)                                    0208
*             ELSE                  /* RECORD IS NOT BUFFERED        */
*               DO;                                                0209
         B     @RC00207                                            0209
@RF00207 DS    0H                                                  0210
*                 RFY                                              0210
*                   R1 RSTD;        /* RESTRICT REGISTER FOR ERRORID
*                                      LENGTH                @G17EP5W*/
*                 IF RCBBERFG=YES THEN/* IF ERRORID APPENDED IN RCB
*                                                            @G17EP5W*/
         L     @14,OLDEST                                          0211
         TM    RCBBERFG(@14),B'00000010'                           0211
         BNO   @RF00211                                            0211
*                   R1=LENGTH(NBFRERID);/* THEN INCLUDE ITS LENGTH 0212
*                                      FOR FREEING           @G17EP5W*/
         LA    R1,10                                               0212
*                 ELSE              /* OTHERWISE             @G17EP5W*/
*                   R1=ZERO;                                       0213
*                                                                  0213
         B     @RC00211                                            0213
@RF00211 SLR   R1,R1                                               0213
*                 /***************************************************/
*                 /*                                                 */
*                 /* FREE NO ADDITIONAL SPACE                @G17EP5W*/
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0214
*                 RCBFLNG=RCBFLNG+  /* FREE ONLY                     */
*                     (NBFRLEN+     /* NON-BUFFERED LENGTH           */
*                     R1+           /* LENGTH OF ERRORID IF PRESENT
*                                                            @G17EP5W*/
*                     SEVEN&        /* ROUNDED TO A DOUBLE WORD      */
*                     'FFF8'X);                                    0214
@RC00211 LA    @14,27                                              0214
         ALR   @14,R1                                              0214
         N     @14,@CF02103                                        0214
         LH    @12,RCBFLNG(,R7)                                    0214
         N     @12,@CF02236                                        0214
         ALR   @14,@12                                             0214
         STH   @14,RCBFLNG(,R7)                                    0214
*                 RFY                                              0215
*                   R1 UNRSTD;      /* UNRESTRICT LENGTH REGISTER  0215
*                                                            @G17EP5W*/
*               END;                                               0216
*           END;                    /* END POST LOOP                 */
@RC00207 DS    0H                                                  0217
@DE00168 CLC   RCBFLNG(2,R7),RCBTLNG(R7)                           0217
         BL    @DL00168                                            0217
*SKIPPOST:                          /* RETRY IF FAIL IN POSTING    0218
*                                      REINIT                        */
*           TRYPOST=NO;             /* RESET SWITCH                  */
*                                                                  0218
SKIPPOST NI    TRYPOST,B'11011111'                                 0218
*           /*********************************************************/
*           /*                                                       */
*           /* THIS SECTION WILL INITIALIZE THE BUFFER AREA. THIS CAN*/
*           /* BE EITHER THE BUFFER ACQUIRED BY THIS MODULE OR THE   */
*           /* FIXED BUFFER USED BY THE RECORDING REQUEST ROUTINE    */
*           /* (IEAVTRER).                                           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0219
*           RCBCNTL=''B;            /* CLEAR THE CONTROL AREA.       */
         XC    RCBCNTL(96,R7),RCBCNTL(R7)                          0219
*           RCBBUFE=ADDR(RCB)+LENGTH(RCB);/* END ADDR OF BUFFER.     */
         LR    @14,R7                                              0220
         AL    @14,@CF00098                                        0220
         ST    @14,RCBBUFE(,R7)                                    0220
*           RCBBUFB=ADDR(RCBBUFRS); /* START ADDR OF BUFFER AREA     */
         LA    @14,RCBBUFRS(,R7)                                   0221
         ST    @14,RCBBUFB(,R7)                                    0221
*           RCBFREE=ADDR(RCBBUFRS); /* START OF FREE AREA.           */
         ST    @14,RCBFREE(,R7)                                    0222
*           RCBFLNG=LENGTH(RCBBUFRS);/* SIZE OF FREE AREA.           */
         LA    @14,4000                                            0223
         STH   @14,RCBFLNG(,R7)                                    0223
*           RCBTLNG=LENGTH(RCBBUFRS);/* TOTAL SIZE OF FREE AREA.     */
         STH   @14,RCBTLNG(,R7)                                    0224
*           RCBDUM=RCBTLNG+1;       /* OFFSET TO DUMMY ALLOC.        */
         AL    @14,@CF00040                                        0225
         STH   @14,RCBDUM(,R7)                                     0225
*           RCBLCNT=ZERO;           /* RESET LOST RCD COUNT.         */
         MVI   RCBLCNT(R7),X'00'                                   0226
*           RCBACNT=ZERO;           /* ACTIVE COUNT IS ZERO.         */
*                                                                  0227
         SLR   @14,@14                                             0227
         STH   @14,RCBACNT(,R7)                                    0227
*           /*********************************************************/
*           /*                                                       */
*           /* SET UP LOST RECORD HEADER                             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0228
*           RFY                                                    0228
*             HDR BASED(ADDR(RCBLRHDR));                           0228
*           HDRTYP='4F'X;           /* LOST RECORD INDICATOR         */
         LA    @14,64                                              0229
         ALR   @14,R7                                              0229
         MVI   HDRTYP(@14),X'4F'                                   0229
*           HDRDS10='1'B;           /* SHORT RECORD INDICATOR      0230
*                                                            @ZA27936*/
         OI    HDRDS10(@14),B'10000000'                            0230
*           PACK(PKWORD(1:2),CVTNUMB);/* PICK UP REL NO. FROM CVT  0231
*                                                            @Z40CPXH*/
         L     @12,CVTPTR                                          0231
         AL    @12,@CF02238                                        0231
         PACK  PKWORD(2),CVTNUMB-252(2,@12)                        0231
*           CVB(HDROPRN,PKWORD(1:2));/* SAVE RELEASE IN HDR  @Z40CPXH*/
         XC    @TS00001(8),@TS00001                                0232
         MVC   @TS00001+6(2),PKWORD                                0232
         CVB   @12,@TS00001                                        0232
         STC   @12,HDROPRN(,@14)                                   0232
*           HDROPSYS=SYSVS2;        /* SYSTEM ID IS VS2      @Z40CPXH*/
         NI    HDROPSYS(@14),B'10011111'                           0233
         OI    HDROPSYS(@14),B'10000000'                           0233
*           HDRISNS=YES;            /* STORE CLOCK USED FOR TIME     */
         OI    HDRISNS(@14),B'01000000'                            0234
*           RFY                                                    0235
*            (R5) RSTD;                                            0235
*           R5=ADDR(HDRCPID);       /* SAVE ADRESS OF CPU ID         */
         LA    R5,HDRCPID(,@14)                                    0236
*           GEN(STIDP ZIP(R5));     /* SAVE CPU ID                   */
         STIDP ZIP(R5)
*           RFY                                                    0238
*            (R5) UNRSTD;                                          0238
*           RFY                                                    0239
*             HDR BASED(ADDR(AR149HDR));                           0239
*                                                                  0239
*           /*********************************************************/
*           /*                                                       */
*           /* INITIALIZE THE SRB USED BY NUCLEUS RECORDING ROUTINE  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0240
*           RFY                                                    0240
*             R2 RSTD;                                             0240
*           R2=ADDR(RCBSRB);                                       0241
         LA    R2,RCBSRB(,R7)                                      0241
*           SRBPKF=ZERO;            /* KEY 0 SRB                     */
         MVI   SRBPKF(R2),X'00'                                    0242
*           SRBRMTR=ZERO;           /* NO RESOURCE MANAGER.          */
         SLR   @14,@14                                             0243
         ST    @14,SRBRMTR(,R2)                                    0243
*           SRBSAVE=ZERO;           /* NO SAVE AREA.                 */
         ST    @14,SRBSAVE(,R2)                                    0244
*           SRBCPAFF=ZERO;          /* RUN ON ANY CPU.               */
         STH   @14,SRBCPAFF(,R2)                                   0245
*           SRBFLNK=ZERO;           /* NO FORWARD CHAIN PTR.         */
         ST    @14,SRBFLNK(,R2)                                    0246
*           SRBPRIOR=ZERO;          /* PRIORITY ZERO.                */
         MVI   SRBPRIOR(R2),X'00'                                  0247
*           SRBPARM=R9;             /* PASS DATA REG TO SRB RTN      */
         ST    R9,SRBPARM(,R2)                                     0248
*           SRBID='SRB ';           /* EBCDIC ID.                    */
         MVC   SRBID(4,R2),@CC02080                                0249
*           SRBASCB=PSAAOLD;        /* MASTERS ASCB ADDRESS          */
         L     @12,PSAAOLD                                         0250
         ST    @12,SRBASCB(,R2)                                    0250
*           SRBPASID=ZERO;          /* NO TASK AFFINITY              */
         STH   @14,SRBPASID(,R2)                                   0251
*           SRBPTCB=ZERO;           /* NO TASK AFFINITY              */
         ST    @14,SRBPTCB(,R2)                                    0252
*           SRBEP=ADDR(RETSRBEP);   /* SRBS ENTRY POINT.             */
         LA    @14,RETSRBEP                                        0253
         ST    @14,SRBEP(,R2)                                      0253
*           RFY                                                    0254
*             R2 UNRSTD;                                           0254
*           RCBSRBIU=NO;            /* SHOW SRB CAN BE USED.         */
*                                                                  0255
         NI    RCBSRBIU(R7),B'01111111'                            0255
*           /*********************************************************/
*           /*                                                       */
*           /* CLEAR BUFFERING AREA TO ZERO.                         */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0256
*           RFY                                                    0256
*            (R4,                                                  0256
*             R5,                                                  0256
*             R2,                                                  0256
*             R3) RSTD;             /* RESTRICT REGS FOR MVCL        */
*           R4=ADDR(RCBBUFRS);      /* START ADDR (TO).              */
         LA    R4,RCBBUFRS(,R7)                                    0257
*           R5=LENGTH(RCBBUFRS);    /* LENGTH TO CLEAR.              */
         LA    R5,4000                                             0258
*           R2=R4;                  /* START ADDR (FROM).            */
         LR    R2,R4                                               0259
*           R3=ZERO;                /* PADD AND COUNT IS ZERO        */
         SLR   R3,R3                                               0260
*           GEN(MVCL R4,R2);        /* CLEAR OUT THE AREA.           */
         MVCL R4,R2
*           RFY                                                    0262
*            (R4,                                                  0262
*             R5,                                                  0262
*             R2,                                                  0262
*             R3) UNRSTD;           /* RESTRICT REGS FOR MVCL        */
*           RTCTRTER=NO;            /* INDICATE CLEANUP DONE         */
         L     @14,CVTPTR                                          0263
         L     @14,CVTRTMCT(,@14)                                  0263
         NI    RTCTRTER(@14),B'01111111'                           0263
*           RETRYADR=ADDR(AWAKE);   /* RESET RETRY ADDRESS           */
         LA    @14,AWAKE                                           0264
         ST    @14,RETRYADR                                        0264
*         END;                      /* END TEMP ERROR CLEANUP        */
*     END;                          /* END TEMPERR                   */
*   ELSE                            /* IF NO TEMP ERRORS SUFFERED    */
*     DO;                           /* PROCESS RECORDS               */
         B     @RC00157                                            0267
@RF00157 DS    0H                                                  0268
*       IF RCBFLNG^=RCBTLNG THEN    /* IF THERE ARE RECORDS TO BE    */
         CLC   RCBFLNG(2,R7),RCBTLNG(R7)                           0268
         BE    @RF00268                                            0268
*         DO;                       /* PROCESSED                     */
*           RFY                                                    0270
*            (R1) RSTD;             /* RESTRICT REGISTER FOR GETMAIN */
*           EXTRTN=YES;             /* SHOW IN EXTERN ROUTINE FOR RCV*/
         OI    EXTRTN,B'01000000'                                  0271
*           RETRYADR=ADDR(AFTGET);  /* SET UP CURRENT RETRY ADDRESS  */
         LA    @14,AFTGET                                          0272
         ST    @14,RETRYADR                                        0272
*           GEN REFS(PARMLIST)(STM R8,R7,PARMLIST);/* SAVE REGS FOR
*                                      RCV                           */
         STM R8,R7,PARMLIST
*           DO;                     /* GETMAIN (RC) LV(FOURK) SP(252)*/
*             RESPECIFY                                            0275
*              (GPR01F,                                            0275
*               GPR15F,                                            0275
*               GPR00F) RESTRICTED;                                0275
*             GPR01F=0;             /* REG 1 MUST BE ZERO            */
         SLR   GPR01F,GPR01F                                       0276
*             GPR15F=0;             /* RC-TYPE GETMAIN               */
         SLR   GPR15F,GPR15F                                       0277
*             GPR00F=FOURK;         /* LENGTH REQUESTED              */
         L     GPR00F,FOURK                                        0278
*             GPR15F=GPR15F×((252)*256);/* SP IN BYTE 2              */
         O     GPR15F,@CF02226                                     0279
*             SVC(120);             /* RC/RU-FORM OF GETMAIN         */
         SVC   120                                                 0280
*             RESPECIFY                                            0281
*              (GPR01F,                                            0281
*               GPR15F,                                            0281
*               GPR00F) UNRESTRICTED;                              0281
*           END;                    /* GETMAIN (RC) LV(FOURK) SP(252)
*                                      GET 4K AREA TO REBUFFER       */
*AFTGET:                            /* ADDRESS FOR RETRY IF G.M.   0283
*                                      FAILS                         */
*           EXTRTN=NO;              /* OUT OF GETMAIN                */
AFTGET   NI    EXTRTN,B'10111111'                                  0283
*           RETRYADR=ADDR(AWAKE);   /* RESET RETRY ADDRESS           */
         LA    @14,AWAKE                                           0284
         ST    @14,RETRYADR                                        0284
*           IF R15=ZERO THEN        /* IF GETMAIN WAS SUCESSFUL      */
         SLR   @14,@14                                             0285
         CR    R15,@14                                             0285
         BNE   @RF00285                                            0285
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE REBUF SEGMENT IS TO MOVE ALL READY RECORDS TO */
*/* THE GETMAINED BUFFER. THIS IS DONE TO AVOID LOST RECORDS DUE TO  */
*/* LACK OF SPACE IN THE RCB. THE SPACE IN THE RCB IS FREED AS RECORD*/
*/* MOVED RATHER THAN WAITING FOR I/O THAT WOULD BE NECESSARY IF     */
*/* WRITTEN DIRECTLY.                                                */
*/*                                                                  */
*/********************************************************************/
*                                                                  0286
*             DO;                                                  0286
*               REBUFADR=R1;        /* SAVE ADDRESS OF GOTTEN BUFFER */
         ST    R1,REBUFADR                                         0287
*               REBLEN=FOURK;       /* SAVE LEN OF BUFFER    @G17EP5W*/
         L     @12,FOURK                                           0288
         ST    @12,REBLEN                                          0288
*               R7=R1;              /* BASE RCB MAPPING ON GETMAINED
*                                      BUFFER FOR INITILIZATION      */
*                                                                  0289
         LR    R7,R1                                               0289
*               /*****************************************************/
*               /*                                                   */
*               /* THIS SECTION WILL INITIALIZE THE BUFFER AREA. THIS*/
*               /* CAN BE EITHER THE BUFFER ACQUIRED BY THIS MODULE  */
*               /* OR THE FIXED BUFFER USED BY THE RECORDING REQUEST */
*               /* ROUTINE (IEAVTRER).                               */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0290
*               RCBCNTL=''B;        /* CLEAR THE CONTROL AREA.       */
         XC    RCBCNTL(96,R7),RCBCNTL(R7)                          0290
*               RCBBUFE=ADDR(RCB)+LENGTH(RCB);/* END ADDR OF BUFFER. */
         LR    @12,R7                                              0291
         AL    @12,@CF00098                                        0291
         ST    @12,RCBBUFE(,R7)                                    0291
*               RCBBUFB=ADDR(RCBBUFRS);/* START ADDR OF BUFFER AREA  */
         LA    @12,RCBBUFRS(,R7)                                   0292
         ST    @12,RCBBUFB(,R7)                                    0292
*               RCBFREE=ADDR(RCBBUFRS);/* START OF FREE AREA.        */
         ST    @12,RCBFREE(,R7)                                    0293
*               RCBFLNG=LENGTH(RCBBUFRS);/* SIZE OF FREE AREA.       */
         LA    @12,4000                                            0294
         STH   @12,RCBFLNG(,R7)                                    0294
*               RCBTLNG=LENGTH(RCBBUFRS);/* TOTAL SIZE OF FREE AREA. */
         STH   @12,RCBTLNG(,R7)                                    0295
*               RCBDUM=RCBTLNG+1;   /* OFFSET TO DUMMY ALLOC.        */
         AL    @12,@CF00040                                        0296
         STH   @12,RCBDUM(,R7)                                     0296
*               RCBLCNT=ZERO;       /* RESET LOST RCD COUNT.         */
         MVI   RCBLCNT(R7),X'00'                                   0297
*               RCBACNT=ZERO;       /* ACTIVE COUNT IS ZERO.         */
*                                                                  0298
         STH   @14,RCBACNT(,R7)                                    0298
*               /*****************************************************/
*               /*                                                   */
*               /* SET UP LOST RECORD HEADER                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0299
*               RFY                                                0299
*                 HDR BASED(ADDR(RCBLRHDR));                       0299
*               HDRTYP='4F'X;       /* LOST RECORD INDICATOR         */
         LA    @14,64                                              0300
         ALR   @14,R7                                              0300
         MVI   HDRTYP(@14),X'4F'                                   0300
*               HDRDS10='1'B;       /* SHORT RECORD INDICATOR      0301
*                                                            @ZA27936*/
         OI    HDRDS10(@14),B'10000000'                            0301
*               PACK(PKWORD(1:2),CVTNUMB);/* PICK UP REL NO. FROM CVT
*                                                            @Z40CPXH*/
         L     @12,CVTPTR                                          0302
         AL    @12,@CF02238                                        0302
         PACK  PKWORD(2),CVTNUMB-252(2,@12)                        0302
*               CVB(HDROPRN,PKWORD(1:2));/* SAVE RELEASE IN HDR    0303
*                                                            @Z40CPXH*/
         XC    @TS00001(8),@TS00001                                0303
         MVC   @TS00001+6(2),PKWORD                                0303
         CVB   @12,@TS00001                                        0303
         STC   @12,HDROPRN(,@14)                                   0303
*               HDROPSYS=SYSVS2;    /* SYSTEM ID IS VS2      @Z40CPXH*/
         NI    HDROPSYS(@14),B'10011111'                           0304
         OI    HDROPSYS(@14),B'10000000'                           0304
*               HDRISNS=YES;        /* STORE CLOCK USED FOR TIME     */
         OI    HDRISNS(@14),B'01000000'                            0305
*               RFY                                                0306
*                (R5) RSTD;                                        0306
*               R5=ADDR(HDRCPID);   /* SAVE ADRESS OF CPU ID         */
         LA    R5,HDRCPID(,@14)                                    0307
*               GEN(STIDP ZIP(R5)); /* SAVE CPU ID                   */
         STIDP ZIP(R5)
*               RFY                                                0309
*                (R5) UNRSTD;                                      0309
*               RFY                                                0310
*                 HDR BASED(ADDR(AR149HDR));                       0310
*                                                                  0310
*               /*****************************************************/
*               /*                                                   */
*               /* INITIALIZE THE SRB USED BY NUCLEUS RECORDING      */
*               /* ROUTINE                                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0311
*               RFY                                                0311
*                 R2 RSTD;                                         0311
*               R2=ADDR(RCBSRB);                                   0312
         LA    R2,RCBSRB(,R7)                                      0312
*               SRBPKF=ZERO;        /* KEY 0 SRB                     */
         MVI   SRBPKF(R2),X'00'                                    0313
*               SRBRMTR=ZERO;       /* NO RESOURCE MANAGER.          */
         SLR   @14,@14                                             0314
         ST    @14,SRBRMTR(,R2)                                    0314
*               SRBSAVE=ZERO;       /* NO SAVE AREA.                 */
         ST    @14,SRBSAVE(,R2)                                    0315
*               SRBCPAFF=ZERO;      /* RUN ON ANY CPU.               */
         STH   @14,SRBCPAFF(,R2)                                   0316
*               SRBFLNK=ZERO;       /* NO FORWARD CHAIN PTR.         */
         ST    @14,SRBFLNK(,R2)                                    0317
*               SRBPRIOR=ZERO;      /* PRIORITY ZERO.                */
         MVI   SRBPRIOR(R2),X'00'                                  0318
*               SRBPARM=R9;         /* PASS DATA REG TO SRB RTN      */
         ST    R9,SRBPARM(,R2)                                     0319
*               SRBID='SRB ';       /* EBCDIC ID.                    */
         MVC   SRBID(4,R2),@CC02080                                0320
*               SRBASCB=PSAAOLD;    /* MASTERS ASCB ADDRESS          */
         L     @12,PSAAOLD                                         0321
         ST    @12,SRBASCB(,R2)                                    0321
*               SRBPASID=ZERO;      /* NO TASK AFFINITY              */
         STH   @14,SRBPASID(,R2)                                   0322
*               SRBPTCB=ZERO;       /* NO TASK AFFINITY              */
         ST    @14,SRBPTCB(,R2)                                    0323
*               SRBEP=ADDR(RETSRBEP);/* SRBS ENTRY POINT.            */
         LA    @14,RETSRBEP                                        0324
         ST    @14,SRBEP(,R2)                                      0324
*               RFY                                                0325
*                 R2 UNRSTD;                                       0325
*               RCBSRBIU=NO;        /* SHOW SRB CAN BE USED.         */
*                                                                  0326
         NI    RCBSRBIU(R7),B'01111111'                            0326
*               /*****************************************************/
*               /*                                                   */
*               /* CLEAR BUFFERING AREA TO ZERO.                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0327
*               RFY                                                0327
*                (R4,                                              0327
*                 R5,                                              0327
*                 R2,                                              0327
*                 R3) RSTD;         /* RESTRICT REGS FOR MVCL        */
*               R4=ADDR(RCBBUFRS);  /* START ADDR (TO).              */
         LA    R4,RCBBUFRS(,R7)                                    0328
*               R5=LENGTH(RCBBUFRS);/* LENGTH TO CLEAR.              */
         LA    R5,4000                                             0329
*               R2=R4;              /* START ADDR (FROM).            */
         LR    R2,R4                                               0330
*               R3=ZERO;            /* PADD AND COUNT IS ZERO        */
         SLR   R3,R3                                               0331
*               GEN(MVCL R4,R2);    /* CLEAR OUT THE AREA.           */
         MVCL R4,R2
*               RFY                                                0333
*                (R4,                                              0333
*                 R5,                                              0333
*                 R2,                                              0333
*                 R3) UNRSTD;       /* RESTRICT REGS FOR MVCL        */
*               R7=RTCTRCB;         /* BACK TO FIXED RCB             */
         L     @14,CVTPTR                                          0334
         L     @14,CVTRTMCT(,@14)                                  0334
         L     R7,RTCTRCB(,@14)                                    0334
*               RESPECIFY           /* RELEASE GETMAINED BUFFER REG  */
*                (R1) UNRESTRICTED;                                0335
*                                                                  0335
*               /*****************************************************/
*               /*                                                   */
*               /* NOW LOOP THROUGH RCB AND MOVE RECORDS TO GETMAINED*/
*               /* BUFFER                                            */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0336
*               LOOP=YES;           /* INSURE FIRST TIME THROUGH LOOP*/
         OI    LOOP,B'10000000'                                    0336
*               DO WHILE(LOOP=YES); /* MOVE RECORDS TIL ALL MOVED,NO
*                                      READY RECORD OR SPACE       0337
*                                      EXHAUSTED                     */
         B     @DE00337                                            0337
@DL00337 DS    0H                                                  0338
*                 OLDEST=RCBFREE+RCBFLNG;/* FIND OLDEST              */
         LH    @14,RCBFLNG(,R7)                                    0338
         N     @14,@CF02236                                        0338
         AL    @14,RCBFREE(,R7)                                    0338
         ST    @14,OLDEST                                          0338
*                 IF OLDEST>=RCBBUFE THEN/* OUTSIDE BUFFER ?         */
         C     @14,RCBBUFE(,R7)                                    0339
         BL    @RF00339                                            0339
*                   OLDEST=OLDEST-RCBTLNG;/* WRAP TO BEGINNING OF  0340
*                                      BUFFER                        */
         LH    @12,RCBTLNG(,R7)                                    0340
         N     @12,@CF02236                                        0340
         SLR   @14,@12                                             0340
         ST    @14,OLDEST                                          0340
*                 RFY                                              0341
*                   RCBBUF BASED(OLDEST);/* BASE THE BUFFER MAP ON 0341
*                                      THIS REC                      */
@RF00339 DS    0H                                                  0342
*/* THE DUMMY ALLOCATION CHECK IS NOT NEEDED SINCE THE HEADERS CAN 0342
*    NOW WRAP THE BUFFER ALSO. THIS ELIMINATES THE DUMMY SPACE AT THE
*    BOTTOM OF THE BUFFER                                     @ZA19199
*                                                                    */
*                                                                  0342
*                 IF RCBBRDY=NO THEN/* IF RECORD NOT READY           */
         L     @14,OLDEST                                          0342
         TM    RCBBRDY(@14),B'00000001'                            0342
         BNZ   @RF00342                                            0342
*                   LOOP=NO;        /* STOP SEARCH                   */
         NI    LOOP,B'01111111'                                    0343
*                 ELSE              /* RECORD IS READY       @ZA19199*/
*                   DO;                                            0344
         B     @RC00342                                            0344
@RF00342 DS    0H                                                  0345
*                     FREESPSW=YES; /* THE SPACE WILL BE FREED IF  0345
*                                      RECORD IS MOVED               */
         OI    FREESPSW,B'10000000'                                0345
*                     IF RCBBNBFR=YES THEN                         0346
         L     @14,OLDEST                                          0346
         TM    RCBBNBFR(@14),B'00001000'                           0346
         BNO   @RF00346                                            0346
*                       DO;         /* UNBUFFERED RECORD...          */
*                         MOVELEN=NBFRLEN;/* LENGTH                  */
         LA    @12,20                                              0348
         ST    @12,MOVELEN                                         0348
*                         IF RCBBERFG=YES THEN/* IS ERRORID APPENDED
*                                                            @G17EP5W*/
         TM    RCBBERFG(@14),B'00000010'                           0349
         BNO   @RF00349                                            0349
*                           MOVELEN=MOVELEN+LENGTH(NBFRERID);/*    0350
*                                      INCLUDE ITS LENGTH    @G17EP5W*/
         AL    @12,@CF00063                                        0350
         ST    @12,MOVELEN                                         0350
*                       END;        /* END UNBUFFERED RECORD @G17EP5W*/
*                     ELSE          /* BUFFERED RECORD               */
*                       MOVELEN=RCBBLEN+/* LENGTH                    */
*                           CONTLEN;                               0352
         B     @RC00346                                            0352
@RF00346 LA    @14,16                                              0352
         L     @12,OLDEST                                          0352
         LH    @12,RCBBLEN(,@12)                                   0352
         N     @12,@CF02236                                        0352
         ALR   @14,@12                                             0352
         ST    @14,MOVELEN                                         0352
*                     IF REBUFADR->RCBFLNG>=/* SPACE IN GOTTEN BUFFER
*                                      ?                             */
*                         MOVELEN THEN/* FOR THIS RECORD             */
@RC00346 L     @14,MOVELEN                                         0353
         L     @12,REBUFADR                                        0353
         LH    @06,RCBFLNG(,@12)                                   0353
         N     @06,@CF02236                                        0353
         CLR   @14,@06                                             0353
         BH    @RF00353                                            0353
*/********************************************************************/
*/*                                                                  */
*/* THE MOVEREC SEGMENT MOVES THE DATA FROM THE RCB TO A GETMAINED   */
*/* BUFFER. ALLOWING FOR WRAPPED RECORDS IN THE RCB                  */
*/*                                                                  */
*/********************************************************************/
*                                                                  0354
*                       DO;                                        0354
*                         RESPECIFY /* RESTRICT REGISTERS FOR        */
*                          (R2,     /* POINTER TO MOVE FROM          */
*                           R3,     /* LENGTH TO MOVE FROM           */
*                           R4,     /* POINTER TO MOVE TO            */
*                           R5) RESTRICTED;/* LENGTH TO MOVE TO      */
*                         R2=OLDEST;/* MOVE DATA FROM THE OLDEST   0356
*                                      RECORD IN THE FIXED BUFFER    */
         L     @06,OLDEST                                          0356
         LR    R2,@06                                              0356
*                         R4=REBUFADR->RCBFREE;/* MOVE DATA TO NEXT
*                                      FREE SPACE IN GETMAINED BUFFER*/
         L     R4,RCBFREE(,@12)                                    0357
*                         IF RCBBWRAP=YES THEN/* IF THE RECORD WRAPS
*                                      THE BUFFER                    */
         TM    RCBBWRAP(@06),B'10000000'                           0358
         BNO   @RF00358                                            0358
*                           DO;     /* MOVE IN TWO STAGES            */
*                             R5=RCBBUFE-R2;/* MOVE DATA FROM BEGINNG
*                                      OF RECORD             @YM08276*/
         L     R5,RCBBUFE(,R7)                                     0360
         SLR   R5,R2                                               0360
*                             R3=MOVELEN;/* THRU END OF BUFFER     0361
*                                                            @YM08276*/
         LR    R3,@14                                              0361
*                             GEN(MVCL R4,R2);/* MOVE THE DATA       */
         MVCL R4,R2
*                             R2=RCBBUFB;/* WRAP TO BEGINNING OF   0363
*                                      FIXED BUFFER                  */
         L     R2,RCBBUFB(,R7)                                     0363
*                             R5=R3;/* PICK UP REMANING LENGTH     0364
*                                                            @YM08276*/
         LR    R5,R3                                               0364
*                             GEN(MVCL R4,R2);/* MOVE THE DATA       */
         MVCL R4,R2
*                           END;                                   0366
*                         ELSE      /* IF NOT A WRAPPED RECORD       */
*                           DO;                                    0367
         B     @RC00358                                            0367
@RF00358 DS    0H                                                  0368
*                             R3=MOVELEN;/* MOVE THE ENTIRE RECORD   */
         L     @14,MOVELEN                                         0368
         LR    R3,@14                                              0368
*                             R5=MOVELEN;                          0369
         LR    R5,@14                                              0369
*                             GEN(MVCL R4,R2);/* MOVE THE DATA       */
         MVCL R4,R2
*                           END;                                   0371
*                         R7=REBUFADR;/* MAP THE GETMAINED BUFFER    */
@RC00358 L     R7,REBUFADR                                         0372
*                         RCBFLNG=RCBFLNG-(MOVELEN+/* DEDUCT ROUNDED
*                                      RECORD LENGTH                 */
*                             SEVEN&'FFF8'X);/* FROM GETMAINED BUFFER*/
         LA    @14,7                                               0373
         AL    @14,MOVELEN                                         0373
         N     @14,@CF02103                                        0373
         LH    @12,RCBFLNG(,R7)                                    0373
         N     @12,@CF02236                                        0373
         SLR   @12,@14                                             0373
         STH   @12,RCBFLNG(,R7)                                    0373
*                         RCBFREE=RCBFREE+(MOVELEN+/* POINT TO     0374
*                                      FREESPACE IN GETMAINED        */
*                             SEVEN&'FFF8'X);/* BUFFER               */
         AL    @14,RCBFREE(,R7)                                    0374
         ST    @14,RCBFREE(,R7)                                    0374
*                         R7=RTCTRCB;/* MAP THE FIXED BUFFER         */
         L     @14,CVTPTR                                          0375
         L     @14,CVTRTMCT(,@14)                                  0375
         L     R7,RTCTRCB(,@14)                                    0375
*                         RESPECIFY /* RELEASE REGISTERS FROM        */
*                          (R2,     /* POINTER TO MOVE FROM          */
*                           R3,     /* LENGTH TO MOVE FROM           */
*                           R4,     /* POINTER TO MOVE TO            */
*                           R5) UNRESTRICTED;/* LENGTH TO MOVE TO    */
*                       END;                                       0377
*                     ELSE          /* NO - SPACE                    */
*                       DO;         /* IN GETMAINED BUFFER           */
         B     @RC00353                                            0378
@RF00353 DS    0H                                                  0379
*                         LOOP=NO;  /* STOP SEARCH                   */
         NI    LOOP,B'01111111'                                    0379
*                         FREESPSW=NO;/* DO NOT FREE THIS RECORD     */
         NI    FREESPSW,B'01111111'                                0380
*                       END;                                       0381
*                     IF FREESPSW=YES THEN/* IF RECORD TO BE FREED   */
@RC00353 TM    FREESPSW,B'10000000'                                0382
         BNO   @RF00382                                            0382
*/********************************************************************/
*/*                                                                  */
*/* THE FREEREC SEGMENT IS USED TO FREE RECORDS EITHER IN THE RCB    */
*/* WHEN THE RECORDS ARE MOVED TO THE GETMAINED BUFFER, OR THE RCB/  */
*/* GETMAINED BUFFER AFTER WRITE TO OPERATOR OR LOGREC               */
*/*                                                                  */
*/********************************************************************/
*                                                                  0383
*                       DO;                                        0383
*                         RESPECIFY /* RESTRICT REGISTERS FOR        */
*                          (R2,     /* SAVING FREE POINTER           */
*                           R3,     /* SAVING FREE LEN & DUMMY DISP  */
*                           R4,     /* UPDATING FREE POINTER         */
*                           R5,     /* UPDATING DUMMY DISPLACEMENT   */
*                           R6) RESTRICTED;/* UPDATING FREE LENGTH   */
*                         RESPECIFY /* RESTRICT REGISTER FOR         */
*                          (R1) RESTRICTED;/* ADDRESS OF FIELD FOR 0385
*                                      LOAD                          */
*                         R1=ADDR(RCBCDS);/* OBTAIN ADDRESS OF     0386
*                                      RCBFLNG,RCBFREE AND RCBDUM    */
         LA    R1,RCBCDS(,R7)                                      0386
*                         GEN(LM R2,R3,ZIP(R1));/* SAVE FOR        0387
*                                      SUBSEQUENT CDS                */
         LM R2,R3,ZIP(R1)
*                         RESPECIFY /* RELEASE ADDRESS OF FIELD FOR  */
*                          (R1) UNRESTRICTED;/* LOAD                 */
*TRYCDS2:                           /* RETRY POINT IF CDS FAILS      */
*                         R4=R2;    /* FREE POINTER AVAILABLE TO   0389
*                                      UPDATE                        */
TRYCDS2  LR    R4,R2                                               0389
*                         R5=R3;    /* FREE LENGTH & DUMMY DISP FOR  */
         LR    R5,R3                                               0390
*                         R6=R5;    /* UPDATING IN UNIQUE REGISTERS  */
         LR    R6,R5                                               0391
*                         GENERATE;                                0392
         SLL   R5,HALFREG         /* ZERO HIGH ORDER TWO BYTES OF    */
         SRL   R5,HALFREG         /* DUMMY DISPLACEMENT              */
         SRL   R6,HALFREG         /* MOVE FREE LEN TO LOW HALF OF REG*/
*                         IF RCBBNBFR=NO THEN/* IF THE RECORD WAS  0393
*                                      BUFFERED                      */
         L     @14,OLDEST                                          0393
         TM    RCBBNBFR(@14),B'00001000'                           0393
         BNZ   @RF00393                                            0393
*                           R6=R6+(RCBBLEN+/* FREE THE DATA          */
*                               CONTLEN+/* THE CONTROL INFO          */
*                               SEVEN&/* ROUNDED TO A DOUBLE WORD    */
*                               'FFF8'X);                          0394
         LA    @12,23                                              0394
         LH    @14,RCBBLEN(,@14)                                   0394
         N     @14,@CF02236                                        0394
         ALR   @12,@14                                             0394
         N     @12,@CF02103                                        0394
         ALR   R6,@12                                              0394
*                         ELSE                                     0395
*                           DO;     /* IF RECORD WAS NOT BUFFERED    */
         B     @RC00393                                            0395
@RF00393 DS    0H                                                  0396
*                             RFY                                  0396
*                               R1 RSTD;/* RESTRICT REGISTER FOR   0396
*                                      ERRORID LENGTH        @G17EP5W*/
*                             IF RCBBERFG=YES THEN/* IF ERRORID    0397
*                                      APPENDED IN RCB       @G17EP5W*/
         L     @14,OLDEST                                          0397
         TM    RCBBERFG(@14),B'00000010'                           0397
         BNO   @RF00397                                            0397
*                               R1=LENGTH(NBFRERID);/* THEN INCLUDE
*                                      ITS LENGTH FOR FREEING      0398
*                                                            @G17EP5W*/
         LA    R1,10                                               0398
*                             ELSE                                 0399
*                               R1=ZERO;/* OTHERWISE FREE NO       0399
*                                      ADDITIONAL SPACE      @G17EP5W*/
         B     @RC00397                                            0399
@RF00397 SLR   R1,R1                                               0399
*                             R6=R6+(NBFRLEN+/* FREE (16 CONTROL INFO
*                                      + 4 ADDR)                     */
*                                 R1+/* LENGTH OF ERRORID IF PRESENT
*                                                            @G17EP5W*/
*                                 SEVEN&/* ROUNDED TO DOUBLE WORD    */
*                                 'FFF8'X);                        0400
@RC00397 LA    @14,27                                              0400
         ALR   @14,R1                                              0400
         N     @14,@CF02103                                        0400
         ALR   R6,@14                                              0400
*                             RFY                                  0401
*                               R1 UNRSTD;/* UNRESTRICT LENGTH     0401
*                                      REGISTER              @G17EP5W*/
*                           END;    /*                       @G17EP5W*/
*                         GEN(SLL R6,HALFREG);/* MOVE NEW LENGTH TO
*                                      HIGH HALF OF REGISTER         */
@RC00393 DS    0H                                                  0403
         SLL R6,HALFREG
*                         R5=R5×R6; /* PUT FREE LENGTH & DUMMY DISP
*                                      IN SAME REGISTER              */
         OR    R5,R6                                               0404
*                         CDS(R2,R4,RCBCDS);/* PUT VALUES IN RCB     */
         CDS   R2,R4,RCBCDS(R7)                                    0405
*                         BC(4,TRYCDS2);/* IF RCB NOT ALTERED        */
         BC    4,TRYCDS2                                           0406
*                         RESPECIFY /* FREE REGISTERS FROM           */
*                          (R2,     /* SAVING FREE POINTER           */
*                           R3,     /* SAVING FREE LEN & DUMMY DISP  */
*                           R4,     /* UPDATING FREE POINTER         */
*                           R5,     /* UPDATING DUMMY DISPLACEMENT   */
*                           R6) UNRESTRICTED;/* UPDATING FREE LENGTH */
*                       END;                                       0408
*                     IF RCBFLNG=RCBTLNG THEN/* ALL RECORDS DONE     */
@RF00382 CLC   RCBFLNG(2,R7),RCBTLNG(R7)                           0409
         BNE   @RF00409                                            0409
*                       LOOP=NO;    /* STOP MOVING RECORDS           */
         NI    LOOP,B'01111111'                                    0410
*                   END;            /* END RECORD READY PROCESS      */
@RF00409 DS    0H                                                  0412
*               END;                /* END MOVE RECORD LOOP          */
@RC00342 DS    0H                                                  0412
@DE00337 TM    LOOP,B'10000000'                                    0412
         BO    @DL00337                                            0412
*             END;                                                 0413
*           ELSE                    /* GETMAIN NOT SUCESSFUL         */
*             REBUFADR=ZERO;        /* INDICATE NO REBUFFERING       */
         B     @RC00285                                            0414
@RF00285 SLR   @14,@14                                             0414
         ST    @14,REBUFADR                                        0414
*           IF REBUFADR^=ZERO THEN  /* IF GETMAIN OK POINT TO      0415
*                                      GETMAINED                     */
@RC00285 L     @14,REBUFADR                                        0415
         LTR   @14,@14                                             0415
         BZ    @RF00415                                            0415
*             R7=REBUFADR;          /* BUFFER FOR WRITING RECORDS    */
*                                                                  0416
         LR    R7,@14                                              0416
*           /*********************************************************/
*           /*                                                       */
*           /* THIS SEGMENT PERFORMS THE ACTUAL OUTPUTTING OF DATA AS*/
*           /* REQUESTED BY THE USER. AT THIS POINT THE CODE IS      */
*           /* COMMON FOR BOTH A FIXED OR GETMAINED BUFFER. IF       */
*           /* WRAPAROUND (SPLIT) RECORDS ARE IN THE FIXED BUFFER    */
*           /* THEY WILL NOT BE WRITTEN, AND IF THE RECORD WAS       */
*           /* DESTINED FOR LOGREC THE LOST RECORD COUNT WILL BE     */
*           /* UPDATED. POSTING WILL BE REQUESTED IF THE USER HAD    */
*           /* SPECIFIED IT AND THE ASID IS VALID. RCBPTR CONTAINS   */
*           /* ADDRESS OF CORRECT BUFFER AREA.                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0417
*           LOOP=YES;               /* SET DO-WHILE CONTROL.         */
*                                                                  0417
@RF00415 OI    LOOP,B'10000000'                                    0417
*           /*********************************************************/
*           /*                                                       */
*           /* GO THROUGH ENTIRE FIXED/GETMAINED BUFFER.             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0418
*           DO WHILE(LOOP=YES);                                    0418
         B     @DE00418                                            0418
@DL00418 DS    0H                                                  0419
*             OLDEST=RCBFREE+RCBFLNG;/* FIRST/NEXT RECORD ADDR.      */
         LH    @14,RCBFLNG(,R7)                                    0419
         N     @14,@CF02236                                        0419
         AL    @14,RCBFREE(,R7)                                    0419
         ST    @14,OLDEST                                          0419
*             IF OLDEST>=RCBBUFE THEN/* OUTSIDE FIXED BUFFER...      */
         C     @14,RCBBUFE(,R7)                                    0420
         BL    @RF00420                                            0420
*               OLDEST=OLDEST-RCBTLNG;/* -YES, WRAP BACK RCD ADDR.   */
         LH    @12,RCBTLNG(,R7)                                    0421
         N     @12,@CF02236                                        0421
         SLR   @14,@12                                             0421
         ST    @14,OLDEST                                          0421
*/* THE DUMMY ALLOCATION CHECK IS NOT NEEDED SINCE THE HEADERS CAN 0422
*    NOW WRAP THE BUFFER ALSO. THIS ELIMINATES THE DUMMY SPACE AT THE
*    BOTTOM OF THE BUFFER                                     @ZA19199
*                                                                    */
*                                                                  0422
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK IF ALL RECORDS HAVE BEEN PROCESSED.           */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0422
*             IF RCBFLNG=RCBTLNG THEN/* ALL RECORDS GONE...          */
@RF00420 CLC   RCBFLNG(2,R7),RCBTLNG(R7)                           0422
         BNE   @RF00422                                            0422
*               LOOP=NO;            /* -YES, GET OUT OF LOOP.        */
         NI    LOOP,B'01111111'                                    0423
*             ELSE                  /* RECORDS STILL REMAIN.         */
*               DO;                                                0424
         B     @RC00422                                            0424
@RF00422 DS    0H                                                  0425
*                 RFY                                              0425
*                   RCBBUF BASED(OLDEST);                          0425
*                                                                  0425
*                 /***************************************************/
*                 /*                                                 */
*                 /* CHECK IF NEXT RECORD IS READY TO OUTPUT.        */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0426
*                 IF RCBBRDY=NO THEN/* RECORD IN SHAPE TO WRITE.     */
         L     @14,OLDEST                                          0426
         TM    RCBBRDY(@14),B'00000001'                            0426
         BNZ   @RF00426                                            0426
*                   LOOP=NO;        /* -NO, LEAVE IT ALONE (ONLY   0427
*                                      APPLIES IF RECORD IS IN FIXED
*                                      BUFFER).                      */
         NI    LOOP,B'01111111'                                    0427
*                 ELSE              /* RECORD IS READY.              */
*                   DO;                                            0428
*                                                                  0428
         B     @RC00426                                            0428
@RF00426 DS    0H                                                  0429
*                     /***********************************************/
*                     /*                                             */
*                     /* OUTPUT THE RECORD IF IT IS CONTIGUOUS. NOTE-*/
*                     /* IT WILL ALWAYS BE IF WE ARE IN THE GETMAINED*/
*                     /* BUFFER. TEST IF RECORD IS ADDRESSABLE FORM  */
*                     /* MASTER MEMORY IF NO, IT WILL NOT BE         */
*                     /* WRITTEN,AND IF IT IS FOR LOGREC UPDATE      */
*                     /* LOSTRECORD COUNT.                           */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0429
*                     NOTADDR=NO;   /* INIT SWITCH                   */
         NI    NOTADDR,B'01111111'                                 0429
*                     IF RCBBNBFR=YES THEN/* UNBUFFERED RECORD...    */
         L     @14,OLDEST                                          0430
         TM    RCBBNBFR(@14),B'00001000'                           0430
         BNO   @RF00430                                            0430
*                       DO;         /* YES - CHECK IT                */
*                         RFY                                      0432
*                           R1 RSTD;                               0432
*                         R1=ADDR(NBFRDATA);/* ADDR OF DATA - TO   0433
*                                      HANDLE WRAP HEADERS   @ZA19199*/
         AL    @14,@CF00054                                        0433
         LR    R1,@14                                              0433
*                         IF R1>=RCBBUFE THEN/* DOES THE HEADER WRAP
*                                                            @ZA19199*/
         C     R1,RCBBUFE(,R7)                                     0434
         BL    @RF00434                                            0434
*                           R1=R1-RCBTLNG;/* YES - RESET PTR FOR WRAP
*                                      CASE                  @ZA19199*/
         LH    @14,RCBTLNG(,R7)                                    0435
         N     @14,@CF02236                                        0435
         SLR   R1,@14                                              0435
*                         ELSE                                     0436
*                           ;       /* NO - POINTER OK       @ZA19199*/
@RF00434 DS    0H                                                  0437
*                         RFY                                      0437
*                           NBFREC BASED(R1);/* REBASE PTR TO HANDLE
*                                      WRAP CASE             @ZA19199*/
*                         R1=NBFRDATA;/* GET RECORD ADDR             */
         L     R1,NBFRDATA(,R1)                                    0438
*                         RFY                                      0439
*                           NBFREC BASED(ADDR(RCBBDATA));/* REBASE 0439
*                                      BACK                  @ZA19199*/
*                         GEN(LRA R1,ZIP(R1));/* TRY DAT             */
         LRA R1,ZIP(R1)
*                         BC(8,OKADDR);/* ADDRESS OK,BRANCH          */
         BC    8,OKADDR                                            0441
*                         NOTADDR=YES;/* SHOW RECORD UNADDRESS ABLE  */
         OI    NOTADDR,B'10000000'                                 0442
*OKADDR:                                                           0443
*                         ;         /* TARGET IF ADDR OK             */
OKADDR   DS    0H                                                  0444
*                         RFY                                      0444
*                           R1 UNRSTD;                             0444
*                       END;                                       0445
*                     IF NOTADDR=YES×/* BAD RECORD ADDR - OR         */
*                         (REBUFADR=ZERO&/* IN THE FIXED BUFFER...   */
*                         RCBBWRAP=YES) THEN/* .AND NON-CONTIGUOUS...
*                                      -YES, WE WILL DROP IT.        */
@RF00430 TM    NOTADDR,B'10000000'                                 0446
         BO    @RT00446                                            0446
         L     @14,REBUFADR                                        0446
         LTR   @14,@14                                             0446
         BNZ   @RF00446                                            0446
         L     @14,OLDEST                                          0446
         TM    RCBBWRAP(@14),B'10000000'                           0446
         BNO   @RF00446                                            0446
@RT00446 DS    0H                                                  0447
*                       DO;                                        0447
*                         IF RCBBLREC=YES THEN/* IF LOGREC RECORD    */
         L     @14,OLDEST                                          0448
         TM    RCBBLREC(@14),B'01000000'                           0448
         BNO   @RF00448                                            0448
*/********************************************************************/
*/* THE PURPOSE OF THE INCLCNT SEGMENT IS TO INCREMENT THE LOST      */
*/* RECORD COUNT FOR NOT SCHEDULED LOGREC REQUESTS                   */
*/********************************************************************/
*                                                                  0449
*                           DO;                                    0449
*                             RESPECIFY/* RESTRICT REGISTERS FOR     */
*                              (R4, /* SAVING LOST RECORD COUNT      */
*                               R5) RESTRICTED;/* INCREMENTING LOST
*                                      REC CT                        */
*                             R4=RCBCS1;/* SAVE CURRENT LOST RECORD
*                                      COUNT                         */
         L     R4,RCBCS1(,R7)                                      0451
*TRYCS1:                            /* RCBLCNT WILL BE INCREMENTED 0452
*                                      VIA CS EFFECTING SERIALIZATION*/
*                             R5=R4;/* MAKE COUNT AVAILABLE FOR    0452
*                                      INCREMENTING                  */
TRYCS1   LR    R5,R4                                               0452
*                             R5=R5+HIBYTE1;/* INCREMENT BY ONE      */
         AL    R5,HIBYTE1                                          0453
*                             CS(R4,R5,RCBCS1);/* PLACE UPDATED COUNT
*                                      IN THE RCB                    */
         CS    R4,@05,RCBCS1(R7)                                   0454
*                             BC(4,TRYCS1);/* IF THE RCB NOT ALTERED */
         BC    4,TRYCS1                                            0455
*                             RESPECIFY/* RELEASE REGISTERS FROM     */
*                              (R4, /* SAVING LOST RECORD COUNT      */
*                               R5) UNRESTRICTED;/* INCREMENTING LOST
*                                      RECORD COUNT                  */
*                           END;    /* END INCLCNT                   */
*                       END;                                       0458
*                     ELSE                                         0459
*                       DO;                                        0459
*                                                                  0459
         B     @RC00446                                            0459
@RF00446 DS    0H                                                  0460
*                         /*******************************************/
*                         /*                                         */
*                         /* THIS SEGMENT PERFORMS THE ACTUAL I/O    */
*                         /* INVOLVED IN OUTPUTTING THE DATA (TO     */
*                         /* LOGREC OR THE OPERATOR).                */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0460
*                         RFY                                      0460
*                          (R1,                                    0460
*                           R0) RSTD;                              0460
*                         IF RCBBNBFR=YES THEN/* IF RECORD NOT     0461
*                                      BUFFERED              @G17EP5W*/
         L     @14,OLDEST                                          0461
         TM    RCBBNBFR(@14),B'00001000'                           0461
         BNO   @RF00461                                            0461
*                           DO;     /* PROCESS NON-BUFF      @G17EP5W*/
*/****************************************************************** */
*/*                                                                  */
*/*  THIS SEGMENT ATTEMPTS TO BUILD A LOGREC RECORD WITH AN          */
*/*  ERRORID APPENDED FOR A NON-BUFFERED RECORD WHICH CONTAINS       */
*/*  AN ERRORID.  THE NEW RECORD IS BUILT IN A BUFFER WHICH          */
*/*  MUST BE AT LEAST RCBBLEN + LENGTH(RCBBERID) IN LENGTH.          */
*/*  IF AN ADEQUATE BUFFER ALREADY EXISTS, THEN IT IS USED.          */
*/*  OTHERWISE, IF NO BUFFER EXISTS, OR THE BUFFER IS TOO            */
*/*  SMALL, A GETMAIN IS ISSUED FOR THE REQUIRED LENGTH.  ANY        */
*/*  SMALLER BUFFER IS FREED.  THE DATA AND ERRORID ARE MOVED        */
*/*  TO THE BUFFER.  RCBBLEN IS UPDATED TO THE NEW LENGTH            */
*/*  AND NBFRDATA POINTS TO THE NEW AREA.  IF THE GETMAIN            */
*/*  FAILED, THEN THE RECORD WILL BE WRITTEN FROM THE ORIGINAL       */
*/*  BUFFER WITHOUT AN ERRORID.                                      */
*/*                                                                  */
*/****************************************************************** */
*                                                                  0463
*                             IF RCBBLREC=YES&/* LOGREC RECORD     0463
*                                                            @G17EP5W*/
*                                 RCBBERFG=YES THEN/* WITH AN ERRORID
*                                      THEN                  @G17EP5W*/
         TM    RCBBLREC(@14),B'01000000'                           0463
         BNO   @RF00463                                            0463
         TM    RCBBERFG(@14),B'00000010'                           0463
         BNO   @RF00463                                            0463
*                               DO; /* ATTEMPT TO REBUFFER   @G17EP5W*/
*                                 RFY                              0465
*                                   R5 RSTD;/* RESTRICT LENGTH REG.
*                                                            @G17EP5W*/
*                                 R5=RCBBLEN+/* CALCULATE BUFFER   0466
*                                      SPACE                 @G17EP5W*/
*                                     LENGTH(NBFRERID);/* DATA +   0466
*                                      ERRORID LENGTH        @G17EP5W*/
         LA    R5,10                                               0466
         LH    @14,RCBBLEN(,@14)                                   0466
         N     @14,@CF02236                                        0466
         ALR   R5,@14                                              0466
*                                 IF R5>BLENGTH THEN/* IF A BUFFER OF
*                                      SUFFICIENT SIZE DOES NOT    0467
*                                      ALREADY EXIST         @G17EP5W*/
         L     @14,BLENGTH                                         0467
         CR    R5,@14                                              0467
         BNH   @RF00467                                            0467
*                                   DO;/* THEN ATTEMPT TO GET ONE  0468
*                                                            @G17EP5W*/
*                                    EXTRTN=YES;/* IF A BUFFER EXISTS
*                                                            @G17EP5W*/
         OI    EXTRTN,B'01000000'                                  0469
*                                    IF BLENGTH^=NOBUFFER THEN/* FREE
*                                      IT BEFORE             @G17EP5W*/
         LTR   @14,@14                                             0470
         BZ    @RF00470                                            0470
*                                     DO;/* GETTING A LARGER ONE   0471
*                                                            @G17EP5W*/
*                                                                  0471
*                                      /******************************/
*                                      /*                            */
*                                      /* SHOW EXTERNAL RTN  @G17EP5W*/
*                                      /*                            */
*                                      /******************************/
*                                                                  0472
*                                      RFY                         0472
*                                       (R1,                       0472
*                                        R4) RSTD;/* RESTRICT REG 4
*                                                            @G17EP5W*/
*                                      R1=BUFADR;/* ADDR. TO BE FREED
*                                                            @G17EP5W*/
         L     R1,BUFADR                                           0473
*                                      R4=BLENGTH;/* LENGTH TO BE  0474
*                                      FREED                 @G17EP5W*/
         LR    R4,@14                                              0474
*                                      RETRYADR=ADDR(AFTBFREE);/*  0475
*                                      CURRENT RETRY ADDR    @G17EP5W*/
         LA    @14,AFTBFREE                                        0475
         ST    @14,RETRYADR                                        0475
*                                      GEN                         0476
*(FREEMAIN RC,A=(R1),LV=(R4),SP=252 );/* FREE SMALLER BUFFER @G17EP5W*/
         FREEMAIN RC,A=(R1),LV=(R4),SP=252
*AFTBFREE:                                                         0477
*                                      RFY                         0477
*                                       (R1,                       0477
*                                        R4) UNRSTD;/* FREE REG 4  0477
*                                                            @G17EP5W*/
AFTBFREE DS    0H                                                  0478
*                                     END;/* END SMALL BUFFER      0478
*                                                            @G17EP5W*/
*                                    RETRYADR=ADDR(AFTBGET);/* SET 0479
*                                      NEW RETRY ADDR        @G17EP5W*/
@RF00470 LA    @14,AFTBGET                                         0479
         ST    @14,RETRYADR                                        0479
*                                    BLENGTH=R5;/* SAVE BUFFER LENGTH
*                                                            @G17EP5W*/
         ST    R5,BLENGTH                                          0480
*                                    GEN REFS(PARMLIST)            0481
*                                        (STM R8,R7,PARMLIST);/* SAVE
*                                      REGS IN CASE OF ERROR @G17EP5W*/
         STM R8,R7,PARMLIST
*                                    RFY                           0482
*                                     (R1,                         0482
*                                      R15) RSTD;/* RESTRICT GETMAIN
*                                      REGS                  @G17EP5W*/
*                                    DO;/* GETMAIN (RC) LV(BLENGTH)
*                                      SP(252)                       */
*                                     RESPECIFY                    0484
*                                      (GPR01F,                    0484
*                                       GPR15F,                    0484
*                                       GPR00F) RESTRICTED;        0484
*                                     GPR01F=0;/* REG 1 MUST BE ZERO */
         SLR   GPR01F,GPR01F                                       0485
*                                     GPR15F=0;/* RC-TYPE GETMAIN    */
         SLR   GPR15F,GPR15F                                       0486
*                                     GPR00F=BLENGTH;/* LENGTH     0487
*                                      REQUESTED                     */
         L     GPR00F,BLENGTH                                      0487
*                                     GPR15F=GPR15F×((252)*256);/* SP
*                                      IN BYTE 2                     */
         O     GPR15F,@CF02226                                     0488
*                                     SVC(120);/* RC/RU-FORM OF    0489
*                                      GETMAIN                       */
         SVC   120                                                 0489
*                                     RESPECIFY                    0490
*                                      (GPR01F,                    0490
*                                       GPR15F,                    0490
*                                       GPR00F) UNRESTRICTED;      0490
*                                    END;/* GETMAIN (RC) LV(BLENGTH)
*                                      SP(252)               @G17EP5W*/
*AFTBGET:                                                          0492
*                                    EXTRTN=NO;/* INDICATE NOT     0492
*                                      EXTERNAL              @G15EP5W*/
AFTBGET  NI    EXTRTN,B'10111111'                                  0492
*                                    RETRYADR=ADDR(AWAKE);/* CHANGE
*                                      RETRY ADDR            @G17EP5W*/
         LA    @14,AWAKE                                           0493
         ST    @14,RETRYADR                                        0493
*                                    GEN REFS(PARMLIST)            0494
*                                        (STM R8,R7,PARMLIST);/* SAVE
*                                      REGS IN CASE OF ERROR @G17EP5W*/
         STM R8,R7,PARMLIST
*                                    IF R15=ZERO THEN/* IF GETMAIN 0495
*                                      SUCCESSFUL            @G17EP5W*/
         LTR   R15,R15                                             0495
         BNZ   @RF00495                                            0495
*                                     BUFADR=R1;/* SAVE BUFFER     0496
*                                      ADDRESS               @G17EP5W*/
         ST    R1,BUFADR                                           0496
*                                    ELSE/* IF GETMAIN FAILED      0497
*                                                            @G17EP5W*/
*                                     BLENGTH=NOBUFFER;/* SET BUFFER
*                                      LENGTH TO 0           @G17EP5W*/
         B     @RC00495                                            0497
@RF00495 SLR   @14,@14                                             0497
         ST    @14,BLENGTH                                         0497
*                                    RFY                           0498
*                                     (R1,                         0498
*                                      R15) UNRSTD;/* FREE UP GETMAIN
*                                      REGS                  @G17EP5W*/
@RC00495 DS    0H                                                  0499
*                                   END;/* END OF BLENGTH TOO SMALL
*                                                            @G17EP5W*/
*                                 RFY                              0500
*                                   ERRORID BASED(R4);/* REFERENCE 0500
*                                      FOR ERRORID           @G17EP5W*/
@RF00467 DS    0H                                                  0501
*                                 IF BLENGTH>=R5 THEN/* IF BUFFER  0501
*                                      EXISTS                @G17EP5W*/
         C     R5,BLENGTH                                          0501
         BH    @RF00501                                            0501
*                                   DO;/* MOVE DATA INTO IT  @G17EP5W*/
*                                    RFY                           0503
*                                     (R1,/* RESTRICT        @G17EP5W*/
*                                      R4,/* REGISTERS       @G17EP5W*/
*                                      R5,/* TO BE           @G17EP5W*/
*                                      R6,/* USED IN         @G17EP5W*/
*                                      R7) RSTD;/* MOVE      @G17EP5W*/
*                                    R1=R7;/* SAVE ADDR. OF 4K BUF 0504
*                                                            @G17EP5W*/
         LR    R1,R7                                               0504
*                                    R7=RCBBLEN;/* LENGTH TO BE MOVED
*                                                            @G17EP5W*/
         L     @12,OLDEST                                          0505
         LH    R7,RCBBLEN(,@12)                                    0505
         N     R7,@CF02236                                         0505
*                                    R4=BUFADR;/* NEW BUFFER ADDRESS
*                                                            @G17EP5W*/
         L     R4,BUFADR                                           0506
*                                    R6=NBFRDATA;/* OLD BUFFER     0507
*                                      ADDRESS               @G17EP5W*/
         L     R6,NBFRDATA+16(,@12)                                0507
*                                    RCBBLEN=R5;/* UPDATE WRITE    0508
*                                      LENGTH                @G17EP5W*/
         STH   R5,RCBBLEN(,@12)                                    0508
*                                    R5=R7;/* LENGTH TO MOVE IS    0509
*                                      LENGTH OF ORIGINAL BUFFER   0509
*                                                            @G17EP5W*/
         LR    R5,R7                                               0509
*                                    MVCL(R4,R6);/* MOVE DATA      0510
*                                                            @G17EP5W*/
         MVCL  R4,R6                                               0510
*                                    ERRORID=NBFRERID;/* ADD ERRORID
*                                                            @G17EP5W*/
         LA    @12,16                                              0511
         AL    @12,OLDEST                                          0511
         MVC   ERRORID(10,R4),NBFRERID(@12)                        0511
*                                    IF NBFRDATA->LRBHTYPE=/* IF THIS
*                                      IS LRB                @G17EP5W*/
*                                        LRBHMCH THEN              0512
         L     @12,NBFRDATA(,@12)                                  0512
         CLI   LRBHTYPE(@12),X'13'                                 0512
         BNE   @RF00512                                            0512
*                                     DO;/* THEN FREE IT     @G17EP5W*/
*                                      NBFRDATA->LRBMACT=ZERO;/* FOR
*                                      SUBSEQUENT USE        @G17EP5W*/
         MVI   LRBMACT(@12),X'00'                                  0514
*                                      BUFADR->HDRDS13=YES;/*      0515
*                                      INDICATE ERRORID APPENDED   0515
*                                                            @G17EP5W*/
         L     @12,BUFADR                                          0515
         OI    HDRDS13(@12),B'00010000'                            0515
*                                     END;/* END LRB RECORD  @G17EP5W*/
*                                    NBFRDATA=BUFADR;/* UPDATE WRITE
*                                      ADDRESS               @G17EP5W*/
@RF00512 L     @12,BUFADR                                          0517
         L     @15,OLDEST                                          0517
         ST    @12,NBFRDATA+16(,@15)                               0517
*                                    R7=R1;/* RESTORE 4K BUF ADDR  0518
*                                                            @G17EP5W*/
         LR    R7,R1                                               0518
*                                    RFY                           0519
*                                     (R1,/* UNRESTRICT      @G17EP5W*/
*                                      R4,/* REGISTERS       @G17EP5W*/
*                                      R5,/* USED IN         @G17EP5W*/
*                                      R6);/* MOVE           @G17EP5W*/
*                                   END;/* END MOVE DATA     @G17EP5W*/
*                               END;/* END REBUFFER ATTEMPT  @G17EP5W*/
@RF00501 DS    0H                                                  0522
*                             R1=NBFRDATA;/* ... TAKE USERS ADDRESS  */
@RF00463 L     @12,OLDEST                                          0522
         L     R1,NBFRDATA+16(,@12)                                0522
*                           END;    /* END NONBUFFERED RECORDS     0523
*                                                            @G17EP5W*/
*                         ELSE      /* IF DATA BUFFERED              */
*                           R1=ADDR(RCBBDATA);/* USE OUR BUFFERED  0524
*                                      ADDRESS.                      */
*                                                                  0524
         B     @RC00461                                            0524
@RF00461 L     R1,OLDEST                                           0524
         LA    R1,RCBBDATA(,R1)                                    0524
*                         /*******************************************/
*                         /*                                         */
*                         /* CHECK FOR OUTPUT DESTINATION.           */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0525
*                         IF RCBBLREC=NO&/* WTO OR LOGREC...         */
*                             RCBBWTO=YES THEN                     0525
@RC00461 L     @12,OLDEST                                          0525
         TM    RCBBWTO(@12),B'00100000'                            0525
         BNO   @RF00525                                            0525
         TM    RCBBLREC(@12),B'01000000'                           0525
         BNZ   @RF00525                                            0525
*                           DO;     /* -WTO.                         */
*                             EXTRTN=YES;/* SHOW IN EXTERNAL ROUTINE
*                                      FOR RECOVERY                  */
         OI    EXTRTN,B'01000000'                                  0527
*                             RETRYADR=ADDR(AFTWTO);/* PRESET RETRY
*                                      ADDR                          */
         LA    @12,AFTWTO                                          0528
         ST    @12,RETRYADR                                        0528
*                             GEN SETS(PARMLIST)(STM R8,R7,PARMLIST);
         STM R8,R7,PARMLIST
*                                   /*                       @YM02750*/
*                             GEN(WTO  MF=(E,(1)));/* PUT DATA TO  0530
*                                      OPERATOR.                     */
         WTO  MF=(E,(1))
*AFTWTO:                                                           0531
*                             ;     /* RETRY IF WTO FAILURE          */
AFTWTO   DS    0H                                                  0532
*                             EXTRTN=NO;/* BACK TO RECORD            */
         NI    EXTRTN,B'10111111'                                  0532
*                             RETRYADR=ADDR(AWAKE);/* RESET RETRY  0533
*                                      ADDR                          */
         LA    @12,AWAKE                                           0533
         ST    @12,RETRYADR                                        0533
*                           END;                                   0534
*                         ELSE      /* -LOGREC.                      */
*                           DO;                                    0535
         B     @RC00525                                            0535
@RF00525 DS    0H                                                  0536
*                             R0=-RCBBLEN;/* TWOS COMPLEMENT LENGTH  */
         L     @12,OLDEST                                          0536
         LH    R0,RCBBLEN(,@12)                                    0536
         N     R0,@CF02236                                         0536
         LCR   R0,R0                                               0536
*                             RFY                                  0537
*                               LRB BASED(R1);                     0537
*                             IF LRBHTYPE=LRBHMCH&/* MCH RECORD    0538
*                                      OVERLAID...                   */
*                                 LRBMCLB='FF'X THEN/* -YES, UP LOST
*                                      RCD COUNT AND DONT OUTPUT RCD.*/
         CLI   LRBHTYPE(R1),X'13'                                  0538
         BNE   @RF00538                                            0538
         CLI   LRBMCLB(R1),X'FF'                                   0538
         BNE   @RF00538                                            0538
*/********************************************************************/
*/* THE PURPOSE OF THE INCLCNT SEGMENT IS TO INCREMENT THE LOST      */
*/* RECORD COUNT FOR NOT SCHEDULED LOGREC REQUESTS                   */
*/********************************************************************/
*                                                                  0539
*                               DO;                                0539
*                                 RESPECIFY/* RESTRICT REGISTERS FOR */
*                                  (R4,/* SAVING LOST RECORD COUNT   */
*                                   R5) RESTRICTED;/* INCREMENTING 0540
*                                      LOST REC CT                   */
*                                 R4=RCBCS1;/* SAVE CURRENT LOST   0541
*                                      RECORD COUNT                  */
         L     R4,RCBCS1(,R7)                                      0541
*TRYCS2:                            /* RCBLCNT WILL BE INCREMENTED 0542
*                                      VIA CS EFFECTING SERIALIZATION*/
*                                 R5=R4;/* MAKE COUNT AVAILABLE FOR
*                                      INCREMENTING                  */
TRYCS2   LR    R5,R4                                               0542
*                                 R5=R5+HIBYTE1;/* INCREMENT BY ONE  */
         AL    R5,HIBYTE1                                          0543
*                                 CS(R4,R5,RCBCS1);/* PLACE UPDATED
*                                      COUNT IN THE RCB              */
         CS    R4,@05,RCBCS1(R7)                                   0544
*                                 BC(4,TRYCS2);/* IF THE RCB NOT   0545
*                                      ALTERED                       */
         BC    4,TRYCS2                                            0545
*                                 RESPECIFY/* RELEASE REGISTERS FROM */
*                                  (R4,/* SAVING LOST RECORD COUNT   */
*                                   R5) UNRESTRICTED;/* INCREMENTING
*                                      LOST RECORD COUNT             */
*                               END;/* END INCLCNT                   */
*                             ELSE  /* IF NOT MCH & OVERLAID         */
*                               DO; /* PUT RECORD TO SYS1.LOGREC.    */
         B     @RC00538                                            0548
@RF00538 DS    0H                                                  0549
*                                 DATAPTRS=R1;/* PRESERVE DATA     0549
*                                      ADDRESS.                      */
         ST    R1,DATAPTRS                                         0549
*                                 EXTRTN=YES;/* SHOW IN EXTERNAL   0550
*                                      ROUTINE FOR RECOVERY          */
         OI    EXTRTN,B'01000000'                                  0550
*                                 RETRYADR=ADDR(AFT76A);/* PRESET  0551
*                                      RETRY ADDR                    */
         LA    @12,AFT76A                                          0551
         ST    @12,RETRYADR                                        0551
*                                 GEN SETS(PARMLIST)               0552
*                                     (STM R8,R7,PARMLIST);/*      0552
*                                                            @YM02750*/
         STM R8,R7,PARMLIST
*                                 SVC(76);/* WRITE TO SYS1.LOGREC    */
         SVC   76                                                  0553
*AFT76A:                                                           0554
*                                 ; /* RETRY IF SVC76 FAILURE        */
AFT76A   DS    0H                                                  0555
*                                 EXTRTN=NO;/* BACK TO RECORD        */
         NI    EXTRTN,B'10111111'                                  0555
*                                 RETRYADR=ADDR(AWAKE);/* RESET RETRY
*                                      ADDR                          */
         LA    @12,AWAKE                                           0556
         ST    @12,RETRYADR                                        0556
*                                 R1=DATAPTRS;/* REGAIN DATA ADDRESS.*/
         L     R1,DATAPTRS                                         0557
*                               END;                               0558
*                             IF LRBHTYPE=LRBHMCH THEN/* MCH       0559
*                                      RECORD...                     */
@RC00538 CLI   LRBHTYPE(R1),X'13'                                  0559
         BNE   @RF00559                                            0559
*                               LRBMACT=ZERO;/* -YES, SHOW BUFFER  0560
*                                      FREE.                         */
         MVI   LRBMACT(R1),X'00'                                   0560
*                             RFY                                  0561
*                               LRB BASED;                         0561
@RF00559 DS    0H                                                  0562
*                             RFY                                  0562
*                              (R1,                                0562
*                               R0) UNRSTD;                        0562
*                           END;    /* END OF LOGREC OUTPUT.         */
*                       END;                                       0564
*                                                                  0564
@RC00525 DS    0H                                                  0565
*                     /***********************************************/
*                     /*                                             */
*                     /* THIS SEGMENT WILL POST THE USERS ECB TO     */
*                     /* INDICATE THAT THE DATA HAS BEEN WRITTEN.    */
*                     /* POSTING WILL NOT BE DONE IF IT WAS NOT      */
*                     /* REQUESTED OR IF THE ASID IS INVALID.        */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0565
*                     RFY                                          0565
*                       ASVT BASED(CVTASVT);                       0565
@RC00446 DS    0H                                                  0566
*                     IF RCBBPOST=YES&/* WANT POSTING...             */
*                         RCBBNBFR=YES THEN/* RECORD UNBUFFED..    0566
*                                                            @YM02617*/
         L     @12,OLDEST                                          0566
         TM    RCBBPOST(@12),B'00001100'                           0566
         BNO   @RF00566                                            0566
*                       DO;         /* -YES.                         */
*                         IF RCBBASID>ZERO&/* VALID NUMERICAL ASID...*/
*                             RCBBASID<=ASVTMAXU&ASVTAVAL(RCBBASID)=NO
*                           THEN    /* ...AND ASID IN USE...         */
         LH    @06,RCBBASID(,@12)                                  0568
         N     @06,@CF02236                                        0568
         LTR   @06,@06                                             0568
         BNP   @RF00568                                            0568
         L     @01,CVTPTR                                          0568
         L     @15,CVTASVT(,@01)                                   0568
         C     @06,ASVTMAXU(,@15)                                  0568
         BH    @RF00568                                            0568
         SLA   @06,2                                               0568
         ALR   @15,@06                                             0568
         TM    ASVTAVAL-4(@15),B'10000000'                         0568
         BNZ   @RF00568                                            0568
*                           DO;     /* YES,POST THE ECB.             */
*                             RFY                                  0570
*                               R5 RSTD;/* PTR TO THE ECB TO POST TO
*                                      HANDLE WRAP HEADERS   @ZA19199*/
*                             R5=ADDR(RCBBECB);/* ADDR OF ECB TO POST
*                                                            @ZA19199*/
         LA    R5,RCBBECB(,@12)                                    0571
*                             RFY                                  0572
*                               USERECB BASED(ECBADR);/* TO INSURE 0572
*                                      PROPER ADDRESS OF ECB @ZA19199*/
*                             IF R5>=RCBBUFE THEN/* DOES THE HDR WRAP
*                                                            @ZA19199*/
         C     R5,RCBBUFE(,R7)                                     0573
         BL    @RF00573                                            0573
*                               R5=R5-RCBTLNG;/* YES - RESET POINTER
*                                                            @ZA19199*/
         LH    @12,RCBTLNG(,R7)                                    0574
         N     @12,@CF02236                                        0574
         SLR   R5,@12                                              0574
*                             ELSE                                 0575
*                               ;   /* HDR DOES NOT WRAP     @ZA19199*/
@RF00573 DS    0H                                                  0576
*                             EXTRTN=YES;/* SHOW IN EXTERNAL ROUTINE
*                                      FOR RECOVERY                  */
         OI    EXTRTN,B'01000000'                                  0576
*                             RETRYADR=ADDR(AFTPSTB);/* PRESET RETRY
*                                      ADDR                          */
         LA    @12,AFTPSTB                                         0577
         ST    @12,RETRYADR                                        0577
*                             GEN SETS(PARMLIST)(STM R8,R7,PARMLIST);
         STM R8,R7,PARMLIST
*                                   /*                       @YM02750*/
*                             DO;   /* POST (USERECB,0) ASCB(ASVTENTY
*                                      (RCBBASID)->UASCBADR)       0579
*                                      ERRET(CVTBRET)                */
*                               I002=I002&&I002;/* INITIALIZE LIST   */
         XC    I002(12),I002                                       0580
*                               I00201=ADDR(USERECB);/* ECB ADDRESS  */
         L     @12,ECBADR(,R5)                                     0581
         ST    @12,I00201                                          0581
*                               I00202=ADDR(ASVTENTY(RCBBASID)->   0582
*                                   UASCBADR);/* ASCB ADDRESS        */
         L     @12,OLDEST                                          0582
         LH    @12,RCBBASID(,@12)                                  0582
         N     @12,@CF02236                                        0582
         SLA   @12,2                                               0582
         L     @06,CVTPTR                                          0582
         L     @04,CVTASVT(,@06)                                   0582
         L     @12,ASVTENTY-4(@12,@04)                             0582
         ST    @12,I00202                                          0582
*                               I00203=ADDR(CVTBRET);/* ERRET ADDRESS*/
         LA    @12,CVTBRET(,@06)                                   0583
         ST    @12,I00203                                          0583
*                               RESPECIFY                          0584
*                                (GPR00F,                          0584
*                                 GPR01P) RESTRICTED;              0584
*                               GPR00F=0;/* POST CODE IN R0          */
         SLR   GPR00F,GPR00F                                       0585
*                               GPR01P=ADDR(I002);/* PARMLIST ADDR   */
         LA    GPR01P,I002                                         0586
*                               GPR01P=GPR01P×'80000000'X;/* SET LIST
*                                      FORM IND                      */
         O     GPR01P,@CF00108                                     0587
*                               SVC(2);/* ISSUE POST SVC             */
         SVC   2                                                   0588
*                               RESPECIFY                          0589
*                                (GPR00F,                          0589
*                                 GPR01P) UNRESTRICTED;            0589
*                             END;  /* POST (USERECB,0) ASCB(ASVTENTY
*                                      (RCBBASID)->UASCBADR)       0590
*                                      ERRET(CVTBRET)                */
*AFTPSTB:                                                          0591
*                             ;     /* RETRY IF POST FAILURE         */
AFTPSTB  DS    0H                                                  0592
*                             RFY                                  0592
*                               USERECB BASED(RCBBECB);/* REBASE BACK
*                                                            @ZA19199*/
*                             RFY                                  0593
*                               R5 UNRSTD;/* FREE THE ECB POINTER  0593
*                                                            @ZA19199*/
*                             EXTRTN=NO;/* BACK TO RECORD            */
         NI    EXTRTN,B'10111111'                                  0594
*                             RETRYADR=ADDR(AWAKE);/* RESET RETRY  0595
*                                      ADDR                          */
         LA    @12,AWAKE                                           0595
         ST    @12,RETRYADR                                        0595
*                           END;                                   0596
*                       END;                                       0597
@RF00568 DS    0H                                                  0598
*                     RFY                                          0598
*                       ASVT BASED;                                0598
*                                                                  0598
@RF00566 DS    0H                                                  0599
*/********************************************************************/
*/*                                                                  */
*/* THE FREEREC SEGMENT IS USED TO FREE RECORDS EITHER IN THE RCB    */
*/* WHEN THE RECORDS ARE MOVED TO THE GETMAINED BUFFER, OR THE RCB/  */
*/* GETMAINED BUFFER AFTER WRITE TO OPERATOR OR LOGREC               */
*/*                                                                  */
*/********************************************************************/
*                                                                  0599
*                     DO;                                          0599
*                       RESPECIFY   /* RESTRICT REGISTERS FOR        */
*                        (R2,       /* SAVING FREE POINTER           */
*                         R3,       /* SAVING FREE LEN & DUMMY DISP  */
*                         R4,       /* UPDATING FREE POINTER         */
*                         R5,       /* UPDATING DUMMY DISPLACEMENT   */
*                         R6) RESTRICTED;/* UPDATING FREE LENGTH     */
*                       RESPECIFY   /* RESTRICT REGISTER FOR         */
*                        (R1) RESTRICTED;/* ADDRESS OF FIELD FOR LOAD*/
*                       R1=ADDR(RCBCDS);/* OBTAIN ADDRESS OF       0602
*                                      RCBFLNG,RCBFREE AND RCBDUM    */
         LA    R1,RCBCDS(,R7)                                      0602
*                       GEN(LM R2,R3,ZIP(R1));/* SAVE FOR SUBSEQUENT
*                                      CDS                           */
         LM R2,R3,ZIP(R1)
*                       RESPECIFY   /* RELEASE ADDRESS OF FIELD FOR  */
*                        (R1) UNRESTRICTED;/* LOAD                   */
*TRYCDS1:                           /* RETRY POINT IF CDS FAILS      */
*                       R4=R2;      /* FREE POINTER AVAILABLE TO   0605
*                                      UPDATE                        */
TRYCDS1  LR    R4,R2                                               0605
*                       R5=R3;      /* FREE LENGTH & DUMMY DISP FOR  */
         LR    R5,R3                                               0606
*                       R6=R5;      /* UPDATING IN UNIQUE REGISTERS  */
         LR    R6,R5                                               0607
*                       GENERATE;                                  0608
         SLL   R5,HALFREG         /* ZERO HIGH ORDER TWO BYTES OF    */
         SRL   R5,HALFREG         /* DUMMY DISPLACEMENT              */
         SRL   R6,HALFREG         /* MOVE FREE LEN TO LOW HALF OF REG*/
*                       IF RCBBNBFR=NO THEN/* IF THE RECORD WAS    0609
*                                      BUFFERED                      */
         L     @12,OLDEST                                          0609
         TM    RCBBNBFR(@12),B'00001000'                           0609
         BNZ   @RF00609                                            0609
*                         R6=R6+(RCBBLEN+/* FREE THE DATA            */
*                             CONTLEN+/* THE CONTROL INFO            */
*                             SEVEN&/* ROUNDED TO A DOUBLE WORD      */
*                             'FFF8'X);                            0610
         LA    @15,23                                              0610
         LH    @12,RCBBLEN(,@12)                                   0610
         N     @12,@CF02236                                        0610
         ALR   @15,@12                                             0610
         N     @15,@CF02103                                        0610
         ALR   R6,@15                                              0610
*                       ELSE                                       0611
*                         DO;       /* IF RECORD WAS NOT BUFFERED    */
         B     @RC00609                                            0611
@RF00609 DS    0H                                                  0612
*                           RFY                                    0612
*                             R1 RSTD;/* RESTRICT REGISTER FOR     0612
*                                      ERRORID LENGTH        @G17EP5W*/
*                           IF RCBBERFG=YES THEN/* IF ERRORID      0613
*                                      APPENDED IN RCB       @G17EP5W*/
         L     @12,OLDEST                                          0613
         TM    RCBBERFG(@12),B'00000010'                           0613
         BNO   @RF00613                                            0613
*                             R1=LENGTH(NBFRERID);/* THEN INCLUDE ITS
*                                      LENGTH FOR FREEING    @G17EP5W*/
         LA    R1,10                                               0614
*                           ELSE                                   0615
*                             R1=ZERO;/* OTHERWISE FREE NO ADDITIONAL
*                                      SPACE                 @G17EP5W*/
         B     @RC00613                                            0615
@RF00613 SLR   R1,R1                                               0615
*                           R6=R6+(NBFRLEN+/* FREE (16 CONTROL INFO +
*                                      4 ADDR)                       */
*                               R1+ /* LENGTH OF ERRORID IF PRESENT
*                                                            @G17EP5W*/
*                               SEVEN&/* ROUNDED TO DOUBLE WORD      */
*                               'FFF8'X);                          0616
@RC00613 LA    @12,27                                              0616
         ALR   @12,R1                                              0616
         N     @12,@CF02103                                        0616
         ALR   R6,@12                                              0616
*                           RFY                                    0617
*                             R1 UNRSTD;/* UNRESTRICT LENGTH REGISTER
*                                                            @G17EP5W*/
*                         END;      /*                       @G17EP5W*/
*                       GEN(SLL R6,HALFREG);/* MOVE NEW LENGTH TO  0619
*                                      HIGH HALF OF REGISTER         */
@RC00609 DS    0H                                                  0619
         SLL R6,HALFREG
*                       R5=R5×R6;   /* PUT FREE LENGTH & DUMMY DISP
*                                      IN SAME REGISTER              */
         OR    R5,R6                                               0620
*                       CDS(R2,R4,RCBCDS);/* PUT VALUES IN RCB       */
         CDS   R2,R4,RCBCDS(R7)                                    0621
*                       BC(4,TRYCDS1);/* IF RCB NOT ALTERED          */
         BC    4,TRYCDS1                                           0622
*                       RESPECIFY   /* FREE REGISTERS FROM           */
*                        (R2,       /* SAVING FREE POINTER           */
*                         R3,       /* SAVING FREE LEN & DUMMY DISP  */
*                         R4,       /* UPDATING FREE POINTER         */
*                         R5,       /* UPDATING DUMMY DISPLACEMENT   */
*                         R6) UNRESTRICTED;/* UPDATING FREE LENGTH   */
*                     END;                                         0624
*                   END;            /* END OF RECORD-IS-READY.       */
*               END;                /* END OF RECORDS-STILL- REMAIN. */
@RC00426 DS    0H                                                  0627
*           END;                    /* END OF DO-WHILE LOOP.         */
@RC00422 DS    0H                                                  0627
@DE00418 TM    LOOP,B'10000000'                                    0627
         BO    @DL00418                                            0627
*           IF REBUFADR^=ZERO THEN  /* FIRST BUFFER EXIST?   @ZA25858*/
         L     @12,REBUFADR                                        0628
         LTR   @12,@12                                             0628
         BZ    @RF00628                                            0628
*             DO;                   /* YES, FREE IT          @ZA25858*/
*               R0=SP252×(REBLEN&HIBYTOFF);/* LENGTH AND SP  @ZA25858*/
         L     R0,REBLEN                                           0630
         ICM   @06,15,HIBYTOFF                                     0630
         NR    R0,@06                                              0630
         ICM   @06,15,SP252                                        0630
         OR    R0,@06                                              0630
*               R1=REBUFADR;        /* ADDRESS               @ZA25858*/
         LR    R1,@12                                              0631
*               GEN REFS(PARMLIST)(STM R8,R7,PARMLIST);/*    @ZA25858*/
         STM R8,R7,PARMLIST
*               EXTRTN=YES;         /* RECURSION             @ZA25858*/
         OI    EXTRTN,B'01000000'                                  0633
*               RETRYADR=ADDR(AFTFREE1);/* CONTROLS          @ZA25858*/
         LA    @12,AFTFREE1                                        0634
         ST    @12,RETRYADR                                        0634
*               GEN(FREEMAIN R,LV=(0),A=(1));/*              @ZA25858*/
         FREEMAIN R,LV=(0),A=(1)
*AFTFREE1:                          /*                       @ZA25858*/
*               EXTRTN=NO;          /* RECURSION /*          @ZA25858*/
AFTFREE1 NI    EXTRTN,B'10111111'                                  0636
*               RETRYADR=ADDR(AWAKE);/* CONTROLS /*          @ZA25858*/
         LA    @12,AWAKE                                           0637
         ST    @12,RETRYADR                                        0637
*             END;                  /* 1ST BUFFER FREE       @ZA25858*/
*           ELSE                                                   0639
*             ;                     /*                       @ZA25858*/
@RF00628 DS    0H                                                  0640
*           IF BUFADR^=ZERO THEN    /* SECOND BUFFER EXIST?  @ZA25858*/
         L     @12,BUFADR                                          0640
         LTR   @12,@12                                             0640
         BZ    @RF00640                                            0640
*             DO;                   /* YES, FREE IT          @ZA25858*/
*               R0=SP252×(BLENGTH&HIBYTOFF);/* LENGTH AND SP @ZA25858*/
         L     R0,BLENGTH                                          0642
         ICM   @06,15,HIBYTOFF                                     0642
         NR    R0,@06                                              0642
         ICM   @06,15,SP252                                        0642
         OR    R0,@06                                              0642
*               R1=BUFADR;          /* ADDRESS               @ZA25858*/
         LR    R1,@12                                              0643
*               GEN REFS(PARMLIST)(STM R8,R7,PARMLIST);/*    @ZA25858*/
         STM R8,R7,PARMLIST
*               EXTRTN=YES;         /* RECURSION             @ZA25858*/
         OI    EXTRTN,B'01000000'                                  0645
*               RETRYADR=ADDR(AFTFREE2);/* CONTROLS          @ZA25858*/
         LA    @12,AFTFREE2                                        0646
         ST    @12,RETRYADR                                        0646
*               GEN(FREEMAIN R,LV=(0),A=(1));/*              @ZA25858*/
         FREEMAIN R,LV=(0),A=(1)
*AFTFREE2:                          /*                       @ZA25858*/
*               EXTRTN=NO;          /* RECURSION             @ZA25858*/
AFTFREE2 NI    EXTRTN,B'10111111'                                  0648
*               RETRYADR=ADDR(AWAKE);/* CONTROLS             @ZA25858*/
         LA    @12,AWAKE                                           0649
         ST    @12,RETRYADR                                        0649
*             END;                  /* 2ND BUFFER FREE       @ZA25858*/
*           ELSE                                                   0651
*             ;                     /*                       @ZA25858*/
@RF00640 DS    0H                                                  0652
*         END;                                                     0652
*       R7=RTCTRCB;                 /* UNCONDITIONALLY BACK TO FIXED
*                                      RCB                           */
@RF00268 L     @12,CVTPTR                                          0653
         L     @12,CVTRTMCT(,@12)                                  0653
         L     R7,RTCTRCB(,@12)                                    0653
*       IF RCBLCNT^=ZERO THEN       /* IF LOST RECORD COUNT NOT ZERO */
*                                                                  0654
         CLI   RCBLCNT(R7),0                                       0654
         BE    @RF00654                                            0654
*         /***********************************************************/
*         /*                                                         */
*         /* THIS SEGMENT WILL WRITE OUT THE LOST RECORD HEADER TO   */
*         /* SYS1.LOGREC. (CONTAINS A COUNT OF THE NUMBER OF LOST    */
*         /* LOGREC RECORDS)                                         */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0655
*         DO;                                                      0655
*           RFY                                                    0656
*            (R1,                                                  0656
*             R0) RSTD;                                            0656
*           RFY                                                    0657
*             R4 RSTD;                                             0657
*           R1=ADDR(RCBLRHDR);      /* PRE SET LOST RECORD HDR.      */
         LA    R1,RCBLRHDR(,R7)                                    0658
*           RFY                                                    0659
*             HDR BASED(R1);                                       0659
*           R4=ADDR(HDRTM);         /* POINT TO AREA FOR TIME IN   0660
*                                      AR149                         */
         LA    R4,HDRTM(,R1)                                       0660
*           GEN(STCK ZIP(R4));      /* STORE THE TIME IN LOST REC HDR*/
         STCK ZIP(R4)
*           LCLTM=LCLTM+CVTTZ;      /* CONVERT TO LOCAL TIME @ZA10070*/
         ICM   @12,15,LCLTM(R1)                                    0662
         L     @06,CVTPTR                                          0662
         AL    @12,CVTTZ(,@06)                                     0662
         STCM  @12,15,LCLTM(R1)                                    0662
*           RFY                                                    0663
*             R4 UNRSTD;                                           0663
*           R0=LENGTH(RCBLRHDR)+LENGTH(RCBLCNT);/* RECORD LENGTH     */
         LA    R0,25                                               0664
*           R0=-R0;                 /* NEGATIVE FOR SVC 76           */
         LCR   R0,R0                                               0665
*           EXTRTN=YES;             /* SHOW EXTERNAL ROUTINE IN    0666
*                                      CONTROL FOR ESTAE             */
         OI    EXTRTN,B'01000000'                                  0666
*           RETRYADR=ADDR(AFT76B);  /* RETRY WILL BE JUST AFTER SVC76*/
         LA    @12,AFT76B                                          0667
         ST    @12,RETRYADR                                        0667
*           GEN SETS(PARMLIST)(STM R8,R7,PARMLIST);/* SAVE FOR EXIT
*                                      USE                           */
         STM R8,R7,PARMLIST
*           SVC(76);                /* WRITE TO SYS1.LOGREC          */
         SVC   76                                                  0669
*AFT76B:                            /* ADDRESS TO RETRY IF IN SVC 76 */
*           RETRYADR=ADDR(AWAKE);   /* RESET RETRY ADDR FOR AFTER  0670
*                                      WAIT                          */
AFT76B   LA    @12,AWAKE                                           0670
         ST    @12,RETRYADR                                        0670
*           GEN REFS(PARMLIST)(STM R8,R7,PARMLIST);/* SAVE REGS FOR
*                                      RCV                           */
         STM R8,R7,PARMLIST
*           EXTRTN=NO;              /* SHOW EXTERNAL ROUTINE       0672
*                                      RELINQUISHED CONTROL          */
         NI    EXTRTN,B'10111111'                                  0672
*           RFY                                                    0673
*            (R1,                                                  0673
*             R0) UNRSTD;                                          0673
*           RFY                                                    0674
*            (R4,                                                  0674
*             R5) RSTD;                                            0674
*                                                                  0674
*           /*********************************************************/
*           /*                                                       */
*           /* RE SET THE LOST RECORD COUNTER                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0675
*           R4=RCBCS1;              /* OBTAIN THE CURRENT COUNT      */
         L     R4,RCBCS1(,R7)                                      0675
*AGAIN:                             /* START CS LOOP                 */
*           R5=R4;                  /* COPY FOR UPDATING             */
AGAIN    LR    R5,R4                                               0676
*           GEN REFS(NULLCNT)(ICM R5,8,NULLCNT);/* RESET COUNT       */
         ICM R5,8,NULLCNT
*           CS(R4,R5,RCBCS1);       /* UPDATE THE LOST REC COUNT     */
         CS    R4,@05,RCBCS1(R7)                                   0678
*           BC(4,AGAIN);            /* LOOP TIL IT WORKS             */
         BC    4,AGAIN                                             0679
*           RFY                                                    0680
*            (R4,                                                  0680
*             R5) UNRSTD;                                          0680
*         END;                                                     0681
*       EXTRTN=YES;                 /* IN EXTERNAL ROUTINE           */
@RF00654 OI    EXTRTN,B'01000000'                                  0682
*       RETRYADR=ADDR(SLEEP);       /* IF FAILS BACK TO WAIT @ZA20615*/
         LA    @12,SLEEP                                           0683
         ST    @12,RETRYADR                                        0683
*       CALL IGFPWMSG;              /* CALL THE MCH WTO ROUTINE      */
         L     @15,@CV00168                                        0684
         BALR  @14,@15                                             0684
*     END;                                                         0685
*   GOTO SLEEP;                     /* BACK TO WAIT FOR REQUESTS     */
*                                                                  0686
         B     SLEEP                                               0686
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS CODE EXECUTES UNDER CONTROL OF THE SRB SCHEDULED BY      */
*   /* IEAVTRER. ITS PURPOSE IS TO POST THE ECB BEING WAITED ON BY   */
*   /* THIS TASK. NOTE THAT THIS CODE WILL EXECUTE AS LOGICALLY      */
*   /* DISTINCT FROM THE REMANIDER OF THIS MODULE, AND NO REGISTERS  */
*   /* ARE ASSUMED AS CONTAINING VALID INFORMATION EXCEPT REGISTERS 1*/
*   /* AND 14.                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0687
*RETSRBEP:                                                         0687
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0687
RETSRBEP DS    0H                                                  0688
*   RFY                                                            0688
*    (R6,                                                          0688
*     R1,                                                          0688
*     R14) RESTRICTED;                                             0688
*   R6=R14;                         /* SAVE SRB RETURN POINT         */
         LR    R6,R14                                              0689
*   R9=R1;                          /* RESET AUTO STORAGE ADDR.      */
         LR    R9,R1                                               0690
*   R8=CRNT8;                       /* RESET MODULE BASE REGISTER    */
         L     R8,CRNT8                                            0691
*   RFY                                                            0692
*    (R1,                                                          0692
*     R14) UNRESTRICTED;                                           0692
*                                                                  0692
*   /*****************************************************************/
*   /*                                                               */
*   /* GET LOCAL LOCK TO SATISFY B.E. POST REQUIREMENT.              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0693
*   RFY                                                            0693
*    (R11,                                                         0693
*     R12,                                                         0693
*     R13,                                                         0693
*     R14) RSTD;                                                   0693
*   GEN;                                                           0694
      SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                           *
               RELATED=(POST,IEAVTRET,(IEAVTRET))
*   RFY                                                            0695
*    (R11,                                                         0695
*     R12,                                                         0695
*     R13,                                                         0695
*     R14) UNRSTD;                                                 0695
*                                                                  0695
*   /*****************************************************************/
*   /*                                                               */
*   /* RESET SRB IN USE BIT                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0696
*   RFY                                                            0696
*    (R3,                                                          0696
*     R4,                                                          0696
*     R7) RSTD;                                                    0696
*   R7=CVTRTMCT->RTCTRCB;           /* POINT TO RCB                  */
         L     @12,CVTPTR                                          0697
         L     @12,CVTRTMCT(,@12)                                  0697
         L     R7,RTCTRCB(,@12)                                    0697
*   R3=RCBCS1;                      /* GET SRB IN USE FLAG           */
         L     R3,RCBCS1(,R7)                                      0698
*AGAIN1:                            /* START CS LOOP                 */
*   R4=R3;                          /* COPY FIELD FOR UPDATING       */
AGAIN1   LR    R4,R3                                               0699
*   R4=R4&SRBOFF;                   /* TURN OFF SRB IN USE FLAG      */
         N     R4,SRBOFF                                           0700
*   CS(R3,R4,RCBCS1);               /* ALLOW SRB SCHEDULING          */
         CS    R3,@04,RCBCS1(R7)                                   0701
*   BC(4,AGAIN1);                   /* FAIL - TRY AGAIN              */
         BC    4,AGAIN1                                            0702
*   RFY                                                            0703
*    (R3,                                                          0703
*     R4,                                                          0703
*     R7) UNRSTD;                                                  0703
*                                                                  0703
*   /*****************************************************************/
*   /*                                                               */
*   /* BRANCH ENTER POST TO WAKE UP RECORDING TASK.                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0704
*   RFY                                                            0704
*    (R10,                                                         0704
*     R11) RESTRICTED;                                             0704
*   R10=ZERO;                       /* ACTUAL CODE MEANINGLESS       */
         SLR   R10,R10                                             0705
*   R11=ADDR(RTCTRECB);             /* ECB TO BE POSTED              */
         L     @12,CVTPTR                                          0706
         L     R11,CVTRTMCT(,@12)                                  0706
         LA    R11,RTCTRECB(,R11)                                  0706
*   CALL POST;                      /* WAKE UP THE TASK              */
         L     @15,CVT0PT01(,@12)                                  0707
         BALR  @14,@15                                             0707
*   RFY                                                            0708
*    (R10,                                                         0708
*     R11) UNRSTD;                                                 0708
*                                                                  0708
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE THE LOCAL LOCK                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0709
*   RFY                                                            0709
*    (R11,                                                         0709
*     R12,                                                         0709
*     R13,                                                         0709
*     R14) RESTRICTED;                                             0709
*   GEN;                                                           0710
      SETLOCK RELEASE,TYPE=LOCAL,RELATED=(POST,IEAVTRET,(IEAVTRET))
*   RFY                                                            0711
*    (R11,                                                         0711
*     R12,                                                         0711
*     R13,                                                         0711
*     R14) UNRSTD;                                                 0711
*                                                                  0711
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN TO SRB DISPATCHER                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0712
*   RFY                                                            0712
*    (R14) RSTD;                                                   0712
*   R14=R6;                         /* SRB RETURN POINT              */
         LR    R14,R6                                              0713
*   GOTO R14;                       /* RETURN TO SRB DISPATCHER      */
         BR    R14                                                 0714
*   RFY                                                            0715
*    (R6,                                                          0715
*     R14) UNRSTD;                                                 0715
*   END RETSRBEP;                                                  0716
*                                                                  0716
*   /*****************************************************************/
*   /*                                                               */
*   /* THE RCDTSKR PROC WILL GAIN CONTROL FROM RTM WHEN AN ERROR IS  */
*   /* SUFFERED. IF WILL DETERMINE TYPE OF ERROR AND TAKE NECESSARY  */
*   /* ACTION. IF THE ERROR IS DEEMED RECOVERABLE RETRY IS DONE AT A */
*   /* COMMON POINT IN THE MAINLINE MODULE AND IT DETERMINES WHERE   */
*   /* RETRY IN THE MAINLINE                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0717
*RCDTSKR:                                                          0717
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0717
RCDTSKR  DS    0H                                                  0718
*   RFY                                                            0718
*    (R14,                                                         0718
*     R7,                                                          0718
*     R2,                                                          0718
*     R1,                                                          0718
*     R1) RSTD;                                                    0718
*   DO;                             /* ENTESTAE (8,9)ERREXIT(NORTCA) */
*/*   ENTRY CODE FOR ESTAE ROUTINE.                                  */
*/*   IF RTCA ALLOCATED THEN RESTORE CODE AND                        */
*/*   DATA REGS FROM START OF USERS PARM LIST,                       */
*/*   AND ESTABLISH ADDR TO ESTAE SAVE AREA                          */
*/*   IF REQUIRED.                                                   */
*/*   IF NO RTCA AVAILABLE THEN BRANCH TO ERROR                      */
*/*   CODE AFTER ESTABLISHING ADDRESSABILITY                         */
*                                                                  0720
*     GEN(USING *,GPR15P);                                         0720
         USING *,GPR15P
*     GEN(CH    GPR00F,*+22);       /* CHECK IF RTCA ALLOC FAILED    */
         CH    GPR00F,*+22
*     GEN(BNE   *+20);              /* NO,SAVE RTM REGS              */
         BNE   *+20
*     GEN(DROP  GPR15P);            /* DROP LOCAL ADDR               */
         DROP  GPR15P
*     GEN(LR    GPR15P,GPR02P);     /* PTR TO USER PARM LIST         */
         LR    GPR15P,GPR02P
*     GEN(L     8,00(GPR15P));                                     0725
         L     8,00(GPR15P)
*     GEN(L     9,04(GPR15P));                                     0726
         L     9,04(GPR15P)
*     GEN(B     NORTCA);            /* BRANCH TO ERROR EXIT          */
         B     NORTCA
*     GEN(DC    H'12');             /* NO RTCA AVAIL RC              */
         DC    H'12'
*     GEN(STM   GPR14P,GPR12F,12(GPR13P));/* GOOD R13, SAVE RTM'S  0729
*                                      REGS                          */
         STM   GPR14P,GPR12F,12(GPR13P)
*     GEN(L     GPR15P,0(GPR01P));  /* PTR TO USER PARM LIST         */
         L     GPR15P,0(GPR01P)
*     GEN(L     8,00(GPR15P));                                     0731
         L     8,00(GPR15P)
*     GEN(L     9,04(GPR15P));                                     0732
         L     9,04(GPR15P)
*   END;                            /* ENTESTAE (8,9)ERREXIT(NORTCA) */
*   RFY                                                            0734
*     SDWA BASED(R1);                                              0734
*   R7=R14;                         /* SAVE RETURN ADDRESS TO RTM    */
         LR    R7,R14                                              0735
*   IF(SDWACMPC=CHARLIE1&EXTRTN=NO)×/* IF ERROR IS OPER EXCP @YM02750*/
*       (RTCTRTER=YES&              /* IF A TEMP ERROR ALREADY     0736
*                                      SUFFERED                      */
*       TRYPOST=NO) THEN            /* AND NOT TRYING POST BEFORE  0736
*                                      REINIT                        */
         CLC   SDWACMPC(3,R1),CHARLIE1                             0736
         BNE   @GL00009                                            0736
         TM    EXTRTN,B'01000000'                                  0736
         BZ    @RT00736                                            0736
@GL00009 L     @15,CVTPTR                                          0736
         L     @15,CVTRTMCT(,@15)                                  0736
         TM    RTCTRTER(@15),B'10000000'                           0736
         BNO   @RF00736                                            0736
         TM    TRYPOST,B'00100000'                                 0736
         BNZ   @RF00736                                            0736
@RT00736 DS    0H                                                  0737
*     DO;                           /* THE ERROR IS DEEMED PERMANENT */
*       DO;                         /* SETRP RECORD(NO)RC(0)         */
*         RESPECIFY                                                0739
*          (GPR00P,                                                0739
*           GPR01P,                                                0739
*           GPR14P,                                                0739
*           GPR15P) RSTD;                                          0739
*         GPR01P->SDWARCDE=0;       /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0740
*         GPR01P->SDWARCRD='0'B;    /* TURN OFF RECORD INDICATOR     */
         NI    SDWARCRD(GPR01P),B'01111111'                        0741
*         RESPECIFY                                                0742
*          (GPR00P,                                                0742
*           GPR01P,                                                0742
*           GPR14P,                                                0742
*           GPR15P) UNRSTD;                                        0742
*       END;                        /* CONTINUE WITH TERM            */
*       RTCTRPER=YES;               /* SHOW PERMANENT ERROR          */
         L     @15,CVTPTR                                          0744
         L     @15,CVTRTMCT(,@15)                                  0744
         OI    RTCTRPER(@15),B'01000000'                           0744
*       RFY                                                        0745
*        (GPR01P) RSTD;             /*                       @ZA13432*/
*       GPR01P=ADDR(SVC51LST);      /* PARM LIST IN REG 1    @ZA13432*/
         LA    GPR01P,SVC51LST                                     0746
*       GEN(SDUMP MF=(E,(1)),HDR='RECORD PERMANENT ERROR');/*      0747
*                                                            @ZA13432*/
         SDUMP MF=(E,(1)),HDR='RECORD PERMANENT ERROR'
*       RFY                                                        0748
*        (GPR01P) UNRSTD;           /*                       @ZA13432*/
*       DO;                         /* WTO('IEA896I - RECORDING    0749
*                                      FUNCTION NO LONGER ACTIVE') 0749
*                                      DESC(4) ROUTCDE(2)            */
*         RFY                                                      0750
*           GPR01P RSTD;            /* RESTRICT REG 1                */
*         GPR01P=ADDR(I03516);      /* ADDRESS CONTROL PROGRAM LIST  */
         LA    GPR01P,I03516                                       0751
*         SVC(35);                  /* ISSUE WTO SVC                 */
         SVC   35                                                  0752
*         RFY                                                      0753
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */
*       END;                        /* WTO('IEA896I - RECORDING    0754
*                                      FUNCTION NO LONGER ACTIVE') 0754
*                                      DESC(4) ROUTCDE(2)            */
*       DECLARE                     /* WTO PARAMETER LIST            */
*         1 I03516 STATIC BDY(WORD),                               0755
*          2 I0351601 FIXED(15) INIT(49),/* TEXT LENGTH              */
*          2 I0351602 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */
*          2 I0351603 CHAR(45) INIT(                               0755
*                'IEA896I - RECORDING FUNCTION NO LONGER ACTIVE'),/*
*                                      MESSAGE TEXT                  */
*          2 I0351604 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR
*                                      CODES                         */
*          2 I0351605 BIT(16) INIT('0100000000000000'B);/* ROUTING 0755
*                                      CODES                         */
*     END;                                                         0756
*   ELSE                                                           0757
*     DO;                           /* RETRY AT COMMON RETRY ROUTINE */
         B     @RC00736                                            0757
@RF00736 DS    0H                                                  0758
*       DO;                         /* SETRP RETADDR(RETRYRTN)FRESDWA
*                                      (YES)RC(4)RECORD(NO)          */
*         RESPECIFY                                                0759
*          (GPR00P,                                                0759
*           GPR01P,                                                0759
*           GPR14P,                                                0759
*           GPR15P) RSTD;                                          0759
*         GPR01P->SDWARCDE=4;       /* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0760
*         GPR01P->SDWARTYA=ADDR(RETRYRTN);/* SAVE RETRY ADDRESS      */
         LA    @12,RETRYRTN                                        0761
         ST    @12,SDWARTYA(,GPR01P)                               0761
*         GPR01P->SDWAFREE='1'B;    /* SET FLAG TO FREE SDWA         */
*         GPR01P->SDWARCRD='0'B;    /* TURN OFF RECORD INDICATOR     */
         OI    SDWAFREE(GPR01P),B'00000100'                        0763
         NI    SDWARCRD(GPR01P),B'01111111'                        0763
*         RESPECIFY                                                0764
*          (GPR00P,                                                0764
*           GPR01P,                                                0764
*           GPR14P,                                                0764
*           GPR15P) UNRSTD;                                        0764
*       END;                                                       0765
*     END;                                                         0766
*   R14=R7;                         /* RESTORE RTM RETURN ADDRESS    */
@RC00736 LR    R14,R7                                              0767
*   GOTO R14;                       /* RETURN TO RTM                 */
         BR    R14                                                 0768
*NORTCA:                            /* IF SDWA NOT AVAILABLE         */
*   R7=R14;                         /* SAVE RTM RETURN POINT         */
NORTCA   LR    R7,R14                                              0769
*   IF(R1=CHARLIE1&EXTRTN=NO)×      /* IF ERROR WAS AN OPER EXCP   0770
*                                                            @YM02750*/
*       (RTCTRTER=YES&TRYPOST=NO) THEN/* A TEMP ERROR ALREADY      0770
*                                      SUFFERED              @YM02750*/
         SLR   @15,@15                                             0770
         ICM   @15,7,CHARLIE1                                      0770
         CR    R1,@15                                              0770
         BNE   @GL00012                                            0770
         TM    EXTRTN,B'01000000'                                  0770
         BZ    @RT00770                                            0770
@GL00012 L     @15,CVTPTR                                          0770
         L     @15,CVTRTMCT(,@15)                                  0770
         TM    RTCTRTER(@15),B'10000000'                           0770
         BNO   @RF00770                                            0770
         TM    TRYPOST,B'00100000'                                 0770
         BNZ   @RF00770                                            0770
@RT00770 DS    0H                                                  0771
*     DO;                           /* CONTINUE WITH TERMINATION     */
*       RTCTRPER=YES;               /* IND RECORDING NO LONGER ACTIVE*/
         L     @15,CVTPTR                                          0772
         L     @15,CVTRTMCT(,@15)                                  0772
         OI    RTCTRPER(@15),B'01000000'                           0772
*       RFY                                                        0773
*        (GPR01P) RSTD;             /*                       @ZA13432*/
*       GPR01P=ADDR(SVC51LST);      /* PARM LIST IN REG 1    @ZA13432*/
         LA    GPR01P,SVC51LST                                     0774
*       GEN(SDUMP MF=(E,(1)),HDR='RECORD PERMANENT ERROR');/*      0775
*                                                            @ZA13432*/
         SDUMP MF=(E,(1)),HDR='RECORD PERMANENT ERROR'
*       RFY                                                        0776
*        (GPR01P) UNRSTD;           /*                       @ZA13432*/
*       DO;                         /* WTO('IEA896I - RECORDING    0777
*                                      FUNCTION NO LONGER ACTIVE') 0777
*                                      DESC(4) ROUTCDE(2)            */
*         RFY                                                      0778
*           GPR01P RSTD;            /* RESTRICT REG 1                */
*         GPR01P=ADDR(I03520);      /* ADDRESS CONTROL PROGRAM LIST  */
         LA    GPR01P,I03520                                       0779
*         SVC(35);                  /* ISSUE WTO SVC                 */
         SVC   35                                                  0780
*         RFY                                                      0781
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */
*       END;                        /* WTO('IEA896I - RECORDING    0782
*                                      FUNCTION NO LONGER ACTIVE') 0782
*                                      DESC(4) ROUTCDE(2)            */
*       DECLARE                     /* WTO PARAMETER LIST            */
*         1 I03520 STATIC BDY(WORD),                               0783
*          2 I0352001 FIXED(15) INIT(49),/* TEXT LENGTH              */
*          2 I0352002 BIT(16) INIT('1000000000000000'B),/* MCS FLAG  */
*          2 I0352003 CHAR(45) INIT(                               0783
*                'IEA896I - RECORDING FUNCTION NO LONGER ACTIVE'),/*
*                                      MESSAGE TEXT                  */
*          2 I0352004 BIT(16) INIT('0001000000000000'B),/* DESCRIPTOR
*                                      CODES                         */
*          2 I0352005 BIT(16) INIT('0100000000000000'B);/* ROUTING 0783
*                                      CODES                         */
*       R15=RCZERO;                 /* INDICATE CONT W/TERMINATION   */
         SLR   R15,R15                                             0784
*     END;                                                         0785
*   ELSE                                                           0786
*     DO;                           /* RETRY AT COMMON RETRY CODE    */
         B     @RC00770                                            0786
@RF00770 DS    0H                                                  0787
*       R15=RCFOUR;                 /* INDICATE RETRY                */
         LA    R15,4                                               0787
*       R0=ADDR(RETRYRTN);          /* RETRY ADDRESS                 */
         LA    R0,RETRYRTN                                         0788
*     END;                                                         0789
*   R14=R7;                         /* RESTORE RTM RETURN ADDRESS    */
@RC00770 LR    R14,R7                                              0790
*   GOTO R14;                       /* RETURN TO RTM TO RETRY        */
         BR    R14                                                 0791
*   END RCDTSKR;                                                   0792
*                                                                  0792
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS PROCEDURE IS USED TO RESET UP REGISTERS AND RETRY OR TO  */
*   /* SET UP FOR CLEANUP BY THE RECORDING TASK                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0793
*RETRYRTN:                                                         0793
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0793
RETRYRTN DS    0H                                                  0794
*   RFY                                                            0794
*    (R14,                                                         0794
*     R1) RSTD;                                                    0794
*   DO;                                                            0795
*     GEN REFS(PARMLIST)(LM R8,R7,0(R1));/* RELOAD REGISTERS FOR RET */
         LM R8,R7,0(R1)
*     IF EXTRTN=NO THEN             /* IF NOT IN EXTERNAL ROUTINE    */
         TM    EXTRTN,B'01000000'                                  0797
         BNZ   @RF00797                                            0797
*       RTCTRTER=YES;               /* INDICATE OUR ERROR            */
         L     @15,CVTPTR                                          0798
         L     @15,CVTRTMCT(,@15)                                  0798
         OI    RTCTRTER(@15),B'10000000'                           0798
*     R14=RETRYADR;                 /* RESUME AT                     */
@RF00797 L     R14,RETRYADR                                        0799
*     GOTO R14;                     /* PRE-SET RETRY ADDR            */
         BR    R14                                                 0800
*   END;                                                           0801
*   RFY                                                            0802
*    (R14,                                                         0802
*     R1) UNRSTD;                                                  0802
*   END RETRYRTN;                                                  0803
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0804
*     GPR01F FIXED(31) REG(1),                                     0804
*     GPR12F FIXED(31) REG(12),                                    0804
*     GPR15F FIXED(31) REG(15),                                    0804
*     GPR00P PTR(31) REG(0),                                       0804
*     GPR01P PTR(31) REG(1),                                       0804
*     GPR02P PTR(31) REG(2),                                       0804
*     GPR13P PTR(31) REG(13),                                      0804
*     GPR14P PTR(31) REG(14),                                      0804
*     GPR15P PTR(31) REG(15);                                      0804
*   DCL                                                            0805
*     1 I002 DEF(ILIST),            /* DEFINE LIST                   */
*      2 I00201 PTR(31),            /* ECB ADDRESS                   */
*      2 I00202 PTR(31),            /* ASCB ADDRESS                  */
*      2 I00203 PTR(31);            /* ERRET ADDRESS                 */
*   DECLARE                                                        0806
*     ILIST CHAR(12) BDY(DWORD);    /* STANDARD LIST                 */
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0807
*     I031F FIXED(31) BASED,                                       0807
*     I031P PTR(31) BASED,                                         0807
*     I015F FIXED(15) BASED,                                       0807
*     I015P PTR(15) BASED,                                         0807
*     I008P PTR(8) BASED,                                          0807
*     I001C CHAR(1) BASED;                                         0807
*   END IEAVTRET                                                   0808
*                                                                  0808
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (RETSPEC )                                       */
*/*%INCLUDE SYSLIB  (RETDCL  )                                       */
*/*%INCLUDE SYSLIB  (IHAESTA )                                       */
*/*%INCLUDE SYSLIB  (IHASDUMP)                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHARTCT )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAHDR  )                                       */
*/*%INCLUDE SYSLIB  (IHALRB  )                                       */
*/*%INCLUDE SYSLIB  (RTMRCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (INIT    )                                       */
*/*%INCLUDE SYSLIB  (TEMPERR )                                       */
*/*%INCLUDE SYSLIB  (POSTER  )                                       */
*/*%INCLUDE SYSLIB  (POSTER  )                                       */
*/*%INCLUDE SYSLIB  (BUFRINIT)                                       */
*/*%INCLUDE SYSLIB  (BUFRINIT)                                       */
*/*%INCLUDE SYSLIB  (REBUF   )                                       */
*/*%INCLUDE SYSLIB  (MOVEREC )                                       */
*/*%INCLUDE SYSLIB  (FREEREC )                                       */
*/*%INCLUDE SYSLIB  (FREEREC )                                       */
*/*%INCLUDE SYSLIB  (DORECORD)                                       */
*/*%INCLUDE SYSLIB  (INCLCNT )                                       */
*/*%INCLUDE SYSLIB  (INCLCNT )                                       */
*/*%INCLUDE SYSLIB  (WRITERCD)                                       */
*/*%INCLUDE SYSLIB  (APPERRID)                                       */
*/*%INCLUDE SYSLIB  (WRITLREC)                                       */
*/*%INCLUDE SYSLIB  (SRBCODE )                                       */
*/*%INCLUDE SYSLIB  (ESTAEXIT)                                       */
*/*%INCLUDE SYSLIB  (RETRYRTN)                                       */
*                                                                  0808
*       ;                                                          0808
@DATA    DS    0H
@CH02223 DC    H'4000'
@DATD    DSECT
         DS    0F
IEAVTRET CSECT
         DS    0F
@CF00040 DC    F'1'
@CF00063 DC    F'10'
@CF00054 DC    F'16'
@CF00098 DC    F'4096'
@CF02226 DC    F'64512'
@CF02238 DC    F'-4'
@CF00108 DC    XL4'80000000'
@CF02236 DC    XL4'0000FFFF'
@CF02103 DC    XL4'FFF8'
@DATD    DSECT
         DS    0D
OLDEST   DS    A
DATAPTRS DS    A
MOVELEN  DS    F
         DS    0D
@TS00001 DS    CL8
BUFLENS  DS    CL8
         ORG   BUFLENS
REBLEN   DS    FL4
BLENGTH  DS    FL4
         ORG   BUFLENS+8
BUFS     DS    CL8
         ORG   BUFS
REBUFADR DS    AL4
BUFADR   DS    AL4
         ORG   BUFS+8
LOOP     DS    BL1
FREESPSW DS    BL1
NOTADDR  DS    BL1
PKWORD   DS    CL2
         DS    CL3
PARMLIST DS    CL72
         ORG   PARMLIST
CRNT8    DS    CL4
CRNT9    DS    CL4
CRNT10   DS    CL4
CRNT11   DS    CL4
CRNT12   DS    CL4
CRNT13   DS    CL4
CRNT14   DS    CL4
CRNT15   DS    CL4
CRNT0    DS    CL4
CRNT1    DS    CL4
CRNT2    DS    CL4
CRNT3    DS    CL4
CRNT4    DS    CL4
CRNT5    DS    CL4
CRNT6    DS    CL4
CRNT7    DS    CL4
FLAGS    DS    CL4
         ORG   FLAGS
FLAG1    DS    BL1
         ORG   FLAG1
RETINIT  DS    BL1
EXTRTN   EQU   FLAG1+0
TRYPOST  EQU   FLAG1+0
@NM00005 EQU   FLAG1+0
         ORG   FLAGS+1
@NM00006 DS    CL3
         ORG   PARMLIST+68
RETRYADR DS    AL4
         ORG   PARMLIST+72
SVC60LST DS    CL16
SVC51LST DS    CL24
ILIST    DS    CL12
IEAVTRET CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00168 DC    V(IGFPWMSG)
         DS    0D
FOURK    DC    A(4096)
HIBYTE1  DC    XL4'01000000'
NULLCNT  DC    AL1(0)
@CC02080 DC    C'SRB '
         DS    CL3
SRBOFF   DC    X'FF7FFFFF'
SP252    DC    X'FC000000'
HIBYTOFF DC    X'00FFFFFF'
CHARLIE1 DC    X'0C1000'
         DS    CL1
I03516   DS    CL53
         ORG   I03516
I0351601 DC    H'49'
I0351602 DC    B'1000000000000000'
I0351603 DC    CL45'IEA896I - RECORDING FUNCTION NO LONGER ACTIVE'
I0351604 DC    B'0001000000000000'
I0351605 DC    B'0100000000000000'
         ORG   I03516+53
         DS    CL3
I03520   DS    CL53
         ORG   I03520
I0352001 DC    H'49'
I0352002 DC    B'1000000000000000'
I0352003 DC    CL45'IEA896I - RECORDING FUNCTION NO LONGER ACTIVE'
I0352004 DC    B'0001000000000000'
I0352005 DC    B'0100000000000000'
         ORG   I03520+53
IEAVTRET CSECT
MFLESTAE  ESTAE  RCDTSKR,MF=L      /* CREATE ESTAE LIST FOR SVC 60   */
MFLSDUMP SDUMP SDATA=(NUC,SQA,LPA,RGN),MF=L                    @ZA13432
IEAVTRET CSECT
         DS   0H
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEAVTRET CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
R5       EQU   @05
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR15F   EQU   @15
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR02P   EQU   @02
GPR12F   EQU   @12
GPR13P   EQU   @13
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
RCBBUF   EQU   0
RCBBLEN  EQU   RCBBUF
RCBBFLGS EQU   RCBBUF+2
RCBBFLG1 EQU   RCBBFLGS
RCBBWRAP EQU   RCBBFLG1
RCBBLREC EQU   RCBBFLG1
RCBBWTO  EQU   RCBBFLG1
RCBBFLG2 EQU   RCBBFLGS+1
RCBBNBFR EQU   RCBBFLG2
RCBBPOST EQU   RCBBFLG2
RCBBERFG EQU   RCBBFLG2
RCBBRDY  EQU   RCBBFLG2
RCBBASID EQU   RCBBUF+6
RCBBECB  EQU   RCBBUF+8
RCBBDATA EQU   RCBBUF+16
NBFREC   EQU   0
NBFRDATA EQU   NBFREC
NBFRERID EQU   NBFREC+4
ECBADR   EQU   0
USERECB  EQU   0
UASCBADR EQU   0
ERRORID  EQU   0
ESTAPTR  EQU   0
SDUMPPTR EQU   0
ASCBPTR  EQU   0
ASVTPTR  EQU   0
LRBPTR   EQU   0
POST     EQU   0
ESTA     EQU   0
ESTAEXT  EQU   ESTA
ESTAFLG1 EQU   ESTAEXT
ESTAIO   EQU   ESTAFLG1
ESTAFGRS EQU   ESTA+12
ESTAFLG2 EQU   ESTAFGRS
SDUMP    EQU   0
SDUSDAT1 EQU   SDUMP+2
SDUSDAT2 EQU   SDUMP+3
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTBRET  EQU   CVTMAP+82
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVT0PT01 EQU   CVTMAP+152
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTTZ    EQU   CVTMAP+304
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
CVTNUMB  EQU   CVTRELNO
RTCT     EQU   0
RTCTSAP  EQU   RTCT+4
RTCTSAP1 EQU   RTCTSAP
RTCTSAP2 EQU   RTCTSAP+1
RTCTSUP  EQU   RTCT+6
RTCTSUP1 EQU   RTCTSUP
RTCTSUP2 EQU   RTCTSUP+1
RTCTSAO  EQU   RTCT+8
RTCTSAO1 EQU   RTCTSAO
RTCTSAO2 EQU   RTCTSAO+1
RTCTSUO  EQU   RTCT+10
RTCTSUO1 EQU   RTCTSUO
RTCTSUO2 EQU   RTCTSUO+1
RTCTSDO  EQU   RTCT+12
RTCTSDO1 EQU   RTCTSDO
RTCTSDO2 EQU   RTCTSDO+1
RTCTABD  EQU   RTCT+14
RTCTIDMP EQU   RTCTABD
RTCTSDF  EQU   RTCT+16
RTCTSDF1 EQU   RTCTSDF
RTCTSDF2 EQU   RTCTSDF+1
RTCTRECB EQU   RTCT+28
RTCTRCB  EQU   RTCT+32
RTCTSDDS EQU   RTCT+36
RTCTFLG  EQU   RTCTSDDS+3
RTCTRFLG EQU   RTCT+176
RTCTRTER EQU   RTCTRFLG
RTCTRPER EQU   RTCTRFLG
RTCTERID EQU   RTCT+224
SRBSECT  EQU   0
SRB      EQU   SRBSECT
SRBID    EQU   SRB
SRBFLNK  EQU   SRB+4
SRBASCB  EQU   SRB+8
SRBFLC   EQU   SRB+12
SRBCPAFF EQU   SRBFLC
SRBPASID EQU   SRBFLC+2
SRBPTCB  EQU   SRBFLC+4
SRBEP    EQU   SRB+20
SRBRMTR  EQU   SRB+24
SRBPARM  EQU   SRB+28
SRBSAVE  EQU   SRB+32
SRBPKF   EQU   SRB+36
SRBPRIOR EQU   SRB+37
HDR      EQU   0
HDRTYP   EQU   HDR
HDROPRN  EQU   HDR+1
HDROPSYS EQU   HDROPRN
HDRIS    EQU   HDR+2
HDRISNS  EQU   HDRIS
HDRDS    EQU   HDR+3
HDRDS1   EQU   HDRDS
HDRDS10  EQU   HDRDS1
HDRDS13  EQU   HDRDS1
HDRCNT   EQU   HDR+6
HDRTM    EQU   HDR+8
HDRCPID  EQU   HDR+16
LRB      EQU   0
LRBHTYPE EQU   LRB
LRBHREL  EQU   LRB+1
LRBHSYS  EQU   LRBHREL
LRBHSW0  EQU   LRB+2
LRBHSW1  EQU   LRB+3
LRBHSW2  EQU   LRB+4
LRBMACT  EQU   LRBHSW2
LRBHSW3  EQU   LRB+5
LRBMCLB  EQU   LRBHSW3
LRBHCPID EQU   LRB+16
LRBBASE  EQU   LRB+24
LRBCVAR  EQU   0
LRBCMP   EQU   LRBCVAR+8
RCB      EQU   0
RCBCNTL  EQU   RCB
RCBBUFB  EQU   RCBCNTL
RCBBUFE  EQU   RCBCNTL+4
RCBCDS   EQU   RCBCNTL+8
RCBFREE  EQU   RCBCDS
RCBFLNG  EQU   RCBCDS+4
RCBDUM   EQU   RCBCDS+6
RCBSRB   EQU   RCBCNTL+16
RCBLRHDR EQU   RCBCNTL+64
RCBCS1   EQU   RCBCNTL+88
RCBLCNT  EQU   RCBCS1
RCBFLGS  EQU   RCBCS1+1
RCBFLG1  EQU   RCBFLGS
RCBSRBIU EQU   RCBFLG1
RCBCS2   EQU   RCBCNTL+92
RCBACNT  EQU   RCBCS2
RCBTLNG  EQU   RCBCS2+2
RCBBUFRS EQU   RCB+96
ASCB     EQU   0
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASVT     EQU   0
ASVTMAXU EQU   ASVT+516
ASVTFRST EQU   ASVT+524
ASVTENTY EQU   ASVT+528
ASVTAVAL EQU   ASVTENTY
SDWA     EQU   0
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACMPC EQU   SDWAABCC+1
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWARTYA EQU   SDWA+240
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
AR149HDR EQU   RCBBDATA
LCLTM    EQU   HDRTM
CVTPTR   EQU   FLCCVT
PSARSVTE EQU   PSARSVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTASVT  EQU   CVTS01+208
CVTRTMCT EQU   CVTS01+224
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LRBHRSW1 EQU   LRBHSW1
LRBHCSW1 EQU   LRBHSW1
LRBHMSW1 EQU   LRBHSW1
LRBMMCH  EQU   LRBBASE
LRBMCEIA EQU   LRBMMCH+8
LRBMTERM EQU   LRBMCEIA
LRBMHARD EQU   LRBMCEIA+1
LRBMINTM EQU   LRBMCEIA+2
LRBMSOFT EQU   LRBMCEIA+3
LRBMPDAR EQU   LRBMMCH+12
LRBMRSR1 EQU   LRBMMCH+13
LRBMRSR2 EQU   LRBMMCH+14
LRBMFLO  EQU   LRBMMCH+24
LRBMCIC  EQU   LRBMFLO
@NM00073 EQU   LRBMCIC
@NM00075 EQU   LRBMCIC+1
@NM00077 EQU   LRBMCIC+2
@NM00079 EQU   LRBMCIC+3
LRBHDWR  EQU   LRBMCIC+4
@NM00082 EQU   LRBMCIC+5
LRBRDDR  EQU   LRBBASE
LRBCCCH  EQU   LRBBASE
LRBCCUA  EQU   LRBCCCH+49
LRBDMDR  EQU   LRBBASE
LRBNMIH  EQU   LRBBASE
LRBTTER  EQU   LRBBASE
I002     EQU   ILIST
I00201   EQU   I002
I00202   EQU   I002+4
I00203   EQU   I002+8
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
LRBTUSR  EQU   LRBTTER+8
LRBTWSC  EQU   LRBTTER+4
LRBTLNH  EQU   LRBTTER
LRBNINT  EQU   LRBNMIH+24
LRBNDEVT EQU   LRBNMIH+20
LRBNVOL  EQU   LRBNMIH+14
LRBNCUA1 EQU   LRBNMIH+11
LRBNCUA2 EQU   LRBNMIH+8
LRBNJOB  EQU   LRBNMIH
LRBDSENS EQU   LRBDMDR+8
LRBDVOL  EQU   LRBDMDR+2
LRBDCUA1 EQU   LRBDMDR
LRBCCLOG EQU   LRBCCCH+56
LRBCLOGL EQU   LRBCCCH+54
LRBCHCUA EQU   LRBCCCH+52
LRBCCUA2 EQU   LRBCCUA+1
@NM00086 EQU   LRBCCUA
LRBCCHID EQU   LRBCCCH+48
LRBCDEVT EQU   LRBCCCH+44
LRBCECSW EQU   LRBCCCH+40
LRBCFCSW EQU   LRBCCCH+32
LRBCFCCW EQU   LRBCCCH+24
LRBCAIO  EQU   LRBCCCH+8
LRBCJOB  EQU   LRBCCCH
LRBRDEV2 EQU   LRBRDDR+32
LRBRCUA2 EQU   LRBRDDR+29
LRBRPH2  EQU   LRBRDDR+28
LRBRDEV1 EQU   LRBRDDR+24
LRBRCUA1 EQU   LRBRDDR+21
LRBRPH1  EQU   LRBRDDR+20
LRBRVOL2 EQU   LRBRDDR+14
LRBRVOL1 EQU   LRBRDDR+8
LRBRJOB  EQU   LRBRDDR
LRBMCEL  EQU   LRBMMCH+304
@NM00085 EQU   LRBMFLO+20
LRBMFSA  EQU   LRBMFLO+16
@NM00084 EQU   LRBMFLO+8
LRBMCELL EQU   LRBMCIC+6
LRBMVCC  EQU   @NM00082
LRBMVPT  EQU   @NM00082
@NM00083 EQU   @NM00082
@NM00081 EQU   LRBHDWR
LRBMNVF  EQU   LRBHDWR
LRBMVST  EQU   @NM00079
LRBMVLG  EQU   @NM00079
LRBMVCR  EQU   @NM00079
LRBMVGR  EQU   @NM00079
LRBMVFP  EQU   @NM00079
@NM00080 EQU   @NM00079
LRBMVRC  EQU   @NM00079
LRBMVFA  EQU   @NM00079
LRBMVIA  EQU   @NM00077
LRBMVPM  EQU   @NM00077
LRBMVMS  EQU   @NM00077
LRBMVWP  EQU   @NM00077
@NM00078 EQU   @NM00077
LRBMFKE  EQU   @NM00077
LRBMFSC  EQU   @NM00077
LRBMFSE  EQU   @NM00077
LRBMIDY  EQU   @NM00075
LRBMIBU  EQU   @NM00075
@NM00076 EQU   @NM00075
LRBMFWN  EQU   @NM00075
LRBMFDG  EQU   @NM00073
@NM00074 EQU   @NM00073
LRBMFED  EQU   @NM00073
LRBMFCD  EQU   @NM00073
LRBMFTD  EQU   @NM00073
LRBMFSR  EQU   @NM00073
LRBMFPD  EQU   @NM00073
LRBMFSD  EQU   @NM00073
LRBMMOSW EQU   LRBMMCH+16
LRBMPWL  EQU   LRBMMCH+15
LRBMVEQR EQU   LRBMRSR2
LRBMPGFX EQU   LRBMRSR2
LRBMLSQA EQU   LRBMRSR2
LRBMFSQA EQU   LRBMRSR2
LRBMNUCL EQU   LRBMRSR2
LRBMSPER EQU   LRBMRSR2
LRBMINTC EQU   LRBMRSR2
LRBMOFLN EQU   LRBMRSR2
LRBMCHNG EQU   LRBMRSR1
LRBMSER  EQU   LRBMRSR1
@NM00072 EQU   LRBMRSR1
@NM00071 EQU   LRBMPDAR
LRBMRSRF EQU   LRBMPDAR
LRBMRSRC EQU   LRBMPDAR
LRBMINVP EQU   LRBMPDAR
@NM00070 EQU   LRBMPDAR
LRBMSBUF EQU   LRBMSOFT
LRBMSHIR EQU   LRBMSOFT
LRBMSECC EQU   LRBMSOFT
LRBMSEXD EQU   LRBMSOFT
@NM00069 EQU   LRBMSOFT
LRBMSSFT EQU   LRBMSOFT
LRBMIL80 EQU   LRBMINTM
LRBMICTM EQU   LRBMINTM
LRBMICKC EQU   LRBMINTM
LRBMITOD EQU   LRBMINTM
@NM00068 EQU   LRBMINTM
LRBMHIPD EQU   LRBMHARD
LRBMHSPF EQU   LRBMHARD
LRBMHSTO EQU   LRBMHARD
LRBMHINV EQU   LRBMHARD
@NM00067 EQU   LRBMHARD
LRBMHHRD EQU   LRBMHARD
LRBMTINV EQU   LRBMTERM
LRBMTDMG EQU   LRBMTERM
LRBMTWRN EQU   LRBMTERM
LRBMTCKS EQU   LRBMTERM
LRBMTSEC EQU   LRBMTERM
@NM00066 EQU   LRBMTERM
LRBMWSC  EQU   LRBMMCH+4
LRBMLNH  EQU   LRBMMCH
@NM00065 EQU   LRBHMSW1
LRBMSYST EQU   LRBHMSW1
@NM00064 EQU   LRBHMSW1
@NM00063 EQU   LRBHCSW1
LRBCERPP EQU   LRBHCSW1
LRBCDATA EQU   LRBHCSW1
LRBCICUA EQU   LRBHCSW1
LRBCNOSP EQU   LRBHCSW1
@NM00062 EQU   LRBHCSW1
LRBCINCO EQU   LRBHCSW1
LRBCMESG EQU   LRBHCSW1
@NM00061 EQU   LRBHRSW1
LRBRSYSI EQU   LRBHRSW1
LRBROPER EQU   LRBHRSW1
LRBRSEC  EQU   LRBHRSW1
LRBRPRIM EQU   LRBHRSW1
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
@NM00133 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00132 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
SDWAERTM EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00131 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00130 EQU   SDWADDAT+3
@NM00129 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00128 EQU   SDWADDAT+1
@NM00127 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00126 EQU   SDWADUMP+2
@NM00125 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00124 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
SDWASEQ# EQU   SDWA+290
SDWAASID EQU   SDWA+288
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00123 EQU   SDWAACF3
@NM00122 EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00121 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00120 EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00119 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWACPUI EQU   SDWA+239
@NM00118 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
SDWAERFL EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00117 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00116 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00115 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00114 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00113 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00112 EQU   SDWAINC2
@NM00111 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00110 EQU   SDWAILC2
@NM00109 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00108 EQU   SDWANXT2
@NM00107 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00106 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00105 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00104 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00103 EQU   SDWAINC1
@NM00102 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00101 EQU   SDWAILC1
@NM00100 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00099 EQU   SDWANXT1
@NM00098 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00097 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00096 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00095 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00094 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00093 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00092 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
@NM00091 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00090 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
SDWAPARM EQU   SDWA
ASVTEND  EQU   ASVT+528
ASVTAVAI EQU   ASVTFRST
ASVTRS00 EQU   ASVT+520
ASVTASVT EQU   ASVT+512
ASVTBEGN EQU   ASVT+512
@NM00089 EQU   ASVT
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
@NM00088 EQU   RCBFLGS+1
@NM00087 EQU   RCBFLG1
LRBCMPCS EQU   LRBCMP+2
LRBCMPPA EQU   LRBCMP
LRBCMPNO EQU   LRBCVAR+6
LRBCMPF2 EQU   LRBCVAR+5
LRBCMPF1 EQU   LRBCVAR+4
LRBCRESD EQU   LRBCVAR+2
LRBCFT   EQU   LRBCVAR
LRBHMCEL EQU   LRBHCPID+6
LRBHMDL  EQU   LRBHCPID+4
LRBHCSER EQU   LRBHCPID+1
@NM00060 EQU   LRBHCPID
LRBHTIME EQU   LRB+12
LRBHDATE EQU   LRB+8
@NM00059 EQU   LRB+7
LRBHCNT  EQU   LRB+6
LRBNDEM  EQU   LRBMACT
LRBNCEM  EQU   LRBMACT
@NM00058 EQU   LRBHSW0
LRBHTMC  EQU   LRBHSW0
@NM00057 EQU   LRBHSW0
LRBHNS   EQU   LRBHSW0
LRBHMORE EQU   LRBHSW0
@NM00056 EQU   LRBHSYS
LRBHSYSB EQU   LRBHSYS
@NM00055 EQU   HDR+7
HDRCNTT  EQU   HDRCNT
HDRCNTS  EQU   HDRCNT
HDRDS3   EQU   HDRDS+2
HDRDS2   EQU   HDRDS+1
HDRDS17  EQU   HDRDS1
HDRDS16  EQU   HDRDS1
HDRDS15  EQU   HDRDS1
HDRDS14  EQU   HDRDS1
HDRDS12  EQU   HDRDS1
HDRDS11  EQU   HDRDS1
HDRISEC  EQU   HDRIS
HDRISR   EQU   HDRIS
HDRISMP  EQU   HDRIS
HDRISTM  EQU   HDRIS
@NM00054 EQU   HDRIS
HDRTRUNC EQU   HDRIS
HDRISMR  EQU   HDRIS
HDRRELN  EQU   HDROPRN
@NM00053 EQU   SRB+40
@NM00052 EQU   SRB+38
RTCTXXX2 EQU   RTCT+234
RTCTETIM EQU   RTCTERID+6
RTCTEASD EQU   RTCTERID+4
RTCTECPU EQU   RTCTERID+2
RTCTESEQ EQU   RTCTERID
RTCTSDWK EQU   RTCT+220
RTCTTDCB EQU   RTCT+184
RTCTXYX2 EQU   RTCT+180
RTCTSEQ# EQU   RTCT+178
RTCTXXX1 EQU   RTCT+177
@NM00051 EQU   RTCTRFLG
RTCTRSTF EQU   RTCTRFLG
RTCTTEST EQU   RTCT+172
RTCTMSRB EQU   RTCT+168
RTCTMLCK EQU   RTCT+164
RTCTFMT  EQU   RTCT+160
RTCTSDPL EQU   RTCT+156
RTCTDEV  EQU   RTCTSDDS+8
RTCTDCB  EQU   RTCTSDDS+4
@NM00050 EQU   RTCTFLG
RTCTDETP EQU   RTCTFLG
RTCTDSUS EQU   RTCTFLG
RTCTDSST EQU   RTCTFLG
RTCTDSNM EQU   RTCTSDDS
RTCTFASB EQU   RTCT+24
RTCTMECB EQU   RTCT+20
RTCTSDID EQU   RTCT+18
RTCTSDEP EQU   RTCTSDF2
RTCTSDDO EQU   RTCTSDF2
RTCTSDEN EQU   RTCTSDF2
RTCTSDTR EQU   RTCTSDF2
RTCTSDPT EQU   RTCTSDF2
RTCTSDSR EQU   RTCTSDF2
RTCTSDSS EQU   RTCTSDF2
RTCTSDSH EQU   RTCTSDF2
@NM00049 EQU   RTCTSDF1
RTCTSDFX EQU   RTCTSDF1
RTCTSDND EQU   RTCTSDF1
RTCTSDNO EQU   RTCTSDF1
@NM00048 EQU   RTCTABD+1
@NM00047 EQU   RTCTIDMP
RTCTISVC EQU   RTCTIDMP
RTCTISYU EQU   RTCTIDMP
RTCTISAB EQU   RTCTIDMP
@NM00046 EQU   RTCTIDMP
@NM00045 EQU   RTCTSDO2
RTCTSDPB EQU   RTCTSDO2
RTCTSDPA EQU   RTCTSDO2
RTCTSDP9 EQU   RTCTSDO2
RTCTSDP8 EQU   RTCTSDO2
RTCTSDP7 EQU   RTCTSDO1
RTCTSDP6 EQU   RTCTSDO1
RTCTSDP5 EQU   RTCTSDO1
RTCTSDP4 EQU   RTCTSDO1
RTCTSDP3 EQU   RTCTSDO1
RTCTSDP2 EQU   RTCTSDO1
RTCTSDP1 EQU   RTCTSDO1
RTCTSDP0 EQU   RTCTSDO1
RTCTSYDF EQU   RTCTSUO2
RTCTSYDE EQU   RTCTSUO2
RTCTSYDD EQU   RTCTSUO2
RTCTSYDC EQU   RTCTSUO2
RTCTSYDB EQU   RTCTSUO2
RTCTSYDA EQU   RTCTSUO2
RTCTSYD9 EQU   RTCTSUO2
RTCTSYD8 EQU   RTCTSUO2
RTCTSYD7 EQU   RTCTSUO1
RTCTSYD6 EQU   RTCTSUO1
RTCTSYD5 EQU   RTCTSUO1
RTCTSYD4 EQU   RTCTSUO1
RTCTSYD3 EQU   RTCTSUO1
RTCTSYD2 EQU   RTCTSUO1
RTCTSYD1 EQU   RTCTSUO1
RTCTSYD0 EQU   RTCTSUO1
RTCTSADF EQU   RTCTSAO2
RTCTSADE EQU   RTCTSAO2
RTCTSADD EQU   RTCTSAO2
RTCTSADC EQU   RTCTSAO2
RTCTSADB EQU   RTCTSAO2
RTCTSADA EQU   RTCTSAO2
RTCTSAD9 EQU   RTCTSAO2
RTCTSAD8 EQU   RTCTSAO2
RTCTSAD7 EQU   RTCTSAO1
RTCTSAD6 EQU   RTCTSAO1
RTCTSAD5 EQU   RTCTSAO1
RTCTSAD4 EQU   RTCTSAO1
RTCTSAD3 EQU   RTCTSAO1
RTCTSAD2 EQU   RTCTSAO1
RTCTSAD1 EQU   RTCTSAO1
RTCTSAD0 EQU   RTCTSAO1
RTCTSUDF EQU   RTCTSUP2
RTCTSUDE EQU   RTCTSUP2
RTCTSUDD EQU   RTCTSUP2
RTCTSUDC EQU   RTCTSUP2
RTCTSUDB EQU   RTCTSUP2
RTCTSUDA EQU   RTCTSUP2
RTCTSUD9 EQU   RTCTSUP2
RTCTSUD8 EQU   RTCTSUP2
RTCTSUD7 EQU   RTCTSUP1
RTCTSUD6 EQU   RTCTSUP1
RTCTSUD5 EQU   RTCTSUP1
RTCTSUD4 EQU   RTCTSUP1
RTCTSUD3 EQU   RTCTSUP1
RTCTSUD2 EQU   RTCTSUP1
RTCTSUD1 EQU   RTCTSUP1
RTCTSUD0 EQU   RTCTSUP1
RTCTSABF EQU   RTCTSAP2
RTCTSABE EQU   RTCTSAP2
RTCTSABD EQU   RTCTSAP2
RTCTSABC EQU   RTCTSAP2
RTCTSABB EQU   RTCTSAP2
RTCTSABA EQU   RTCTSAP2
RTCTSAB9 EQU   RTCTSAP2
RTCTSAB8 EQU   RTCTSAP2
RTCTSAB7 EQU   RTCTSAP1
RTCTSAB6 EQU   RTCTSAP1
RTCTSAB5 EQU   RTCTSAP1
RTCTSAB4 EQU   RTCTSAP1
RTCTSAB3 EQU   RTCTSAP1
RTCTSAB2 EQU   RTCTSAP1
RTCTSAB1 EQU   RTCTSAP1
RTCTSAB0 EQU   RTCTSAP1
RTCTNAME EQU   RTCT
CVTLEVL  EQU   CVTRELNO+2
CVTMDL   EQU   CVTFIX+250
@NM00044 EQU   CVTFIX+248
@NM00043 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTBAH   EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTRV490 EQU   CVTMAP+388
CVTSU    EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTVS1B  EQU   CVTOPTB
CVTVS1A  EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00018 EQU   SDUMP+20
@NM00017 EQU   SDUMP+16
@NM00016 EQU   SDUMP+12
@NM00015 EQU   SDUMP+8
@NM00014 EQU   SDUMP+4
@NM00013 EQU   SDUSDAT2
SDUSWA   EQU   SDUSDAT2
SDUCSA   EQU   SDUSDAT2
SDUTRT   EQU   SDUSDAT1
SDULPA   EQU   SDUSDAT1
SDURGN   EQU   SDUSDAT1
SDULSQA  EQU   SDUSDAT1
SDUSQA   EQU   SDUSDAT1
SDUNUC   EQU   SDUSDAT1
SDUPSA   EQU   SDUSDAT1
SDUALPSA EQU   SDUSDAT1
@NM00012 EQU   SDUMP
ESTARSVI EQU   ESTAFGRS+1
@NM00011 EQU   ESTAFLG2
ESTABRNT EQU   ESTAFLG2
@NM00010 EQU   ESTAFLG2
ESTAEREC EQU   ESTAFLG2
ESTATERM EQU   ESTAFLG2
@NM00009 EQU   ESTAFLG2
ESTAOWNR EQU   ESTA+8
ESTAPARM EQU   ESTA+4
ESTAEXIT EQU   ESTAEXT+1
ESTAHALT EQU   ESTAIO
ESTANOIO EQU   ESTAIO
ESTASYNC EQU   ESTAFLG1
@NM00008 EQU   ESTAFLG1
ESTAESTA EQU   ESTAFLG1
@NM00007 EQU   ESTAFLG1
ESTASTAR EQU   ESTAFLG1
ESTASTAI EQU   ESTAFLG1
@NM00004 EQU   RCBBUF+12
@NM00003 EQU   RCBBUF+4
@NM00002 EQU   RCBBFLG2
@NM00001 EQU   RCBBFLG1
@NM00042 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00041 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00040 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00039 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00038 EQU   FLCFSA
@NM00037 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00036 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00035 EQU   FLCIOA
@NM00034 EQU   FLCMCLA+15
@NM00033 EQU   FLCMCLA+14
@NM00032 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00031 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00030 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00029 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00028 EQU   FLCPER
@NM00027 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00026 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00025 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00024 EQU   FLCPIILC
@NM00023 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00022 EQU   FLCSVILC
@NM00021 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00020 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00019 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RF00349 EQU   @RC00346
@RF00448 EQU   @RC00446
@RC00157 EQU   SLEEP
@RF00159 EQU   @RC00157
@ENDDATA EQU   *
         END   IEAVTRET,(C'PLS1818',0701,77334)
