         TITLE '        IEAVTRER  RECORDING REQUEST FACILITY           *
                        '
IEAVTRER CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEAVTRER  77.132'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @08,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@08                                         0001
HALFREG EQU 16                     /* BITS FOR SHIFT                 */
R2DISP  EQU 28                     /* DISPLACEMENT IN SAVEAREA       */
ZIP     EQU  0                     /* ZERO DISPLACEMENT              */
BYTE1   EQU  4                     /* BYTE ONE IN REG                */
*   IF CVTRTMCT=0 THEN              /* IF RTCT NOT INIT      @YM33344*/
         L     @14,CVTPTR                                          0109
         L     @14,CVTRTMCT(,@14)                                  0109
         LTR   @14,@14                                             0109
         BNZ   @RF00109                                            0109
*     DO;                           /* DONT HANDLE REQUEST   @YM33344*/
*       R15=RCTWENTY;               /* IND RECORD INACTIVE   @YM33344*/
         LA    R15,20                                              0111
*     END;                          /* END NOT INIT GROUP    @YM33344*/
*   ELSE                            /* IF RTCT INIT PROCESS  @YM33344*/
*     DO;                           /* AS NORMAL             @YM33344*/
         B     @RC00109                                            0113
@RF00109 DS    0H                                                  0114
*       IF EMERREQ=YES THEN         /* IF THIS IS AN EMERGENCY     0114
*                                      REQUEST FROM THE SYSTEM     0114
*                                      TERMINATION FACILITY          */
         TM    EMERREQ(R13),B'10000000'                            0114
         BNO   @RF00114                                            0114
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE EMERPROC SEGMENT IS TO HANDLE TERMINATION     */
*/* REQUESTS. THE RECORDING FACILITY MUST RETURN THE ADDRESS AND     */
*/* LENGTH OF UNWRITTEN LOGREC RECORDS. STF WILL ATTEMPT TO WRITE    */
*/* THESE RECORDS BEFORE ENTERING WAIT STATE.                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0115
*         DO;                       /* EMERGENCY PROCESSING          */
*           R15=LOOPCODE;           /* USED FOR LOOP CONTROL         */
         LA    R15,1                                               0116
*           RESPECIFY               /* RESTRICT REGISTER FOR         */
*             R4 RESTRICTED;        /* ADDRESS TO STORE SYSTEM MASK  */
*           R4=ADDR(SMASK);         /* OBTAIN ADDRESS FOR STNSM      */
         LA    R4,SMASK(,R13)                                      0118
*           GEN(STNSM ZIP(R4),X'FF');/* STORE SYSTEM MASK AND      0119
*                                      PRESERVE ITS ORIGINAL VALUE   */
         STNSM ZIP(R4),X'FF'
*           RESPECIFY               /* RELEASE REGISTER FROM         */
*             R4 UNRESTRICTED;      /* ADDRESS TO STORE SYSTEM MASK  */
*           IF DATBIT=YES THEN      /* IF DYNAMIC ADDRESS TRANSLATION
*                                      IS ACTIVE, REQUESTOR NOT STF  */
         TM    DATBIT(R13),B'00000100'                             0121
         BNO   @RF00121                                            0121
*             R15=RC6TEEN;          /* REQUEST NOT HONORED           */
         LA    R15,16                                              0122
*           ELSE                    /* IF DAT NOT ACTIVE CONTINUE  0123
*                                      WITH                          */
*             DO;                   /* EMERGENCY PROCESSING          */
*                                                                  0123
         B     @RC00121                                            0123
@RF00121 DS    0H                                                  0124
*               /*****************************************************/
*               /*                                                   */
*               /* CONVERT NECESSARY VIRTUAL ADDRESSES TO REAL       */
*               /* ADDRESSES.                                        */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0124
*               RFY                                                0124
*                (R3) RSTD;                                        0124
*               R3=CVTRTMCT;        /* VIRTUAL RTCT ADDRESS          */
         L     @14,CVTPTR                                          0125
         L     R3,CVTRTMCT(,@14)                                   0125
*               GEN(LRA R3,ZIP(R3));/* MAKE IT REAL ADDR             */
         LRA R3,ZIP(R3)
*               R3->RTCTRPER=YES;   /* TURN OFF RECORDING TO OBVIATE
*                                      RCB SERIALIZATION             */
         OI    RTCTRPER(R3),B'01000000'                            0127
*               R12=R3->RTCTRCB;    /* GET VIRTUAL RCB ADDRESS       */
         L     R12,RTCTRCB(,R3)                                    0128
*               GEN(LRA R12,ZIP(R12));/* MAKE IT REAL                */
         LRA R12,ZIP(R12)
*               IF R3->RTCTRSTF=NO THEN/* FIRST STF ENTRY ...        */
         TM    RTCTRSTF(R3),B'00100000'                            0130
         BNZ   @RF00130                                            0130
*                 DO;               /* -YES , DO ONE-TIME VIRT TO  0131
*                                      REAL TRANSLATION OF RCB ADDR  */
*                   R3->RTCTRSTF=YES;/* SHOW ADDRS TRANSLATED        */
         OI    RTCTRSTF(R3),B'00100000'                            0132
*                   R3=RCBBUFB;                                    0133
         L     R3,RCBBUFB(,R12)                                    0133
*                   GEN(LRA R3,ZIP(R3));/* REAL BUFFER START         */
         LRA R3,ZIP(R3)
*                   RCBBUFB=R3;     /* UPDATE THE RCB                */
         ST    R3,RCBBUFB(,R12)                                    0135
*                   R3=RCBBUFE-1;   /* BUFFEREND MINUS ONE TO INSURE
*                                      SAME PAGE             @YM04220*/
         L     R3,RCBBUFE(,R12)                                    0136
         BCTR  R3,0                                                0136
*                   GEN(LRA R3,ZIP(R3));/* REAL BUFFER END           */
         LRA R3,ZIP(R3)
*                   RCBBUFE=R3+1;   /* UPDATE THE RCB        @YM04220*/
         LA    @14,1                                               0138
         ALR   @14,R3                                              0138
         ST    @14,RCBBUFE(,R12)                                   0138
*                   R3=RCBFREE;                                    0139
         L     R3,RCBFREE(,R12)                                    0139
*                   GEN(LRA R3,ZIP(R3));/* REAL FREE PTR             */
         LRA R3,ZIP(R3)
*                   RCBFREE=R3;     /* UPDATE THE RCB                */
         ST    R3,RCBFREE(,R12)                                    0141
*                 END;              /* END V - R TRANSLATION         */
*               RFY                                                0143
*                (R3) UNRSTD;                                      0143
@RF00130 DS    0H                                                  0144
*               IF RCBFLNG=RCBTLNG THEN/* IF THERE ARE NO UNWRITTEN
*                                      RECORD                        */
         CLC   RCBFLNG(2,R12),RCBTLNG(R12)                         0144
         BNE   @RF00144                                            0144
*                 R15=RCFOUR;       /* NOTIFY SYSTEM TERMINATION     */
         LA    R15,4                                               0145
*               ELSE                /* IF THERE ARE UNWRITTEN RECORDS
*                                      SEARCH UNTIL A LOGREC RECORD
*                                      OR NO RECORDS REMAIN          */
*                 DO WHILE(R15=LOOPCODE);                          0146
         B     @RC00144                                            0146
@RF00144 B     @DE00146                                            0146
@DL00146 DS    0H                                                  0147
*                   RESPECIFY       /* RESTRICT REGISTER FOR         */
*                    (R3,           /* POINTER TO OLDEST RECORD      */
*                     R1,           /* ADDRESS OF THE DATA TO WRITE  */
*                     R0) RESTRICTED;/* LENGTH OF THE DATA TO WRITE  */
*                   R3=RCBFREE+RCBFLNG;/* FIND ADDRESS OF OLDEST     */
         LH    R3,RCBFLNG(,R12)                                    0148
         N     R3,@CF02089                                         0148
         AL    R3,RCBFREE(,R12)                                    0148
*/*  DUMMY ALLOCATION CODE NO LONGER NEEDED SINCE THE SPACE AT THE END
*    OF THE BUFFER WILL CONTAIN THE BEGINNING OF A WRAPPED HEADER  0149
*                                                             @ZA19199
*                                                                    */
*                                                                  0149
*                   IF R3>=RCBBUFE THEN/* IF RCBBUFRS HAS BEEN     0149
*                                      WRAPPED AROUND, UPDATE THE  0149
*                                      RECORD POINTER                */
         C     R3,RCBBUFE(,R12)                                    0149
         BL    @RF00149                                            0149
*                     R3=R3-RCBTLNG;                               0150
         LH    @14,RCBTLNG(,R12)                                   0150
         N     @14,@CF02089                                        0150
         SLR   R3,@14                                              0150
*                   RESPECIFY       /* BASE THIS BUFFER ENTRY ON     */
*                    (RCBBUF) BASED(R3);/* THE CALCULATED ADDRESS    */
@RF00149 DS    0H                                                  0152
*                   IF RCBBWRAP=YES×/* IS THIS A WRAPPED OR WTO      */
*                       RCBBWTO=YES THEN/* RECORD                    */
         TM    RCBBWRAP(R3),B'10100000'                            0152
         BZ    @RF00152                                            0152
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE FREEREC SEGMENT IS TO FREE A RECORD IN THE RCB*/
*/* AND MAKE AVAILABLE THE SPACE ALLOCATED TO IT                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0153
*                     DO;           /* FREE THE RECORD               */
*                       IF RCBBNBFR=NO THEN/* IF IT WAS BUFFERED THE */
         TM    RCBBNBFR(R3),B'00001000'                            0154
         BNZ   @RF00154                                            0154
*                         RCBFLNG=RCBFLNG+/* LENGTH TO FREE IS THE   */
*                             (RCBBLEN+/* DATA LENGTH PLUS           */
*                             CONTLEN+/* CONTROL INFO LENGTH         */
*                             SEVEN&/* ROUNDED TO DOUBLE WORD        */
*                             'FFF8'X);                            0155
         LA    @14,23                                              0155
         LH    @09,RCBBLEN(,R3)                                    0155
         N     @09,@CF02089                                        0155
         ALR   @14,@09                                             0155
         N     @14,@CF01992                                        0155
         LH    @09,RCBFLNG(,R12)                                   0155
         N     @09,@CF02089                                        0155
         ALR   @14,@09                                             0155
         STH   @14,RCBFLNG(,R12)                                   0155
*                       ELSE                                       0156
*                         DO;       /* IF NOT BUFFERED       @G17EP5W*/
         B     @RC00154                                            0156
@RF00154 DS    0H                                                  0157
*                           RFY                                    0157
*                             R5 RSTD;/* RESTRICT REGISTER FOR ERROR
*                                      ID LENGTH             @G17EP5W*/
*                           IF RCBBERFG=YES THEN/* IF ERRORID      0158
*                                      APPENDED IN RCB       @G17EP5W*/
         TM    RCBBERFG(R3),B'00000010'                            0158
         BNO   @RF00158                                            0158
*                             R5=LENGTH(RCBBERID);/* THEN INCLUDE ITS
*                                      LENGTH FOR FREEING    @G17EP5W*/
         LA    R5,10                                               0159
*                           ELSE                                   0160
*                             R5=ZERO;/* OTHERWISE FREE NO ADDITIONAL
*                                      SPACE                 @G17EP5W*/
         B     @RC00158                                            0160
@RF00158 L     R5,ZERO                                             0160
*                           RCBFLNG=RCBFLNG+/* IF IT WAS NOT BUFFERED
*                                      THE                           */
*                               (NBFRLEN+/* LENGTH IS (16 CONTROL +  */
*                               R5+ /* LENGTH OF ERROR ID IF PRESENT
*                                      OR ZERO               @G17EP5W*/
*                               SEVEN&/* 4 FOR DATA PTR) ROUNDED TO  */
*                               'FFF8'X);/* DOUBLE WORD              */
@RC00158 LA    @14,27                                              0161
         ALR   @14,R5                                              0161
         N     @14,@CF01992                                        0161
         LH    @09,RCBFLNG(,R12)                                   0161
         N     @09,@CF02089                                        0161
         ALR   @14,@09                                             0161
         STH   @14,RCBFLNG(,R12)                                   0161
*                           RFY                                    0162
*                             R5 UNRSTD;/* RELEASE LENGTH REGISTER 0162
*                                                            @G17EP5W*/
*                         END;      /* END NON BUFFERED RECORD     0163
*                                                            @G17EP5W*/
*                     END;          /* END FREE RECORD               */
*                   ELSE            /* IF NOT WTO OR DUMMY ALLOC     */
*                     DO;           /* AND NOT WRAPPED PROCESS LOGREC
*                                      RECORD                        */
         B     @RC00152                                            0165
@RF00152 DS    0H                                                  0166
*                       IF RCBBNBFR=YES THEN/* IF NOT BUFFERED IN RCB*/
         TM    RCBBNBFR(R3),B'00001000'                            0166
         BNO   @RF00166                                            0166
*                         DO;                                      0167
*                           R1=NBFRDATA;/* GET DATA ADDRESS FROM BUF */
         L     R1,NBFRDATA+16(,R3)                                 0168
*                           GEN(LRA R1,ZIP(R1));/* INSURE REAL ADDR  */
         LRA R1,ZIP(R1)
*                         END;                                     0170
*                       ELSE        /* IF BUFFERED GET ADDRESS       */
*                         R1=ADDR(RCBBDATA);/* OF DATA IN BUFFER     */
         B     @RC00166                                            0171
@RF00166 LA    R1,RCBBDATA(,R3)                                    0171
*                       R0=RCBBLEN; /* OBTAIN LENGTH OF RECORD       */
@RC00166 LH    @14,RCBBLEN(,R3)                                    0172
         N     @14,@CF02089                                        0172
         LR    R0,@14                                              0172
*                       R15=RCZERO; /* INDICATE TO STF LOGREC RECORD
*                                      ADDR & LENGTH IN REGISTERS    */
         SLR   R15,R15                                             0173
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE FREEREC SEGMENT IS TO FREE A RECORD IN THE RCB*/
*/* AND MAKE AVAILABLE THE SPACE ALLOCATED TO IT                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0174
*                       DO;         /* FREE THE RECORD               */
*                         IF RCBBNBFR=NO THEN/* IF IT WAS BUFFERED 0175
*                                      THE                           */
         TM    RCBBNBFR(R3),B'00001000'                            0175
         BNZ   @RF00175                                            0175
*                           RCBFLNG=RCBFLNG+/* LENGTH TO FREE IS THE */
*                               (RCBBLEN+/* DATA LENGTH PLUS         */
*                               CONTLEN+/* CONTROL INFO LENGTH       */
*                               SEVEN&/* ROUNDED TO DOUBLE WORD      */
*                               'FFF8'X);                          0176
         AL    @14,@CF02073                                        0176
         N     @14,@CF01992                                        0176
         LH    @09,RCBFLNG(,R12)                                   0176
         N     @09,@CF02089                                        0176
         ALR   @14,@09                                             0176
         STH   @14,RCBFLNG(,R12)                                   0176
*                         ELSE                                     0177
*                           DO;     /* IF NOT BUFFERED       @G17EP5W*/
         B     @RC00175                                            0177
@RF00175 DS    0H                                                  0178
*                             RFY                                  0178
*                               R5 RSTD;/* RESTRICT REGISTER FOR   0178
*                                      ERROR ID LENGTH       @G17EP5W*/
*                             IF RCBBERFG=YES THEN/* IF ERRORID    0179
*                                      APPENDED IN RCB       @G17EP5W*/
         TM    RCBBERFG(R3),B'00000010'                            0179
         BNO   @RF00179                                            0179
*                               R5=LENGTH(RCBBERID);/* THEN INCLUDE
*                                      ITS LENGTH FOR FREEING      0180
*                                                            @G17EP5W*/
         LA    R5,10                                               0180
*                             ELSE                                 0181
*                               R5=ZERO;/* OTHERWISE FREE NO       0181
*                                      ADDITIONAL SPACE      @G17EP5W*/
         B     @RC00179                                            0181
@RF00179 L     R5,ZERO                                             0181
*                             RCBFLNG=RCBFLNG+/* IF IT WAS NOT     0182
*                                      BUFFERED THE                  */
*                                 (NBFRLEN+/* LENGTH IS (16 CONTROL +*/
*                                 R5+/* LENGTH OF ERROR ID IF PRESENT
*                                      OR ZERO               @G17EP5W*/
*                                 SEVEN&/* 4 FOR DATA PTR) ROUNDED TO*/
*                                 'FFF8'X);/* DOUBLE WORD            */
@RC00179 LA    @14,27                                              0182
         ALR   @14,R5                                              0182
         N     @14,@CF01992                                        0182
         LH    @09,RCBFLNG(,R12)                                   0182
         N     @09,@CF02089                                        0182
         ALR   @14,@09                                             0182
         STH   @14,RCBFLNG(,R12)                                   0182
*                             RFY                                  0183
*                               R5 UNRSTD;/* RELEASE LENGTH REGISTER
*                                                            @G17EP5W*/
*                           END;    /* END NON BUFFERED RECORD     0184
*                                                            @G17EP5W*/
*                       END;        /* END FREE RECORD               */
@RC00175 DS    0H                                                  0186
*                     END;          /* END LOGREC PROCESSING         */
*                   IF RCBFLNG=RCBTLNG&/* IF THERE ARE NO RECORDS AND*/
*                       R15^=RCZERO THEN/* ONE WAS NOT FOUND THIS  0187
*                                      PASS                          */
@RC00152 CLC   RCBFLNG(2,R12),RCBTLNG(R12)                         0187
         BNE   @RF00187                                            0187
         LTR   R15,R15                                             0187
         BZ    @RF00187                                            0187
*                     R15=RCFOUR;   /* NOTIFY STF NO RECORDS         */
         LA    R15,4                                               0188
*                   RESPECIFY       /* RELEASE REGISTERS FROM        */
*                    (R3,           /* POINTER TO THE OLDEST RECORD  */
*                     R1,           /* ADDRESS OF DATA TO WRITE      */
*                     R0) UNRESTRICTED;/* LENGTH OF DATA TO WRITE    */
@RF00187 DS    0H                                                  0190
*                 END;              /* END BUFFER SEARCH             */
@DE00146 C     R15,@CF00045                                        0190
         BE    @DL00146                                            0190
*             END;                  /* END EMERGENCY PROCESSING      */
*         END;                      /* END EMERPROC                  */
*       ELSE                        /* IF NOT AN EMERGENCY REQUEST   */
*         DO;                       /* CONTINUE RECORD PROCESSING    */
         B     @RC00114                                            0193
@RF00114 DS    0H                                                  0194
*           R12=RTCTRCB;            /* SET UP ADDRESSIBILTY FOR RCB  */
         L     @14,CVTPTR                                          0194
         L     @14,CVTRTMCT(,@14)                                  0194
         L     R12,RTCTRCB(,@14)                                   0194
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE ESTRCV SEGMENT IS TO ESTABLISH RECOVERY       */
*/* FOR THE RECORDING REQUEST ROUTINE. RECOVERY IS ESTABLISHED       */
*/* ACCORDING TO THE STATE OF THE CALLER. THIS IS DETERMINED BY      */
*/* THE FLAGS SET IN REGISTER ZERO BY THE RECORD MACRO EXPANSION     */
*/* AND THE KEYWORD SPECIFIED BY THE CALLER FOR RCVRY = ON THE       */
*/* RECORD MACRO                                                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0195
*           RESPECIFY               /* RESTRICT REGISTERS FOR        */
*            (R1,                   /* RETURN OF GETMAINED AREA      */
*             R2,                   /* ADDRESS OF RECOVERY ROUTINE   */
*             R3,                   /* ADDRESS OF RECOVERY PARMLIST  */
*             R4) RESTRICTED;       /* WORK REGISTER FOR SETFRR      */
*           TRUNCFLG=NO;            /* INITIALIZE TRUNCATED FLAG   0196
*                                      (OFF)                         */
*           OPTNOBUF=NO;            /* INITIALIZE NOBUF OFF (OPT)    */
*           NOESTAE=YES;            /* INDICATES GETMAIN NOT       0198
*                                      SUCESSFUL RESET IF GETMAIN  0198
*                                      SUCESSFUL                     */
*           UPACNT=NO;              /* INIT ACTIVE COUNT SWITCH OFF  */
         OI    NOESTAE(R13),B'00100000'                            0199
         NI    TRUNCFLG(R13),B'00101111'                           0199
*           R2=ADDR(FRREP);         /* GET ADDRESS OF RECOVERY     0200
*                                      ROUTINE                       */
         LA    R2,FRREP                                            0200
*           IF ESTAEREQ=YES THEN    /* THE CALLER REQUESTED RECOVERY */
         TM    ESTAEREQ(R13),B'10000000'                           0201
         BNO   @RF00201                                            0201
*             DO;                   /* VIA ESTAE AS HE WAS NOT LOCKED
*                                      DISABLED OR IN SRB MODE       */
*               DO;                 /* GETMAIN (RC)                0203
*                                      LV(LENGTH(GMSPACE)) SP(253)   */
*                 RESPECIFY                                        0204
*                  (GPR01F,                                        0204
*                   GPR15F,                                        0204
*                   GPR00F) RESTRICTED;                            0204
*                 GPR01F=0;         /* REG 1 MUST BE ZERO            */
         SLR   GPR01F,GPR01F                                       0205
*                 GPR15F=0;         /* RC-TYPE GETMAIN               */
         SLR   GPR15F,GPR15F                                       0206
*                 GPR00F=LENGTH(GMSPACE);/* LENGTH REQUESTED         */
         LA    GPR00F,40                                           0207
*                 GPR15F=GPR15F×((253)*256);/* SP IN BYTE 2          */
         O     GPR15F,@CF02076                                     0208
*                 SVC(120);         /* RC/RU-FORM OF GETMAIN         */
         SVC   120                                                 0209
*                 RESPECIFY                                        0210
*                  (GPR01F,                                        0210
*                   GPR15F,                                        0210
*                   GPR00F) UNRESTRICTED;                          0210
*               END;                /* GETMAIN (RC)                0211
*                                      LV(LENGTH(GMSPACE)) SP(253) 0211
*                                      GET SPACE FOR ESTAE LISTS     */
*               IF R15=ZERO THEN    /* IF GETMAIN SUCESSFUL          */
         C     R15,ZERO                                            0212
         BNE   @RF00212                                            0212
*                 DO;               /* PROCESS ESTAE                 */
*                   GMAD=R1;        /* SAVE THE ADDRESS              */
         ST    R1,GMAD(,R13)                                       0214
*                   NOESTAE=NO;     /* INDICATE GETMAIN SUCESSFUL    */
         NI    NOESTAE(R13),B'11011111'                            0215
*                   SVC60LST=MFLESTAE;/* SET UP FOR E FORM ESTAE     */
         L     @14,GMAD(,R13)                                      0216
         MVC   SVC60LST(16,@14),MFLESTAE                           0216
*                   R1=ADDR(SVC60LST);/* ADDRESS LSIT FORM ESTAE     */
         LA    R1,SVC60LST(,@14)                                   0217
*                   R3=ADDR(RCVPLIST);/* ADDRESS ESTAE PARMLST       */
         LR    R3,@14                                              0218
*                   GEN(ESTAE PARAM=(R3),MF=(E,(1)));/* ISSUE ESTAE  */
         ESTAE PARAM=(R3),MF=(E,(1))
*                 END;                                             0220
*               ELSE                                               0221
*                 GMAD=0;           /* NOTE NO WORKAREA AVAILABLE  0221
*                                                            @ZM40310
*                                                            @ZA19199*/
         B     @RC00212                                            0221
@RF00212 SLR   @14,@14                                             0221
         ST    @14,GMAD(,R13)                                      0221
*             END;                                                 0222
@RC00212 DS    0H                                                  0223
*           IF FRRREQ=YES THEN      /* THE CALLER REQUESTED RECOVERY */
@RF00201 TM    FRRREQ(R13),B'01000000'                             0223
         BNO   @RF00223                                            0223
*             DO;                   /* VIA SETFRR AS HE WAS IN ONE OF
*                                      THE ABOVE STATES              */
*               GEN(SETFRR A,FRRAD=(R2),PARMAD=(R3),WRKREGS=(R3,R4));
         SETFRR A,FRRAD=(R2),PARMAD=(R3),WRKREGS=(R3,R4)
*               GMAD=R3;            /* CHECKPOINT THE PARAMETER AREA
*                                      ADDRESS               @ZM40310*/
         ST    R3,GMAD(,R13)                                       0226
*             END;                                                 0227
*           IF FRRREQ=YES×NOESTAE=NO THEN/* IF ESTAE WAS DONE OR   0228
*                                      FRRREQ                        */
@RF00223 TM    FRRREQ(R13),B'01000000'                             0228
         BO    @RT00228                                            0228
         TM    NOESTAE(R13),B'00100000'                            0228
         BNZ   @RF00228                                            0228
@RT00228 DS    0H                                                  0229
*             DO;                   /* INITIALIZE THE RECOVERY     0229
*                                      PARMLIST                      */
*               RFY                                                0230
*                 GMSPACE BASED(R3);/* SET UP BASE FOR PARMLIST      */
*               RETRY8=R8;          /* SAVE BASE REGISTER            */
         ST    R8,RETRY8(,R3)                                      0231
*               RETRY13=R13;        /* SAVE POINTER TO SAVEAREA      */
         ST    R13,RETRY13(,R3)                                    0232
*               RETRYADR=ADDR(RETRYRTN);/* SAVE ADDRESS OF RETRY   0233
*                                      ROUTINE                       */
         LA    @14,RETRYRTN                                        0233
         ST    @14,RETRYADR(,R3)                                   0233
*               RFY                                                0234
*                 GMSPACE BASED(GMAD);/* SET UP BASE FOR PARMLIST    */
*               RESPECIFY           /* RELEASE REGISTERS FROM        */
*                (R1,                                              0235
*                 R2,               /* RECOVERY ROUTINE ADDRESS      */
*                 R3,               /* ADDRESS OF RECOVERY PARMLIST  */
*                 R4) UNRESTRICTED; /* WORKREGISTER FOR SETFRR       */
*             END;                                                 0236
*           IF RTCTRTER=YES×        /* IF ANY TEMPORARY OR PERMANENT */
*               RTCTRPER=YES THEN   /* ERRORS HAVE BEEN SUFFERED     */
@RF00228 L     @14,CVTPTR                                          0237
         L     @14,CVTRTMCT(,@14)                                  0237
         TM    RTCTRTER(@14),B'11000000'                           0237
         BZ    @RF00237                                            0237
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE ERRPROC SEGMENT IS TO DETERMINE THE NATURE    */
*/* OF A PREVIOUSLY SUFFERED ERROR AND TO NOTIFY THE REQUESTOR THE   */
*/*  REASON HIS REQUEST WAS NOT HONORED                              */
*/*                                                                  */
*/********************************************************************/
*                                                                  0238
*             DO;                                                  0238
*               IF RTCTRPER=YES THEN/* IF A PERMANENT ERROR RECORDING*/
         TM    RTCTRPER(@14),B'01000000'                           0239
         BNO   @RF00239                                            0239
*                 R15=RCTWENTY;     /* IS INACTIVE. NOTIFY CALLER    */
         LA    R15,20                                              0240
*               IF RTCTRTER=YES&    /* IF A TEMPORARY ERROR AND NO   */
*                   RTCTRPER=NO THEN/* PERMANENT ERRORS              */
@RF00239 L     @14,CVTPTR                                          0241
         L     @14,CVTRTMCT(,@14)                                  0241
         TM    RTCTRTER(@14),B'10000000'                           0241
         BNO   @RF00241                                            0241
         TM    RTCTRPER(@14),B'01000000'                           0241
         BNZ   @RF00241                                            0241
*                 DO;               /* POST TASK TO INITIATE CLEANUP */
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE SCHSRB SEGMENT IS TO SCHEULE THE RECORDING    */
*/* SRB.  THE CODE THAT RUNS UNDER THIS SRB WILL POST THE RECORDING  */
*/* TASK.                                                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0243
*                   RESPECIFY       /* RESTRICT REGISTERS FOR        */
*                    (R3,           /* SAVING SRB IN USE FIELD       */
*                     R4) RESTRICTED;/* CHECK & SET OF IN USE FLAG   */
*                   R3=RCBCS1;      /* SAVE SRB IN USE FLAG          */
         L     R3,RCBCS1(,R12)                                     0244
*TEST2:                             /* TO SEE IF SRB IN USE          */
*                   R4=R3;          /* MAKE IT AVAILABLE TO SET      */
TEST2    LR    R4,R3                                               0245
*                   GENERATE REFS(R4) FLOWS(NOSCHED2);             0246
          CLM  R4,4,INUSEMSK       /*IS SRB IN USE                  */
          BNL NOSCHED2            /* IF YES SKIP SCHEDULE           */
*                   R4=R4×INUSEON;  /* IF NOT IN USE SET IN USE      */
         O     R4,@CF00165                                         0247
*                   CS(R3,R4,RCBCS1);/* PUT UPDATED FLAG IN THE RCB  */
         CS    R3,@04,RCBCS1(R12)                                  0248
*                   BC(4,TEST2);    /* IF RCB NOT ALTERED            */
         BC    4,TEST2                                             0249
*                   RESPECIFY       /* RESTRICT REGISTER FOR         */
*                    (R5,                                          0250
*                     R7) RESTRICTED;/* ADDRESS OF SRB AND SAVE RCODE*/
*                   R7=R15;         /* SAVE RETURN CODE AROUND     0251
*                                      SCHEDULE                      */
         LR    R7,R15                                              0251
*                   R5=ADDR(RCBSRB);/* GET ADDRESS OF SRB            */
         LA    R5,RCBSRB(,R12)                                     0252
*                   GEN(SCHEDULE SRB=(R5),SCOPE=GLOBAL);/* SCHEDULE
*                                      THE SRB                       */
         SCHEDULE SRB=(R5),SCOPE=GLOBAL
*                   R15=R7;         /* RESTORE RETURN CODE           */
         LR    R15,R7                                              0254
*NOSCHED2:                          /* SRB WAS IN USE AND NOT      0255
*                                      SCHEDULED                     */
*                   RESPECIFY       /* RELEASE REGISTERS FROM        */
*                    (R3,           /* SAVING THE SRB IN USE FLAG    */
*                     R4,           /* CHECK & SET OF IN USE FLAG    */
*                     R7,           /* SAVING RETURN CODE            */
*                     R5) UNRESTRICTED;/* ADDRESS OF SRB             */
NOSCHED2 DS    0H                                                  0256
*                   R15=RC6TEEN;    /* INDICATE REQUEST NOT SCHEDULED
*                                      DUE TO A PROCESSING ERROR     */
         LA    R15,16                                              0256
*                 END;              /* END TEMPORARY ERROR PROCESSING*/
*             END;                  /* END ERROR PROCESSING          */
*           ELSE                    /* IF NO PREVIOUS ERRORS BEING   */
*             DO;                   /* PROCESSED CONTINUE WITH RECORD
*                                      PROCESSING                    */
         B     @RC00237                                            0259
@RF00237 DS    0H                                                  0260
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE INCACNT SEGMENT IS TO INCREMENT THE ACTIVE    */
*/*  REQUEST COUNT. THIS COUNT IS USED TO INDICATE THE NUMBER OF     */
*/*  REQUESTS CURRENTLY MANIPULATING THE RCB. IT IS USED BY THE TASK */
*/*  TO DETERMINE WHEN TO INITIATE CLEANUP IN THE EVENT IT BECOMES   */
*/*  NECESSARY                                                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0260
*               RESPECIFY           /* RESTRICT REGISTERS FOR        */
*                (R3,               /* SAVING THE ACTIVE COUNT       */
*                 R4) RESTRICTED;   /* INCREMENTING THE ACTIVE COUNT */
*               R3=RCBCS2;          /* SAVE CURRENT ACTIVE REQUEST 0261
*                                      COUNT                         */
         L     R3,RCBCS2(,R12)                                     0261
*TRYCS2:                            /* RCBACNT WILL BE INCREMENTED 0262
*                                      VIA CS EFFECTING SERIALIZATION*/
*               R4=R3;              /* MAKE AVAILABLE FOR          0262
*                                      INCREMENTING                  */
TRYCS2   LR    R4,R3                                               0262
*               R4=R4+HIHALF1;      /* INCREMENT ACTIVE REQUEST CT.  */
         AL    R4,HIHALF1                                          0263
*               CS(R3,R4,RCBCS2);   /* PUT UPDATED COUNT IN RCB      */
         CS    R3,@04,RCBCS2(R12)                                  0264
*               BC(4,TRYCS2);       /* IF RCBACNT IS NOT ALTERED     */
         BC    4,TRYCS2                                            0265
*               UPACNT=YES;         /* INDICATE ACTIVE COUNT UPDATED
*                                      FOR THIS REQUEST      @YM05488*/
         OI    UPACNT(R13),B'00010000'                             0266
*               RESPECIFY           /* FREE REGISTERS FROM           */
*                (R3,               /* SAVING ACTIVE COUNT           */
*                 R4) UNRESTRICTED; /* INCREMENTING ACTIVE COUNT     */
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE FNDSPACE SEGMENT IS TO FIND AND ALLOCATE      */
*/* REQUIRED SPACE IN THE RCB TO BUFFER THE CURRENTLY REQUESTED      */
*/* RECORD. INCLUDED ARE SEGMENTS TO DETERMINE SPACE REQUIREMENTS,   */
*/* TO PROCESS ALLOCATION IF SPACE IS AVAILABLE, AND TO RECALCULATE  */
*/* SPACE REQUIREMENTS IF POSSIBLE AND NECESSARY                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0268
*               RESPECIFY           /* RESTRICT REGISTERS FOR        */
*                (R6,               /* CALCULATING SPACE REQUIREMENT */
*                 R7) RESTRICTED;   /* MAINTAINING HEADER LENGTH     */
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE CALCSPCE SEGMENT IS TO DETERMINE THE SPACE    */
*/* REQUIREMENT IN THE RCB FOR A PARTICULAR REQUEST. THE AMOUNT      */
*/* IS BASED ON THE REQUIRED BUILD FUNCTIONS AS INDICATED BY THE     */
*/* FLAG SETTINGS AND DATALENGTH IN REGISTER ZERO                    */
*/*                                                                  */
*/********************************************************************/
*                                                                  0269
*               R6=CONTLEN;         /* ALL BUFFER ENTRIES INCLUDE THE
*                                      RECORD CONTROL INFORMATION    */
         LA    R6,16                                               0269
*/* STATEMENT AT FLAGGED COMMENT BELOW MOVED FROM HERE. STATEMENT  0270
*   HERE CAUSED ERRORID TO BE CONSIDERED PART OF RECORD WHICH MUST BE
*   CONTIGUOUS, BUT ERRORID NEED NOT BE CONTIGUOUS WITH HEADER     0270
*                                                            @ZA16445*/
*                                                                  0270
*               IF NBUFREQ=YES THEN /* IF NON BUFFERED REQUEST       */
         TM    NBUFREQ(R13),B'00010000'                            0270
         BNO   @RF00270                                            0270
*                 DO;                                              0271
*                   R6=R6+(LENGTH(NBFRDATA));/* ADD FOUR BYTES FOR 0272
*                                      DATA ADDRESS                  */
         AL    R6,@CF00039                                         0272
*                   R7=R6;          /* HEADER AND ENTRY ARE EQUAL    */
         LR    R7,R6                                               0273
*                 END;              /* END NON BUFFERED CALCULATION  */
*               ELSE                /* IF BUFFERING REQUESTED        */
*                 DO;               /* ADDITIONAL SPACE REQUIRED AS
*                                      FOLLOWS                       */
         B     @RC00270                                            0275
@RF00270 DS    0H                                                  0276
*                   IF HDRREQ=YES THEN/* IF AR149 HEADER REQUESTED   */
         TM    HDRREQ(R13),B'00001000'                             0276
         BNO   @RF00276                                            0276
*                     DO;           /* ADD LENGTH OF HEADER          */
*                       R6=R6+(LENGTH(HDR));                       0278
         AL    R6,@CF00111                                         0278
*                       IF JOBNMREQ=YES THEN/* IF JOBNAME REQUESTED  */
         TM    JOBNMREQ(R13),B'00000100'                           0279
         BNO   @RF00279                                            0279
*                         R6=R6+(LENGTH(RCBBJOBN));/* ADD 8 BYTES  0280
*                                      REQUIRED FOR JOBNAME          */
         AL    R6,@CF00032                                         0280
*                     END;          /* END HEADER PROCESSING         */
@RF00279 DS    0H                                                  0282
*                   R7=R6;          /* HEADER LENGTH BEFORE ADDING 0282
*                                      DATA                          */
@RF00276 LR    R7,R6                                               0282
*                   R6=R6+DATLEN;   /* ADD LENGTH OF DATA TO BUFFER  */
         LH    @14,DATLEN(,R13)                                    0283
         N     @14,@CF02089                                        0283
         ALR   R6,@14                                              0283
*                 END;              /* END BUFFERED CALCULATION      */
*/* FOLLOWING STATEMENT MOVED FROM FLAGGED COMMENT ABOVE     @ZA16445*/
*                                                                  0285
*               IF ERRIDREQ=YES THEN/* IF AN ERROR ID WAS REQUESTED
*                                                            @G17EP5W*/
@RC00270 TM    ERRIDREQ(R13),B'00000001'                           0285
         BNO   @RF00285                                            0285
*                 R6=R6+            /* THEN ADD ITS LENGTH IN WITH 0286
*                                      THE                           */
*                     LENGTH(RCBBERID);/* SPACE REQUIREMENTS @G17EP5W*/
         AL    R6,@CF00105                                         0286
*               RESPECIFY           /* RESTRICT REGISTERS FOR        */
*                (R2,               /* SAVING FREE POINTER,          */
*                 R3,               /* FREE LENGTH & DUMMY         0287
*                                      DISPLACEMENT                  */
*                 R4,               /* UPDATING FREE POINTER,        */
*                 R5,               /* FREE LENGTH & DUMMY         0287
*                                      DISPLACEMENT                  */
*                 R10,              /* CALCULATING NEW FREE LENGTH   */
*                 R9) RESTRICTED;   /* SWITCH FOR LOOP CONTROL       */
@RF00285 DS    0H                                                  0288
*               R15=RCZERO;         /* PRIME THE RETURN CODE         */
         SLR   R15,R15                                             0288
*               R9=LOOPCODE;        /* SET SWITCH FOR LOOP CONTROL   */
         LA    R9,1                                                0289
*               DO WHILE(R9=LOOPCODE);/* DETERMINE IF SPACE AVAILABLE
*                                      AND ALLOCATE IT OR RECALCULATE
*                                      SPACE AND RECHECK FOR       0290
*                                      AVAILABILITY                  */
         B     @DE00290                                            0290
@DL00290 DS    0H                                                  0291
*                 RESPECIFY         /* RESTRICT REGISTER FOR         */
*                  (R11) RESTRICTED;/* ADDRESS OF FIELDS FOR LOAD    */
*                 R11=ADDR(RCBCDS); /* OBTAIN ADDRESS OF DOUBLE WORD
*                                      CONTAINING FREE PTR,FREE    0292
*                                      LENGTH AND DUMMY DISPLACENENT */
         LA    R11,RCBCDS(,R12)                                    0292
*                 GEN(LM R2,R3,ZIP(R11));/* SAVE FIELDS IN REGISTERS */
         LM R2,R3,ZIP(R11)
*                 RESPECIFY         /* RELEASE REGISTER FROM         */
*                  (R11) UNRESTRICTED;/* ADDRESS OF FIELDS FOR LOAD  */
*                 R4=R2;            /* MAKE FREE POINTER AVAILABLE TO
*                                      UPDATE                        */
         LR    R4,R2                                               0295
*                 R5=R3;            /* MAKE FREE LENGTH AND DUMMY  0296
*                                      DISPLACEMENT AVAILABLE TO   0296
*                                      UPDATE                        */
         LR    R5,R3                                               0296
*                 R10=R5;           /* PUT FREE LEN & DUM IN UNIQ  0297
*                                      REGS                          */
         LR    R10,R5                                              0297
*                 GENERATE REFS(R5,R10);                           0298
          SLL   R5,HALFREG        /* ZERO HIGH ORDER TWO BYTES       */
          SRL   R5,HALFREG        /*  OF REG OF DUMMY DISPLACEMENT   */
          SRL   R10,HALFREG       /* MOVE FREE LENGTH TO LOW HALF REG*/
*                 IF R10>=R6 THEN   /* SPACE AVAILABLE FOR THIS    0299
*                                      RECORD?                       */
         CR    R10,R6                                              0299
         BL    @RF00299                                            0299
*/********************************************************************/
*/*                                                                  */
*/* IF SPACE IS AVAILABLE FOR THE RECORD, THE SPACE IS ALLOCATED.    */
*/*  (THE CHECK FOR CONTIGUOUS HEADER SPACE IS NO LONGER NEEDED      */
*/*   BECAUSE THE HEADER CAN NOW WRAP ALSO)                          */
*/*                                                           @ZA19199
*                                                                    */
*/********************************************************************/
*                                                                  0300
*                   DO;                                            0300
*                     R10=R10-(R6+  /* NEW FREE LENGTH IS MINUS THIS */
*                         SEVEN&'FFFFFFF8'X);/* RECORD ROUNDED TO DBL
*                                      WORD                          */
         LA    @14,7                                               0301
         ALR   @14,R6                                              0301
         N     @14,@CF02011                                        0301
         SLR   R10,@14                                             0301
*                     R4=R4+(R6+    /* NEW FREE PTR IS PLUS THIS REC */
*                         SEVEN&'FFFFFFF8'X);/* ROUNDED TO DBL WORD  */
         ALR   R4,@14                                              0302
*                     IF R4>=RCBBUFE THEN/* DOES THIS RECORD WRAP  0303
*                                      BUFFER                        */
         C     R4,RCBBUFE(,R12)                                    0303
         BL    @RF00303                                            0303
*                       R4=R4-RCBTLNG;/* IF SO UPDATE FREE POINTER   */
         LH    @14,RCBTLNG(,R12)                                   0304
         N     @14,@CF02089                                        0304
         SLR   R4,@14                                              0304
*                     GEN(SLL R10,HALFREG);/* MOVE FREE LENGTH TO  0305
*                                      HIGH HALF OF REGISTER         */
@RF00303 DS    0H                                                  0305
         SLL R10,HALFREG
*                     R5=R5×R10;    /* PUT IN REG WITH DUMMY DISP    */
         OR    R5,R10                                              0306
*                     CDS(R2,R4,RCBCDS);/* PUT UPDATED VALUES IN RCB
*                                      IF                            */
         CDS   R2,R4,RCBCDS(R12)                                   0307
*                     BC(4,SKPRESET);/* RCB HASN'T BEEN ALTERED      */
         BC    4,SKPRESET                                          0308
*                     R9=NOLOOP;    /* SPACE ALLOCATED - GET OUT     */
         SLR   R9,R9                                               0309
*SKPRESET:                          /* RCB HAS BEEN ALTERED TRY AGAIN*/
*                   END;            /* END REC SPACE AVAIL PROCESSING*/
*                 ELSE              /* SPACE NOT AVAILABLE           */
*/********************************************************************/
*/*                                                                  */
*/* IF SPACE FOR RECORD NOT AVAILABLE,REQUIRED SPACE IS RECALCULATED */
*/* IF POSSIBLE. POSSIBLE RECALCULATIONS ARE FOR A NON BUFFERED OPT  */
*/* REQUEST OR A TRUNCATED LOGREC REQUEST                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0311
*                   DO;                                            0311
         B     @RC00299                                            0311
@RF00299 DS    0H                                                  0312
*                     IF BUFREQ=NO&NBUFREQ=NO THEN/* IF BUFFERING WAS
*                                      OPTIONAL                      */
         TM    BUFREQ(R13),B'00110000'                             0312
         BNZ   @RF00312                                            0312
*                       DO;         /* PROCESS BUFFERING TO        0313
*                                      NO-BUF'ING                    */
*                         NBUFREQ=YES;/* INDICATE NO BUFFERING       */
         OI    NBUFREQ(R13),B'00010000'                            0314
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE CALCSPCE SEGMENT IS TO DETERMINE THE SPACE    */
*/* REQUIREMENT IN THE RCB FOR A PARTICULAR REQUEST. THE AMOUNT      */
*/* IS BASED ON THE REQUIRED BUILD FUNCTIONS AS INDICATED BY THE     */
*/* FLAG SETTINGS AND DATALENGTH IN REGISTER ZERO                    */
*/*                                                                  */
*/********************************************************************/
*                                                                  0315
*                         R6=CONTLEN;/* ALL BUFFER ENTRIES INCLUDE 0315
*                                      THE RECORD CONTROL INFORMATION*/
         LA    R6,16                                               0315
*/* STATEMENT AT FLAGGED COMMENT BELOW MOVED FROM HERE. STATEMENT  0316
*   HERE CAUSED ERRORID TO BE CONSIDERED PART OF RECORD WHICH MUST BE
*   CONTIGUOUS, BUT ERRORID NEED NOT BE CONTIGUOUS WITH HEADER     0316
*                                                            @ZA16445*/
*                                                                  0316
*                         IF NBUFREQ=YES THEN/* IF NON BUFFERED    0316
*                                      REQUEST                       */
         TM    NBUFREQ(R13),B'00010000'                            0316
         BNO   @RF00316                                            0316
*                           DO;                                    0317
*                             R6=R6+(LENGTH(NBFRDATA));/* ADD FOUR 0318
*                                      BYTES FOR DATA ADDRESS        */
         AL    R6,@CF00039                                         0318
*                             R7=R6;/* HEADER AND ENTRY ARE EQUAL    */
         LR    R7,R6                                               0319
*                           END;    /* END NON BUFFERED CALCULATION  */
*                         ELSE      /* IF BUFFERING REQUESTED        */
*                           DO;     /* ADDITIONAL SPACE REQUIRED AS
*                                      FOLLOWS                       */
         B     @RC00316                                            0321
@RF00316 DS    0H                                                  0322
*                             IF HDRREQ=YES THEN/* IF AR149 HEADER 0322
*                                      REQUESTED                     */
         TM    HDRREQ(R13),B'00001000'                             0322
         BNO   @RF00322                                            0322
*                               DO; /* ADD LENGTH OF HEADER          */
*                                 R6=R6+(LENGTH(HDR));             0324
         AL    R6,@CF00111                                         0324
*                                 IF JOBNMREQ=YES THEN/* IF JOBNAME
*                                      REQUESTED                     */
         TM    JOBNMREQ(R13),B'00000100'                           0325
         BNO   @RF00325                                            0325
*                                   R6=R6+(LENGTH(RCBBJOBN));/* ADD 8
*                                      BYTES REQUIRED FOR JOBNAME    */
         AL    R6,@CF00032                                         0326
*                               END;/* END HEADER PROCESSING         */
@RF00325 DS    0H                                                  0328
*                             R7=R6;/* HEADER LENGTH BEFORE ADDING 0328
*                                      DATA                          */
@RF00322 LR    R7,R6                                               0328
*                             R6=R6+DATLEN;/* ADD LENGTH OF DATA TO
*                                      BUFFER                        */
         LH    @14,DATLEN(,R13)                                    0329
         N     @14,@CF02089                                        0329
         ALR   R6,@14                                              0329
*                           END;    /* END BUFFERED CALCULATION      */
*/* FOLLOWING STATEMENT MOVED FROM FLAGGED COMMENT ABOVE     @ZA16445*/
*                                                                  0331
*                         IF ERRIDREQ=YES THEN/* IF AN ERROR ID WAS
*                                      REQUESTED             @G17EP5W*/
@RC00316 TM    ERRIDREQ(R13),B'00000001'                           0331
         BNO   @RF00331                                            0331
*                           R6=R6+  /* THEN ADD ITS LENGTH IN WITH 0332
*                                      THE                           */
*                               LENGTH(RCBBERID);/* SPACE          0332
*                                      REQUIREMENTS          @G17EP5W*/
         AL    R6,@CF00105                                         0332
*                         R15=RCFOUR;/* NOTIFY REQUESTOR BUFFERING 0333
*                                      NOT DONE                      */
@RF00331 LA    R15,4                                               0333
*                         OPTNOBUF=YES;/* REMEMBER WE DIDN'T BUFFER  */
         OI    OPTNOBUF(R13),B'01000000'                           0334
*                       END;        /* END PROC BUF TO NO BUF        */
*                     ELSE          /* IF BUFFERING NOT OPTIONAL     */
*                       DO;         /* CHECK FOR                     */
         B     @RC00312                                            0336
@RF00312 DS    0H                                                  0337
*                         IF LOGRREQ=YES&RCBFLNG>=(R7+LENGTH(RCBBERID)+
*                             4)    /* IF /* LOGREC REQUEST AND AT 0337
*                                      LEAST /* ROOM FOR HEADER AND
*                                      ERRORID IF /* PRESENT AND 4 0337
*                                      BYTES OF DATA /*      @G17EP5W
*                                                            @ZA16445
*                                                            @ZA10810*/
*                             &R15<=RCFOUR THEN/* TRUNCATION STILL 0337
*                                      UNTRIED                       */
         TM    LOGRREQ(R13),B'01000000'                            0337
         BNO   @RF00337                                            0337
         LA    @14,14                                              0337
         ALR   @14,R7                                              0337
         LH    @11,RCBFLNG(,R12)                                   0337
         N     @11,@CF02089                                        0337
         CR    @14,@11                                             0337
         BH    @RF00337                                            0337
         C     R15,@CF00039                                        0337
         BH    @RF00337                                            0337
*                           DO;     /* CALCULATE TRUNCATED LENGTH    */
*                             R6=R10;/* THE REMAINING FREE SPACE IS
*                                      USED                          */
         LR    R6,R10                                              0339
*                             DATLEN=R6-R7;/* THE DATA RECORDED WILL
*                                      BE AVAIL SPACE MINUS REQUIRED
*                                      HEADER                        */
         LR    @14,R6                                              0340
         SLR   @14,R7                                              0340
         STH   @14,DATLEN(,R13)                                    0340
*                             IF ERRIDREQ=YES THEN/* IF THE ERRID IS
*                                      NEEDED AT THE END OF THE    0341
*                                      TRUNCATED RECORD, THE DATA  0341
*                                      MOVED MUST BE ERRID LENGTH  0341
*                                      LESS                  @ZA19981*/
         TM    ERRIDREQ(R13),B'00000001'                           0341
         BNO   @RF00341                                            0341
*                               DATLEN=DATLEN-LENGTH(RCBBERID);/*  0342
*                                      LEAVE ENOUGH ROOM FOR THE   0342
*                                      ERRID AT RECORD END   @ZA19981*/
         SL    @14,@CF00105                                        0342
         STH   @14,DATLEN(,R13)                                    0342
*                             ELSE                                 0343
*                               ;   /* NO ERRID - DATA CAN FILL UP 0343
*                                      SPACE IN BUFFER       @ZA19981*/
@RF00341 DS    0H                                                  0344
*                             R15=RCEIGHT;/* NOTIFY REQUESTOR REC  0344
*                                      TRUNCATED                     */
         LA    R15,8                                               0344
*                             TRUNCFLG=YES;/* REMEMBER WE TRUNCATED  */
         OI    TRUNCFLG(R13),B'10000000'                           0345
*                           END;    /* END TRUNCATE PROCESSING       */
*                         ELSE      /* IF TRUNCATION NOT AVAILABLE   */
*                           DO;     /* RECORD LOST                   */
         B     @RC00337                                            0347
@RF00337 DS    0H                                                  0348
*                             R15=RCTWELVE;/* NOTIFY REQUESTOR       */
         LA    R15,12                                              0348
*                             OPTNOBUF=NO;/* NON BUFFERED REC WOULD
*                                      NOT FIT                       */
*                             TRUNCFLG=NO;/* TRUNCATION COULD NOT BE
*                                      DONE                          */
         NI    OPTNOBUF(R13),B'00111111'                           0350
*                             R9=NOLOOP;/* CANT DO IT GET OUT        */
         SLR   R9,R9                                               0351
*                           END;    /* END CANT TRUNCATE             */
*                       END;        /* END BUF NOT OPTIONAL          */
@RC00337 DS    0H                                                  0354
*                   END;            /* END RECALCSP                  */
@RC00312 DS    0H                                                  0355
*               END;                                               0355
@RC00299 DS    0H                                                  0355
@DE00290 C     R9,@CF00045                                         0355
         BE    @DL00290                                            0355
*               RESPECIFY           /* RELEASE REGISTERS FROM        */
*                (R3,               /* SAVING FREE LEN & DUMMY DISP  */
*                 R4,               /* UPDATING FREE POINTER,        */
*                 R5,               /* FREE LEN & DUMMY DISPLACEMENT */
*                 R10,              /* CALCULATING NEW FREE LENGTH   */
*                 R9) UNRESTRICTED; /* SWITCH FOR LOOP CONTROL       */
*               IF TRUNCFLG=YES THEN/* NOTIFY USER WE TRUNCATED THE  */
         TM    TRUNCFLG(R13),B'10000000'                           0357
         BNO   @RF00357                                            0357
*                 R15=RCEIGHT;      /* RECORD                        */
         LA    R15,8                                               0358
*               IF OPTNOBUF=YES THEN/* NOTIFY USER WE DIDNT BUFFER 0359
*                                      HIS                           */
@RF00357 TM    OPTNOBUF(R13),B'01000000'                           0359
         BNO   @RF00359                                            0359
*                 R15=RCFOUR;       /* OPTIONAL REQUEST              */
         LA    R15,4                                               0360
*/* NOTE: SAVFREE,HDRLEN AND SPACE WERE RESTRICTED AND NOT UNRESTRICT*/
*/*       IN THIS SEGMENT AS THEIR CURRENT VALUES ARE INPUT TO BUILD */
*/*       RECORD SEGMENT                                             */
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE BUILDREC SEGMENT IS TO DETERMINE IF SPACE WAS */
*/* ALOCATED, IF SO THE RECORD IS BUILT IN THE ALLOCATED SPACE.      */
*/* THE RECORD IS BUILT TO CALLERS REQUIREMENT AS DETERMINED BY INPUT*/
*/* PARAMETER SPECIFICATIONS                                         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0361
*               IF R15^=RCTWELVE THEN/* IF SPACE WAS ALLOCATED FOR 0361
*                                      THIS                          */
@RF00359 C     R15,@CF00135                                        0361
         BE    @RF00361                                            0361
*                 DO;               /* REQUEST                       */
*                   RESPECIFY       /* BASE THE BUFFER ENTRY MAPPING
*                                      ON                            */
*                     RCBBUF BASED(R2);/* THE POINTER TO ALLOTED   0363
*                                      SPACE                         */
*                   DBLWORD=DBLWORD&&DBLWORD;/* CLEAR RECORD CONTROL
*                                      FLAG BITS             @ZA19199*/
         XC    DBLWORD(8,R2),DBLWORD(R2)                           0364
*                   RFY                                            0365
*                     R5 RSTD;      /* PTR TO THE NEXT DBLWORD IN THE
*                                      RCB WHICH IS THE RCBBECB    0365
*                                                            @ZA19199*/
*                   RFY                                            0366
*                     DBLWORD BASED(R5);/* GET THE NEXT DOUBLE WORD
*                                      TO INITIALIZE         @ZA19199*/
*                   R5=ADDR(RCBBECB);/* POINT TO NEXT DBLWORD      0367
*                                                            @ZA19199*/
         LA    R5,RCBBECB(,R2)                                     0367
*                   IF R5>=RCBBUFE THEN/* DOES THE HEADER WRAP     0368
*                                                            @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0368
         BL    @RF00368                                            0368
*                     DO;           /* IT DOES WRAP          @ZA19199*/
*                       R5=R5-RCBTLNG;/* UPDATE PTR IN BUFFER      0370
*                                                            @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0370
         N     @14,@CF02089                                        0370
         SLR   R5,@14                                              0370
*                       RCBBWRAP=YES;/* INDICATE A WRAPPED RECORD  0371
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0371
*                     END;          /* END HEADER DOES WRAP  @ZA19199*/
*                   ELSE                                           0373
*                     ;             /* HEADER DOES NOT WRAP  @ZA19199*/
@RF00368 DS    0H                                                  0374
*                   DBLWORD=DBLWORD&&DBLWORD;/* CLEAR RECORD CONTROL
*                                      ECB AND RESV AREAS    @ZA19199*/
         XC    DBLWORD(8,R5),DBLWORD(R5)                           0374
*                   RFY                                            0375
*                     R5 UNRSTD;    /* FREE NEXT DBLWORD PTR @ZA19199*/
*                   RFY                                            0376
*                     DBLWORD BASED(ADDR(RCBBUF));/* REBASE BACK   0376
*                                                            @ZA19199*/
*                   RESPECIFY       /* RESTRICT REGISTER FOR POINTER
*                                      TO                            */
*                    (R10,          /* DATA - IF IN PARMLIST OR NOT  */
*                     R9,           /* PARMLIST                      */
*                     R3,           /* ERRORID PARAMETER POINTER   0377
*                                                            @G17EP5W*/
*                     R4) RESTRICTED;/* NEXT SPACE FOR BUILDING      */
*                   IF LOGRREQ=YES THEN/* IF A LOGREC REQUEST      0378
*                                      INDICATE                      */
         TM    LOGRREQ(R13),B'01000000'                            0378
         BNO   @RF00378                                            0378
*                     RCBBLREC=YES; /* IN BUFFER ENTRY               */
         OI    RCBBLREC(R2),B'01000000'                            0379
*                   IF WTOREQ=YES THEN/* IF A WTO REQUEST INDICATE   */
@RF00378 TM    WTOREQ(R13),B'00100000'                             0380
         BNO   @RF00380                                            0380
*                     RCBBWTO=YES;  /* IN BUFFER ENTRY               */
         OI    RCBBWTO(R2),B'00100000'                             0381
*                   IF NBUFREQ=YES THEN/* IF IT IS A NON BUFFERED  0382
*                                      RECORD                        */
@RF00380 TM    NBUFREQ(R13),B'00010000'                            0382
         BNO   @RF00382                                            0382
*                     RCBBLEN=DATLEN;/* RECORD LENGTH IS THE LENGTH
*                                      FROM THE REQUESTOR            */
         LH    @14,DATLEN(,R13)                                    0383
         N     @14,@CF02089                                        0383
         STH   @14,RCBBLEN(,R2)                                    0383
*                   ELSE            /* BUFFERED RECORD...            */
*                     RCBBLEN=R6-CONTLEN;/* RECORD LENGTH IS SPACE 0384
*                                      ALLOTED MINUS RECORD CONTROL
*                                      INFO                          */
         B     @RC00382                                            0384
@RF00382 LR    @14,R6                                              0384
         SL    @14,@CF00062                                        0384
         STH   @14,RCBBLEN(,R2)                                    0384
*                   R4=R2+CONTLEN;  /* POINT TO SPACE FOR RECORD     */
@RC00382 LA    R4,16                                               0385
         ALR   R4,R2                                               0385
*                   IF R4>=RCBBUFE THEN/* DOES HEADER WRAP THE BUFFER
*                                                            @ZA19199*/
         C     R4,RCBBUFE(,R12)                                    0386
         BL    @RF00386                                            0386
*                     DO;           /* YES - IT DOES         @ZA19199*/
*                       R4=R4-RCBTLNG;/* RESET THE POINTER   @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0388
         N     @14,@CF02089                                        0388
         SLR   R4,@14                                              0388
*                       RCBBWRAP=YES;/* TURN ON THE WRAP INDICATOR 0389
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0389
*                     END;          /* END HEADER WRAPS THE BUFFER 0390
*                                                            @ZA19199*/
*                   ELSE                                           0391
*                     ;             /* HEADER DOES NOT WRAP  @ZA19199*/
@RF00386 DS    0H                                                  0392
*                   IF DATAIND=YES THEN/* IF CALLER SPECIFIED DATAADR*/
         TM    DATAIND(R13),B'10000000'                            0392
         BNO   @RF00392                                            0392
*                     R10=-SAVEONE; /* SAVE POINTER TO DATA          */
         L     R10,SAVEONE(,R13)                                   0393
         LCR   R10,R10                                             0393
*                   ELSE            /* IF NOT DATA ADDRESS PROCESS 0394
*                                      THE                           */
*                     DO;           /* PARAMETER LIST                */
*                                                                  0394
         B     @RC00392                                            0394
@RF00392 DS    0H                                                  0395
*                       /*********************************************/
*                       /*                                           */
*                       /* IN EACH BUILD SEGMENT THE POINTERS ARE    */
*                       /* UPDATED AS FOLLOWS THE PARAMETER LIST     */
*                       /* POINTER IS UPDATED TO POINT TO THE NEXT   */
*                       /* ENTRY IN THE LIST A POINTER TO THE RECORD */
*                       /* PORTION OF THE BUFFER ENTRY IS UPDATED TO */
*                       /* POINT TO THE AVAILABLE SPACE              */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0395
*                       R9=DATAAD;  /* POINT TO THE PARMLIST         */
         L     R9,DATAAD(,R13)                                     0395
*                       RFY                                        0396
*                         HDR BASED(R4);/* REBASE HDR IN CASE OF WRAP
*                                                            @ZA19199*/
*                       IF HDRREQ=YES THEN/* IF BUILD OF AR149     0397
*                                      REQUESTED                     */
         TM    HDRREQ(R13),B'00001000'                             0397
         BNO   @RF00397                                            0397
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE BLDAR149 SEGMENT IS TO BUILD THE AR149 HEADER */
*/* INTO THE BUFFER ALLOCATED FOR THIS REQUEST. INFORMATION FOR THE  */
*/* HEADER IS IN PARMLIST                                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0398
*                         DO;                                      0398
*                           HDRTYP=PARMTYPE;/* PUT RECORD TYPE FROM
*                                      PARMLIST                      */
         MVC   HDRTYP(1,R4),PARMTYPE(R9)                           0399
*/* IF GETMAINED WORKAREA IS NOT AVAILABLE, THE RELEASE NUMBER IS NOT
*   PUT INTO RECORD                                          @ZM40310*/
*                                                                  0400
*                           IF GMAD^=0 THEN                        0400
         L     @14,GMAD(,R13)                                      0400
         LTR   @14,@14                                             0400
         BZ    @RF00400                                            0400
*                             DO;   /* IF WORKAREA AVAILABLE @ZM40310*/
*                               PKDWORD=PKDWORD&&PKDWORD;/* CLEAR OUT
*                                      WORKAREA              @Z40CPXH*/
         XC    PKDWORD(8,@14),PKDWORD(@14)                         0402
*                               PACK(PKDWORD(7:8),CVTNUMB);/* PICK UP
*                                      REL NO FROM CVT       @Z40CPXH*/
         L     @11,CVTPTR                                          0403
         AL    @11,@CF02093                                        0403
         PACK  PKDWORD+6(2,@14),CVTNUMB-252(2,@11)                 0403
*                               RFY                                0404
*                                (R11,                             0404
*                                 R14) RSTD;/*               @Z40CPXH*/
*                               R14=ADDR(PKDWORD);/* SET UP FOR CVB
*                                                            @Z40CPXH*/
         L     @05,GMAD(,R13)                                      0405
         LA    R14,PKDWORD(,@05)                                   0405
*                               GEN;                               0406
*                                 /* CONVERT RELEASE NUMBER  @Z40CPXH*/
   CVB   R11,0(R14)                                           Z40CPXH
*                               HDROPRN=R11;/* SAVE RELEASE IN HDR 0407
*                                                            @Z40CPXH*/
         STC   R11,HDROPRN(,R4)                                    0407
*                               RFY                                0408
*                                (R11,                             0408
*                                 R14) UNRSTD;/*             @Z40CPXH*/
*                               HDROPSYS=SYSVS2;/* SYSTEM IS VS2   0409
*                                                            @Z40CPXH*/
         NI    HDROPSYS(R4),B'10011111'                            0409
         OI    HDROPSYS(R4),B'10000000'                            0409
*                             END;  /*                       @ZM40310*/
*                           HDRIS='40'X;/* INDICATE STORE TOD CLOCK
*                                      USED                          */
@RF00400 MVI   HDRIS(R4),X'40'                                     0411
*                           HDRDS=PARMSWTS;/* DEPENDENT SWITCHES FROM
*                                      PARMLIST                      */
         MVC   HDRDS(3,R4),PARMSWTS(R9)                            0412
*                           HDRCNT=ZERO;/* NO MULTIPLE PHYSICAL    0413
*                                      RECORDS                       */
         L     @14,ZERO                                            0413
         STC   @14,HDRCNT(,R4)                                     0413
*                           RESPECIFY/* RESTRICT REGISTER FOR        */
*                            (R5) RESTRICTED;/* ARE TO STORE (CLOCK &
*                                      CPUID)                        */
*                           R5=ADDR(HDRTM);/* POINT TO AREA FOR TIME
*                                      IN AR149                      */
         LA    R5,HDRTM(,R4)                                       0415
*                           IF R5>=RCBBUFE THEN/* IS HDR TIME WRAPPED
*                                      IN THE BUFFER         @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0416
         BL    @RF00416                                            0416
*                             DO;   /* YES IT WRAPS - RESET PTR    0417
*                                                            @ZA19199*/
*                               R5=R5-RCBTLNG;/* PROPER ADDR AFTER 0418
*                                      WRAP                  @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0418
         N     @14,@CF02089                                        0418
         SLR   R5,@14                                              0418
*                               RCBBWRAP=YES;/* INDICATE HEADER WRAPS
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0419
*                             END;  /* END HEADER WRAPS BUFFER     0420
*                                                            @ZA19199*/
*                           ELSE                                   0421
*                             ;     /* HEADER DOES NOT WRAP  @ZA19199*/
@RF00416 DS    0H                                                  0422
*                           GEN(STCK ZIP(R5));/* STORE TOD CLOCK   0422
*                                      VALUE IN AR149                */
         STCK ZIP(R5)
*                           LCLTM=LCLTM+CVTTZ;/* ADJ GMT TO LOCAL  0423
*                                                            @YM06396*/
         ICM   @14,15,LCLTM(R5)                                    0423
         L     @11,CVTPTR                                          0423
         AL    @14,CVTTZ(,@11)                                     0423
         STCM  @14,15,LCLTM(R5)                                    0423
*                           R5=ADDR(HDRCPID);/* POINT TO AREA FOR  0424
*                                      CPUID IN AR149                */
         LA    R5,HDRCPID(,R4)                                     0424
*                           IF R5>=RCBBUFE THEN/* IS HDR CPUID     0425
*                                      WRAPPED IN THE BUFFER @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0425
         BL    @RF00425                                            0425
*                             DO;   /* YES IT WRAPS - RESET PTR    0426
*                                                            @ZA19199*/
*                               R5=R5-RCBTLNG;/* PROPER ADDR AFTER 0427
*                                      WRAP                  @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0427
         N     @14,@CF02089                                        0427
         SLR   R5,@14                                              0427
*                               RCBBWRAP=YES;/* INDICATE HEADER WRAPS
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0428
*                             END;  /* END HEADER WRAPS BUFFER     0429
*                                                            @ZA19199*/
*                           ELSE                                   0430
*                             ;     /* HEADER DOES NOT WRAP  @ZA19199*/
@RF00425 DS    0H                                                  0431
*                           GEN(STIDP ZIP(R5));/* STORE CPUID IN   0431
*                                      AR149                         */
         STIDP ZIP(R5)
*                           RESPECIFY/* RELEASE REGISTER FROM        */
*                            (R5) UNRESTRICTED;/* AREA TO STORE    0432
*                                      (CLOCK & CPUID)               */
*                           R9=R9+  /* POINT TO NEXT ENTRY IN      0433
*                                      PARMLIST                      */
*                               (LENGTH(PARMHDR));                 0433
         AL    R9,@CF00039                                         0433
*                           R4=R4+(LENGTH(HDR));/* POINT TO FREE AREA
*                                      IN ALLOCATED BUFFER SPACE     */
         AL    R4,@CF00111                                         0434
*                           IF R4>=RCBBUFE THEN/* CHECK IF THE NEXT
*                                      ADDR CAUSES THE BUFFER TO WRAP
*                                                            @ZA19199*/
         C     R4,RCBBUFE(,R12)                                    0435
         BL    @RF00435                                            0435
*                             DO;   /* YES - RESET POINTER   @ZA19199*/
*                               R4=R4-RCBTLNG;/* READJUST THE ADDR 0437
*                                                            @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0437
         N     @14,@CF02089                                        0437
         SLR   R4,@14                                              0437
*                               RCBBWRAP=YES;/* INDICATE HEADER WRAPS
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0438
*                             END;  /* END NEXT ADDRESS CAUSES BUFFER
*                                      TO WRAP               @ZA19199*/
*                           ELSE                                   0440
*                             ;     /* NEXT ADDRESS DOES NOT CAUSE A
*                                      BUFFER WRAP           @ZA19199*/
@RF00435 DS    0H                                                  0441
*                         END;                                     0441
*                       RFY                                        0442
*                         HDR BASED(ADDR(AR149HDR));/* REBASE BACK 0442
*                                                            @ZA19199*/
@RF00397 DS    0H                                                  0443
*                       IF JOBNMREQ=YES THEN/* IF JOBNAME REQUESTED  */
         TM    JOBNMREQ(R13),B'00000100'                           0443
         BNO   @RF00443                                            0443
*                         DO;                                      0444
*                           RCBBJOBN=PARMJOBN;/* MOVE JOBNAME TO   0445
*                                      SPACE FOLLOWING HEADER        */
         MVC   RCBBJOBN(8,R4),PARMJOBN(R9)                         0445
*                           R4=R4+  /* POINT TO NEXT FREE SPACE      */
*                               (LENGTH(RCBBJOBN));                0446
         AL    R4,@CF00032                                         0446
*                           IF R4>=RCBBUFE THEN/* CHECK IF THE NEXT
*                                      ADDR CAUSES THE BUFFER TO WRAP
*                                                            @ZA19199*/
         C     R4,RCBBUFE(,R12)                                    0447
         BL    @RF00447                                            0447
*                             DO;   /* YES - RESET POINTER   @ZA19199*/
*                               R4=R4-RCBTLNG;/* READJUST THE ADDR 0449
*                                                            @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0449
         N     @14,@CF02089                                        0449
         SLR   R4,@14                                              0449
*                               RCBBWRAP=YES;/* INDICATE HEADER WRAPS
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0450
*                             END;  /* END NEXT ADDRESS CAUSES BUFFER
*                                      TO WRAP               @ZA19199*/
*                           ELSE                                   0452
*                             ;     /* NEXT ADDRESS DOES NOT CAUSE A
*                                      BUFFER WRAP           @ZA19199*/
@RF00447 DS    0H                                                  0453
*                           R9=R9+  /* POINT TO NEXT PARM LIST ENTRY */
*                               (LENGTH(PARMJOBN));                0453
         AL    R9,@CF00032                                         0453
*                         END;                                     0454
*                       IF ERRIDREQ=YES THEN/* IF ERROR ID IN PARM 0455
*                                      LIST                  @G17EP5W*/
@RF00443 TM    ERRIDREQ(R13),B'00000001'                           0455
         BNO   @RF00455                                            0455
*                         DO;       /* THEN PROCESS IT       @G17EP5W*/
*                           R3=R9;  /* SAVE ERRORID ADDRESS  @G17EP5W*/
         LR    R3,R9                                               0457
*                           R9=R9+  /* GET ADDR OF NEXT PARAM      0458
*                                                            @G17EP5W*/
*                               LENGTH(PARMERID);                  0458
         AL    R9,@CF00135                                         0458
*                         END;                                     0459
*                       IF POSTREQ=YES THEN/* IF POSTING REQUESTED   */
@RF00455 TM    POSTREQ(R13),B'00000001'                            0460
         BNO   @RF00460                                            0460
*                         DO;       /* INDICATE                      */
*                           RCBBPOST=YES;/* IN BUFFER ENTRY          */
         OI    RCBBPOST(R2),B'00000100'                            0462
*                           RFY                                    0463
*                             R5 RSTD;/* POINTER TO THE ECB TO BE  0463
*                                      POSTED                @ZA19199*/
*                           R5=ADDR(RCBBECB);/* GET ADDR OF THE ECB
*                                      FIELD                 @ZA19199*/
         LA    R5,RCBBECB(,R2)                                     0464
*                           IF R5>=RCBBUFE THEN/* DOES THIS ADDR WRAP
*                                                            @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0465
         BL    @RF00465                                            0465
*                             DO;   /* YES - RESET ADDR      @ZA19199*/
*                               R5=R5-RCBTLNG;/* RE-ADJUST THE     0467
*                                      POINTER TO THE ECB    @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0467
         N     @14,@CF02089                                        0467
         SLR   R5,@14                                              0467
*                               RCBBWRAP=YES;/* INDICATE RECORD WRAPS
*                                                            @ZA19199*/
         OI    RCBBWRAP(R2),B'10000000'                            0468
*                             END;  /* END ADDR WRAPS        @ZA19199*/
*                           ELSE                                   0470
*                             ;     /* ADDR DOES NOT WRAP    @ZA19199*/
@RF00465 DS    0H                                                  0471
*                           BECB=PARMECB;/* MOVE ECB ADDR INTO BUFFER
*                                                            @ZA19199*/
         MVC   BECB(4,R5),PARMECB(R9)                              0471
*                           RFY                                    0472
*                             R5 UNRSTD;/* FREE ECB POINTER  @ZA19199*/
*                           R9=R9+  /* POINT TO NEXT PARMLIST ENT    */
*                               (LENGTH(PARMECB));                 0473
         LA    @14,4                                               0473
         ALR   R9,@14                                              0473
*                           RCBBASID=PARMASID;/* MOVE ASID TO BUFFER */
         MVC   RCBBASID(2,R2),PARMASID+2(R9)                       0474
*                           R9=R9+  /* POINT TO NEXT PARMLIST ENTRY  */
*                               (LENGTH(PARMASID));                0475
         ALR   R9,@14                                              0475
*                         END;                                     0476
*                       IF TIMEREQ=YES THEN/* IF TIME WAS REQUESTED  */
@RF00460 TM    TIMEREQ(R13),B'00000010'                            0477
         BNO   @RF00477                                            0477
*                         DO;                                      0478
*                           IF HDRREQ=YES THEN                     0479
         TM    HDRREQ(R13),B'00001000'                             0479
         BNO   @RF00479                                            0479
*                             DO;   /* SET UP PTR TO HANDLE WRAPPED
*                                      HEADERS               @ZA19199*/
*                               RFY                                0481
*                                 R5 RSTD;/* POINTER TO THE TIME   0481
*                                      FIELD IN HDR          @ZA19199*/
*                               R5=ADDR(HDRTM);/* GET ADDR OF THE  0482
*                                      TIME FIELD            @ZA19199*/
         LA    R5,HDRTM+16(,R2)                                    0482
*                               IF R5>=RCBBUFE THEN/* DOES THIS ADDR
*                                      WRAP                  @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0483
         BL    @RF00483                                            0483
*                                 R5=R5-RCBTLNG;/* RE-ADJUST THE   0484
*                                      POINTER TO THE TIME FIELD   0484
*                                                            @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0484
         N     @14,@CF02089                                        0484
         SLR   R5,@14                                              0484
*                               ELSE                               0485
*                                 ; /* ADDR DOES NOT WRAP    @ZA19199*/
@RF00483 DS    0H                                                  0486
*                               TIMESLOT=TIMEHDR;/* RETURN TIME STAMP
*                                      FROM HDR              @ZA19199*/
         L     @14,PARMTIME(,R9)                                   0486
         MVC   TIMESLOT(8,@14),TIMEHDR(R5)                         0486
*                               RFY                                0487
*                                 R5 UNRSTD;/* FREE TIME FIELD PTR 0487
*                                                            @ZA19199*/
*                             END;  /* END HDR WAS REQUIRED  @ZA19199*/
*                           ELSE                                   0489
*                             TIMESLOT=EVAL(R9+LENGTH(PARMTIME))-> 0489
*                                 PARMDATA->HDRTM;/* OR FROM       0489
*                                      REQUESTORS BUFFER             */
         B     @RC00479                                            0489
@RF00479 L     @14,PARMTIME(,R9)                                   0489
         LA    @11,4                                               0489
         ALR   @11,R9                                              0489
         L     @11,PARMDATA(,@11)                                  0489
         MVC   TIMESLOT(8,@14),HDRTM(@11)                          0489
*                           R9=R9+  /* POINT TO NEXT ENTRY IN        */
*                               (LENGTH(PARMTIME));/* PARMLIST       */
@RC00479 AL    R9,@CF00039                                         0490
*                         END;                                     0491
*                       R10=PARMDATA;/* GET POINTER TO DATA FROM   0492
*                                      PARMLIST                      */
@RF00477 L     R10,PARMDATA(,R9)                                   0492
*                     END;          /* END PARMLIST PROCESSING       */
*                   IF R15=RCEIGHT THEN/* IF A TRUNCATED RECORD      */
@RC00392 C     R15,@CF00032                                        0494
         BNE   @RF00494                                            0494
*                     DO;           /* SET UP PTR TO HANDLE WRAPPED
*                                      HEADERS               @ZA19199*/
*                       RFY                                        0496
*                         R5 RSTD;  /* PTR TO THE HDR SECTION OF   0496
*                                      RECORD                @ZA19199*/
*                       R5=ADDR(HDR);/* SET THE POINTER      @ZA19199*/
         LA    R5,16                                               0497
         ALR   R5,R2                                               0497
*                       RFY                                        0498
*                         HDR BASED(R5);/* BASE CONTROL BLOCK ON   0498
*                                      POINTER               @ZA19199*/
*                       IF R5>=RCBBUFE THEN/* DOES THE HEADER WRAP 0499
*                                                            @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0499
         BL    @RF00499                                            0499
*                         R5=R5-RCBTLNG;/* YES - RESET ADDRESS     0500
*                                                            @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0500
         N     @14,@CF02089                                        0500
         SLR   R5,@14                                              0500
*                       ELSE                                       0501
*                         ;         /* THE HEADER DID NOT WRAP     0501
*                                                            @ZA19199*/
@RF00499 DS    0H                                                  0502
*                       HDRTRUNC=YES;/* INDICATE TRUNCATED RECORD IN
*                                      AR149                 @ZA19199*/
         OI    HDRTRUNC(R5),B'00100000'                            0502
*                       RFY                                        0503
*                         HDR BASED(ADDR(AR149HDR));/* REBASE BACK 0503
*                                                            @ZA19199*/
*                       RFY                                        0504
*                         R5 UNRSTD;/* FREE HDR POINTER      @ZA19199*/
*                     END;          /* END A TRUNCATED RECORD      0505
*                                                            @ZA19199*/
*                   IF NBUFREQ=YES THEN/* IF IT IS A UNBUFFERED    0506
*                                      REQUEST                       */
@RF00494 TM    NBUFREQ(R13),B'00010000'                            0506
         BNO   @RF00506                                            0506
*                     DO;           /* OR FORCED BY FIND SPACE       */
*                       RCBBNBFR=YES;/* INDICATE IT IN BUFFER ENTRY  */
         OI    RCBBNBFR(R2),B'00001000'                            0508
*                       RFY                                        0509
*                         NBFREC BASED(R4);/* POINTER IN BUFFER WHERE
*                                      DATA SHOULD BE PLACED @ZA19199*/
*                       NBFRDATA=R10;/* PUT THE ADDRESS IN THE BUFFER*/
         ST    R10,NBFRDATA(,R4)                                   0510
*                       IF ERRIDREQ=YES THEN/* IF ERROR ID REQUESTED
*                                                            @G17EP5W*/
         TM    ERRIDREQ(R13),B'00000001'                           0511
         BNO   @RF00511                                            0511
*                         DO;                                      0512
*                           RCBBERFG=YES;/* SET ERROR ID FLAG IN RCB
*                                                            @G17EP5W*/
         OI    RCBBERFG(R2),B'00000010'                            0513
*                           RFY                                    0514
*                            (R5,                                  0514
*                             R11) RSTD;                           0514
*                           R4=ADDR(NBFRERID);/* ADR OF ERRORID IN 0515
*                                      RCB                   @ZA16445*/
         LA    @14,NBFRERID(,R4)                                   0515
         LR    R4,@14                                              0515
*                           RFY                                    0516
*                             NBFREC BASED(ADDR(RCBBDATA));/* REBASE
*                                      BACK                  @ZA19199*/
*                           R10=ADDR(PARMERID);/* ADR OF ERRORID IN
*                                      PLIST                 @ZA16445*/
         LR    R10,R3                                              0517
*                           R11=LENGTH(RCBBERID);/* LENGTH OF ERRORID
*                                                            @ZA16445*/
         LA    R11,10                                              0518
*                           IF RCBBUFE-R4<R11 THEN/* WILL RECORD   0519
*                                      WRAP?                 @ZA16445*/
         L     @14,RCBBUFE(,R12)                                   0519
         SLR   @14,R4                                              0519
         CR    @14,R11                                             0519
         BNL   @RF00519                                            0519
*                             DO;   /*                       @ZA16445*/
*                               RCBBWRAP=YES;/* INDICATE WRAPPED   0521
*                                      RECORD                @ZA16445*/
         OI    RCBBWRAP(R2),B'10000000'                            0521
*                               R5=RCBBUFE-R4;/* FILL TO END OF    0522
*                                      BUFFER                @ZA16445*/
         LR    R5,@14                                              0522
*                             END;  /*                       @ZA16445*/
*                           ELSE    /* ERRORID WILL NOT WRAP @ZA16445*/
*                             R5=R11;/* MOVE ENTIRE ERRORID  @ZA16445*/
         B     @RC00519                                            0524
@RF00519 LR    R5,R11                                              0524
*                           GEN(MVCL R4,R10);/* MOVE THE DATA      0525
*                                                            @ZA16445*/
@RC00519 DS    0H                                                  0525
         MVCL R4,R10
*                           IF R11^=ZERO THEN/* MORE DATA TO MOVE? 0526
*                                                            @ZA16445*/
         C     R11,ZERO                                            0526
         BE    @RF00526                                            0526
*                             DO;   /*                       @ZA16445*/
*                               R4=RCBBUFB;/* MOVE REST OF ERRORID TO
*                                      BEGINNING OF BUFFER   @ZA16445*/
         L     R4,RCBBUFB(,R12)                                    0528
*                               R5=R11;/* REST OF ERRORID    @ZA16445*/
         LR    R5,R11                                              0529
*                               GEN(MVCL R4,R10);/* MOVE THE DATA  0530
*                                                            @ZA16445*/
         MVCL R4,R10
*                             END;  /*                       @ZA16445*/
*                           RFY                                    0532
*                            (R5,                                  0532
*                             R11) UNRSTD;                         0532
@RF00526 DS    0H                                                  0533
*                         END;      /* END ERROR ID PROCESSING     0533
*                                                            @G17EP5W*/
*                     END;                                         0534
*                   ELSE            /* IF DATA TO BE BUFFERED        */
*                     DO;                                          0535
*                                                                  0535
         B     @RC00506                                            0535
@RF00506 DS    0H                                                  0536
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE MOVEDATA SEGMENT IS TO MOVE THE DATA FOR      */
*/* RECORDING FROM THE CALLERS AREA TO THE RCB. ALLOWANCE IS MADE    */
*/* FOR WRAPPING THE RCB BUFFER AREA. IF THIS OCCURS THE BUFFER ENTRY*/
*/* HEADER IS MARKED TO INDICATE IT (RCBBWRAP = YES)                 */
*/*                                                                  */
*/********************************************************************/
*                                                                  0536
*                       RESPECIFY   /* RESTRICT REGISTERS FOR        */
*                        (R11,      /* LENGTH OF DATA TO BE MOVED    */
*                         R5) RESTRICTED;/* LENGTH OF AREA TO MOVE IT
*                                      TO                            */
*                       R11=DATLEN; /* PICK OF LENGTH OF DATA TO MOVE*/
         LH    R11,DATLEN(,R13)                                    0537
         N     R11,@CF02089                                        0537
*                       DO WHILE(R11^=ZERO);/* MOVE DATA UNTIL IT IS
*                                      ALL MOVED                     */
         B     @DE00538                                            0538
@DL00538 DS    0H                                                  0539
*                         IF RCBBUFE-R4<R11 THEN/* WILL THIS RECORD
*                                      WRAP                          */
         L     @14,RCBBUFE(,R12)                                   0539
         SLR   @14,R4                                              0539
         CR    @14,R11                                             0539
         BNL   @RF00539                                            0539
*                           DO;     /* THE RCB                       */
*                             RCBBWRAP=YES;/* INDICATE WRAPPED RECORD*/
         OI    RCBBWRAP(R2),B'10000000'                            0541
*                             R5=RCBBUFE-R4;/* MOVE DATA TO FILL   0542
*                                      REMAINING SPACE TO END OF   0542
*                                      BUFFER                        */
         LR    R5,@14                                              0542
*                           END;    /* END OF WRAPPED PROCESS        */
*                         ELSE      /* RECORD DOESNT WRAP            */
*                           R5=R11; /* MOVE ALL THE DATA             */
         B     @RC00539                                            0544
@RF00539 LR    R5,R11                                              0544
*                         GEN(MVCL R4,R10);/* MOVE THE DATA          */
@RC00539 DS    0H                                                  0545
         MVCL R4,R10
*                         IF R11^=ZERO THEN/* IF THERE IS MORE DATA
*                                      TO MOVE               @G17EP5W*/
         C     R11,ZERO                                            0546
         BE    @RF00546                                            0546
*                           DO;                                    0547
*                             R4=RCBBUFB;/* WRAP TO BEGINNING OF   0548
*                                      BUFFER                        */
         L     R4,RCBBUFB(,R12)                                    0548
*                             R5=R11;/* PICK UP LENGTH REMAINING TO
*                                      MOVE                          */
         LR    R5,R11                                              0549
*                           END;                                   0550
*                       END;                                       0551
@RF00546 DS    0H                                                  0551
@DE00538 C     R11,ZERO                                            0551
         BNE   @DL00538                                            0551
*                       RESPECIFY                                  0552
*                        (R5,                                      0552
*                         R11) UNRESTRICTED;                       0552
*                       IF ERRIDREQ=YES THEN/* IF ERRORID TO BE    0553
*                                      APPENDED              @G17EP5W*/
         TM    ERRIDREQ(R13),B'00000001'                           0553
         BNO   @RF00553                                            0553
*                         DO;       /* THEN ADD ERRORID      @G17EP5W*/
*                           RCBBERFG=YES;/* SET ERROR ID FLAG IN RCB
*                                                            @G17EP5W*/
         OI    RCBBERFG(R2),B'00000010'                            0555
*                           RFY                                    0556
*                            (R5,                                  0556
*                             R11) RSTD;                           0556
*                           R10=ADDR(PARMERID);/* ADR OF ERRORID IN
*                                      PLIST                 @ZA16445*/
         LR    R10,R3                                              0557
*                           R11=LENGTH(RCBBERID);/* LENGTH OF ERRORID
*                                                            @ZA16445*/
         LA    R11,10                                              0558
*                           IF RCBBUFE-R4<R11 THEN/* WILL RECORD   0559
*                                      WRAP?                 @ZA16445*/
         L     @14,RCBBUFE(,R12)                                   0559
         SLR   @14,R4                                              0559
         CR    @14,R11                                             0559
         BNL   @RF00559                                            0559
*                             DO;   /*                       @ZA16445*/
*                               RCBBWRAP=YES;/* INDICATE WRAPPED   0561
*                                      RECORD                @ZA16445*/
         OI    RCBBWRAP(R2),B'10000000'                            0561
*                               R5=RCBBUFE-R4;/* FILL TO END OF    0562
*                                      BUFFER                @ZA16445*/
         LR    R5,@14                                              0562
*                             END;  /*                       @ZA16445*/
*                           ELSE    /* ERRORID WILL NOT WRAP @ZA16445*/
*                             R5=R11;/* MOVE ENTIRE ERRORID  @ZA16445*/
         B     @RC00559                                            0564
@RF00559 LR    R5,R11                                              0564
*                           GEN(MVCL R4,R10);/* MOVE THE DATA      0565
*                                                            @ZA16445*/
@RC00559 DS    0H                                                  0565
         MVCL R4,R10
*                           IF R11^=ZERO THEN/* MORE DATA TO MOVE? 0566
*                                                            @ZA16445*/
         C     R11,ZERO                                            0566
         BE    @RF00566                                            0566
*                             DO;   /*                       @ZA16445*/
*                               R4=RCBBUFB;/* MOVE REST OF ERRORID TO
*                                      BEGINNING OF BUFFER   @ZA16445*/
         L     R4,RCBBUFB(,R12)                                    0568
*                               R5=R11;/* REST OF ERRORID    @ZA16445*/
         LR    R5,R11                                              0569
*                               GEN(MVCL R4,R10);/* MOVE THE DATA  0570
*                                                            @ZA16445*/
         MVCL R4,R10
*                             END;  /*                       @ZA16445*/
*                           RFY                                    0572
*                            (R5,                                  0572
*                             R11) UNRSTD;                         0572
@RF00566 DS    0H                                                  0573
*                           RFY                                    0573
*                             R5 RSTD;/* POINTER FOR THE HDR TO    0573
*                                      HANDLE WRAPPED HEADERS      0573
*                                                            @ZA19199*/
*                           R5=ADDR(HDR);/* SET UP THE POINTER     0574
*                                                            @ZA19199*/
         LA    R5,16                                               0574
         ALR   R5,R2                                               0574
*                           RFY                                    0575
*                             HDR BASED(R5);/* REBASE THE HDR      0575
*                                                            @ZA19199*/
*                           IF R5>=RCBBUFE THEN/* DID THE HDR WRAP 0576
*                                                            @ZA19199*/
         C     R5,RCBBUFE(,R12)                                    0576
         BL    @RF00576                                            0576
*                             R5=R5-RCBTLNG;/* YES - RESET POINTER 0577
*                                                            @ZA19199*/
         LH    @14,RCBTLNG(,R12)                                   0577
         N     @14,@CF02089                                        0577
         SLR   R5,@14                                              0577
*                           ELSE                                   0578
*                             ;     /* NO - POINTER OK       @ZA19199*/
@RF00576 DS    0H                                                  0579
*                           IF HDRTYP=LRBHMCH THEN/* IF THIS IS A  0579
*                                      HARDWARE RECORD       @G17EP5W*/
         CLI   HDRTYP(R5),X'13'                                    0579
         BNE   @RF00579                                            0579
*                             HDRDS13=YES;/* INDICATE ERRORID PRESENT
*                                                            @G17EP5W*/
         OI    HDRDS13(R5),B'00010000'                             0580
*                           ELSE    /* OTHERWISE IT IS A SOFTWARE  0581
*                                      RECORD                @G17EP5W*/
*                             HDRDS12=YES;/* INDICATE ERRORID PRESENT
*                                                            @G17EP5W*/
         B     @RC00579                                            0581
@RF00579 OI    HDRDS12(R5),B'00100000'                             0581
*                           RFY                                    0582
*                             HDR BASED(ADDR(AR149HDR));/* REBASE  0582
*                                      BACK                  @ZA19199*/
@RC00579 DS    0H                                                  0583
*                           RFY                                    0583
*                             R5 UNRSTD;/* FREE HDR POINTER  @ZA19199*/
*                         END;      /* END ADD ERRORID       @G17EP5W*/
*                     END;                                         0585
@RF00553 DS    0H                                                  0586
*                   RCBBRDY=YES;    /* MARK THE RECORD READY         */
@RC00506 OI    RCBBRDY(R2),B'00000001'                             0586
*                 END;              /* END SPACE ALLOTED PROCESSING  */
*               RESPECIFY           /* RELEASE REGISTERS FROM        */
*                (R7,               /* MAINTAINING HEADER LENGTH     */
*                 R6,               /* CALCULATING SPACE REQUIREMENT */
*                 R2,               /* POINTER TO ALLOTED SPACE      */
*                 R10,              /* POINTER TO DATA               */
*                 R9,               /* POINTER TO PARMLIST           */
*                 R3,               /* POINTER TO PARAM ERRORID    0588
*                                                            @G17EP5W*/
*                 R4) UNRESTRICTED; /* POINTER TO NEXT SPACE TO BUILD*/
@RF00361 DS    0H                                                  0589
*SCHEDRTN:                          /* RETRY POINT IF ERROR SUFFERED
*                                      IN RER AND ESTAE/FRR IN EFFECT*/
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE SCHSRB SEGMENT IS TO SCHEULE THE RECORDING    */
*/* SRB.  THE CODE THAT RUNS UNDER THIS SRB WILL POST THE RECORDING  */
*/* TASK.                                                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0589
*               RESPECIFY           /* RESTRICT REGISTERS FOR        */
*                (R3,               /* SAVING SRB IN USE FIELD       */
*                 R4) RESTRICTED;   /* CHECK & SET OF IN USE FLAG    */
SCHEDRTN DS    0H                                                  0590
*               R3=RCBCS1;          /* SAVE SRB IN USE FLAG          */
         L     R3,RCBCS1(,R12)                                     0590
*TEST1:                             /* TO SEE IF SRB IN USE          */
*               R4=R3;              /* MAKE IT AVAILABLE TO SET      */
TEST1    LR    R4,R3                                               0591
*               GENERATE REFS(R4) FLOWS(NOSCHED1);                 0592
          CLM  R4,4,INUSEMSK       /*IS SRB IN USE                  */
          BNL NOSCHED1            /* IF YES SKIP SCHEDULE           */
*               R4=R4×INUSEON;      /* IF NOT IN USE SET IN USE      */
         O     R4,@CF00165                                         0593
*               CS(R3,R4,RCBCS1);   /* PUT UPDATED FLAG IN THE RCB   */
         CS    R3,@04,RCBCS1(R12)                                  0594
*               BC(4,TEST1);        /* IF RCB NOT ALTERED            */
         BC    4,TEST1                                             0595
*               RESPECIFY           /* RESTRICT REGISTER FOR         */
*                (R5,                                              0596
*                 R7) RESTRICTED;   /* ADDRESS OF SRB AND SAVE RCODE */
*               R7=R15;             /* SAVE RETURN CODE AROUND     0597
*                                      SCHEDULE                      */
         LR    R7,R15                                              0597
*               R5=ADDR(RCBSRB);    /* GET ADDRESS OF SRB            */
         LA    R5,RCBSRB(,R12)                                     0598
*               GEN(SCHEDULE SRB=(R5),SCOPE=GLOBAL);/* SCHEDULE THE
*                                      SRB                           */
         SCHEDULE SRB=(R5),SCOPE=GLOBAL
*               R15=R7;             /* RESTORE RETURN CODE           */
         LR    R15,R7                                              0600
*NOSCHED1:                          /* SRB WAS IN USE AND NOT      0601
*                                      SCHEDULED                     */
*               RESPECIFY           /* RELEASE REGISTERS FROM        */
*                (R3,               /* SAVING THE SRB IN USE FLAG    */
*                 R4,               /* CHECK & SET OF IN USE FLAG    */
*                 R7,               /* SAVING RETURN CODE            */
*                 R5) UNRESTRICTED; /* ADDRESS OF SRB                */
NOSCHED1 DS    0H                                                  0602
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE DCRACNT SEGMENT IS TO DECREMENT THE ACTIVE    */
*/*  REQUEST COUNT. THIS COUNT IS USED TO INDICATE THE NUMBER OF     */
*/*  REQUESTS CURRENTLY MANIPULATING THE RCB. IT IS DECREMENTED AS   */
*/* THE CURRENT RECORD IS IN THE BUFFER AND RCBBUFRS MANIPULATION    */
*/* COMPLETE.                                                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0602
*               RESPECIFY           /* RESTRICT REGISTERS FOR        */
*                (R3,               /* SAVING THE ACTIVE COUNT       */
*                 R4) RESTRICTED;   /* DECREMENTING THE ACTIVE COUNT */
*               R3=RCBCS2;          /* SAVE CURRENT ACTIVE REQUEST 0603
*                                      COUNT                         */
         L     R3,RCBCS2(,R12)                                     0603
*TRCS4:                             /* RCBACNT WILL BE DECREMENTED 0604
*                                      VIA CS EFFECTING SERIALIZATION*/
*               R4=R3;              /* MAKE AVAILABLE FOR          0604
*                                      DECREMENTING                  */
TRCS4    LR    R4,R3                                               0604
*               R4=R4-HIHALF1;      /* DECREMENT ACTIVE REQUEST CT.  */
         SL    R4,HIHALF1                                          0605
*               CS(R3,R4,RCBCS2);   /* PUT UPDATED COUNT IN RCB      */
         CS    R3,@04,RCBCS2(R12)                                  0606
*               BC(4,TRCS4);        /* IF RCBACNT IS NOT ALTERED     */
         BC    4,TRCS4                                             0607
*               UPACNT=NO;          /* INDICATE ACTIVE COUNT       0608
*                                      DECREMENTED FOR THIS REQUEST
*                                                            @YM05488*/
         NI    UPACNT(R13),B'11101111'                             0608
*               RESPECIFY           /* FREE REGISTERS FROM           */
*                (R3,               /* SAVING ACTIVE COUNT           */
*                 R4) UNRESTRICTED; /* DECREMENTING ACTIVE COUNT     */
*               IF(R15=RCTWELVE×    /* IF RETURN CODE INDICATES NOT  */
*                   R15=RC6TEEN)&   /* ENOUGH SPACE OR PROCESSING  0610
*                                      ERROR                         */
*                   LOGRREQ=YES THEN/* AND THE REQUEST WAS FOR LOGREC*/
         C     R15,@CF00135                                        0610
         BE    @GL00005                                            0610
         C     R15,@CF00062                                        0610
         BNE   @RF00610                                            0610
@GL00005 TM    LOGRREQ(R13),B'01000000'                            0610
         BNO   @RF00610                                            0610
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE INCLCNT SEGMENT IS TO INCREMENT THE LOST      */
*/* RECORD COUNT FOR NOT SCHEDULED LOGREC REQUESTS                   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0611
*                 DO;                                              0611
*                   RESPECIFY       /* RESTRICT REGISTERS FOR        */
*                    (R3,           /* SAVING LOST RECORD COUNT      */
*                     R4) RESTRICTED;/* INCREMENTING LOST REC CT     */
*                   R3=RCBCS1;      /* SAVE CURRENT LOST RECORD COUNT*/
         L     R3,RCBCS1(,R12)                                     0613
*TRYCS1:                            /* RCBLCNT WILL BE INCREMENTED 0614
*                                      VIA CS EFFECTING SERIALIZATION*/
*                   R4=R3;          /* MAKE COUNT AVAILABLE FOR    0614
*                                      INCREMENTING                  */
TRYCS1   LR    R4,R3                                               0614
*                   R4=R4+HIBYTE1;  /* INCREMENT BY ONE              */
         AL    R4,HIBYTE1                                          0615
*                   CS(R3,R4,RCBCS1);/* PLACE UPDATED COUNT IN THE 0616
*                                      RCB                           */
         CS    R3,@04,RCBCS1(R12)                                  0616
*                   BC(4,TRYCS1);   /* IF THE RCB NOT ALTERED        */
         BC    4,TRYCS1                                            0617
*                   RESPECIFY       /* RELEASE REGISTERS FROM        */
*                    (R3,           /* SAVING LOST RECORD COUNT      */
*                     R4) UNRESTRICTED;/* INCREMENTING LOST RECORD 0618
*                                      COUNT                         */
*                 END;              /* END INCLCNT                   */
*             END;                  /* END NO PREVIOUS ERROR RECORD
*                                      PROCESSING                    */
@RF00610 DS    0H                                                  0621
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE REMRCV SEGMENT IS TO DELETE RECOVERY SET UP   */
*/* BY THE ESTRCV SEGMENT                                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0621
*           RESPECIFY               /* RESTRICT REGISTERS FOR        */
*            (R3,                   /* SET FRR WORKREG               */
*             R4,                   /* SET FRR WORKREG               */
*             R7) RESTRICTED;       /* PRESERVING RETURN CODE        */
@RC00237 DS    0H                                                  0622
*           R7=R15;                 /* SAVE REGISTER CLOBBERED BY  0622
*                                      ESTAE                         */
         LR    R7,R15                                              0622
*           IF ESTAEREQ=YES&        /* IF RECOVERY BY ESTAE          */
*               NOESTAE=NO THEN     /* IF ESTAE WAS ESTABLISHED      */
         TM    ESTAEREQ(R13),B'10000000'                           0623
         BNO   @RF00623                                            0623
         TM    NOESTAE(R13),B'00100000'                            0623
         BNZ   @RF00623                                            0623
*             DO;                                                  0624
*               DO;                 /* FREEMAIN(RC) LV(LENGTH(GMSPACE
*                                      ))A(GMAD->GMSPACE) SP(253)    */
*                 RESPECIFY                                        0626
*                  (GPR01F,                                        0626
*                   GPR15F,                                        0626
*                   GPR00F) RESTRICTED;                            0626
*                 GPR01F=0;         /* REG 1 MUST BE ZERO            */
         SLR   GPR01F,GPR01F                                       0627
*                 GPR15F=1;         /* SET TYPE                      */
         LA    GPR15F,1                                            0628
*                 GPR00F=LENGTH(GMSPACE);/* LENGTH REQUESTED         */
         LA    GPR00F,40                                           0629
*                 GPR01F=ADDR(GMAD->GMSPACE);/* SET REGISTER ONE     */
         L     GPR01F,GMAD(,R13)                                   0630
*                 GPR15F=GPR15F+((253)*256);/* SUBPOOL VALUE         */
         AL    GPR15F,@CF02076                                     0631
*                 SVC(120);         /* RC/RU-FORM OF GETMAIN         */
         SVC   120                                                 0632
*                 RESPECIFY                                        0633
*                  (GPR01F,                                        0633
*                   GPR15F,                                        0633
*                   GPR00F) UNRESTRICTED;                          0633
*               END;                /* FREEMAIN(RC) LV(LENGTH(GMSPACE
*                                      ))A(GMAD->GMSPACE) SP(253)    */
*               GEN(ESTAE 0);       /* DELETE IT                     */
         ESTAE 0
*             END;                                                 0636
*           IF FRRREQ=YES THEN      /* IF RECOVERY BY SETFRR         */
@RF00623 TM    FRRREQ(R13),B'01000000'                             0637
         BNO   @RF00637                                            0637
*             DO;                                                  0638
*               GEN(SETFRR D,WRKREGS=(R3,R4));/* DELETE IT           */
         SETFRR D,WRKREGS=(R3,R4)
*             END;                                                 0640
*           R15=R7;                 /* RESTORE REG CLOBBERED BY ESTAE*/
@RF00637 LR    R15,R7                                              0641
*           RESPECIFY               /* RELEASE REGISTER FROM         */
*            (R3,                   /* SETFRR WRKREG                 */
*             R4,                   /* SETFRR WRKREG                 */
*             R7) UNRESTRICTED;     /* PRESERVING RETURN CODE        */
*         END;                      /* END NON EMERGENCY PROCESSING  */
*     END;                          /* END RTCT INIT PROCESS @YM33344*/
@RC00114 DS    0H                                                  0645
*   RESPECIFY                       /* RESTRICT REGISTER FOR         */
*     R14 RESTRICTED;               /* USE FOR RETURN                */
@RC00109 DS    0H                                                  0646
*   R14=SAVE14;                     /* RESTORE REGISTER 14           */
         L     R14,SAVE14(,R13)                                    0646
*   RESPECIFY                       /* RELEASE REGISTER FROM         */
*     R14 UNRESTRICTED;             /* USE FOR RETURN                */
*   GEN;                                                           0648
*                                                                  0648
          LM    R2,R12,R2DISP(R13)      /* RESTORE REGISTERS 2-12    */
          BR    R14                     /* RETURN TO CALLER          */
*/********************************************************************/
*/*                                                                  */
*/* THE  RCDRCVR SEGMENT GETS CONTROL WHEN AN ERROR IS SUFFERED IN   */
*/* IEAVTRER NO CORRECTIVE ACTION IS TAKEN A BIT IT SET TO NOTIFY THE*/
*/* TASK TO QUIESCE AND CLEANUP.  FURTHER RECORDING IS PROHIBITED TIL*/
*/*  THE RCB REINITIALIZATION IS COMPLETE.                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  0649
*RCDRCVR:                                                          0649
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);                          0649
         B     @PB00002                                            0649
RCDRCVR  DS    0H                                                  0650
*   RFY                                                            0650
*    (R14,                                                         0650
*     R1,                                                          0650
*     R2,                                                          0650
*     R7,                                                          0650
*     R1) RSTD;                                                    0650
*   DO;                             /* ENTESTAE (8)ERREXIT(NORTCA)   */
*/*  ENTRY CODE FOR ESTAE ROUTINE.                                   */
*/*  IF RTCA ALLOCATED THEN RESTORE CODE AND                         */
*/*  DATA REGS FROM START OF USERS PARM LIST,                        */
*/*  AND ESTABLISH ADDR TO ESTAE SAVE AREA                           */
*/*  IF REQUIRED.                                                    */
*/*  IF NO RTCA AVAILABLE THEN BRANCH TO ERROR                       */
*/*  CODE AFTER ESTABLISHING ADDRESSABILITY                          */
*                                                                  0652
*     GEN(USING *,GPR15P);                                         0652
         USING *,GPR15P
*     GEN(CH    GPR00F,*+18);       /* CHECK IF RTCA ALLOC FAILED    */
         CH    GPR00F,*+18
*     GEN(BNE   *+16);              /* NO,SAVE RTM REGS              */
         BNE   *+16
*     GEN(DROP  GPR15P);            /* DROP LOCAL ADDR               */
         DROP  GPR15P
*     GEN(LR    GPR15P,GPR02P);     /* PTR TO USER PARM LIST         */
         LR    GPR15P,GPR02P
*     GEN(L     8,00(GPR15P));                                     0657
         L     8,00(GPR15P)
*     GEN(B     NORTCA);            /* BRANCH TO ERROR EXIT          */
         B     NORTCA
*     GEN(DC    H'12');             /* NO RTCA AVAIL RC              */
         DC    H'12'
*     GEN(STM   GPR14P,GPR12F,12(GPR13P));/* GOOD R13, SAVE RTM'S  0660
*                                      REGS                          */
         STM   GPR14P,GPR12F,12(GPR13P)
*     GEN(L     GPR15P,0(GPR01P));  /* PTR TO USER PARM LIST         */
         L     GPR15P,0(GPR01P)
*     GEN(L     8,00(GPR15P));                                     0662
         L     8,00(GPR15P)
*   END;                            /* ENTESTAE (8)ERREXIT(NORTCA)   */
*   RFY                                                            0664
*     SDWA BASED(R1);               /* POINT TO SDWA FROM RTM        */
*FRREP:                             /* ENTRY POINT IF RECOVERY IS FRR*/
*   R2=SDWAPARM;                    /* PICK UP THE POINTER TO      0665
*                                      PARMLIST FROM THE SDWA        */
FRREP    L     R2,SDWAPARM(,R1)                                    0665
*   SDWASR01=R2;                    /* SAVE PARMLIST ADDRESS FOR   0666
*                                      RETRY ROUTINE (ONLY IF FRR) IF
*                                      ESTAE SETRP WILL HANDLE REG 2 */
         ST    R2,SDWASR01(,R1)                                    0666
*   RFY                                                            0667
*     GMSPACE BASED(R2);            /* MAP WITH PARMLIST DECLARED    */
*   R8=RETRY8;                      /* ENSURE ADDRESSABILITY (FRR)   */
         L     R8,RETRY8(,R2)                                      0668
*   R7=R14;                         /* SAVE THE RETURN ADDRESS TO RTM*/
         LR    R7,R14                                              0669
*   R13=RETRY13;                    /* RESTORE SAVEAREA POINTER    0670
*                                                            @YM05488*/
         L     R13,RETRY13(,R2)                                    0670
*   R12=RTCTRCB;                    /* RESTORE RCB POINTER   @YM05488*/
         L     @09,CVTPTR                                          0671
         L     @09,CVTRTMCT(,@09)                                  0671
         L     R12,RTCTRCB(,@09)                                   0671
*   IF SDWACMPC=CHARLIE2×           /* IF ERROR WAS PRIV OP EXCP     */
*       SDWACMPC=CHARLIE4 THEN      /* OR PROTECTION CHECK           */
         CLC   SDWACMPC(3,R1),CHARLIE2                             0672
         BE    @RT00672                                            0672
         CLC   SDWACMPC(3,R1),CHARLIE4                             0672
         BNE   @RF00672                                            0672
@RT00672 DS    0H                                                  0673
*     DO;                           /* CONTINUE WITH TERMINATION     */
*       IF UPACNT=YES THEN          /* IF RCB HAS BE UPDATED @YM05488*/
         TM    UPACNT(R13),B'00010000'                             0674
         BNO   @RF00674                                            0674
*         DO;                                                      0675
*           RTCTRTER=YES;           /* INDICATE TO TASK TO CLEANUP   */
         L     @09,CVTPTR                                          0676
         L     @09,CVTRTMCT(,@09)                                  0676
         OI    RTCTRTER(@09),B'10000000'                           0676
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE DCRACNT SEGMENT IS TO DECREMENT THE ACTIVE    */
*/*  REQUEST COUNT. THIS COUNT IS USED TO INDICATE THE NUMBER OF     */
*/*  REQUESTS CURRENTLY MANIPULATING THE RCB. IT IS DECREMENTED AS   */
*/* THE CURRENT RECORD IS IN THE BUFFER AND RCBBUFRS MANIPULATION    */
*/* COMPLETE.                                                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0677
*           RESPECIFY               /* RESTRICT REGISTERS FOR        */
*            (R3,                   /* SAVING THE ACTIVE COUNT       */
*             R4) RESTRICTED;       /* DECREMENTING THE ACTIVE COUNT */
*           R3=RCBCS2;              /* SAVE CURRENT ACTIVE REQUEST 0678
*                                      COUNT                         */
         L     R3,RCBCS2(,R12)                                     0678
*RCVCS:                             /* RCBACNT WILL BE DECREMENTED 0679
*                                      VIA CS EFFECTING SERIALIZATION*/
*           R4=R3;                  /* MAKE AVAILABLE FOR          0679
*                                      DECREMENTING                  */
RCVCS    LR    R4,R3                                               0679
*           R4=R4-HIHALF1;          /* DECREMENT ACTIVE REQUEST CT.  */
         SL    R4,HIHALF1                                          0680
*           CS(R3,R4,RCBCS2);       /* PUT UPDATED COUNT IN RCB      */
         CS    R3,@04,RCBCS2(R12)                                  0681
*           BC(4,RCVCS);            /* IF RCBACNT IS NOT ALTERED     */
         BC    4,RCVCS                                             0682
*           UPACNT=NO;              /* INDICATE ACTIVE COUNT       0683
*                                      DECREMENTED FOR THIS REQUEST
*                                                            @YM05488*/
         NI    UPACNT(R13),B'11101111'                             0683
*           RESPECIFY               /* FREE REGISTERS FROM           */
*            (R3,                   /* SAVING ACTIVE COUNT           */
*             R4) UNRESTRICTED;     /* DECREMENTING ACTIVE COUNT     */
*         END;                                                     0685
*       DO;                         /* SETRP RECORD(NO)RC(0)         */
@RF00674 DS    0H                                                  0687
*         RESPECIFY                                                0687
*          (GPR00P,                                                0687
*           GPR01P,                                                0687
*           GPR14P,                                                0687
*           GPR15P) RSTD;                                          0687
*         GPR01P->SDWARCDE=0;       /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0688
*         GPR01P->SDWARCRD='0'B;    /* TURN OFF RECORD INDICATOR     */
         NI    SDWARCRD(GPR01P),B'01111111'                        0689
*         RESPECIFY                                                0690
*          (GPR00P,                                                0690
*           GPR01P,                                                0690
*           GPR14P,                                                0690
*           GPR15P) UNRSTD;                                        0690
*       END;                                                       0691
*     END;                                                         0692
*   ELSE                            /* IF NONE OF THE ABOVE ERRORS   */
*     DO;                           /* RETRY IS EFFECTED IN IEAVTRER
*                                      AT THE POINT WHERE THE      0693
*                                      RECORDING TASK IS POSTED AND
*                                      RETURN WILL BE MADE TO CALLER
*                                      WITH THE APPROPRIATE RETURN 0693
*                                      CODE                          */
         B     @RC00672                                            0693
@RF00672 DS    0H                                                  0694
*       RTCTRTER=YES;               /* NOTIFY THE TASK TO CLEANUP    */
         L     @09,CVTPTR                                          0694
         L     @09,CVTRTMCT(,@09)                                  0694
         OI    RTCTRTER(@09),B'10000000'                           0694
*       DO;                         /* SETRP RETADDR(RETPOINT)FRESDWA
*                                      (YES)RC(4)RECORD(NO)          */
*         RESPECIFY                                                0696
*          (GPR00P,                                                0696
*           GPR01P,                                                0696
*           GPR14P,                                                0696
*           GPR15P) RSTD;                                          0696
*         GPR01P->SDWARCDE=4;       /* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0697
*         GPR01P->SDWARTYA=ADDR(RETPOINT);/* SAVE RETRY ADDRESS      */
         L     @09,RETRYADR(,R2)                                   0698
         ST    @09,SDWARTYA(,GPR01P)                               0698
*         GPR01P->SDWAFREE='1'B;    /* SET FLAG TO FREE SDWA         */
*         GPR01P->SDWARCRD='0'B;    /* TURN OFF RECORD INDICATOR     */
         OI    SDWAFREE(GPR01P),B'00000100'                        0700
         NI    SDWARCRD(GPR01P),B'01111111'                        0700
*         RESPECIFY                                                0701
*          (GPR00P,                                                0701
*           GPR01P,                                                0701
*           GPR14P,                                                0701
*           GPR15P) UNRSTD;                                        0701
*       END;                                                       0702
*     END;                                                         0703
*   R14=R7;                         /* RESTORE RTM RETURN POINT      */
@RC00672 LR    R14,R7                                              0704
*   GOTO R14;                       /* RETURN TO THE RTM             */
         BR    R14                                                 0705
*NORTCA:                            /* IF RTCA/SDWA NOT OBTAINED     */
*   RFY                                                            0706
*     GMSPACE BASED(R2);                                           0706
NORTCA   DS    0H                                                  0707
*   R13=RETRY13;                    /* RESTORE SAVEAREA POINTER    0707
*                                                            @YM05488*/
         L     R13,RETRY13(,R2)                                    0707
*   R12=RTCTRCB;                    /* RESTORE RCB POINTER   @YM05488*/
         L     @09,CVTPTR                                          0708
         L     @09,CVTRTMCT(,@09)                                  0708
         L     R12,RTCTRCB(,@09)                                   0708
*   IF R1=CHARLIE2×                 /* IF ERROR WAS PRIV OP EXCP     */
*       R1=CHARLIE4 THEN            /* OR PROTECTION CHECK           */
         SLR   @09,@09                                             0709
         ICM   @09,7,CHARLIE2                                      0709
         CR    R1,@09                                              0709
         BE    @RT00709                                            0709
         SLR   @09,@09                                             0709
         ICM   @09,7,CHARLIE4                                      0709
         CR    R1,@09                                              0709
         BNE   @RF00709                                            0709
@RT00709 DS    0H                                                  0710
*     DO;                           /* CONTINUE WITH TERMINATION     */
*       IF UPACNT=YES THEN          /* IF RCB HAS BE UPDATED @YM05488*/
         TM    UPACNT(R13),B'00010000'                             0711
         BNO   @RF00711                                            0711
*         DO;                                                      0712
*           RTCTRTER=YES;           /* INDICATE TO TASK TO CLEANUP   */
         L     @09,CVTPTR                                          0713
         L     @09,CVTRTMCT(,@09)                                  0713
         OI    RTCTRTER(@09),B'10000000'                           0713
*/********************************************************************/
*/*                                                                  */
*/* THE PURPOSE OF THE DCRACNT SEGMENT IS TO DECREMENT THE ACTIVE    */
*/*  REQUEST COUNT. THIS COUNT IS USED TO INDICATE THE NUMBER OF     */
*/*  REQUESTS CURRENTLY MANIPULATING THE RCB. IT IS DECREMENTED AS   */
*/* THE CURRENT RECORD IS IN THE BUFFER AND RCBBUFRS MANIPULATION    */
*/* COMPLETE.                                                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0714
*           RESPECIFY               /* RESTRICT REGISTERS FOR        */
*            (R3,                   /* SAVING THE ACTIVE COUNT       */
*             R4) RESTRICTED;       /* DECREMENTING THE ACTIVE COUNT */
*           R3=RCBCS2;              /* SAVE CURRENT ACTIVE REQUEST 0715
*                                      COUNT                         */
         L     R3,RCBCS2(,R12)                                     0715
*RCVCS1:                            /* RCBACNT WILL BE DECREMENTED 0716
*                                      VIA CS EFFECTING SERIALIZATION*/
*           R4=R3;                  /* MAKE AVAILABLE FOR          0716
*                                      DECREMENTING                  */
RCVCS1   LR    R4,R3                                               0716
*           R4=R4-HIHALF1;          /* DECREMENT ACTIVE REQUEST CT.  */
         SL    R4,HIHALF1                                          0717
*           CS(R3,R4,RCBCS2);       /* PUT UPDATED COUNT IN RCB      */
         CS    R3,@04,RCBCS2(R12)                                  0718
*           BC(4,RCVCS1);           /* IF RCBACNT IS NOT ALTERED     */
         BC    4,RCVCS1                                            0719
*           UPACNT=NO;              /* INDICATE ACTIVE COUNT       0720
*                                      DECREMENTED FOR THIS REQUEST
*                                                            @YM05488*/
         NI    UPACNT(R13),B'11101111'                             0720
*           RESPECIFY               /* FREE REGISTERS FROM           */
*            (R3,                   /* SAVING ACTIVE COUNT           */
*             R4) UNRESTRICTED;     /* DECREMENTING ACTIVE COUNT     */
*         END;                                                     0722
*       R15=RCZERO;                 /* INDICATE TO RTM TERMINATE     */
@RF00711 SLR   R15,R15                                             0723
*     END;                                                         0724
*   ELSE                            /* IF NONE OF THE ABOVE RETRY    */
*     DO;                           /* IN IEAVTRER AT SCHED OF SRB   */
         B     @RC00709                                            0725
@RF00709 DS    0H                                                  0726
*       RFY                                                        0726
*         R0 RSTD;                                                 0726
*       R15=RCFOUR;                 /* INDICATE RETRY                */
         LA    R15,4                                               0727
*       R0=RETRYADR;                /* RETURN TO RTM THE RETRY ADDR  */
         L     R0,RETRYADR(,R2)                                    0728
*       RTCTRTER=YES;               /* INDICATE TO TASK TO CLEANUP   */
         L     @09,CVTPTR                                          0729
         L     @09,CVTRTMCT(,@09)                                  0729
         OI    RTCTRTER(@09),B'10000000'                           0729
*       RFY                                                        0730
*         R0 UNRSTD;                                               0730
*     END;                                                         0731
*   GOTO R14;                       /* RETURN TO RTM                 */
@RC00709 BR    R14                                                 0732
*   RFY                                                            0733
*    (R14,                                                         0733
*     R1,                                                          0733
*     R2,                                                          0733
*     R7,                                                          0733
*     R1) UNRSTD;                                                  0733
*   END RCDRCVR;                                                   0734
*                                                                  0734
@PB00002 DS    0H                                                  0734
*/********************************************************************/
*/*                                                                  */
*/* IF THE RECOVERY EXIT GETS CONTOL RETRY IS EFFECTED AT THIS POINT */
*/* SO THE RETURN CODE IN REGISTER 15 MAY BE SET AND ADDRESSIBILITY  */
*/* CAN BE ESTABLISHED PRIOR TO RETRYING IN THE MAINLINE             */
*/*                                                                  */
*/********************************************************************/
*                                                                  0735
*RETRYRTN:                          /* COMMON RETRY CODE FROM RCDRCVR*/
*   DO;                                                            0735
RETRYRTN DS    0H                                                  0736
*     RFY                                                          0736
*       R1 RSTD;                                                   0736
*     RFY                                                          0737
*       GMSPACE BASED(R1);                                         0737
*     R8=RETRY8;                    /* RESET BASE REGISTER FOR RER   */
         L     R8,RETRY8(,R1)                                      0738
*     R13=RETRY13;                  /* RESTORE PTR TO CALLERS      0739
*                                      SAVEAREA                      */
         L     R13,RETRY13(,R1)                                    0739
*     R12=RTCTRCB;                  /* REFRESH RCB BASE              */
         L     @14,CVTPTR                                          0740
         L     @14,CVTRTMCT(,@14)                                  0740
         L     R12,RTCTRCB(,@14)                                   0740
*     R15=RC6TEEN;                  /* SHOW TEMPORARY ERROR          */
         LA    R15,16                                              0741
*     GOTO SCHEDRTN;                /* RETRY AT SCHEDULE OF SRB TO 0742
*                                      POST THE RECORDING TASK       */
         B     SCHEDRTN                                            0742
*     RFY                                                          0743
*       R1 UNRSTD;                                                 0743
*   END;                                                           0744
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0745
*     GPR01F FIXED(31) REG(1),                                     0745
*     GPR12F FIXED(31) REG(12),                                    0745
*     GPR15F FIXED(31) REG(15),                                    0745
*     GPR00P PTR(31) REG(0),                                       0745
*     GPR01P PTR(31) REG(1),                                       0745
*     GPR02P PTR(31) REG(2),                                       0745
*     GPR13P PTR(31) REG(13),                                      0745
*     GPR14P PTR(31) REG(14),                                      0745
*     GPR15P PTR(31) REG(15);                                      0745
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0746
*     I031F FIXED(31) BASED,                                       0746
*     I031P PTR(31) BASED,                                         0746
*     I015F FIXED(15) BASED,                                       0746
*     I015P PTR(15) BASED,                                         0746
*     I008P PTR(8) BASED,                                          0746
*     I001C CHAR(1) BASED;                                         0746
*   END IEAVTRER                    /* END OF IEAVTRER               */
*                                                                  0747
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (RERSPEC )                                       */
*/*%INCLUDE SYSLIB  (RERDCL  )                                       */
*/*%INCLUDE SYSLIB  (IHAESTA )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHARTCT )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAHDR  )                                       */
*/*%INCLUDE SYSLIB  (RTMRCB  )                                       */
*/*%INCLUDE SYSLIB  (IHALRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (EMERPROC)                                       */
*/*%INCLUDE SYSLIB  (FREEREC )                                       */
*/*%INCLUDE SYSLIB  (FREEREC )                                       */
*/*%INCLUDE SYSLIB  (ESTRCV  )                                       */
*/*%INCLUDE SYSLIB  (ERRPROC )                                       */
*/*%INCLUDE SYSLIB  (SCHSRB  )                                       */
*/*%INCLUDE SYSLIB  (SCHSRB  )                                       */
*/*%INCLUDE SYSLIB  (INCACNT )                                       */
*/*%INCLUDE SYSLIB  (FNDSPACE)                                       */
*/*%INCLUDE SYSLIB  (CALCSPCE)                                       */
*/*%INCLUDE SYSLIB  (CALCSPCE)                                       */
*/*%INCLUDE SYSLIB  (SPCAVAIL)                                       */
*/*%INCLUDE SYSLIB  (RECALCSP)                                       */
*/*%INCLUDE SYSLIB  (BUILDREC)                                       */
*/*%INCLUDE SYSLIB  (BLDAR149)                                       */
*/*%INCLUDE SYSLIB  (MOVEDATA)                                       */
*/*%INCLUDE SYSLIB  (DCRACNT )                                       */
*/*%INCLUDE SYSLIB  (DCRACNT )                                       */
*/*%INCLUDE SYSLIB  (DCRACNT )                                       */
*/*%INCLUDE SYSLIB  (INCLCNT )                                       */
*/*%INCLUDE SYSLIB  (REMRCV  )                                       */
*/*%INCLUDE SYSLIB  (RCDRCVR )                                       */
*/*%INCLUDE SYSLIB  (RETRYRTN)                                       */
*                                                                  0747
*       ;                                                          0747
@DATA    DS    0H
@DATD    DSECT
         DS    0F
IEAVTRER CSECT
         DS    0F
@CF00045 DC    F'1'
@CF00039 DC    F'4'
@CF00032 DC    F'8'
@CF00105 DC    F'10'
@CF00135 DC    F'12'
@CF00062 DC    F'16'
@CF02073 DC    F'23'
@CF00111 DC    F'24'
@CF02076 DC    F'64768'
@CF02093 DC    F'-4'
@CF00165 DC    XL4'00800000'
@CF02011 DC    XL4'FFFFFFF8'
@CF02089 DC    XL4'0000FFFF'
@CF01992 DC    XL4'FFF8'
@DATD    DSECT
         DS    0D
IEAVTRER CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
HIHALF1  DC    XL4'00010000'
HIBYTE1  DC    XL4'01000000'
ZERO     DC    F'0'
INUSEMSK DC    X'80'
CHARLIE1 DC    X'0C1000'
CHARLIE2 DC    X'0C2000'
CHARLIE4 DC    X'0C4000'
IEAVTRER CSECT
MFLESTAE ESTAE RCDRCVR,MF=L       /* SET UP ESTAE LIST               */
@DATD    DSECT
@ENDDATD EQU   *
IEAVTRER CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
R13      EQU   @13
R5       EQU   @05
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R14      EQU   @14
R15      EQU   @15
GPR01F   EQU   @01
GPR15F   EQU   @15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR02P   EQU   @02
GPR12F   EQU   @12
GPR13P   EQU   @13
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
REGSAVE  EQU   0
GMAD     EQU   REGSAVE
STOREWD  EQU   REGSAVE+8
SMASK    EQU   STOREWD
DATBIT   EQU   SMASK
SOMEFLAG EQU   STOREWD+1
RERFLGS  EQU   SOMEFLAG
TRUNCFLG EQU   RERFLGS
OPTNOBUF EQU   RERFLGS
NOESTAE  EQU   RERFLGS
UPACNT   EQU   RERFLGS
SAVE14   EQU   REGSAVE+12
SAVEZERO EQU   REGSAVE+20
REQFLDS  EQU   SAVEZERO
EMERREQ  EQU   REQFLDS
LOGRREQ  EQU   REQFLDS
WTOREQ   EQU   REQFLDS
ERRIDREQ EQU   REQFLDS
ESTAEREQ EQU   REQFLDS+1
FRRREQ   EQU   REQFLDS+1
BUFREQ   EQU   REQFLDS+1
NBUFREQ  EQU   REQFLDS+1
HDRREQ   EQU   REQFLDS+1
JOBNMREQ EQU   REQFLDS+1
TIMEREQ  EQU   REQFLDS+1
POSTREQ  EQU   REQFLDS+1
DATLEN   EQU   SAVEZERO+2
SAVEONE  EQU   REGSAVE+24
DATAAD   EQU   SAVEONE
DATAIND  EQU   DATAAD
RCBBUF   EQU   0
RCBBLEN  EQU   RCBBUF
RCBBFLGS EQU   RCBBUF+2
RCBBFLG1 EQU   RCBBFLGS
RCBBWRAP EQU   RCBBFLG1
RCBBLREC EQU   RCBBFLG1
RCBBWTO  EQU   RCBBFLG1
RCBBFLG2 EQU   RCBBFLGS+1
RCBBNBFR EQU   RCBBFLG2
RCBBPOST EQU   RCBBFLG2
RCBBERFG EQU   RCBBFLG2
RCBBRDY  EQU   RCBBFLG2
RCBBASID EQU   RCBBUF+6
RCBBECB  EQU   RCBBUF+8
RCBBDATA EQU   RCBBUF+16
NBFREC   EQU   0
NBFRDATA EQU   NBFREC
NBFRERID EQU   NBFREC+4
DBLWORD  EQU   0
BECB     EQU   0
TIMEHDR  EQU   0
TIMESLOT EQU   0
PARMTIME EQU   0
PARMHDR  EQU   0
PARMTYPE EQU   PARMHDR
PARMSWTS EQU   PARMHDR+1
PARMJOBN EQU   0
PARMERID EQU   0
PARMECB  EQU   0
PARMASID EQU   0
PARMDATA EQU   0
RCBBJOBN EQU   0
RCBBERID EQU   0
LCLTM    EQU   0
ESTAPTR  EQU   0
ESTA     EQU   0
ESTAEXT  EQU   ESTA
ESTAFLG1 EQU   ESTAEXT
ESTAIO   EQU   ESTAFLG1
ESTAFGRS EQU   ESTA+12
ESTAFLG2 EQU   ESTAFGRS
RETPOINT EQU   0
GMSPACE  EQU   0
RCVPLIST EQU   GMSPACE
RETRY8   EQU   RCVPLIST
RETRY13  EQU   RCVPLIST+4
RETRYADR EQU   RCVPLIST+8
PKDWORD  EQU   RCVPLIST+16
SVC60LST EQU   GMSPACE+24
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTTZ    EQU   CVTMAP+304
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
CVTNUMB  EQU   CVTRELNO
RTCT     EQU   0
RTCTSAP  EQU   RTCT+4
RTCTSAP1 EQU   RTCTSAP
RTCTSAP2 EQU   RTCTSAP+1
RTCTSUP  EQU   RTCT+6
RTCTSUP1 EQU   RTCTSUP
RTCTSUP2 EQU   RTCTSUP+1
RTCTSAO  EQU   RTCT+8
RTCTSAO1 EQU   RTCTSAO
RTCTSAO2 EQU   RTCTSAO+1
RTCTSUO  EQU   RTCT+10
RTCTSUO1 EQU   RTCTSUO
RTCTSUO2 EQU   RTCTSUO+1
RTCTSDO  EQU   RTCT+12
RTCTSDO1 EQU   RTCTSDO
RTCTSDO2 EQU   RTCTSDO+1
RTCTABD  EQU   RTCT+14
RTCTIDMP EQU   RTCTABD
RTCTSDF  EQU   RTCT+16
RTCTSDF1 EQU   RTCTSDF
RTCTSDF2 EQU   RTCTSDF+1
RTCTRCB  EQU   RTCT+32
RTCTSDDS EQU   RTCT+36
RTCTFLG  EQU   RTCTSDDS+3
RTCTRFLG EQU   RTCT+176
RTCTRTER EQU   RTCTRFLG
RTCTRPER EQU   RTCTRFLG
RTCTRSTF EQU   RTCTRFLG
RTCTERID EQU   RTCT+224
SRBPTR   EQU   0
SRBSECT  EQU   0
SRB      EQU   SRBSECT
SRBFLC   EQU   SRB+12
HDR      EQU   0
HDRTYP   EQU   HDR
HDROPRN  EQU   HDR+1
HDROPSYS EQU   HDROPRN
HDRIS    EQU   HDR+2
HDRTRUNC EQU   HDRIS
HDRDS    EQU   HDR+3
HDRDS1   EQU   HDRDS
HDRDS12  EQU   HDRDS1
HDRDS13  EQU   HDRDS1
HDRCNT   EQU   HDR+6
HDRTM    EQU   HDR+8
HDRCPID  EQU   HDR+16
RCB      EQU   0
RCBCNTL  EQU   RCB
RCBBUFB  EQU   RCBCNTL
RCBBUFE  EQU   RCBCNTL+4
RCBCDS   EQU   RCBCNTL+8
RCBFREE  EQU   RCBCDS
RCBFLNG  EQU   RCBCDS+4
RCBSRB   EQU   RCBCNTL+16
RCBCS1   EQU   RCBCNTL+88
RCBFLGS  EQU   RCBCS1+1
RCBFLG1  EQU   RCBFLGS
RCBCS2   EQU   RCBCNTL+92
RCBTLNG  EQU   RCBCS2+2
LRBPTR   EQU   0
LRB      EQU   0
LRBHREL  EQU   LRB+1
LRBHSYS  EQU   LRBHREL
LRBHSW0  EQU   LRB+2
LRBHSW1  EQU   LRB+3
LRBHSW2  EQU   LRB+4
LRBMACT  EQU   LRBHSW2
LRBHSW3  EQU   LRB+5
LRBHCPID EQU   LRB+16
LRBBASE  EQU   LRB+24
LRBCVAR  EQU   0
LRBCMP   EQU   LRBCVAR+8
FRREPTR  EQU   0
FRRSPTR  EQU   0
FRRS     EQU   0
FRRSHEAD EQU   FRRS
FRRSENTR EQU   0
FRRSFLGS EQU   FRRSENTR+4
FRRSFLG1 EQU   FRRSFLGS
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACMPC EQU   SDWAABCC+1
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWASR01 EQU   SDWASRSV+4
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWARTYA EQU   SDWA+240
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
AR149HDR EQU   RCBBDATA
PSARSVTE EQU   PSARSVT
CVTPTR   EQU   FLCCVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRTMCT EQU   CVTS01+224
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LRBHRSW1 EQU   LRBHSW1
LRBHCSW1 EQU   LRBHSW1
LRBHMSW1 EQU   LRBHSW1
LRBMMCH  EQU   LRBBASE
LRBMCEIA EQU   LRBMMCH+8
LRBMTERM EQU   LRBMCEIA
LRBMHARD EQU   LRBMCEIA+1
LRBMINTM EQU   LRBMCEIA+2
LRBMSOFT EQU   LRBMCEIA+3
LRBMPDAR EQU   LRBMMCH+12
LRBMRSR1 EQU   LRBMMCH+13
LRBMRSR2 EQU   LRBMMCH+14
LRBMFLO  EQU   LRBMMCH+24
LRBMCIC  EQU   LRBMFLO
@NM00075 EQU   LRBMCIC
@NM00077 EQU   LRBMCIC+1
@NM00079 EQU   LRBMCIC+2
@NM00081 EQU   LRBMCIC+3
@NM00084 EQU   LRBMCIC+5
LRBRDDR  EQU   LRBBASE
LRBCCCH  EQU   LRBBASE
LRBCCUA  EQU   LRBCCCH+49
LRBDMDR  EQU   LRBBASE
LRBNMIH  EQU   LRBBASE
LRBTTER  EQU   LRBBASE
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
LRBTUSR  EQU   LRBTTER+8
LRBTWSC  EQU   LRBTTER+4
LRBTLNH  EQU   LRBTTER
LRBNINT  EQU   LRBNMIH+24
LRBNDEVT EQU   LRBNMIH+20
LRBNVOL  EQU   LRBNMIH+14
LRBNCUA1 EQU   LRBNMIH+11
LRBNCUA2 EQU   LRBNMIH+8
LRBNJOB  EQU   LRBNMIH
LRBDSENS EQU   LRBDMDR+8
LRBDVOL  EQU   LRBDMDR+2
LRBDCUA1 EQU   LRBDMDR
LRBCCLOG EQU   LRBCCCH+56
LRBCLOGL EQU   LRBCCCH+54
LRBCHCUA EQU   LRBCCCH+52
LRBCCUA2 EQU   LRBCCUA+1
@NM00088 EQU   LRBCCUA
LRBCCHID EQU   LRBCCCH+48
LRBCDEVT EQU   LRBCCCH+44
LRBCECSW EQU   LRBCCCH+40
LRBCFCSW EQU   LRBCCCH+32
LRBCFCCW EQU   LRBCCCH+24
LRBCAIO  EQU   LRBCCCH+8
LRBCJOB  EQU   LRBCCCH
LRBRDEV2 EQU   LRBRDDR+32
LRBRCUA2 EQU   LRBRDDR+29
LRBRPH2  EQU   LRBRDDR+28
LRBRDEV1 EQU   LRBRDDR+24
LRBRCUA1 EQU   LRBRDDR+21
LRBRPH1  EQU   LRBRDDR+20
LRBRVOL2 EQU   LRBRDDR+14
LRBRVOL1 EQU   LRBRDDR+8
LRBRJOB  EQU   LRBRDDR
LRBMCEL  EQU   LRBMMCH+304
@NM00087 EQU   LRBMFLO+20
LRBMFSA  EQU   LRBMFLO+16
@NM00086 EQU   LRBMFLO+8
LRBMCELL EQU   LRBMCIC+6
LRBMVCC  EQU   @NM00084
LRBMVPT  EQU   @NM00084
@NM00085 EQU   @NM00084
@NM00083 EQU   LRBMCIC+4
LRBMVST  EQU   @NM00081
LRBMVLG  EQU   @NM00081
LRBMVCR  EQU   @NM00081
LRBMVGR  EQU   @NM00081
LRBMVFP  EQU   @NM00081
@NM00082 EQU   @NM00081
LRBMVRC  EQU   @NM00081
LRBMVFA  EQU   @NM00081
LRBMVIA  EQU   @NM00079
LRBMVPM  EQU   @NM00079
LRBMVMS  EQU   @NM00079
LRBMVWP  EQU   @NM00079
@NM00080 EQU   @NM00079
LRBMFKE  EQU   @NM00079
LRBMFSC  EQU   @NM00079
LRBMFSE  EQU   @NM00079
LRBMIDY  EQU   @NM00077
LRBMIBU  EQU   @NM00077
@NM00078 EQU   @NM00077
LRBMFWN  EQU   @NM00077
LRBMFDG  EQU   @NM00075
@NM00076 EQU   @NM00075
LRBMFED  EQU   @NM00075
LRBMFCD  EQU   @NM00075
LRBMFTD  EQU   @NM00075
LRBMFSR  EQU   @NM00075
LRBMFPD  EQU   @NM00075
LRBMFSD  EQU   @NM00075
LRBMMOSW EQU   LRBMMCH+16
LRBMPWL  EQU   LRBMMCH+15
LRBMVEQR EQU   LRBMRSR2
LRBMPGFX EQU   LRBMRSR2
LRBMLSQA EQU   LRBMRSR2
LRBMFSQA EQU   LRBMRSR2
LRBMNUCL EQU   LRBMRSR2
LRBMSPER EQU   LRBMRSR2
LRBMINTC EQU   LRBMRSR2
LRBMOFLN EQU   LRBMRSR2
LRBMCHNG EQU   LRBMRSR1
LRBMSER  EQU   LRBMRSR1
@NM00074 EQU   LRBMRSR1
@NM00073 EQU   LRBMPDAR
LRBMRSRF EQU   LRBMPDAR
LRBMRSRC EQU   LRBMPDAR
LRBMINVP EQU   LRBMPDAR
@NM00072 EQU   LRBMPDAR
LRBMSBUF EQU   LRBMSOFT
LRBMSHIR EQU   LRBMSOFT
LRBMSECC EQU   LRBMSOFT
LRBMSEXD EQU   LRBMSOFT
@NM00071 EQU   LRBMSOFT
LRBMSSFT EQU   LRBMSOFT
LRBMIL80 EQU   LRBMINTM
LRBMICTM EQU   LRBMINTM
LRBMICKC EQU   LRBMINTM
LRBMITOD EQU   LRBMINTM
@NM00070 EQU   LRBMINTM
LRBMHIPD EQU   LRBMHARD
LRBMHSPF EQU   LRBMHARD
LRBMHSTO EQU   LRBMHARD
LRBMHINV EQU   LRBMHARD
@NM00069 EQU   LRBMHARD
LRBMHHRD EQU   LRBMHARD
LRBMTINV EQU   LRBMTERM
LRBMTDMG EQU   LRBMTERM
LRBMTWRN EQU   LRBMTERM
LRBMTCKS EQU   LRBMTERM
LRBMTSEC EQU   LRBMTERM
@NM00068 EQU   LRBMTERM
LRBMWSC  EQU   LRBMMCH+4
LRBMLNH  EQU   LRBMMCH
@NM00067 EQU   LRBHMSW1
LRBMSYST EQU   LRBHMSW1
@NM00066 EQU   LRBHMSW1
@NM00065 EQU   LRBHCSW1
LRBCERPP EQU   LRBHCSW1
LRBCDATA EQU   LRBHCSW1
LRBCICUA EQU   LRBHCSW1
LRBCNOSP EQU   LRBHCSW1
@NM00064 EQU   LRBHCSW1
LRBCINCO EQU   LRBHCSW1
LRBCMESG EQU   LRBHCSW1
@NM00063 EQU   LRBHRSW1
LRBRSYSI EQU   LRBHRSW1
LRBROPER EQU   LRBHRSW1
LRBRSEC  EQU   LRBHRSW1
LRBRPRIM EQU   LRBHRSW1
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
@NM00134 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00133 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
SDWAERTM EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00132 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00131 EQU   SDWADDAT+3
@NM00130 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00129 EQU   SDWADDAT+1
@NM00128 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00127 EQU   SDWADUMP+2
@NM00126 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00125 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
SDWASEQ# EQU   SDWA+290
SDWAASID EQU   SDWA+288
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00124 EQU   SDWAACF3
@NM00123 EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00122 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00121 EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00120 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWACPUI EQU   SDWA+239
@NM00119 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
SDWAERFL EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00118 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00117 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00116 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00115 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00114 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00113 EQU   SDWAINC2
@NM00112 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00111 EQU   SDWAILC2
@NM00110 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00109 EQU   SDWANXT2
@NM00108 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00107 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00106 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00105 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00104 EQU   SDWAINC1
@NM00103 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00102 EQU   SDWAILC1
@NM00101 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00100 EQU   SDWANXT1
@NM00099 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00098 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00097 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00096 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00095 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00094 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00093 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
@NM00092 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00091 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
FRRSPARM EQU   FRRSENTR+8
@NM00090 EQU   FRRSFLGS+1
@NM00089 EQU   FRRSFLG1
FRRSNEST EQU   FRRSFLG1
FRRSRCUR EQU   FRRSFLG1
FRRSFRRA EQU   FRRSENTR
FRRSENTS EQU   FRRS+84
FRRSRTMW EQU   FRRS+16
FRRSCURR EQU   FRRSHEAD+12
FRRSELEN EQU   FRRSHEAD+8
FRRSLAST EQU   FRRSHEAD+4
FRRSEMP  EQU   FRRSHEAD
LRBCMPCS EQU   LRBCMP+2
LRBCMPPA EQU   LRBCMP
LRBCMPNO EQU   LRBCVAR+6
LRBCMPF2 EQU   LRBCVAR+5
LRBCMPF1 EQU   LRBCVAR+4
LRBCRESD EQU   LRBCVAR+2
LRBCFT   EQU   LRBCVAR
LRBHMCEL EQU   LRBHCPID+6
LRBHMDL  EQU   LRBHCPID+4
LRBHCSER EQU   LRBHCPID+1
@NM00062 EQU   LRBHCPID
LRBHTIME EQU   LRB+12
LRBHDATE EQU   LRB+8
@NM00061 EQU   LRB+7
LRBHCNT  EQU   LRB+6
LRBMCLB  EQU   LRBHSW3
LRBNDEM  EQU   LRBMACT
LRBNCEM  EQU   LRBMACT
@NM00060 EQU   LRBHSW0
LRBHTMC  EQU   LRBHSW0
@NM00059 EQU   LRBHSW0
LRBHNS   EQU   LRBHSW0
LRBHMORE EQU   LRBHSW0
@NM00058 EQU   LRBHSYS
LRBHSYSB EQU   LRBHSYS
LRBHTYPE EQU   LRB
RCBBUFRS EQU   RCB+96
RCBACNT  EQU   RCBCS2
@NM00057 EQU   RCBFLGS+1
@NM00056 EQU   RCBFLG1
RCBSRBIU EQU   RCBFLG1
RCBLCNT  EQU   RCBCS1
RCBLRHDR EQU   RCBCNTL+64
RCBDUM   EQU   RCBCDS+6
@NM00055 EQU   HDR+7
HDRCNTT  EQU   HDRCNT
HDRCNTS  EQU   HDRCNT
HDRDS3   EQU   HDRDS+2
HDRDS2   EQU   HDRDS+1
HDRDS17  EQU   HDRDS1
HDRDS16  EQU   HDRDS1
HDRDS15  EQU   HDRDS1
HDRDS14  EQU   HDRDS1
HDRDS11  EQU   HDRDS1
HDRDS10  EQU   HDRDS1
HDRISEC  EQU   HDRIS
HDRISR   EQU   HDRIS
HDRISMP  EQU   HDRIS
HDRISTM  EQU   HDRIS
@NM00054 EQU   HDRIS
HDRISNS  EQU   HDRIS
HDRISMR  EQU   HDRIS
HDRRELN  EQU   HDROPRN
@NM00053 EQU   SRB+40
@NM00052 EQU   SRB+38
SRBPRIOR EQU   SRB+37
SRBPKF   EQU   SRB+36
SRBSAVE  EQU   SRB+32
SRBPARM  EQU   SRB+28
SRBRMTR  EQU   SRB+24
SRBEP    EQU   SRB+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRB+8
SRBFLNK  EQU   SRB+4
SRBID    EQU   SRB
RTCTXXX2 EQU   RTCT+234
RTCTETIM EQU   RTCTERID+6
RTCTEASD EQU   RTCTERID+4
RTCTECPU EQU   RTCTERID+2
RTCTESEQ EQU   RTCTERID
RTCTSDWK EQU   RTCT+220
RTCTTDCB EQU   RTCT+184
RTCTXYX2 EQU   RTCT+180
RTCTSEQ# EQU   RTCT+178
RTCTXXX1 EQU   RTCT+177
@NM00051 EQU   RTCTRFLG
RTCTTEST EQU   RTCT+172
RTCTMSRB EQU   RTCT+168
RTCTMLCK EQU   RTCT+164
RTCTFMT  EQU   RTCT+160
RTCTSDPL EQU   RTCT+156
RTCTDEV  EQU   RTCTSDDS+8
RTCTDCB  EQU   RTCTSDDS+4
@NM00050 EQU   RTCTFLG
RTCTDETP EQU   RTCTFLG
RTCTDSUS EQU   RTCTFLG
RTCTDSST EQU   RTCTFLG
RTCTDSNM EQU   RTCTSDDS
RTCTRECB EQU   RTCT+28
RTCTFASB EQU   RTCT+24
RTCTMECB EQU   RTCT+20
RTCTSDID EQU   RTCT+18
RTCTSDEP EQU   RTCTSDF2
RTCTSDDO EQU   RTCTSDF2
RTCTSDEN EQU   RTCTSDF2
RTCTSDTR EQU   RTCTSDF2
RTCTSDPT EQU   RTCTSDF2
RTCTSDSR EQU   RTCTSDF2
RTCTSDSS EQU   RTCTSDF2
RTCTSDSH EQU   RTCTSDF2
@NM00049 EQU   RTCTSDF1
RTCTSDND EQU   RTCTSDF1
RTCTSDNO EQU   RTCTSDF1
@NM00048 EQU   RTCTABD+1
@NM00047 EQU   RTCTIDMP
RTCTISVC EQU   RTCTIDMP
RTCTISYU EQU   RTCTIDMP
RTCTISAB EQU   RTCTIDMP
@NM00046 EQU   RTCTIDMP
@NM00045 EQU   RTCTSDO2
RTCTSDPB EQU   RTCTSDO2
RTCTSDPA EQU   RTCTSDO2
RTCTSDP9 EQU   RTCTSDO2
RTCTSDP8 EQU   RTCTSDO2
RTCTSDP7 EQU   RTCTSDO1
RTCTSDP6 EQU   RTCTSDO1
RTCTSDP5 EQU   RTCTSDO1
RTCTSDP4 EQU   RTCTSDO1
RTCTSDP3 EQU   RTCTSDO1
RTCTSDP2 EQU   RTCTSDO1
RTCTSDP1 EQU   RTCTSDO1
RTCTSDP0 EQU   RTCTSDO1
RTCTSYDF EQU   RTCTSUO2
RTCTSYDE EQU   RTCTSUO2
RTCTSYDD EQU   RTCTSUO2
RTCTSYDC EQU   RTCTSUO2
RTCTSYDB EQU   RTCTSUO2
RTCTSYDA EQU   RTCTSUO2
RTCTSYD9 EQU   RTCTSUO2
RTCTSYD8 EQU   RTCTSUO2
RTCTSYD7 EQU   RTCTSUO1
RTCTSYD6 EQU   RTCTSUO1
RTCTSYD5 EQU   RTCTSUO1
RTCTSYD4 EQU   RTCTSUO1
RTCTSYD3 EQU   RTCTSUO1
RTCTSYD2 EQU   RTCTSUO1
RTCTSYD1 EQU   RTCTSUO1
RTCTSYD0 EQU   RTCTSUO1
RTCTSADF EQU   RTCTSAO2
RTCTSADE EQU   RTCTSAO2
RTCTSADD EQU   RTCTSAO2
RTCTSADC EQU   RTCTSAO2
RTCTSADB EQU   RTCTSAO2
RTCTSADA EQU   RTCTSAO2
RTCTSAD9 EQU   RTCTSAO2
RTCTSAD8 EQU   RTCTSAO2
RTCTSAD7 EQU   RTCTSAO1
RTCTSAD6 EQU   RTCTSAO1
RTCTSAD5 EQU   RTCTSAO1
RTCTSAD4 EQU   RTCTSAO1
RTCTSAD3 EQU   RTCTSAO1
RTCTSAD2 EQU   RTCTSAO1
RTCTSAD1 EQU   RTCTSAO1
RTCTSAD0 EQU   RTCTSAO1
RTCTSUDF EQU   RTCTSUP2
RTCTSUDE EQU   RTCTSUP2
RTCTSUDD EQU   RTCTSUP2
RTCTSUDC EQU   RTCTSUP2
RTCTSUDB EQU   RTCTSUP2
RTCTSUDA EQU   RTCTSUP2
RTCTSUD9 EQU   RTCTSUP2
RTCTSUD8 EQU   RTCTSUP2
RTCTSUD7 EQU   RTCTSUP1
RTCTSUD6 EQU   RTCTSUP1
RTCTSUD5 EQU   RTCTSUP1
RTCTSUD4 EQU   RTCTSUP1
RTCTSUD3 EQU   RTCTSUP1
RTCTSUD2 EQU   RTCTSUP1
RTCTSUD1 EQU   RTCTSUP1
RTCTSUD0 EQU   RTCTSUP1
RTCTSABF EQU   RTCTSAP2
RTCTSABE EQU   RTCTSAP2
RTCTSABD EQU   RTCTSAP2
RTCTSABC EQU   RTCTSAP2
RTCTSABB EQU   RTCTSAP2
RTCTSABA EQU   RTCTSAP2
RTCTSAB9 EQU   RTCTSAP2
RTCTSAB8 EQU   RTCTSAP2
RTCTSAB7 EQU   RTCTSAP1
RTCTSAB6 EQU   RTCTSAP1
RTCTSAB5 EQU   RTCTSAP1
RTCTSAB4 EQU   RTCTSAP1
RTCTSAB3 EQU   RTCTSAP1
RTCTSAB2 EQU   RTCTSAP1
RTCTSAB1 EQU   RTCTSAP1
RTCTSAB0 EQU   RTCTSAP1
RTCTNAME EQU   RTCT
CVTLEVL  EQU   CVTRELNO+2
CVTMDL   EQU   CVTFIX+250
@NM00044 EQU   CVTFIX+248
@NM00043 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTBAH   EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTRV490 EQU   CVTMAP+388
CVTSU    EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTVS1B  EQU   CVTOPTB
CVTVS1A  EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00018 EQU   RCVPLIST+12
ESTARSVI EQU   ESTAFGRS+1
@NM00017 EQU   ESTAFLG2
ESTABRNT EQU   ESTAFLG2
@NM00016 EQU   ESTAFLG2
ESTAEREC EQU   ESTAFLG2
ESTATERM EQU   ESTAFLG2
@NM00015 EQU   ESTAFLG2
ESTAOWNR EQU   ESTA+8
ESTAPARM EQU   ESTA+4
ESTAEXIT EQU   ESTAEXT+1
ESTAHALT EQU   ESTAIO
ESTANOIO EQU   ESTAIO
ESTASYNC EQU   ESTAFLG1
@NM00014 EQU   ESTAFLG1
ESTAESTA EQU   ESTAFLG1
@NM00013 EQU   ESTAFLG1
ESTASTAR EQU   ESTAFLG1
ESTASTAI EQU   ESTAFLG1
@NM00012 EQU   RCBBUF+12
@NM00011 EQU   RCBBUF+4
@NM00010 EQU   RCBBFLG2
@NM00009 EQU   RCBBFLG1
@NM00008 EQU   REGSAVE+28
@NM00007 EQU   REQFLDS
@NM00006 EQU   REGSAVE+16
@NM00005 EQU   SOMEFLAG+1
@NM00004 EQU   RERFLGS
@NM00003 EQU   SMASK
@NM00002 EQU   SMASK
@NM00001 EQU   REGSAVE+4
@NM00042 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00041 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00040 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00039 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00038 EQU   FLCFSA
@NM00037 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00036 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00035 EQU   FLCIOA
@NM00034 EQU   FLCMCLA+15
@NM00033 EQU   FLCMCLA+14
@NM00032 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00031 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00030 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00029 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00028 EQU   FLCPER
@NM00027 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00026 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00025 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00024 EQU   FLCPIILC
@NM00023 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00022 EQU   FLCSVILC
@NM00021 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00020 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00019 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RC00154 EQU   @RC00152
@RC00121 EQU   @RC00114
@RC00144 EQU   @RC00114
@RF00241 EQU   @RC00237
SKPRESET EQU   @RC00299
@RF00511 EQU   @RC00506
@ENDDATA EQU   *
         END   IEAVTRER,(C'PLS1149',0701,77132)
