)ATTR DEFAULT(%+_)
  ×   TYPE(TEXT)   INTENS(HIGH) COLOR(YELLOW)
  %   TYPE(TEXT)   INTENS(HIGH)
  +   TYPE(TEXT)   INTENS(LOW)  COLOR(TURQ)
  ~   TYPE(TEXT)   INTENS(LOW)
  _   TYPE(INPUT)  INTENS(HIGH) CAPS(ON)  JUST(LEFT)
  @   TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT) COLOR(YELLOW)
  $   TYPE(OUTPUT) INTENS(HIGH) CAPS(ON)  JUST(LEFT) COLOR(YELLOW)
)BODY
~------------------------× Change Notice Preparation ~------------------
%Command ===>_ZCMD
+
+ Change~---$CHGROUP+-@NUMBER+
+
+ Title~----@CHTITLE
+
+ Requested by~-------@CMRBPGMR       ~
+ Supervisor~---------@CMRBSUPR       ~
+
+ Center/cpus~--------@CMRBD1          ~(cccc or cccc/a,b)
+ Date Required~------@CMRBD2          ~(mm/dd/yy)
+ Time Required~------@CMRBD3          ~(hh:mm or Shift-2)
+
+ Library/System~-----@CHLIB                                      +
+ Module/Components~--@COMPON                            +
+
+ Priority~-----------@CMRBP    +      ~(Emergency, Critical, Urgent, Ro
+ Class/User Notice~--@CMRBC+          ~(A: 30day notice, B: usernews, B
+ Reference~----------@REFNUM       +  ~(SPR#, Change#, Center/Change#)
+
+
+
+
)INIT
  .CURSOR = ZCMD
)PROC
)END
