)ATTR DEFAULT(%+_)
  ×   TYPE(TEXT)   INTENS(HIGH)                      COLOR(YELLOW)
  %   TYPE(TEXT)   INTENS(HIGH)
  +   TYPE(TEXT)   INTENS(LOW) color(turq)
  ~   TYPE(TEXT)   INTENS(LOW)
  _   TYPE(INPUT)  INTENS(HIGH) CAPS(ON)  JUST(LEFT)
  $   TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT) COLOR(TURQ)
  #   TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT) COLOR(White)
  @   TYPE(OUTPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT) COLOR(RED)
)BODY
+---------------------×  Rockwell Change Notice Dialog  +---------------
+
+
+
+
%           Change Notice #CHGROUP+-#NUMBER%is now being processed
+
+
+
+         ×Overlay Generation Language is processing the Change Notice
+
+
+
)INIT
)END
