+------------------% Create Usermod Status Panel +----------------------
+
+
+    Your USERMOD%&MODID  +is being generated for%&SRCMAC+element %&CUME
+
+
+    When this process is finished you will be placed into ISPF Browse
+    on a report dataset containing the differences found during the
+    build process.
+
+    The format of the report is:
+
+    columns 1-80 contain the delta record
+    columns 86-121 report what action was taken with the record
+
+            if columns 86-88 contain --- the record was put in the delt
+            if columns 86-88 contain *** the record was not put in delt
+
+
)INIT
)PROC
)END
