)ATTR
  ^ TYPE(INPUT) INTENS(NON)
  _ TYPE(INPUT) INTENS(HIGH) COLOR(WHITE) CAPS(ON)
  + TYPE(TEXT)  INTENS(LOW)  COLOR(GREEN)
  % TYPE(TEXT)  INTENS(HIGH) COLOR(TURQ)
)BODY EXPAND(ÖÖ)
%Ö-Ö  &FUNC - ENTRY PANEL  Ö-Ö
%COMMAND ===>_ZCMD
%
+ENTER PARTITIONED OR SEQUENTIAL DATA SET NAME
+   DATA SET NAME %===>_DSN
+   VOLUME SERIAL %===>_VOLUME+ (if not cataloged)
+
+   PASSWORD      %===>^PASSWORD+
+
+   PROFILE NAME  %===>_PROFILE +
+   INITIAL MACRO %===>_MACRO   +
+
)INIT
)PROC
   IF (&ZCMD ^= ' ') .MSG = ISPZ001
   VER (&DSN,NB,DSNAME)
   VER (&VOLUME,NAME)
)END
