)ATTR DEFAULT(%`_)
 ` TYPE(text)   INTENS(low)  COLOR(blue)
)BODY
%-------------- Full-Screen FIND MEMBER in System Library --------------
%OPTION  ===>_ZCMD                                           `Center - &
`                                                            `Cpu/OS - &
%*`Search Libraries:   %===> _FMLIBARY   `
`  Member Name to Find:%===> _FMMEMBER                  `( name, pattern
`  When Found Xeq Cmd: %===> _FMFINDBP`                  ( Browse,PDS or
`  Scan Display Format:%===> _FMSDF `                    ( full STATUS o
`  USER option Parm:   %===> _FMUSRPRM                  `( For USER Lib
`
%*`Specify:                                              +----Member Usa
`  LINK      - Link List Libraries.                      × name:    memb
`  LPA       - LPA Libraries.                            × prefix:  xxx*
`  LOAD      - ISPLLIB/STEPLIB/LPAlibs/LinkList.         × range:   aaa:
`  CMD       - ISPLLIB/STEPLIB/LPAlibs/LinkList/SYSPROC. × contain: bbb/
`  DRDS      - JES3 Disk Reader DataSets.                ×  " both: aaa/
`  UCC7      - ISC UCC7 Job Libraries.                   × liblist: ?
`  CLIST     - Your Allocated SYSPROC File.              +--------------
`  FI=file   - Where 'file' is any pre-Allocated File.
`  FI=?      - Full-Screen List Allocate for FI= selection.
`  USER      - Search user provided libraries (see Tutorial).
`  PROC      - Standard Proclibs (PROC=ST).
`  PROC=xx   - Other JES3 Proclibs.
`              &XXMSG
_FMOPTS                       `
)INIT
 .CURSOR = FMLIBARY
 .HELP = FSFMTUT1
 IF (&Z$CTR = SWCC)      &PROCXX = 'MC, MX, DC, ST, TT, SY, TS, or ALL'
 IF (&Z$CTR = SWC2)      &PROCXX = 'AA, LL, QU, ST, MC, MX, SY, TU, TS,
 IF (&Z$CTR = WCC1)      &PROCXX = 'AA, LL, QU, ST, SY, TS, or ALL'
 IF (&Z$CTR = SWCC,SWC2,WCC1) &XXMSG  = '(At &Z$CTR. xx=&PROCXX.)'
 &FMLIB=&Z &FMPROC=&Z &FMTYPE=&Z &FMPARM=&Z &FMDDNAME=&Z &FMMANY=&Z &FMU
 &FMOPTS = &Z
 &FMSDF = &FSFMSDF      &FMMEMBER = &FMMEMSAV
 IF (&FMSDF = &Z,' ')   &FMSDF    = ONLY
 IF (&FMSDF = ONLY)     &FMFINDBP = &Z
)PROC
 VER(&FMLIBARY,NB)   &FMTYPE = TRUNC(&FMLIBARY,'=')   &FMPARM = .TRAIL
 IF (&FMPARM ^= &Z) &FMTYPE = '&FMTYPE.='
 VER(&FMTYPE,NB,LIST,LINK,LPA,UCC7,DRDS,PROC,USER,+
                     LOAD,CMD,CLIST,'PROC=','DD=','FI=',MSG=FSFM011)
 IF (&FMTYPE = 'PROC=')   &FMLIB = 'PROC'   &FMPROC = &FMPARM   VER(&FMP
   IF (&Z$CTR=SWCC) VER(&FMPROC,LIST,MC,MX,DC,ST,TT,SY,TS,ALL,MSG=FSFM01
   IF (&Z$CTR=SWC2) VER(&FMPROC,LIST,AA,LL,QU,ST,MC,MX,SY,TU,TS,ALL,MSG=
   IF (&FMPROC^=ALL) VER(&FMPROC,NB,PICT,'CC')
   IF (&FMPROC =ALL) &FMMANY = PROC
 IF (&FMTYPE = 'DD=','FI=')   &FMLIB = 'DD'   &FMDDNAME = &FMPARM
   IF (&FMDDNAME ^= '?') VER(&FMDDNAME,NB,NAME,MSG=FSFM015)
 IF (&FMTYPE = LINK,LPA,CMD,LOAD,UCC7,DRDS,CLIST,PROC,USER)   &FMLIB = &
   IF (&FMLIB = LOAD,CMD)  &FMMANY = &FMLIB
   IF (&FMLIB = PROC)      &FMPROC = ST    &FMUSRPRM = &Z
   IF (&FMLIB = CLIST)     &FMLIB  = DD    &FMDDNAME = SYSPROC
 IF (&FMLIBARY ^= USER)  &FMUSRPRM = &Z
 IF (&FMLIBARY ^= 'FI=?','DD=?')
   IF (&FMMEMBER ^= '?')  IF(&FMUSRPRM ^= '?')  VER(&FMMEMBER,NB)
 &FMFINDBP = TRANS(&FMFINDBP B,BROWSE BR,BROWSE P,PDS BLANK,&Z  *,*)
 VER(&FMFINDBP,LIST,BROWSE,PDS)
 &FMSDF = TRANS(&FMSDF
   S,STATUS KDSN,STATUS O,ONLY KBR,ONLY *,*)
 VER(&FMSDF,LIST,ONLY,STATUS)
 IF (&FMSDF = ONLY)     &FMOPTS = '&FMOPTS FMVERS(KBR)  '
 IF (&FMSDF = STATUS)   &FMOPTS = '&FMOPTS FMVERS(KDSN) '
 &FSFMSDF = &FMSDF      VPUT (FSFMSDF) PROFILE
 /* Convert prefix member notation xxx* to PDS range notation xxx:xxx */
 &FMMEMSAV = &FMMEMBER
 &FMPFXMEM = TRUNC(&FMMEMBER,'*')    &FMPFXTRL = .TRAIL
 IF (&FMPFXTRL = &Z)                 &FMPFXMBR = '&FMPFXMEM*'
   IF (&FMMEMBER  = &FMPFXMBR)       &FMMEMBER = '&FMPFXMEM:&FMPFXMEM'
 &ZSEL='CMD(%FSFMSCAN &FMOPTS                       +
             FMLIB(&FMLIB) FMMEMBER(''&FMMEMBER'') FMPROC(''&FMPROC'') +
             FMDDNAME(''&FMDDNAME'') FMUSRPRM(''&FMUSRPRM'') +
             FMMANY(''&FMMANY'') FMFINDBP(''&FMFINDBP''))'
)END
