)ATTR
 @ TYPE(INPUT) CAPS(OFF)
)BODY
%-------------------------  IPCS - Subcommand FIND  --------------------
%Command ===>_ZCMD
%
+Operator        %===>_Z +        (=×relational operator)
+Value           %===>@FNDVALUE
+Address         %===>_ADDRESS
+
+BOUNDARY        %===>_BOUNDARY  +(length,index - storage alignment)
+BREAK           %===>_Z  +       (YES×NO - stop at missing address)
+MASK            %===>_FNDMSK
+
+Optional data area description:
+   LENGTH       %===>_LENGTH#
+   POSITIONS    %===>_POSITION
+   Address space%===>_FNDQUAL
+   Attributes   %===>_FNDATTR
+   Array        %===>_FNDARRAY
+
+Notes: See%tutorial+for explanations of parameters.
+      %Value+must be A'...'×C'...'×F'...'×H'...'×P'...'×T'...'×X'...'.
+       Output is affected by settings established by SETDEF DISPLAY,VER
)INIT

 .ZVARS = '(FNDOPER BREAK)'
 .CURSOR = FNDVALUE
 .HELP   = TPCFIND

 IF  (&FNDOPER  = '')  &FNDOPER  = '='
 IF  (&BOUNDARY = '')  &BOUNDARY = '1,1'
 IF  (&BREAK    = '')  &BREAK    = YES
 IF  (&FNDQUAL  = '')  &FNDQUAL  = &QUAL
 &FNDVAL   = &Z
 &FNDADDR  = &Z
 &FNDBOUND = ''
 &FNDLEN   = &Z
 &FNDPOSIT = &Z

)PROC

 &BREAK    = TRANS(TRUNC(&BREAK,1) N,NO Y,YES *,*)

 VER (&FNDOPER ,NONBLANK,LIST,'<','<=','^>','=','>=','^<','>','^='
                               LT, LE , NG , EQ, GE , NL , GT, NE)
 &TEMP = TRUNC(&FNDVALUE,2)  VER (&TEMP,LIST,'a''','A''','c''','C''',
                                             'f''','F''','h''','H''',
                                             'p''','P''','t''','T''',
                                             'x''','X''')
 &TEMP2  = .TRAIL
 IF  (&FNDVALUE ^= '')  &FNDVAL = '&TEMP&QUOTE&TEMP2&QUOTE'
 VER (&BREAK   ,NONBLANK,LIST,NO,YES)
 IF  (&ADDRESS  ^= '')  &FNDADDR  = 'ADDRESS(&ADDRESS)'
 IF  (&BOUNDARY ^= '')  &FNDBOUND = 'BOUNDARY(&BOUNDARY)'
 &FNDBREAK = TRANS(&BREAK  YES,BREAK NO,NOBREAK)
 IF  (&LENGTH#  ^= '')  &FNDLEN   = 'LENGTH(&LENGTH#)'
 IF  (&POSITION ^= '')  &FNDPOSIT = 'POSITIONS(&POSITION)'
 &DATADESC = '&FNDLEN &FNDPOSIT &FNDQUAL &FNDATTR &FNDARRAY'
 &PARM = '&FNDOPER &FNDVAL &FNDADDR &FNDBOUND &FNDBREAK &FNDMASK &DATADE

 &ZSEL = 'PGM(BLSGSCMD) PARM(&PREFIX FIND &PARM &SUFFIX)'

)END
