%-----------------------  IPCS - Subcommand LISTMAP  -------------------
%Command ===>_ZCMD
%
+                          List Storage Map Entries
+
+Optional:
+   Address RANGE%===>_RANGE                       +(address:address)
+   Address space%===>_MAPQUAL                     +(ASID(asid)×see tuto
+
+RESCAN          %===>_Z  +                         (repeat diagnostic m
+VERIFY          %===>_Z  +                         (request dump output
+
+
+Notes: if no address range or address space is specified,
+       all map records for the dump are listed.
+       Output is affected by settings established by SETDEF DISPLAY,VER
)INIT

 .ZVARS  = '(RESCAN VERIFY)'
 .CURSOR = RANGE
 .HELP   = TPCLMAP

 IF  (&MAPQUAL = '')  &MAPQUAL = &QUAL
 IF  (&RESCAN  = '')  &RESCAN = YES
 &VERIFY = TRANS(&DEFVER VERIFY,YES NOVERIFY,NO *,*)

)PROC

 &RESCAN = TRANS(TRUNC(&RESCAN,1) Y,YES N,NO *,*)
 &VERIFY = TRANS(TRUNC(&VERIFY,1) Y,YES N,NO *,*)

 VER (&RESCAN,NONBLANK,LIST,YES,NO)
 VER (&VERIFY,NONBLANK,LIST,YES,NO)

 IF  (&RANGE ^= '')  &MAPRANGE = 'RANGE(&RANGE)'
 &MAPRSCAN = TRANS(&RESCAN YES,RESCAN NO,NORESCAN)
 &MAPVER   = TRANS(&VERIFY YES,VERIFY NO,NOVERIFY)
 &PARM = '&MAPRANGE &MAPQUAL &MAPRSCAN &MAPVER'

 &ZSEL = 'PGM(BLSGSCMD) PARM(&PREFIX LISTMAP &PARM &SUFFIX)'

)END
