%--------------------------  AMDPRDMP - Print Dump  --------------------
%Command ===>_ZCMD
%
+Execute AMDPRDMP %===>_Z     +  (SUBMIT×TSO)
+Verify           %===>_Z  +     (NO×YES - browse/edit control statement
+Line count       %===>_Z +      (58×43×11-80)
+
+Optional parameters:
+   TASK/STEPLIB  %===>_TASKLIB                                       +
+   CVT address   %===>_CVT   +  (hex address×P)
+   SEGTAB address%===>_SEGTAB+  (hex address)
+   TITLE%===>_TITLE
)INIT

 .ZVARS  = '(DMPHOW DMPVER DMPLINES)'
 .CURSOR = DMPHOW
 .HELP   = TPCPRDMP

 IF  (&DMPHOW = '')  &DMPHOW = SUBMIT
 IF  (&DMPVER = '')  &DMPVER = NO
 IF  (&DMPLINES = '') &DMPLINES = 58

)PROC

 &DMPHOW = TRANS(TRUNC(&DMPHOW,1) T,TSO S,SUBMIT *,*)
 &DMPVER = TRANS(TRUNC(&DMPVER,1) N,NO Y,YES *,*)

 VER (&DMPHOW,NONBLANK,LIST,TSO,SUBMIT)
 VER (&DMPVER,NONBLANK,LIST,NO,YES)
 VER (&DMPLINES,NONBLANK,RANGE,11,80)
 VER (&TASKLIB,DSNAME)
 IF  (&CVT ^= P)
     VER (&CVT,HEX)
 VER (&SEGTAB,HEX)

 IF  (&NODE ^= &NODENAME)
     VER (&DMPHOW,LIST,SUBMIT,MSG=IPC009)

 VPUT (DMPHOW DMPVER DMPLINES) PROFILE

)END
