%---------------------  AMDPRDMP - Print Dump EDIT PI  -----------------
%Command ===>_ZCMD
%
+                 GTF PI (Program Interrupt) Trace Records
+
+Specify PI codes in decimal (1-19) - code,code,...:
+     %===>_GTFPI1                                         +
)INIT
 .CURSOR = GTFPI1
 &GTFPI1 = ''
)PROC
 VER (&GTFPI1,NONBLANK)
 VPUT (GTFPI1)
)END
