)ATTR
  _   TYPE(INPUT) INTENS(HIGH) CAPS(ON)  JUST(LEFT) COLOR(TURQ)
  |   TYPE(TEXT)  INTENS(LOW)  CAPS(OFF)            COLOR(TURQ)
  ~   TYPE(TEXT)  INTENS(LOW)  CAPS(OFF)            COLOR(YELLOW)
  +   TYPE(TEXT)  INTENS(LOW)  CAPS(OFF)            COLOR(BLUE)
  #   TYPE(TEXT)  INTENS(high) CAPS(OFF)            COLOR(white)
)BODY
+-------% IBM Advanced Function Printing Font Selection 2-UP Landscape +
%Command ===>_ZCMD

+   Enter Desired Font Selection%===>_PRTCHAR
+
     ~DUMP +DUMP    8-point                   108 characters per line
     ~GS15 +Gothic  8-point                   108 characters per line
     #GT15 +Gothic  8-point                   108 characters per line
     ~ST15 +Serif   8-point                   108 characters per line
     ~D225 +Data1   8-point                    96 characters per line
     ~D226 +Data1   8-point Bold               96 characters per line
     ~D227 +Data1   8-point Italic             95 characters per line

+     Special small fonts
     ~GT20+Gothic   5-point                   144 characters per line
     ~GT24+Gothic   4-point                   193 characters per line
|
|                     ----------------
|         Orientation ×Page-1 Page-2 ×
|                     ----------------
|
|     This is the only font that can be used when printing on an IBM
|     Advanced Function Printing (AFP) Printer in Landscape 2-UP mode
)INIT
  &PRTCHAR = &Z
)PROC
  VER (&PRTCHAR,NONBLANK,LIST,DUMP,GS15,GT15,ST15,D225,D226,D227,GT20,GT
)END
