)ATTR
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /** Rockwell User/Group Menu BUILD Facility:  RMBF "MBF"/BUILD  **/
  /** Michael E. Theys                                            **/
  /** Information Systems Center/SWCC                             **/
  /** Rockwell International                                      **/
  /** 1200 N. Alma Rd.  Bldg 401-109                              **/
  /** Richardson, TEXAS 75081-2205                                **/
  /** (214) 996-2860  COMNET 437-2860                    Oct 1986 **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
               /* 9 8 7 6 5 4 3 2 1 0 <-+-> 0 1 2 3 4 5 6 7 8 9 */
)BODY
%TUTORIAL ----------- SUGGESTION BOX on Menu BUILD Facility ------------
%COMMAND ===>_ZCMD
+
    To forward suggestions on modifications to the Menu Build Facility:

    Send suggestions to:
          Michael E. Theys
          Rockwell International
          ISC - SWCC    M/S 401-109
          1200 N. Alma Rd.
          Richardson, TEXAS 75081-2205

          (214) 996-2860

          Rockwell COMNET 437-2860

    &RMBFTUT


)INIT
  &RMBFTUT = &Z
  IF (&RMBF@VER = SYS,AOST)
    &RMBFTUT = 'Rockwell SYS/ISPF or AOST users can send Message using +
                 TSO/E command:           XMIT SWCC.XTS0008'
)PROC
)END
