)ATTR DEFAULT(`+_)
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /**                                                             **/
  /** User/Group Modifable Primary Option Menu: BUILD             **/
  /**                                                             **/
  /** Michael E. Theys                                            **/
  /** Southwestern Computing Center                               **/
  /** Information Systems Center                                  **/
  /** Rockwell International                                      **/
  /** 1200 N. Alma Rd.  Bldg 401-109                              **/
  /** Richardson, Texas 75081-2205                                **/
  /** (214) 996-2860  COMNET 437-2860                             **/
  /** XMIT Address    SWCC.XTS0008                       Oct 1986 **/
  /**                                                             **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  Ö   TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT)  PADC('_') COLOR(GRE
  ~   TYPE(INPUT) INTENS(HIGH) CAPS(ON)  JUST(LEFT ) PADC('_') COLOR(GRE
  !   TYPE(INPUT) INTENS(HIGH) CAPS(ON)  JUST(LEFT ) PADC('_') COLOR(RED
               /*              Centering Template               */
               /* 9 8 7 6 5 4 3 2 1 0 <-+-> 0 1 2 3 4 5 6 7 8 9 */
)BODY
`-------------------  Options on THE MBF Primary Menu  -----------------
`OPTION ===>_ZCMD
`
`NON-DISPLAYABLE (Hidden) Options for THE MBF Primary Menu:
`
 Opt                Comment
~Z      +       + : ÖRMBFLDA                                   +
+     COMMAND  ===> !RMBFCA
`
~Z      +       + : ÖRMBFLDB                                   +
+     COMMAND  ===> !RMBFCB
`
~Z      +       + : ÖRMBFLDC                                   +
+     COMMAND  ===> !RMBFCC
`
~Z      +       + : ÖRMBFLDD                                   +
+     COMMAND  ===> !RMBFCD
`
~Z      +       + : ÖRMBFLDE                                   +
+     COMMAND  ===> !RMBFCE
`
`
`To DELETE an option, change "Opt" to *.  It will be removed on END.
`
)INIT

 .ZVARS = '(RMBFOA RMBFOB RMBFOC RMBFOD RMBFOE)'
 .CURSOR = ZCMD

)PROC

 &RMBFHOPT = &Z

 IF (&RMBFOA ^= &Z,'*')    VER(&RMBFCA,NB)
   VPUT  (RMBFOA    RMBFLDA RMBFCA) PROFILE    &RMBFHOPT = YES
 IF (&RMBFOB ^= &Z,'*')    VER(&RMBFCB,NB)
   VPUT  (RMBFOB    RMBFLDB RMBFCB) PROFILE    &RMBFHOPT = YES
 IF (&RMBFOC ^= &Z,'*')    VER(&RMBFCC,NB)
   VPUT  (RMBFOC    RMBFLDC RMBFCC) PROFILE    &RMBFHOPT = YES
 IF (&RMBFOD ^= &Z,'*')    VER(&RMBFCD,NB)
   VPUT  (RMBFOD    RMBFLDD RMBFCD) PROFILE    &RMBFHOPT = YES
 IF (&RMBFOE ^= &Z,'*')    VER(&RMBFCE,NB)
   VPUT  (RMBFOE    RMBFLDE RMBFCE) PROFILE    &RMBFHOPT = YES

 IF (&RMBFOA  = '*')
   &RMBFOA = &Z  &RMBFLDA = &Z  &RMBFCA = &Z
   VPUT (RMBFOA,RMBFLDA,RMBFCA) PROFILE
 IF (&RMBFOB  = '*')
   &RMBFOB = &Z  &RMBFLDB = &Z  &RMBFCB = &Z
   VPUT (RMBFOB,RMBFLDB,RMBFCB) PROFILE
 IF (&RMBFOC  = '*')
   &RMBFOC = &Z  &RMBFLDC = &Z  &RMBFCC = &Z
   VPUT (RMBFOC,RMBFLDC,RMBFCC) PROFILE
 IF (&RMBFOD  = '*')
   &RMBFOD = &Z  &RMBFLDD = &Z  &RMBFCD = &Z
   VPUT (RMBFOD,RMBFLDD,RMBFCD) PROFILE
 IF (&RMBFOE  = '*')
   &RMBFOE = &Z  &RMBFLDE = &Z  &RMBFCE = &Z
   VPUT (RMBFOE,RMBFLDE,RMBFCE) PROFILE

 VPUT (RMBFHOPT) PROFILE

 IF (&ZCMD  = ' ')  &LONG  = ' '   &SHORT = ' '   .MSG = SYS010

 &ZSEL = TRANS(TRUNC(&ZCMD,'.')
                    ' ',' '
                    'X','EXIT'
              '&RMBFOA','&RMBFCA'
              '&RMBFOB','&RMBFCB'
              '&RMBFOC','&RMBFCC'
              '&RMBFOD','&RMBFCD'
              '&RMBFOE','&RMBFCE'
                     * ,'?')

 &ZTRAIL = .TRAIL

)END
