)ATTR
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /** Rockwell Menu BUILD Facility: Instant Access Options        **/
  /** Michael E. Theys/ISC SWCC/Rockwell International            **/
  /** (214) 996-2860  COMNET 437-2860 XMIT Address: SWCC.XTS0008  **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
 ^ TYPE(OUTPUT) INTENS(HIGH)
)BODY
%----------------- &$RCTR Instant Access Options for User Menu ---------
%_ZCMD                                                           +Primar

+Instant Access Options are alternate names for menu options.  They may
 be shorter to use or have a more meaningful name. Use like any menu opt

 *======== Use ASIS options ==========* *======= These can take .opts:
+Option    Same As   Option    Same As   Option    Same As   Option    S
%&RUSRFA01+&RUSRFB01%&RUSRFA16+&RUSRFB16%&RUSRPA01+&RUSRPB01%&RUSRPA16+&
%&RUSRFA02+&RUSRFB02%&RUSRFA17+&RUSRFB17%&RUSRPA02+&RUSRPB02%&RUSRPA17+&
%&RUSRFA03+&RUSRFB03%&RUSRFA18+&RUSRFB18%&RUSRPA03+&RUSRPB03%&RUSRPA18+&
%&RUSRFA04+&RUSRFB04%&RUSRFA19+&RUSRFB19%&RUSRPA04+&RUSRPB04%&RUSRPA19+&
%&RUSRFA05+&RUSRFB05%&RUSRFA20+&RUSRFB20%&RUSRPA05+&RUSRPB05%&RUSRPA20+&
%&RUSRFA06+&RUSRFB06%&RUSRFA21+&RUSRFB21%&RUSRPA06+&RUSRPB06%&RUSRPA21+&
%&RUSRFA07+&RUSRFB07%&RUSRFA22+&RUSRFB22%&RUSRPA07+&RUSRPB07%&RUSRPA22+&
%&RUSRFA08+&RUSRFB08%&RUSRFA23+&RUSRFB23%&RUSRPA08+&RUSRPB08%&RUSRPA23+&
%&RUSRFA09+&RUSRFB09%&RUSRFA24+&RUSRFB24%&RUSRPA09+&RUSRPB09%&RUSRPA24+&
%&RUSRFA10+&RUSRFB10%&RUSRFA25+&RUSRFB25%&RUSRPA10+&RUSRPB10%&RUSRPA25+&
%&RUSRFA11+&RUSRFB11%&RUSRFA26+&RUSRFB26%&RUSRPA11+&RUSRPB11%&RUSRPA26+&
%&RUSRFA12+&RUSRFB12%&RUSRFA27+&RUSRFB27%&RUSRPA12+&RUSRPB12%&RUSRPA27+&
%&RUSRFA13+&RUSRFB13%&RUSRFA28+&RUSRFB28%&RUSRPA13+&RUSRPB13%&RUSRPA28+&
%&RUSRFA14+&RUSRFB14%&RUSRFA29+&RUSRFB29%&RUSRPA14+&RUSRPB14%&RUSRPA29+&
%&RUSRFA15+&RUSRFB15%&RUSRFA30+&RUSRFB30%&RUSRPA15+&RUSRPB15%&RUSRPA30+&
+
)INIT
 &$RCTR = &$RCENTER
 .ZVARS = '(RUSRZPRM)'
)PROC
  &ZSEL = TRUNC (&ZCMD,'.')
  &ZTRAIL = .TRAIL
)END
