)ATTR
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /** AOST Master Menu with: BUILD                       Oct 1986 **/
  /** Uses Rockwell Menu BUILD Facility to dynamically add options**/
  /** Michael E. Theys/ISC SWCC/Rockwell International            **/
  /** (214) 996-2860  COMNET 437-2860 XMIT Address: SWCC.XTS0008  **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
 _ TYPE(INPUT)  INTENS(HIGH)              JUST(LEFT)  CAPS(ON)
 \ TYPE(TEXT)   INTENS(HIGH)
 + TYPE(TEXT)   INTENS(LOW)
 | TYPE(TEXT)   INTENS(HIGH)
 ~ TYPE(TEXT)   INTENS(LOW)
 ` TYPE(TEXT)   INTENS(LOW)
 { TYPE(OUTPUT) INTENS(LOW)               JUST(LEFT)  CAPS(OFF)
 } TYPE(OUTPUT) INTENS(LOW)               JUST(LEFT)  CAPS(ON)
 @ TYPE(OUTPUT) INTENS(LOW)               JUST(ASIS)
 Ö TYPE(OUTPUT) INTENS(HIGH)              JUST(RIGHT) CAPS(ON)
)BODY
|&Z$SYS%----------------\  AOST Master Application Menu  %-------------|
%OPTION ===>_ZCMD
%                                                           +Userid   -~
%  0+ PARMS       -`Specify ISPF parameters/defaults        +Prefix   -~
%  1+ ISPF/PDF    -`ISPF/Program Development Facility &IVER +Date     -~
%  2+ AOST        -`OS and T Utilities Menu                 +Julian   -~
%  3+ SYSTEM      -`Systems Programmers Primary Menu        +Time     -~
%  4+ FLIST       -`Dataset Full List Processing            +Terminal -~
%  5+ ROCKWELL    -`Rockwell Primary Option Menu            +PF Keys  -~
%  6+ INFO CENTER -`Rockwell Information Center Services    +Proc     -~
%  7+ AOST NEWS   -`AOST System News Facility               +Applid   -~
%  8+ ROCK NEWS   -`Rockwell TSO User News                  +Cpu/MVS  -~
%  9+ FEEDBACK    -`Provide Feedback to AOST support        +&Z$SYSC   _
%  A+ ADMIN GROUP -`Administration Application for Group    +&RPRMMSB1
%  U+ USER        -`User Application                        +&RPRMMSB2
%ÖZ +}RPRMSD1    }Z{RPRMLD1                                 +&RPRMMSB3
%ÖZ +}RPRMSD2    }Z{RPRMLD2                                 +&RPRMMSB4
%ÖZ +}RPRMSD3    }Z{RPRMLD3                                 +&RPRMMSB5
%ÖZ +}RPRMSD4    }Z{RPRMLD4                                 +&RPRMMSB6
%ÖZ +}RPRMSD5    }Z{RPRMLD5                                 +&RPRMMSB7
%  X+ EXIT        -`Terminate using list/log defaults       +&RPRMMSB8
+Enter%END+command to terminate AOST        %&RMBFISCN
%&RMBFAOST                                  %&RMBFUSRN
%
)INIT

  &IVER = TRUNC(&ZENVIR,5)  &IVER=.TRAIL  &IVER=TRUNC(&IVER,3)
  .CURSOR = ZCMD   .HELP   = $UMSTR    &ZPRIM  = YES

  IF (&ZOSTINIT = YES)
    IF (&Z$SAVE ^= &Z)
      &ZCMD   = &Z$SAVE
      &Z$SAVE = &Z
  IF (&ZOSTINIT = &Z)
    &Z$SAVE   = &ZCMD
    &ZCMD     = 'FIRST'
    .RESP     = ENTER
    &ZOSTINIT = YES

  &RMBFPOOL = 'PRM'      &RMBFMAXM = 5      VPUT (RMBFPOOL,RMBFMAXM)
  &RMBF@PNL = 'AOSTMSTR' &RMBF@VER = 'AOST'

  .ZVARS='(RPRMO1 RPRMD1 RPRMO2 RPRMD2 RPRMO3 RPRMD3 +
           RPRMO4 RPRMD4 RPRMO5 RPRMD5)'

  /* Convert old AOST modifiable menu options to new MBF/BUILD format */
  IF (&RPRMSEEN ^= YES)    IF (&RMBFCONV ^= YES)   IF (&RPRMMOPT ^= YES)
    IF (&Z$B ^= &Z) /* Old AOST modifiable menu options */
      &RPRMO1=B &RPRMSD1='&Z$B' &RPRMLD1='&Z$BD' &RPRMC1='&Z$BC NEWAPPL(
      &RPRMO2=C &RPRMSD2='&Z$C' &RPRMLD2='&Z$CD' &RPRMC2='&Z$CC NEWAPPL(
      &RPRMO3=D &RPRMSD3='&Z$D' &RPRMLD3='&Z$DD' &RPRMC3='&Z$DC NEWAPPL(
      &RPRMO4=E &RPRMSD4='&Z$E' &RPRMLD4='&Z$ED' &RPRMC4='&Z$EC NEWAPPL(
      &RPRMMOPT = YES      VPUT (RPRMMOPT) PROFILE
      VPUT (RPRMO1,RPRMSD1,RPRMLD1,RPRMC1) PROFILE
      VPUT (RPRMO2,RPRMSD2,RPRMLD2,RPRMC2) PROFILE
      VPUT (RPRMO3,RPRMSD3,RPRMLD3,RPRMC3) PROFILE
      VPUT (RPRMO4,RPRMSD4,RPRMLD4,RPRMC4) PROFILE

  &RPRMD1 = &Z  &RPRMD2 = &Z  &RPRMD3 = &Z  &RPRMD4 = &Z  &RPRMD5 = &Z
  IF (&RPRMLD1 ^= &Z) &RPRMD1 = '-'
  IF (&RPRMLD2 ^= &Z) &RPRMD2 = '-'
  IF (&RPRMLD3 ^= &Z) &RPRMD3 = '-'
  IF (&RPRMLD4 ^= &Z) &RPRMD4 = '-'
  IF (&RPRMLD5 ^= &Z) &RPRMD5 = '-'

  /* See if color menu desired. If color get color palette number */
  IF (&ZCOLORS ^= '0007') &Z$SYSC = &Z   &Z$PRMCLR = &Z
  IF (&ZCOLORS  = '0007') &Z$SYSC = 'Color?   -'
    IF (&Z$PRMCLR ^= YES,NO)  &Z$PRMCLR = YES
    IF (&Z$PRMCLR = YES)
      IF (&ZKOLORS   = &Z) /* Set default color palettes */
        &ZKOLOR0  = WYGTBGBGTT* &ZKOLOR1  = RTGYGBGBWW* &ZKOLOR2  = BYYT
        &ZKOLOR3  = BRWBWTWTWW* &ZKOLOR4  = PGRPRYRYWW* &ZKOLOR5  = TBGT
        &ZKOLOR6  = YPBYBRBRWW* &ZKOLOR7  = WTPWPGPGWW* &ZKOLOR8  = GWYG
        &ZKOLOR9  = WPTGTYTYWW* &ZKOLOR10 = WPTTRGRGTTY &ZKOLOR11 = BYYT
        &ZKOLOR12 = TYGBBGBGTTW &ZKOLOR13 = GWYGGPGPWWY &ZKOLOR14 = WRTG
        &ZKOLOR15 = GGGGGGGGGGW &ZKOLOR16 = RRRRRRRRRRG &ZKOLOR17 = BBBB
        &ZKOLOR18 = WWWWWWWWWWR &ZKOLOR19 = PPPPPPPPPPY &ZKOLOR20 = TTTT
        &ZKOLOR21 = YYYYYYYYYYG &ZKOLOR22 = RWBWWBWBRRW &ZKOLOR23 = ****
      IF (&Z$PRMROT = YES) &Z$PRMHUE=TRANS(&Z$PRMHUE 0,1 1,2 2,3 3,4 4,5
         6,7 7,8 8,9 9,10 10,11 11,12 12,13 13,14 14,15 15,16 16,17 17,1
         19,20 20,21 21,22 22,23 23,0 *,1)
        IF (&Z$PRMHUE ^= 1)           &Z$SYSC = 'Color&Z$PRMHUE?  -'
      &ZPALETTE = TRANS(&Z$PRMHUE
          0,&ZKOLOR0   1,&ZKOLOR1   2,&ZKOLOR2   3,&ZKOLOR3   4,&ZKOLOR4
          5,&ZKOLOR5   6,&ZKOLOR6   7,&ZKOLOR7   8,&ZKOLOR8   9,&ZKOLOR9
         10,&ZKOLOR10 11,&ZKOLOR11 12,&ZKOLOR12 13,&ZKOLOR13 14,&ZKOLOR1
         15,&ZKOLOR15 16,&ZKOLOR16 17,&ZKOLOR17 18,&ZKOLOR18 19,&ZKOLOR1
         20,&ZKOLOR20 21,&ZKOLOR21 22,&ZKOLOR22 23,&ZKOLOR23  *,&Z
      IF (&ZPALETTE = &Z) &ZPALETTE = WYGTBGBGTTW  &Z$PRMHUE = 0
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(_) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(|) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(\) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(~) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(+) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(`) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(}) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR({) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(Ö) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z) &ZPALETTE = .TRAIL .ATTRCHAR(%) = 'COLOR(
      &ZKR=TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
           P,PINK T,TURQ *,&Z)  IF (&ZKR ^= &Z)  .ATTR(ZCMD)  = 'COLOR(&

  IF (&RPRMSEEN = &Z)  &RMBFAOST = 'Use option BUILD to define options.'
  /* Monogram the panel - Can be preset in %RMBF@OST */
  IF (&RMBFNAME = &Z,'SYS/ISPF','--------')  &RMBFNAME = '{AOST}'
  &RMBFMNG = &RMBFNAME

  /* Show Time in AM/PM format  <M.Theys> */
  &ZROC@HR = TRUNC(&ZTIME,':')  &ZROC@MM = .TRAIL
  &ZROC@PM = TRANS(&ZROC@HR 12,PM 13,PM 14,PM 15,PM 16,PM 17,PM 18,PM
                            19,PM 20,PM 21,PM 22,PM 23,PM  *,AM)
  &ZROC@HH = TRANS(&ZROC@HR 13,1 14,2 15,3 16,4  17,5  18,6
                            19,7 20,8 21,9 22,10 23,11 24,12 00,12
                            01,1 02,2 03,3 04,4  05,5  06,6
                            07,7 08,8 09,9 *,*)
  &ZTIMEPM = '&ZROC@HH:&ZROC@MM &ZROC@PM'
  IF (&ZTIMEPM = '12:00 PM') &ZTIMEPM = '12 NOON'
  IF (&ZTIMEPM = '12:00 AM') &ZTIMEPM = 'MIDNIGHT'

)PROC

  IF (&ZCOLORS = '0007')
    &Z$PRMCLR = TRUNC(&Z$PRMCLR,'.')
    IF (.TRAIL  = R)    &Z$PRMROT = YES      &Z$PRMHUE = 0
    IF (.TRAIL ^= R,&Z) &Z$PRMHUE = .TRAIL   &Z$PRMROT = NO
    &Z$PRMCLR=TRANS(TRUNC(&Z$PRMCLR,1) Y,YES N,NO D,DEFINE *,*)
    IF (&Z$PRMCLR ^= NO,YES,DEFINE)
      &SHORT='NO, YES or DEFINE'
      &LONG='NO:none, YES×YES.n:multi-color (n=0-23,R), +
             DEFINE:create palettes'        .MSG = SYS010
    IF (&Z$PRMCLR  = NO)   &Z$PRMROT = NO
    VPUT (Z$PRMCLR,Z$PRMHUE,Z$PRMROT) PROFILE

  IF (&RPRMTRNS = YES)

    /* User/Group Full Alias    Option Translate. Ex: EZOUT to R.P.1 */
    &ZCMD = TRANS( &ZCMD
      '&RPRMFA01','&RPRMFB01'  '&RPRMFA02','&RPRMFB02'  '&RPRMFA03','&RP
      '&RPRMFA04','&RPRMFB04'  '&RPRMFA05','&RPRMFB05'  '&RPRMFA06','&RP
      '&RPRMFA07','&RPRMFB07'  '&RPRMFA08','&RPRMFB08'  '&RPRMFA09','&RP
      '&RPRMFA10','&RPRMFB10'  '&RPRMFA11','&RPRMFB11'  '&RPRMFA12','&RP
      '&RPRMFA13','&RPRMFB13'  '&RPRMFA14','&RPRMFB14'  '&RPRMFA15','&RP
      '&RPRMFA16','&RPRMFB16'  '&RPRMFA17','&RPRMFB17'  '&RPRMFA18','&RP
      '&RPRMFA19','&RPRMFB19'  '&RPRMFA20','&RPRMFB20'  '&RPRMFA21','&RP
      '&RPRMFA22','&RPRMFB22'  '&RPRMFA23','&RPRMFB23'  '&RPRMFA24','&RP
      '&RPRMFA25','&RPRMFB25'  '&RPRMFA26','&RPRMFB26'  '&RPRMFA27','&RP
      '&RPRMFA28','&RPRMFB28'  '&RPRMFA29','&RPRMFB29'  '&RPRMFA30','&RP
               *,*)

    /* User/Group Partial Alias Option Translate. Ex: ASM2.? to R.S.A.?
    &RPRMZCMD = TRANS( TRUNC(&ZCMD,'.')
      '&RPRMPA01','&RPRMPB01'  '&RPRMPA02','&RPRMPB02'  '&RPRMPA03','&RP
      '&RPRMPA04','&RPRMPB04'  '&RPRMPA05','&RPRMPB05'  '&RPRMPA06','&RP
      '&RPRMPA07','&RPRMPB07'  '&RPRMPA08','&RPRMPB08'  '&RPRMPA09','&RP
      '&RPRMPA10','&RPRMPB10'  '&RPRMPA11','&RPRMPB11'  '&RPRMPA12','&RP
      '&RPRMPA13','&RPRMPB13'  '&RPRMPA14','&RPRMPB14'  '&RPRMPA15','&RP
      '&RPRMPA16','&RPRMPB16'  '&RPRMPA17','&RPRMPB17'  '&RPRMPA18','&RP
      '&RPRMPA19','&RPRMPB19'  '&RPRMPA20','&RPRMPB20'  '&RPRMPA21','&RP
      '&RPRMPA22','&RPRMPB22'  '&RPRMPA23','&RPRMPB23'  '&RPRMPA24','&RP
      '&RPRMPA25','&RPRMPB25'  '&RPRMPA26','&RPRMPB26'  '&RPRMPA27','&RP
      '&RPRMPA28','&RPRMPB28'  '&RPRMPA29','&RPRMPB29'  '&RPRMPA30','&RP
                *,'RPRMDMY')
    &RPRMTRAL = .TRAIL            /* Rebuild new translated command: */
    IF (&RPRMTRAL ^= &Z)          &RPRMTRAL = '.&RPRMTRAL'
    IF (&RPRMZCMD ^= 'RPRMDMY')   &ZCMD = '&RPRMZCMD.&RPRMTRAL'

  &RMBFPOOL = 'PRM'      &RMBFMAXM = 5    VPUT (RMBFPOOL,RMBFMAXM)
  &RMBF@PNL = 'AOSTMSTR' &RMBF@VER = 'AOST' /* Mainly for BUILD Demos */

  &RMBF@OST = &Z
  IF (&RPRMDOIT  = YES) &RMBF@OST = 'PARM(CMD(%RMBF@OST))'
  IF (&RMBFXMIT  = YES) &RMBF@OST = 'PARM(CMD(%RMBFAOST))'
  IF (&RMBFNOTE ^= NO)  &RMBF@OST = 'PARM(CMD(%RMBFAOST))'
  /* %RMBFAOST calls: %RMBF@OST, %RMBFRECV, %RMBFRSN   */

  IF (&ZCMD = &Z)  IF (&Z$PRMCLR = DEFINE)  &ZCMD = RMBFZKLR
  &ZSEL = TRANS(TRUNC(&ZCMD,'.')
               0 ,'PANEL(ISPOPTA)  NEWPOOL'        /* ISPF Options   */
               1 ,'PANEL(ISR@PRIM) NEWAPPL(ISR)'   /* ISPF/PDF       */
               2 ,'PANEL(AOSTPRIM) NEWAPPL(AOST)'  /* OST Menu*/
               3 ,'PANEL(SYS@PRIM) NEWAPPL(ISR)'   /* SYS Menu       */
               4 ,'PANEL(ISPFLIST) NEWAPPL(ISR)'   /* FULLLIST       */
               5 ,'PANEL(ROC@PRIM) NEWAPPL(ISR)'   /* ROCKWELL       */
               6 ,'PANEL(RINFPRIM) NEWAPPL(ISR)'   /* Info Center    */
               7 ,'CMD(%ANEWS)'                    /* AOST News      */
               8 ,'PANEL(RCQCNM01) NEWAPPL(ISR)'   /* Rockwell News  */
               9 ,'CMD(%FEEDBACK) NEWAPPL(XMIT)'   /* AOST Feedback  */
               A ,'CMD(%ROCADMIN) NOCHECK'         /* Group Admin    */
               U ,'CMD(%ROCUSER)  NOCHECK'         /* User Appl      */
            FIRST,'PGM(SPFVINIT) &RMBF@OST'        /* AOST Var Inits */
            BUILD,'PANEL(RMBFMENU)'                /* Modify Menu    */
         RMBFZKLR,'PANEL(RMBFZKLR)'                /* Modify Menu    */
                X,'EXIT'
              ' ',' '
        '&RPRMO1','&RPRMC1' /* Primary Option for User/Group Use. */
        '&RPRMO2','&RPRMC2' /* Primary Option for User/Group Use. */
        '&RPRMO3','&RPRMC3' /* Primary Option for User/Group Use. */
        '&RPRMO4','&RPRMC4' /* Primary Option for User/Group Use. */
        '&RPRMO5','&RPRMC5' /* Primary Option for User/Group Use. */
        '&RPRMOA','&RPRMCA' /* Non Display Option  for User/Group Startu
        '&RPRMOB','&RPRMCB' /* Non Display Option  for User/Group Startu
        '&RPRMOC','&RPRMCC' /* Non Display Option  for User/Group Startu
        '&RPRMOD','&RPRMCD' /* Non Display Option  for User/Group Startu
        '&RPRMOE','&RPRMCE' /* Non Display Option  for User/Group Startu
        /* Old AOST Option Naming Convention */
              A1 ,'CMD(%ROCUSER)  NOCHECK'         /* User Appl      */
               T ,'PANEL(ROC1NEWS) '               /* Rockwell News  */
               N ,'CMD(%ANEWS)'                    /* AOST News      */
               P ,'PANEL(ISPOPTA)  NEWPOOL'        /* ISPF Options   */
               I ,'PANEL(RINFPRIM) NEWAPPL(ISR)'   /* Info Center    */
               F ,'PGM(FEEDBACK)'                  /* AOST Feedback  */
               J ,'PANEL(JES3)     NEWAPPL(AOST)'  /* JES3 Menu      */
                *,'?' )

  &ZTRAIL = .TRAIL

  &RPRMMENU = '&RPRMMOPT&RPRMHOPT'
  IF (&RPRMMENU ^= &Z)    &RPRMMENU = &Z
    &RPRMZTRL = &ZTRAIL   /* Save the ZTRAIL */
    /* See if the ISPF Command was defined with a "~"              */
    /* "~" tells BUILD that a ZTRAIL option needs to be inserted.  */
    &RPRMZSL1 = TRUNC (&ZSEL,'~')  &RPRMZSL2 = .TRAIL
    &RPRMZSL  = '&RPRMZSL1&RPRMZSL2'
    IF (&RPRMZSL ^= &ZSEL)  /* Then we had a '~' in ISPF Command   */
       /* Now put ZSEL back together with ZTRAIL (even if empty)   */
       &ZSEL = '&RPRMZSL1&RPRMZTRL&RPRMZSL2'
    /* Reset original ZCMD ZTRAIL value for next panel. */
    &ZTRAIL =  &RPRMZTRL

)END
