)ATTR
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /**                                                             **/
  /** User/Group Modifable Primary Option Menu: BUILD             **/
  /**                                                             **/
  /** Michael E. Theys                                            **/
  /** Southwestern Computing Center                               **/
  /** Information Systems Center                                  **/
  /** Rockwell International                                      **/
  /** 1200 N. Alma Rd.  Bldg 401-109                              **/
  /** Richardson, Texas 75081-2205                                **/
  /** (214) 996-2860  COMNET 437-2860                             **/
  /** XMIT Address    SWCC.XTS0008                       Oct 1986 **/
  /**                                                             **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  `  TYPE(OUTPUT) INTENS(low)  CAPS(ON)
  Ö  TYPE(OUTPUT) INTENS(high) CAPS(ON) color(yellow)
  !  TYPE(INPUT)  INTENS(HIGH) CAPS(ON)  PAD('_')
  {  TYPE(OUTPUT) INTENS(low)  CAPS(OFF)
  _  TYPE(INPUT)  INTENS(HIGH)
               /*              Centering Template               */
               /* 9 8 7 6 5 4 3 2 1 0 <-+-> 0 1 2 3 4 5 6 7 8 9 */
)BODY
%-------------------  Define an ISPF Command for your option  ----------
%COMMAND ===>_ZCMD
%
+Invoke Selection Menu:
+PANEL  %===>_RMBFZPN +     OPT  %===>_RMBFZPO
+
+Invoke Command:
+CMD    %===>_RMBFZCM
+
+Invoke Program:
+PGM    %===>_RMBFZMN +     PARM %===>_RMBFZMP
+                                                               +
+NOCHECK%===>_Z  +
+NEWAPPL%===>_Z  +          ID   %===>_Z   +
+NEWPOOL%===>_Z  +
+
+-- You have -- OK?_Z+
+Menu Type/Pos:`Z  +
+Your Menu Opt:`Z      +
+Short Name:   `Z          +
+Description:  {Z                                         +
+ISPF Command: ÖZ
+
)INIT
.HELP  = RMBFT121
.ZVARS = '(RMBFNOCK +
           RMBFZAP RMBFZID RMBFZNP +
           RMBFISOK +
           RMBFMTP RMBFMO RMBFMS RMBFML RMBFMC)'

IF (&RMBFZAP = &Z)  &RMBFZAP = NO  &RMBFZID = &Z
IF (&RMBFZNP = &Z)  &RMBFZNP = NO
IF (&RMBFNOCK= &Z)  &RMBFNOCK= NO

&RMBFISOK= N
&RMBFIMSG = &Z

IF (&RMBFMC  = '?',&Z)
  .CURSOR = RMBFZPN
IF (&RMBFMC ^= '?',&Z)
  .CURSOR = RMBFISOK

)REINIT

REFRESH(RMBFMC,RMBFISOK)
REFRESH(RMBFZPN,RMBFZPO,RMBFZCM,RMBFZMN,RMBFZMP,RMBFZAP,RMBFZID,RMBFZNP)

)PROC

&RMBFMC = &Z   &SHORT = &Z   &LONG = &Z    &RMBFIMSG = &Z

IF (&RMBFZPN ^= &Z)
  VER(&RMBFZPN,NAME)
  &RMBFMC = 'PANEL(&RMBFZPN)'
  IF (&RMBFZPO ^= &Z)  &RMBFMC = '&RMBFMC OPT(&RMBFZPO)'
  IF (&RMBFZCM ^= &Z)  &RMBFIMSG = ONLYONE  .CURSOR = RMBFZCM
  IF (&RMBFZMN ^= &Z)  &RMBFIMSG = ONLYONE  .CURSOR = RMBFZMN

IF (&RMBFZCM ^= &Z)
  &RMBFNOCK = TRANS(TRUNC(&RMBFNOCK,1) Y,YES N,NO *,*)
  VER (&RMBFNOCK,NB,LIST,YES,NO)
  &RMBFMC = 'CMD(&RMBFZCM)'
  IF (&RMBFNOCK = YES) &RMBFMC = '&RMBFMC NOCHECK'
  IF (&RMBFZPN ^= &Z)  &RMBFIMSG = ONLYONE  .CURSOR = RMBFZPN
  IF (&RMBFZMN ^= &Z)  &RMBFIMSG = ONLYONE  .CURSOR = RMBFZMN

IF (&RMBFZMN ^= &Z)
  VER(&RMBFZMN,NAME)
  &RMBFNOCK = TRANS(TRUNC(&RMBFNOCK,1) Y,YES N,NO *,*)
  VER (&RMBFNOCK,NB,LIST,YES,NO)
  &RMBFMC = 'PGM(&RMBFZMN)'
  IF (&RMBFZMP ^= &Z)  &RMBFMC = '&RMBFMC PARM(&RMBFZMP)'
  IF (&RMBFNOCK = YES) &RMBFMC = '&RMBFMC NOCHECK'
  IF (&RMBFZPN ^= &Z)  &RMBFIMSG = ONLYONE  .CURSOR = RMBFZPN
  IF (&RMBFZCM ^= &Z)  &RMBFIMSG = ONLYONE  .CURSOR = RMBFZCM

&RMBFJUNK = '&RMBFZPN&RMBFZCM&RMBFZMN'
IF (&RMBFJUNK = &Z)        &RMBFIMSG = NEEDFUNC

IF (&RMBFMC = '?',&Z,' ')  &RMBFIMSG = NEEDFUNC


&RMBFZAP = TRANS(TRUNC(&RMBFZAP,1) Y,YES N,NO *,*)
VER (&RMBFZAP,NB,LIST,YES,NO)
IF (&RMBFZAP = YES)
  IF (&RMBFZID  = &Z)  &RMBFMC = '&RMBFMC NEWAPPL'
  IF (&RMBFZID ^= &Z)  &RMBFMC = '&RMBFMC NEWAPPL(&RMBFZID)'

&RMBFZNP = TRANS(TRUNC(&RMBFZNP,1) Y,YES N,NO *,*)
VER (&RMBFZNP,NB,LIST,YES,NO)
IF (&RMBFZNP = YES)    &RMBFMC = '&RMBFMC NEWPOOL'

IF (&RMBFIMSG  = &Z)
  VER(&RMBFISOK,NB,LIST,Y,N)
  IF (&RMBFISOK = N)
    .CURSOR = RMBFISOK
    &SHORT='To save, Set OK? to Y!'
    &LONG ='The option will be updated with your ISPF command when OK? i
    .MSG = SYS010
  IF (&RMBFISOK = Y)
    VPUT (RMBFMC)
IF (&RMBFIMSG ^= &Z)
  IF (&RMBFIMSG = NEEDFUNC)
    &SHORT='Enter Function Name!'
    &LONG='The name of a PANEL, COMMAND, or PROGRAM must be entered.'
    .CURSOR = RMBFZPN   .HELP = ISR7F100  .MSG = SYS010
  IF (&RMBFIMSG = ONLYONE)
      &SHORT='Enter ONE name only!'    .HELP = ISR7F100
      &LONG='More then one name was entered for a panel, command, or pro
      .MSG = SYS010

)END
