)ATTR
% TYPE(TEXT)   INTENS(LOW)  COLOR(&WROKC1)                       /* BLUE
+ TYPE(TEXT)   INTENS(LOW)  COLOR(&WROKC2)                       /* GREE
! TYPE(TEXT)   INTENS(HIGH) COLOR(&WROKC3)                       /* GREE
} TYPE(OUTPUT) INTENS(HIGH) COLOR(&WROKC3) JUST(RIGHT) CAPS(OFF) /* GREE
{ TYPE(OUTPUT) INTENS(HIGH) COLOR(&WROKC3) JUST(LEFT)  CAPS(OFF) /* GREE
# TYPE(TEXT)   INTENS(HIGH) COLOR(&WROKC4)                       /* TURQ
)BODY WIDTH(&ZSCREENW) EXPAND(||)
%************************************|*|********************************
%**+_ZCMD                            | |
%**#                         | |****  **  ****| |          +Userid - &ZU
%**#                     | |********  **  ********| |      +Date   - &ZD
%**#                  | |***********  **  ***********| |   +Time   - &ZT
%**#                | |*************  **  *************| |
%**#               | |**************  **  **************| |
%**!Welcome #     | |***************  **  ***************| |}ROCWCTR1
%**!to      #    | |****************  **  ****************| |}ROCWCTR2
%**{ROCWVER #    | |****************  **  ****************| |}ROCWCTR3
%**#             | |*************     **     *************| |
%**#              | |********       ******       ********| |
%**#               | |****        **********        ****| |
%**#                | |*        **************        *| |
%**#                       | |******************| |
%**#                      | |********************| |
%**#                         | |**************| |
%**+                                  | |
%**%                     | | @@@   @@@   @@@@ @@@@@| |
%**%                     | |@   @ @   @ @       @  | |
%**%                     | |@@@@@ @   @ @@@@@   @  | |
%**%                     | |@   @ @   @     @   @  | |
%**%                     | |@   @  @@@  @@@@    @  | |
%**+                                  | |
%**+       | |Please wait for startup initializations to complete.| |
%**+                                  | |
%*************************************|*|*******************************
)INIT

.CURSOR = ZCMD
&ZCMD   = &Z
&RCTR = &$RCENTER

&ZROC@HR = TRUNC(&ZTIME,':')  &ZROC@MM = .TRAIL
&ZROC@PM = TRANS(&ZROC@HR 12,PM 13,PM 14,PM 15,PM 16,PM 17,PM 18,PM
                          19,PM 20,PM 21,PM 22,PM 23,PM  *,AM)
&ZROC@HH = TRANS(&ZROC@HR 13,1 14,2 15,3 16,4  17,5  18,6
                          19,7 20,8 21,9 22,10 23,11 24,12 00,12
                          01,1 02,2 03,3 04,4  05,5  06,6
                          07,7 08,8 09,9 *,*)
&ZTIMEPM = '&ZROC@HH:&ZROC@MM &ZROC@PM'
IF (&ZTIMEPM = '12:00 PM') &ZTIMEPM = '12 NOON'
IF (&ZTIMEPM = '12:00 AM') &ZTIMEPM = 'MIDNIGHT'

&ROCWVER = TRANS(&RMBF@VER AOST,AOST SYS,'SYS/ISPF' ISC,'ISC/ISPF' *,Roc
&ROCWVER = 'Rockwell'

IF (&RCTR = CGAD)
  &ROCWCTR1 = 'Collins Government'
  &ROCWCTR2 = 'Avionics Division'
  &ROCWCTR3 = 'Computing Center'

IF (&RCTR = MCC,CRCS)
  &ROCWCTR1 = 'Cedar Rapids'
  &ROCWCTR2 = 'Computing'
  &ROCWCTR3 = 'Satellite'

IF (&RCTR ^= CGAD,MCC,CRCS)
  &ROCWCTR  = TRUNC(&RCTR,3)  &ROCWCTRN = .TRAIL
  &ROCWCTR1 = TRANS(&ROCWCTR SWC,SouthWestern WCC,Western *,' ')
  &ROCWCTR2 = 'Computing'
  &ROCWCTR3 = 'Center'
  IF (&ROCWCTRN ^= &Z,'C','1') &ROCWCTR3 = '&ROCWCTR3 &ROCWCTRN'

IF (&ZCOLORS = '0007')
  IF (&RMBF@VER  = &Z,ROCK)
      &WROKC1=BLUE   &WROKC2=WHITE  &WROKC3=GREEN  &WROKC4=TURQ
  IF (&RMBF@VER ^= &Z,ROCK)
    &RMBFWROK=TRANS(&RMBFWROK
      0,1   1,2   2,3   3,4   4,5   5,6   6,7   7,8   8,9   9,10 10,11 1
     12,13 13,14 14,15 15,16 16,17 17,18 18,19 19,20 20,21 21,22 22,23 2
     24,25 25,26 26,27 27,28  *,0)        VPUT RMBFWROK PROFILE
    /* Set the color palettes used */     &WROKCS0  = 'BWGT'
    &WROKCS1  = 'BGYT' &WROKCS2  = 'BYGT' &WROKCS3  = 'TYGB' &WROKCS4  =
    &WROKCS5  = 'RTBP' &WROKCS6  = 'RBTP' &WROKCS7  = 'PTBR' &WROKCS8  =
    &WROKCS9  = 'GBTY' &WROKCS10 = 'GTBY' &WROKCS11 = 'YBTG' &WROKCS12 =
    &WROKCS13 = 'TRPB' &WROKCS14 = 'BRPT' &WROKCS15 = 'TPRB' &WROKCS16 =
    &WROKCS17 = 'GRPY' &WROKCS18 = 'GPRY' &WROKCS19 = 'YPRG' &WROKCS20 =
    &WROKCS21 = 'RGYP' &WROKCS22 = 'RYGP' &WROKCS23 = 'PGYR' &WROKCS24 =
    &WROKCS25 = 'WYGT' &WROKCS26 = 'WRTP' &WROKCS27 = 'GRYW' &WROKCS28 =
    &ZPALETTE = TRANS(&RMBFWROK
      0,&WROKCS0   1,&WROKCS1   2,&WROKCS2   3,&WROKCS3   4,&WROKCS4
      5,&WROKCS5   6,&WROKCS6   7,&WROKCS7   8,&WROKCS8   9,&WROKCS9
     10,&WROKCS10 11,&WROKCS11 12,&WROKCS12 13,&WROKCS13 14,&WROKCS14
     15,&WROKCS15 16,&WROKCS16 17,&WROKCS17 18,&WROKCS18 19,&WROKCS19
     20,&WROKCS20 21,&WROKCS21 22,&WROKCS22 23,&WROKCS23 24,&WROKCS24
     25,&WROKCS25 26,&WROKCS26 27,&WROKCS27 28,&WROKCS28  *,&Z)
    IF (&ZPALETTE = &Z) &ZPALETTE = BWGT  &RMBFWROK = 0
    &ZKR = TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
         P,PINK T,TURQ *,&Z)  &WROKC1 = &ZKR  &ZPALETTE = .TRAIL
    &ZKR = TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
         P,PINK T,TURQ *,&Z)  &WROKC2 = &ZKR  &ZPALETTE = .TRAIL
    &ZKR = TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
         P,PINK T,TURQ *,&Z)  &WROKC3 = &ZKR  &ZPALETTE = .TRAIL
    &ZKR = TRANS(TRUNC(&ZPALETTE,1) W,WHITE G,GREEN R,RED B,BLUE Y,YELLO
         P,PINK T,TURQ *,&Z)  &WROKC4 = &ZKR
IF (&ZCOLORS ^= '0007')
      &WROKC1=&Z     &WROKC2=&Z     &WROKC3=&Z     &WROKC4=&Z
)PROC
)END
