)ATTR DEFAULT(`+_)
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /**                                                             **/
  /** User/Group Modifable Primary Option Menu: BUILD             **/
  /**                                                             **/
  /** Michael E. Theys                                            **/
  /** Southwestern Computing Center                               **/
  /** Information Systems Center                                  **/
  /** Rockwell International                                      **/
  /** 1200 N. Alma Rd.  Bldg 401-109                              **/
  /** Richardson, Texas 75081-2205                                **/
  /** (214) 996-2860  COMNET 437-2860                             **/
  /** XMIT Address    SWCC.XTS0008                       Oct 1986 **/
  /**                                                             **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  Ö   TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(LEFT)  PADC('_') COLOR(GRE
  ~   TYPE(INPUT) INTENS(HIGH) CAPS(ON)  JUST(LEFT ) PADC('_') COLOR(GRE
  !   TYPE(INPUT) INTENS(HIGH) CAPS(ON)  JUST(LEFT ) PADC('_') COLOR(RED
  @   AREA(DYNAMIC) SCROLL(ON)
)BODY
`--------------  Options on GROUP Primary Menu  (4 of 6)  --------------
`OPTION ===>_ZCMD
`
`MENU Options on Group Primary Option Menu:    +{Use Scroll PF Keys to P
`                                           +{UP=p3,DOWN=p5,LEFT=1st,RIG
 Opt  Name           Description
~Z + ~RGRPSD19   +- ÖRGRPLD19                                  +
+19   COMMAND  ===> !RGRPC19
`
~Z + ~RGRPSD20   +- ÖRGRPLD20                                  +
+20   COMMAND  ===> !RGRPC20
`
~Z + ~RGRPSD21   +- ÖRGRPLD21                                  +
+21   COMMAND  ===> !RGRPC21
`
~Z + ~RGRPSD22   +- ÖRGRPLD22                                  +
+22   COMMAND  ===> !RGRPC22
`
~Z + ~RGRPSD23   +- ÖRGRPLD23                                  +
+23   COMMAND  ===> !RGRPC23
`
~Z + ~RGRPSD24   +- ÖRGRPLD24                                  +
+24   COMMAND  ===> !RGRPC24
`To DELETE an option, change "Opt" to *.  It will be removed on END.   @
)INIT

 .ZVARS = '(RGRPO19 RGRPO20 RGRPO21 RGRPO22  RGRPO23  RGRPO24)'
 .CURSOR = ZCMD

 &DYNAM = '+ '   /* Set the dynamic area to a blank text file */ &D=&Z

)PROC

 /** Scrollable Selection Menu **/
 /** If no option is selected, check for a scroll command **/
 IF (&ZCMD = &Z,' ')
   /* If a scroll command was entered, set &ZCMD to the scroll command *
   /* (normally, on the first selection menu, UP would be an invalid com
   IF (&ZVERB = UP,DOWN,LEFT,RIGHT,END)  &ZCMD='&ZVERB..'   .RESP=ENTER


 &RGRPMOPT = &Z

 IF (&RGRPO1 ^= &Z,'*')
   VER(&RGRPSD1,NB) VER(&RGRPLD1,NB) VER(&RGRPC1,NB)
   VPUT  (RGRPO1  RGRPSD1 RGRPLD1 RGRPC1) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO2 ^= &Z,'*')
   VER(&RGRPSD2,NB) VER(&RGRPLD2,NB) VER(&RGRPC2,NB)
   VPUT  (RGRPO2  RGRPSD2 RGRPLD2 RGRPC2) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO3 ^= &Z,'*')
   VER(&RGRPSD3,NB) VER(&RGRPLD3,NB) VER(&RGRPC3,NB)
   VPUT  (RGRPO3  RGRPSD3 RGRPLD3 RGRPC3) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO4 ^= &Z,'*')
   VER(&RGRPSD4,NB) VER(&RGRPLD4,NB) VER(&RGRPC4,NB)
   VPUT  (RGRPO4  RGRPSD4 RGRPLD4 RGRPC4) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO5 ^= &Z,'*')
   VER(&RGRPSD5,NB) VER(&RGRPLD5,NB) VER(&RGRPC5,NB)
   VPUT  (RGRPO5  RGRPSD5 RGRPLD5 RGRPC5) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO6 ^= &Z,'*')
   VER(&RGRPSD6,NB) VER(&RGRPLD6,NB) VER(&RGRPC6,NB)
   VPUT  (RGRPO6  RGRPSD6 RGRPLD6 RGRPC6) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO7 ^= &Z,'*')
   VER(&RGRPSD7,NB) VER(&RGRPLD7,NB) VER(&RGRPC7,NB)
   VPUT  (RGRPO7  RGRPSD7 RGRPLD7 RGRPC7) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO8 ^= &Z,'*')
   VER(&RGRPSD8,NB) VER(&RGRPLD8,NB) VER(&RGRPC8,NB)
   VPUT  (RGRPO8  RGRPSD8 RGRPLD8 RGRPC8) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO9 ^= &Z,'*')
   VER(&RGRPSD9,NB) VER(&RGRPLD9,NB) VER(&RGRPC9,NB)
   VPUT  (RGRPO9  RGRPSD9 RGRPLD9 RGRPC9) PROFILE    &RGRPMOPT = YES
 IF (&RGRPO10 ^= &Z,'*')
   VER(&RGRPSD10,NB) VER(&RGRPLD10,NB) VER(&RGRPC10,NB)
   VPUT  (RGRPO10 RGRPSD10 RGRPLD10 RGRPC10) PROFILE &RGRPMOPT = YES
 IF (&RGRPO11 ^= &Z,'*')
   VER(&RGRPSD11,NB) VER(&RGRPLD11,NB) VER(&RGRPC11,NB)
   VPUT  (RGRPO11 RGRPSD11 RGRPLD11 RGRPC11) PROFILE &RGRPMOPT = YES
 IF (&RGRPO12 ^= &Z,'*')
   VER(&RGRPSD12,NB) VER(&RGRPLD12,NB) VER(&RGRPC12,NB)
   VPUT  (RGRPO12 RGRPSD12 RGRPLD12 RGRPC12) PROFILE &RGRPMOPT = YES
 IF (&RGRPO13 ^= &Z,'*')
   VER(&RGRPSD13,NB) VER(&RGRPLD13,NB) VER(&RGRPC13,NB)
   VPUT  (RGRPO13 RGRPSD13 RGRPLD13 RGRPC13) PROFILE &RGRPMOPT = YES
 IF (&RGRPO14 ^= &Z,'*')
   VER(&RGRPSD14,NB) VER(&RGRPLD14,NB) VER(&RGRPC14,NB)
   VPUT  (RGRPO14 RGRPSD14 RGRPLD14 RGRPC14) PROFILE &RGRPMOPT = YES
 IF (&RGRPO15 ^= &Z,'*')
   VER(&RGRPSD15,NB) VER(&RGRPLD15,NB) VER(&RGRPC15,NB)
   VPUT  (RGRPO15 RGRPSD15 RGRPLD15 RGRPC15) PROFILE &RGRPMOPT = YES
 IF (&RGRPO16 ^= &Z,'*')
   VER(&RGRPSD16,NB) VER(&RGRPLD16,NB) VER(&RGRPC16,NB)
   VPUT  (RGRPO16 RGRPSD16 RGRPLD16 RGRPC16) PROFILE &RGRPMOPT = YES
 IF (&RGRPO17 ^= &Z,'*')
   VER(&RGRPSD17,NB) VER(&RGRPLD17,NB) VER(&RGRPC17,NB)
   VPUT  (RGRPO17 RGRPSD17 RGRPLD17 RGRPC17) PROFILE &RGRPMOPT = YES
 IF (&RGRPO18 ^= &Z,'*')
   VER(&RGRPSD18,NB) VER(&RGRPLD18,NB) VER(&RGRPC18,NB)
   VPUT  (RGRPO18 RGRPSD18 RGRPLD18 RGRPC18) PROFILE &RGRPMOPT = YES
 IF (&RGRPO19 ^= &Z,'*')
   VER(&RGRPSD19,NB) VER(&RGRPLD19,NB) VER(&RGRPC19,NB)
   VPUT  (RGRPO19 RGRPSD19 RGRPLD19 RGRPC19) PROFILE &RGRPMOPT = YES
 IF (&RGRPO20 ^= &Z,'*')
   VER(&RGRPSD20,NB) VER(&RGRPLD20,NB) VER(&RGRPC20,NB)
   VPUT  (RGRPO20 RGRPSD20 RGRPLD20 RGRPC20) PROFILE &RGRPMOPT = YES
 IF (&RGRPO21 ^= &Z,'*')
   VER(&RGRPSD21,NB) VER(&RGRPLD21,NB) VER(&RGRPC21,NB)
   VPUT  (RGRPO21 RGRPSD21 RGRPLD21 RGRPC21) PROFILE &RGRPMOPT = YES
 IF (&RGRPO22 ^= &Z,'*')
   VER(&RGRPSD22,NB) VER(&RGRPLD22,NB) VER(&RGRPC22,NB)
   VPUT  (RGRPO22 RGRPSD22 RGRPLD22 RGRPC22) PROFILE &RGRPMOPT = YES
 IF (&RGRPO23 ^= &Z,'*')
   VER(&RGRPSD23,NB) VER(&RGRPLD23,NB) VER(&RGRPC23,NB)
   VPUT  (RGRPO23 RGRPSD23 RGRPLD23 RGRPC23) PROFILE &RGRPMOPT = YES
 IF (&RGRPO24 ^= &Z,'*')
   VER(&RGRPSD24,NB) VER(&RGRPLD24,NB) VER(&RGRPC24,NB)
   VPUT  (RGRPO24 RGRPSD24 RGRPLD24 RGRPC24) PROFILE &RGRPMOPT = YES
 IF (&RGRPO25 ^= &Z,'*')
   VER(&RGRPSD25,NB) VER(&RGRPLD25,NB) VER(&RGRPC25,NB)
   VPUT  (RGRPO25 RGRPSD25 RGRPLD25 RGRPC25) PROFILE &RGRPMOPT = YES
 IF (&RGRPO26 ^= &Z,'*')
   VER(&RGRPSD26,NB) VER(&RGRPLD26,NB) VER(&RGRPC26,NB)
   VPUT  (RGRPO26 RGRPSD26 RGRPLD26 RGRPC26) PROFILE &RGRPMOPT = YES
 IF (&RGRPO27 ^= &Z,'*')
   VER(&RGRPSD27,NB) VER(&RGRPLD27,NB) VER(&RGRPC27,NB)
   VPUT  (RGRPO27 RGRPSD27 RGRPLD27 RGRPC27) PROFILE &RGRPMOPT = YES
 IF (&RGRPO28 ^= &Z,'*')
   VER(&RGRPSD28,NB) VER(&RGRPLD28,NB) VER(&RGRPC28,NB)
   VPUT  (RGRPO28 RGRPSD28 RGRPLD28 RGRPC28) PROFILE &RGRPMOPT = YES
 IF (&RGRPO29 ^= &Z,'*')
   VER(&RGRPSD29,NB) VER(&RGRPLD29,NB) VER(&RGRPC29,NB)
   VPUT  (RGRPO29 RGRPSD29 RGRPLD29 RGRPC29) PROFILE &RGRPMOPT = YES
 IF (&RGRPO30 ^= &Z,'*')
   VER(&RGRPSD30,NB) VER(&RGRPLD30,NB) VER(&RGRPC30,NB)
   VPUT  (RGRPO30 RGRPSD30 RGRPLD30 RGRPC30) PROFILE &RGRPMOPT = YES
 IF (&RGRPO31 ^= &Z,'*')
   VER(&RGRPSD31,NB) VER(&RGRPLD31,NB) VER(&RGRPC31,NB)
   VPUT  (RGRPO31 RGRPSD31 RGRPLD31 RGRPC31) PROFILE &RGRPMOPT = YES
 IF (&RGRPO32 ^= &Z,'*')
   VER(&RGRPSD32,NB) VER(&RGRPLD32,NB) VER(&RGRPC32,NB)
   VPUT  (RGRPO32 RGRPSD32 RGRPLD32 RGRPC32) PROFILE &RGRPMOPT = YES
 IF (&RGRPO33 ^= &Z,'*')
   VER(&RGRPSD33,NB) VER(&RGRPLD33,NB) VER(&RGRPC33,NB)
   VPUT  (RGRPO33 RGRPSD33 RGRPLD33 RGRPC33) PROFILE &RGRPMOPT = YES
 IF (&RGRPO34 ^= &Z,'*')
   VER(&RGRPSD34,NB) VER(&RGRPLD34,NB) VER(&RGRPC34,NB)
   VPUT  (RGRPO34 RGRPSD34 RGRPLD34 RGRPC34) PROFILE &RGRPMOPT = YES
 IF (&RGRPO35 ^= &Z,'*')
   VER(&RGRPSD35,NB) VER(&RGRPLD35,NB) VER(&RGRPC35,NB)
   VPUT  (RGRPO35 RGRPSD35 RGRPLD35 RGRPC35) PROFILE &RGRPMOPT = YES
 IF (&RGRPO36 ^= &Z,'*')
   VER(&RGRPSD36,NB) VER(&RGRPLD36,NB) VER(&RGRPC36,NB)
   VPUT  (RGRPO36 RGRPSD36 RGRPLD36 RGRPC36) PROFILE &RGRPMOPT = YES


 IF (&RGRPO1 = '*')
   &RGRPO1 =&Z  &RGRPSD1 = &Z  &RGRPLD1 = &Z  &RGRPC1 = &Z
   VPUT  (RGRPO1  RGRPSD1 RGRPLD1 RGRPC1) PROFILE
 IF (&RGRPO2 = '*')
   &RGRPO2 =&Z  &RGRPSD2 = &Z  &RGRPLD2 = &Z  &RGRPC2 = &Z
   VPUT  (RGRPO2  RGRPSD2 RGRPLD2 RGRPC2) PROFILE
 IF (&RGRPO3 = '*')
   &RGRPO3 =&Z  &RGRPSD3 = &Z  &RGRPLD3 = &Z  &RGRPC3 = &Z
   VPUT  (RGRPO3  RGRPSD3 RGRPLD3 RGRPC3) PROFILE
 IF (&RGRPO4 = '*')
   &RGRPO4 =&Z  &RGRPSD4 = &Z  &RGRPLD4 = &Z  &RGRPC4 = &Z
   VPUT  (RGRPO4  RGRPSD4 RGRPLD4 RGRPC4) PROFILE
 IF (&RGRPO5 = '*')
   &RGRPO5 =&Z  &RGRPSD5 = &Z  &RGRPLD5 = &Z  &RGRPC5 = &Z
   VPUT  (RGRPO5  RGRPSD5 RGRPLD5 RGRPC5) PROFILE
 IF (&RGRPO6 = '*')
   &RGRPO6 =&Z  &RGRPSD6 = &Z  &RGRPLD6 = &Z  &RGRPC6 = &Z
   VPUT  (RGRPO6  RGRPSD6 RGRPLD6 RGRPC6) PROFILE
 IF (&RGRPO7 = '*')
   &RGRPO7 =&Z  &RGRPSD7 = &Z  &RGRPLD7 = &Z  &RGRPC7 = &Z
   VPUT  (RGRPO7  RGRPSD7 RGRPLD7 RGRPC7) PROFILE
 IF (&RGRPO8 = '*')
   &RGRPO8 =&Z  &RGRPSD8 = &Z  &RGRPLD8 = &Z  &RGRPC8 = &Z
   VPUT  (RGRPO8  RGRPSD8 RGRPLD8 RGRPC8) PROFILE
 IF (&RGRPO9 = '*')
   &RGRPO9 =&Z  &RGRPSD9 = &Z  &RGRPLD9 = &Z  &RGRPC9 = &Z
   VPUT  (RGRPO9  RGRPSD9 RGRPLD9 RGRPC9) PROFILE
 IF (&RGRPO10 = '*')
   &RGRPO10 =&Z &RGRPSD10 = &Z &RGRPLD10 = &Z &RGRPC10 = &Z
   VPUT  (RGRPO10 RGRPSD10 RGRPLD10 RGRPC10) PROFILE
 IF (&RGRPO11 = '*')
   &RGRPO11 =&Z &RGRPSD11 = &Z &RGRPLD11 = &Z &RGRPC11 = &Z
   VPUT  (RGRPO11 RGRPSD11 RGRPLD11 RGRPC11) PROFILE
 IF (&RGRPO12 = '*')
   &RGRPO12 =&Z &RGRPSD12 = &Z &RGRPLD12 = &Z &RGRPC12 = &Z
   VPUT  (RGRPO12 RGRPSD12 RGRPLD12 RGRPC12) PROFILE
 IF (&RGRPO13 = '*')
   &RGRPO13 =&Z &RGRPSD13 = &Z &RGRPLD13 = &Z &RGRPC13 = &Z
   VPUT  (RGRPO13 RGRPSD13 RGRPLD13 RGRPC13) PROFILE
 IF (&RGRPO14 = '*')
   &RGRPO14 =&Z &RGRPSD14 = &Z &RGRPLD14 = &Z &RGRPC14 = &Z
   VPUT  (RGRPO14 RGRPSD14 RGRPLD14 RGRPC14) PROFILE
 IF (&RGRPO15 = '*')
   &RGRPO15 =&Z &RGRPSD15 = &Z &RGRPLD15 = &Z &RGRPC15 = &Z
   VPUT  (RGRPO15 RGRPSD15 RGRPLD15 RGRPC15) PROFILE
 IF (&RGRPO16 = '*')
   &RGRPO16 =&Z &RGRPSD16 = &Z &RGRPLD16 = &Z &RGRPC16 = &Z
   VPUT  (RGRPO16 RGRPSD16 RGRPLD16 RGRPC16) PROFILE
 IF (&RGRPO17 = '*')
   &RGRPO17 =&Z &RGRPSD17 = &Z &RGRPLD17 = &Z &RGRPC17 = &Z
   VPUT  (RGRPO17 RGRPSD17 RGRPLD17 RGRPC17) PROFILE
 IF (&RGRPO18 = '*')
   &RGRPO18 =&Z &RGRPSD18 = &Z &RGRPLD18 = &Z &RGRPC18 = &Z
   VPUT  (RGRPO18 RGRPSD18 RGRPLD18 RGRPC18) PROFILE
 IF (&RGRPO19 = '*')
   &RGRPO19 =&Z &RGRPSD19 = &Z &RGRPLD19 = &Z &RGRPC19 = &Z
   VPUT  (RGRPO19 RGRPSD19 RGRPLD19 RGRPC19) PROFILE
 IF (&RGRPO20 = '*')
   &RGRPO20 =&Z &RGRPSD20 = &Z &RGRPLD20 = &Z &RGRPC20 = &Z
   VPUT  (RGRPO20 RGRPSD20 RGRPLD20 RGRPC20) PROFILE
 IF (&RGRPO21 = '*')
   &RGRPO21 =&Z &RGRPSD21 = &Z &RGRPLD21 = &Z &RGRPC21 = &Z
   VPUT  (RGRPO21 RGRPSD21 RGRPLD21 RGRPC21) PROFILE
 IF (&RGRPO22 = '*')
   &RGRPO22 =&Z &RGRPSD22 = &Z &RGRPLD22 = &Z &RGRPC22 = &Z
   VPUT  (RGRPO22 RGRPSD22 RGRPLD22 RGRPC22) PROFILE
 IF (&RGRPO23 = '*')
   &RGRPO23 =&Z &RGRPSD23 = &Z &RGRPLD23 = &Z &RGRPC23 = &Z
   VPUT  (RGRPO23 RGRPSD23 RGRPLD23 RGRPC23) PROFILE
 IF (&RGRPO24 = '*')
   &RGRPO24 =&Z &RGRPSD24 = &Z &RGRPLD24 = &Z &RGRPC24 = &Z
   VPUT  (RGRPO24 RGRPSD24 RGRPLD24 RGRPC24) PROFILE
 IF (&RGRPO25 = '*')
   &RGRPO25 =&Z &RGRPSD25 = &Z &RGRPLD25 = &Z &RGRPC25 = &Z
   VPUT  (RGRPO25 RGRPSD25 RGRPLD25 RGRPC25) PROFILE
 IF (&RGRPO26 = '*')
   &RGRPO26 =&Z &RGRPSD26 = &Z &RGRPLD26 = &Z &RGRPC26 = &Z
   VPUT  (RGRPO26 RGRPSD26 RGRPLD26 RGRPC26) PROFILE
 IF (&RGRPO27 = '*')
   &RGRPO27 =&Z &RGRPSD27 = &Z &RGRPLD27 = &Z &RGRPC27 = &Z
   VPUT  (RGRPO27 RGRPSD27 RGRPLD27 RGRPC27) PROFILE
 IF (&RGRPO28 = '*')
   &RGRPO28 =&Z &RGRPSD28 = &Z &RGRPLD28 = &Z &RGRPC28 = &Z
   VPUT  (RGRPO28 RGRPSD28 RGRPLD28 RGRPC28) PROFILE
 IF (&RGRPO29 = '*')
   &RGRPO29 =&Z &RGRPSD29 = &Z &RGRPLD29 = &Z &RGRPC29 = &Z
   VPUT  (RGRPO29 RGRPSD29 RGRPLD29 RGRPC29) PROFILE
 IF (&RGRPO30 = '*')
   &RGRPO30 =&Z &RGRPSD30 = &Z &RGRPLD30 = &Z &RGRPC30 = &Z
   VPUT  (RGRPO30 RGRPSD30 RGRPLD30 RGRPC30) PROFILE
 IF (&RGRPO31 = '*')
   &RGRPO31 =&Z &RGRPSD31 = &Z &RGRPLD31 = &Z &RGRPC31 = &Z
   VPUT  (RGRPO31 RGRPSD31 RGRPLD31 RGRPC31) PROFILE
 IF (&RGRPO32 = '*')
   &RGRPO32 =&Z &RGRPSD32 = &Z &RGRPLD32 = &Z &RGRPC32 = &Z
   VPUT  (RGRPO32 RGRPSD32 RGRPLD32 RGRPC32) PROFILE
 IF (&RGRPO33 = '*')
   &RGRPO33 =&Z &RGRPSD33 = &Z &RGRPLD33 = &Z &RGRPC33 = &Z
   VPUT  (RGRPO33 RGRPSD33 RGRPLD33 RGRPC33) PROFILE
 IF (&RGRPO34 = '*')
   &RGRPO34 =&Z &RGRPSD34 = &Z &RGRPLD34 = &Z &RGRPC34 = &Z
   VPUT  (RGRPO34 RGRPSD34 RGRPLD34 RGRPC34) PROFILE
 IF (&RGRPO35 = '*')
   &RGRPO35 =&Z &RGRPSD35 = &Z &RGRPLD35 = &Z &RGRPC35 = &Z
   VPUT  (RGRPO35 RGRPSD35 RGRPLD35 RGRPC35) PROFILE
 IF (&RGRPO36 = '*')
   &RGRPO36 =&Z &RGRPSD36 = &Z &RGRPLD36 = &Z &RGRPC36 = &Z
   VPUT  (RGRPO36 RGRPSD36 RGRPLD36 RGRPC36) PROFILE


 VPUT (RGRPMOPT) PROFILE

 IF (&ZCMD  = ' ')  &LONG  = ' '   &SHORT = ' '   .MSG = SYS010

 &ZSEL = TRANS(TRUNC(&ZCMD,'.')
                    ' ',' '
          /*        'X','EXIT'    */
              '&RGRPO1','&RGRPC1'
              '&RGRPO2','&RGRPC2'
              '&RGRPO3','&RGRPC3'
              '&RGRPO4','&RGRPC4'
              '&RGRPO5','&RGRPC5'
              '&RGRPO6','&RGRPC6'
              '&RGRPO7','&RGRPC7'
              '&RGRPO8','&RGRPC8'
              '&RGRPO9','&RGRPC9'
             '&RGRPO10','&RGRPC10'
             '&RGRPO11','&RGRPC11'
             '&RGRPO12','&RGRPC12'
             '&RGRPO13','&RGRPC13'
             '&RGRPO14','&RGRPC14'
             '&RGRPO15','&RGRPC15'
             '&RGRPO16','&RGRPC16'
             '&RGRPO17','&RGRPC17'
             '&RGRPO18','&RGRPC18'
             '&RGRPO19','&RGRPC19'
             '&RGRPO20','&RGRPC20'
             '&RGRPO21','&RGRPC21'
             '&RGRPO22','&RGRPC22'
             '&RGRPO23','&RGRPC23'
             '&RGRPO24','&RGRPC24'
             '&RGRPO25','&RGRPC25'
             '&RGRPO26','&RGRPC26'
             '&RGRPO27','&RGRPC27'
             '&RGRPO28','&RGRPC28'
             '&RGRPO29','&RGRPC29'
             '&RGRPO30','&RGRPC30'
             '&RGRPO31','&RGRPC31'
             '&RGRPO32','&RGRPC32'
             '&RGRPO33','&RGRPC33'
             '&RGRPO34','&RGRPC34'
             '&RGRPO35','&RGRPC35'
             '&RGRPO36','&RGRPC36'
       /** Scrollable Selection Menu **/
                     UP,'PANEL(RMBFGRP3)' /* Previous, Page 3 */
                   DOWN,'PANEL(RMBFGRP5)' /* Next,     Page 5 */
                   LEFT,'PANEL(RMBFGRPM)' /* First,    Page 1 */
                  RIGHT,'PANEL(RMBFGRP6)' /* Last,     Page 6 */
                    END,'EXIT'
                     * ,'?')

 &ZTRAIL = .TRAIL

)END
