)ATTR
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
  /** User/Group Modifable Primary Option Menu: BUILD             **/
  /**                                                             **/
  /** Michael E. Theys                                            **/
  /** Southwestern Computing Center                               **/
  /** Information Systems Center                                  **/
  /** Rockwell International                                      **/
  /** 1200 N. Alma Rd.  Bldg 401-109                              **/
  /** Richardson, Texas 75081-2205                                **/
  /** (214) 996-2860  COMNET 437-2860                             **/
  /** XMIT Address    SWCC.XTS0008                       Oct 1986 **/
  /** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** ** **/
               /*              Centering Template               */
               /* 9 8 7 6 5 4 3 2 1 0 <-+-> 0 1 2 3 4 5 6 7 8 9 */
)BODY
%TUTORIAL ------------- Menu Build Facility DEMONSTRATION --------------
%COMMAND ===>_ZCMD
+
+
+
+
+
+
+                              NOT COMPLETED
+
+
+  A different DEMO is used for each BUILD supported primary menu.
+  Sample menu options will be defined.
+  Options added will be the hidden menu options and instant access opti
+
+  To clear the DEMO use BUILD utility option 3.1 to CLEAR the "DEMO".
)PROC
)END
