)ATTR
  #   TYPE(TEXT)  INTENS(LOW)  CAPS(OFF)  JUST(LEFT) COLOR(TURQ)
)BODY
+-------------% Rockwell Technical Proposal Update Selection +----------
%Selection ===>_RTPSEL
+
  Select the Technical Proposal Section to be Updated/Reviewed:
%    +
% 1 -+Computing Center/Satellite #(1)
% 2 -+Shipping Address and Dept. Number #(2)
% 3 -+Project Title and Person to Contact for More Inforamation #(3,4)
% 4 -+Vendor Contact and Need Date and Project Life #(5,6,7)
% 5 -+Requirements Definition and Project Justification #(8)
% 6 -+How is the Requirement Currently Satisfied #(9)
% 7 -+Benefit Statement #(10)
% 8 -+Detailed Description of Equipment/Software Requested #(11)
% 9 -+Alternatives Considered and Reasons for Rejection #(12)
%10 -+Project Cost Category, Funding, Requested by and Approved by #(13,
%11 -+Additional Information #(15)
%    +
% P -+Print the entire Technical Proposal
+
)INIT
)PROC
 VER (&RTPSEL,NONBLANK,LIST,1,2,3,4,5,6,7,8,9,10,11,P)
)END
