)BODY DEFAULT(%Ö_)
%--------------------- SMP LIST CDS (Control Data Set) -----------------
%COMMAND ===>_ZCMD
Ö
ÖLIST data set: &INDEX..SMP&DATASET
Ö
ÖOperands to restrict output (* for no restriction):
Ö    Entry      %===>_OPT   Ö
Ö    Name/Id(s) %===>_IDS
Ö    FORFMID    %===>_FORFMID Ö
Ö
ÖCross reference:
Ö    XREF       %===>_XREFÖ      (NO/YES)
Ö
ÖValid entries:
%    ASSEM  Ö- JCLIN assembler source text
%    DLIB   Ö- JCLIN totally copied libraries
%    LMOD   Ö- APPLY/JCLIN link edit data
%    MAC    Ö- APPLY/ACCEPT ++MAC and ++MACUPD
%    MOD    Ö- APPLY/ACCEPT ++MOD and ++ZAP
%    SRC    Ö- APPLY/ACCEPT ++SRC and ++SRCUPD
%    SYSMOD Ö- System modification
%    SYS    Ö- APPLY/RESTORE/ACCEPT verification and control
)INIT
 &ENTRY   = TRANS(&ENTRY   ' ',SYSMOD *,*)
 &OPT     = TRANS(&OPT     ' ',&ENTRY *,*)
 &FORFMID = TRANS(&FORFMID ' ','*' *,*)
 &XREF    = TRANS(&XREF    XREF,YES *,*)
 &XREF    = TRANS(TRUNC(&XREF,1) N,NO Y,YES ' ',NO *,*)
)PROC
 &ENTRY = TRUNC(&OPT,'.')
 VER (&IDS,NONBLANK)
 VER (&FORFMID,NONBLANK)
 VER (&XREF,NONBLANK)
 &XREF = TRANS(TRUNC(&XREF,1) N,NO Y,YES *,*)
 VER (&XREF,LIST,YES,NO)
 &SEL = TRANS(TRUNC(&OPT,'.')
              ASSEM ,'CMD(%SMPEXEC)'
              DLIB  ,'CMD(%SMPEXEC)'
              LMOD  ,'CMD(%SMPEXEC)'
              MAC   ,'CMD(%SMPEXEC)'
              MOD   ,'CMD(%SMPEXEC)'
              SRC   ,'CMD(%SMPEXEC)'
              SYSMOD,'PANEL(SMPCDSE)'
              SYS   ,'CMD(%SMPEXEC)'
              ' '   ,' '
              *     ,?)
 IF (&IDS = *)
     &IDS = ' '
 IF (&FORFMID = *)
     &FORFMID = ' '
 &XREF = TRANS(&XREF NO,' ' YES,XREF)
)END
