)ATTR DEFAULT(%+_)
)BODY
%----------------- SYSTEM'S SCRATCH DUMP UTILITY -----------------------
%COMMAND ===>_ZCMD
%
+   ENTER NAME OF DUMP TO BE DELETED:
+
+   DUMP NAME:%&DUMP
+
+   ***************************************************************
+   *                                                             *
+   * %  **** ERROR MORE THAN ONE ENTRY FOUND FOR DUMP DSN ****   *
+   *                                                             *
+   *  DIALOG IS GOING TO TERMINATE YOU WILL HAVE TO CLEAN UP     *
+   *  DATASET BY HAND PRESS %ENTER+OR%END+TO EXIT                *
+   ***************************************************************
+
)INIT
)PROC
)END
