+------------% Rockwell ISC Technical Proposal Entry Dialog +-----------
%Command ===>_ZCMD
+
+  The Technical Proposal Table Dataset does not exist:%&TECHDSN
+
+  Create dataset%===>_TPAOPT+ Y or N
+
)INIT
 &TPAOPT = &Z
)PROC
 VER (&TPAOPT,NONBLANK,LIST,Y,N)
)END
