)ATTR DEFAULT(%+_)
       %   TYPE(TEXT) INTENS(HIGH)
       +   TYPE(TEXT) SKIP(ON) INTENS(LOW)
       ×   TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(ASIS) PAD(' ')
)BODY
+------------% Rockwell ISC Technical Proposal Entry Dialog +-----------
%Command ===>_ZCMD
+
+Enter Requirements Definition and Project Justification:
+
+==>×TP715
+==>×TP716
+==>×TP717
+==>×TP718
+==>×TP719
+==>×TP720
+==>×TP721
+==>×TP722
+==>×TP723
+==>×TP724
+==>×TP725
+==>×TP726
+==>×TP727
+==>×TP728
+
+  Continue%===>_CONT+ Y or N or A for More Definition/Justification
)INIT
 &CONT = &Z
)PROC
 VER (&CONT,NONBLANK,LIST,Y,N,A)
)END
