)ATTR DEFAULT(%+_)
       %   TYPE(TEXT) INTENS(HIGH)
       +   TYPE(TEXT) SKIP(ON) INTENS(LOW)
       ×   TYPE(INPUT) INTENS(HIGH) CAPS(OFF) JUST(ASIS) PAD(' ')
)BODY
+------------% Rockwell ISC Technical Proposal Entry Dialog +-----------
%Command ===>_ZCMD
+
+Enter How the Requirement is Currently Satisfied:
+
+==>×TP81
+==>×TP82
+==>×TP83
+==>×TP84
+==>×TP85
+==>×TP86
+==>×TP87
+==>×TP88
+==>×TP89
+==>×TP810
+==>×TP811
+==>×TP812
+==>×TP813
+==>×TP814
+
+  Continue%===>_CONT+ Y or N
)INIT
 &CONT = &Z
)PROC
 VER (&CONT,NONBLANK,LIST,Y,N)
)END
