)ATTR DEFAULT(%+_)
 ×    TYPE(OUTPUT)
      INTENS(LOW)
      CAPS(OFF)

 #    TYPE(INPUT)
      INTENS(HIGH)
      PAD(' ')
)BODY
+-------------------------% TSO HELP COMMAND SCREEN  +------------------
%Option ===>_ZCMD                                                  +Scro
+
+Options: %F+Function %S+Syntax %O+Operands %C+Subcommand %M+Message
+
)MODEL
 ×RECORD
)INIT
 .CURSOR = ZCMD
  &SCRL = &ZSCBR
  .ZVARS = '(SCRL)'
 &ZCMD = &Z
 .HELP = TSOHELPT
  &ZTDMARK = 'END OF HELP '
  &UMSG40 = &Z
  &LMSG40 = &Z
  &ZTDMSG = DTSM040
  &ZSCROLLD = DATA
)PROC
 &XCMD = TRUNC(&ZCMD,1)
 &TYPE = &ZCMD
 &ZCMD = &Z
)END
