 LISTIT: PROC OPTIONS(MAIN);
 DCL IN INPUT FILE RECORD ENV(FB RECSIZE(80));
 DCL LIST OUTPUT STREAM PRINT;
 DCL CARD CHAR(80);
 ON ENDFILE(IN) GO TO FINN;
 LOOP: READ FILE(IN) INTO(CARD);
 IF SUBSTR(CARD,1,50)=' % PAGE;'
   THEN PUT FILE(LIST) PAGE;
 ELSE PUT FILE(LIST) EDIT (CARD) (COL(1),A(80));
 GO TO LOOP;
 FINN:
 END LISTIT;
