//NDUMP01  JOB ,'AMDPRDMP SCAN ZAP',CLASS=9,TYPRUN=HOLD
/*PROCLIB NER.SP1IPO.CNTL
/*JOBPARM Q=F,I
//*
//SMP    EXEC  SMP4APLY
//SMPCNTL  DD  *
 REJECT  S(NDUMP01) .
 RESETRC .
 RECEIVE .
 APPLY   G(NDUMP01) DIS(NO) .
//SMPPTFIN DD  *
++ USERMOD (NDUMP01)    /*
      ENABLE  SCAN  OPTION FOR AMDPRDMP.
      THIS ZAP ENTERS THE NEW KEYWORDS AND MODULE NAMES INTO
      AMDPRECT THAT ARE NECESSARY TO USE THE PRDMP FORMATTING
      EXITS.
                           */ .
++ VER (Z038)  FMID (JBB1326) .
++ ZAP (AMDPRECT) .
 NAME AMDPRECT
  VER 00F0 40404040,40404040,00000000
  VER 00FC 40404040,40404040
  REP 00F0 C1D4C4D7,E2C3C1D5  AMDPSCAN
  REP 00FC E2C3C1D5,40404040   SCAN
 IDRDATA NDUMP01
