MAGE     TITLE 'MVS/SE SRM ANALYSIS DISPLAY'
MAGE     DCMSTART R,LV=4096
#SRM     #STAK GET,FRAME=19,SIZE=20
#DMN     #STAK GET,FRAME=19,SIZE=101
#RCT     #STAK GET,FRAME=19,SIZE=21
#WLM     #STAK GET,FRAME=19,SIZE=65
         L     R3,CVTPTR
         USING CVT,R3
         L     R11,CVTOPCTP
         DROP  R3
         USING RMCNS,R11
*                                     DO STATIC DISPLAY ITEMS  LINE 1
         LA    R5,STATLINE
         MVC   0(79,R5),BLANKS
         L     R2,RMCTWMST
         LA    R2,WMSTID-WMST(R2)      SET
         MVC   0(L'IPSMSG,R5),IPSMSG      CURRENT
         MVC   L'IPSMSG(2,R5),0(R2)              IPS
*                                     DO STATIC DISPLAY ITEMS  LINE 2
         LA    R5,79(R5)
         MVC   0(79,R5),BLANKS
         MVC   0(79,R5),ERVTITL
         L     R2,RMPTCPU
         ST    R2,DECWORK1
         BAL   R14,@DECIMAL
         MVC   5(3,R5),DECWORK4+1
         L     R2,RMPTIOC
         ST    R2,DECWORK1
         BAL   R14,@DECIMAL
         MVC   13(3,R5),DECWORK4+1
         L     R2,RMPTERV
         ST    R2,DECWORK1
         BAL   R14,@DECIMAL
         MVC   21(4,R5),DECWORK4
*                                     DO STATIC DISPLAY ITEMS  LINE 3
         LA    R5,79(R5)
         MVC   0(79,R5),BLANKS
         MVC   0(79,R5),RFCTITL
         L     R10,RMCTWMST
         USING WMST,R10
*        L     R2,WMSTIPC
*        ST    R2,DECWORK1
*        BAL   R14,@DECIMAL
*        MVC   06(02,R5),DECWORK4+1
*        MVC   09(01,R5),DECWORK4+3
         MVC   07(4,R5),WMSTIPC
         MVC   18(4,R5),WMSTIPI
         MVC   29(4,R5),WMSTIPM
*                                                          LINE 4
         LA    R5,79(R5)
         MVC   0(79,R5),BLANKS
*
         LA    R5,79(R5)
         MVC   0(79,R5),BLANKS
         EJECT
RESTART  EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         GETIMAGE MAGE,SCREEN
         LA    R5,STATLINE
         LA    R6,L18
         LA    R4,4
GRUNT    EQU   *
         MVC   0(79,R6),0(R5)
         LA    R6,79(R6)
         LA    R5,79(R5)
         BCT   R4,GRUNT
         OI    IOCBFLGC,IOCBCCLR+IOCBCRAO
         TRMIO IOCB,FORMAT=FORMAT,IMAGE=SCREEN
         PFKEY DEF=NO,K9=RESTART,K12=WIZEXIT,                          X
               K1=RESTART,K3=SHOWDMDT,K4=LSCTRCT,K5=WLMNGR,K6=SRMTIME
         EJECT
SHOWDMDT EQU   *
         LA    R1,#DMN
         CALL  DOMAINS
DMNFWD   EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME FORWARD,#DMN,SCREEN,TITLE=YES
         B     DMNSHOW
DMNBACK  EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME BACKWARD,#DMN,SCREEN,TITLE=YES
         B     DMNSHOW
DMNSHOW  EQU   *
         OI    IOCBFLGC,IOCBCCLR+IOCBCRAO
         TRMIO IOCB,FORMAT=FORMAT,IMAGE=SCREEN
         PFKEY K12=WIZEXIT,K9=RESTART,DEF=NO,K8=DMNFWD,K7=DMNBACK,     X
               K1=RESTART,K3=SHOWDMDT,K4=LSCTRCT,K5=WLMNGR,K6=SRMTIME, X
               ENTER=SHOWDMDT
LSCTRCT  EQU   *
         LA    R1,#RCT
         CALL  RCTDATA
RCTFWD   EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME FORWARD,#RCT,SCREEN,TITLE=YES
         B     RCTSHOW
RCTBACK  EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME BACKWARD,#RCT,SCREEN,TITLE=YES
         B     RCTSHOW
RCTSHOW  EQU   *
         OI    IOCBFLGC,IOCBCCLR+IOCBCRAO
         TRMIO IOCB,FORMAT=FORMAT,IMAGE=SCREEN
         PFKEY K12=WIZEXIT,K9=RESTART,DEF=NO,K8=RCTFWD,K7=RCTBACK,     X
               K1=RESTART,K3=SHOWDMDT,K4=LSCTRCT,K5=WLMNGR,K6=SRMTIME, X
               ENTER=LSCTRCT
         EJECT
WLMNGR   EQU   *
         LA    R1,#WLM
         ST    R1,WLMPARM
         MVI   WLMPARM,X'80'
         LA    R1,WLMPARM
*        CALL  PLICALLA
WLMFWD   EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME FORWARD,#WLM,SCREEN,TITLE=YES
         B     WLMSHOW
WLMBACK  EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME BACKWARD,#WLM,SCREEN,TITLE=YES
         B     WLMSHOW
WLMSHOW  EQU   *
         OI    IOCBFLGC,IOCBCCLR+IOCBCRAO
         TRMIO IOCB,FORMAT=FORMAT,IMAGE=SCREEN
         PFKEY K12=WIZEXIT,K9=RESTART,DEF=NO,K8=WLMFWD,K7=WLMBACK,     X
               K1=RESTART,K3=SHOWDMDT,K4=LSCTRCT,K5=WLMNGR,K6=SRMTIME, X
               ENTER=WLMNGR
         EJECT
SRMTIME  EQU   *
         LA    R1,#SRM
         CALL  SRMTIME
SRMFWD   EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME FORWARD,#SRM,SCREEN,TITLE=YES
         B     SRMSHOW
SRMBACK  EQU   *
         DCMSNULL FORMAT=FORMAT,IMAGE=SCREEN
         #FRAME BACKWARD,#SRM,SCREEN,TITLE=YES
         B     SRMSHOW
SRMSHOW  EQU   *
         OI    IOCBFLGC,IOCBCCLR+IOCBCRAO
         TRMIO IOCB,FORMAT=FORMAT,IMAGE=SCREEN
         PFKEY K12=WIZEXIT,K9=RESTART,DEF=NO,K8=SRMFWD,K7=SRMBACK,     X
               K1=RESTART,K3=SHOWDMDT,K4=LSCTRCT,K5=WLMNGR,K6=SRMTIME, X
               ENTER=SRMTIME
         B     RESTART
*                                                          LINE 5
IPSMSG   DC    C' CURRENT IPS =  '
ERVTITL  DS    0CL79
         DC    CL79' CPU=NNN I/O=NNN ENQ=NNN   '
RFCTITL  DS    0CL79
         DC    CL79' CPU = NN.N I/O = NN.N MSO = NN.N '
WIZEXIT  DCMSTOP RC=(15),SCREEN=YES
WLMADDR  DS    F
WLMLIST  DS    H
WLMPARM  DS    CL4
         DS    F .
         SPACE 3
STATLINE DS    6CL79 .
#DMN     #STAKCB
#SRM     #STAKCB
#RCT     #STAKCB
#WLM     #STAKCB
         EJECT
         CVT DSECT=YES,LIST=NO
         EJECT
RMCNS    RMCNS
         EJECT
         IRAWAMT
         EJECT
         IRAWMST
         END
