 TARGET:PROC OPTIONS(MAIN);
   DCL TGET  ENTRY (CHAR(120) VAR,FIXED BIN(15)),
       HTPUT ENTRY (CHAR(120) VAR);
    DCL TME CHAR(9), TCS3 CHAR(3);
    DCL TCS1 CHAR(14), TCS6 CHAR(6), TCS4 CHAR(4);
    DCL (KNT,S,R1,R2) FIXED BIN(31),
        W CHAR(120) VAR,
        R3 FLOAT DEC,
        (RTN, RTN2, T, E) FIXED BIN(31),
        RC FIXED BIN(15);
    DCL RAND ENTRY (FIXED BIN(31),FLOAT DEC);
    DCL SAVE_Y FIXED BIN(15) INIT(0);
    W='  ';
    CALL HTPUT(W);
    W='T h i s  i s';
    CALL HTPUT(W);
    W=' - Target -';
    CALL HTPUT(W);
    W='  ';
    CALL HTPUT(W);
    W='Have you played the game before?';
    CALL HTPUT(W);
    W='If so, enter Y, otherwise enter N.';
    CALL HTPUT(W);
   STRT_RD:
    W='  ';
    CALL TGET(W,RC);
    IF RC = 8 THEN GOTO STRT_RD;
    IF RC ^=0 THEN CALL IHEDUMP(RC);
    IF W = 'Y' THEN GOTO NO_RULES;
    IF W = 'y' THEN GOTO NO_RULES;
    W='This demonstration simulates the results of firing a field';
    CALL HTPUT(W);
    W='  artillery weapon.  You are the "Officer-in-Charge", giving';
    CALL HTPUT(W);
    W='  orders to the gun crew, specifying the degree of elevation';
    CALL HTPUT(W);
    W='  that you estimate will place your projectile on the Target.';
    CALL HTPUT(W);
    W='A hit within 100 yards of the Target will destroy it!';
    CALL HTPUT(W);
    W='  ';
    CALL HTPUT(W);
    W='The maximum range of your weapon is 46,500 yards.';
    CALL HTPUT(W);
    SAVE_Y = SAVE_Y + 2;
   NO_RULES:
    SAVE_Y = SAVE_Y + 1;
    W='  ';
    CALL HTPUT(W);
    KNT=0;
    TME = TIME;
    R1=SUBSTR(TME,5);
   RANDG:
    CALL RAND(R1,R3);
    T = 36352 * R3 + 5000;
    S = 0;
    KNT = KNT+1;
    IF KNT<2 THEN GOTO START;
   RANDH:
    CALL RAND(R1,R3);
    IF KNT<4 THEN GOTO RANDI;
    RTN=FLOOR((7.5-KNT)*R3) + 2;
    IF RTN ^<2 THEN GOTO START;
    KNT = KNT - 1;
    GOTO RANDH;
   RANDI:
    RTN=FLOOR((7.5-KNT)*R3) + 3;
    GOTO START;
0  MINEL:
    W='The minimum elevation of your weapon is 1 degree.';
    CALL HTPUT(W);
    GOTO READ;
0  MAXEL:
    W='The maximum elevation of your weapon is 89 degrees.';
    CALL HTPUT(W);
    GOTO READ;
0  OVER:
    TCS1 = ABS(E);
    TCS6 = SUBSTR(TCS1,9);
    W='Over Target by' ×× TCS6 ×× ' yards.';
  O:CALL HTPUT(W);
    IF KNT<2 THEN GOTO READ;
    TCS1 = RTN2;
    TCS4 = SUBSTR(TCS1,11);
    W='Enemy shell landed' ×× TCS4 ×× ' yards from your position.';
    CALL HTPUT(W);
    IF RTN=S THEN GOTO END;
             ELSE GOTO READ;
0  SHORT:
    TCS1 = E;
    TCS6 = SUBSTR(TCS1,9);
    W='Short of Target by' ×× TCS6 ×× ' yards.';
    GOTO O;
0  HIT:
    TCS1 = S;
    TCS3 = SUBSTR(TCS1,12);
    W='*+* Target destroyed! *+*' ×× TCS3 ×× ' rounds expended.';
    CALL HTPUT(W);
  A:W='  ';
    CALL HTPUT(W);
    IF SAVE_Y < 2  THEN GOTO A1;
    IF KNT ^<2 THEN GOTO A1;
    W='Your forward observer has sighted more enemy activity.';
    CALL HTPUT(W);
    W='If you wish to continue the attack, hit RETURN,';
    CALL HTPUT(W);
    W='  otherwise enter  RETREAT .';
    GOTO A2;
   A1:
    W='Charge or RETREAT?';
   A2:
    CALL HTPUT(W);
    CALL TGET(W,RC);
    IF RC = 8 THEN GOTO A;
    IF RC ^= 0 THEN CALL IHEDUMP(RC);
    IF W='RETREAT' THEN GOTO CHICK;
    IF W='retreat' THEN GOTO CHICK;
                   ELSE GOTO RANDG;
   CHICK:
    W='C h i c k e n !';
    GOTO FINIS;
   START:
    TCS1 = T;
    TCS6 = SUBSTR(TCS1,9);
    W='Distance to the Target is' ×× TCS6 ×× ' yards.';
    CALL HTPUT(W);
    IF KNT<2 THEN GOTO READ;
    W='The enemy will now be returning your fire.';
    CALL HTPUT(W);
   READ:
    W='Elevation?';
    CALL HTPUT(W);
    CALL TGET(W,RC);
    IF RC=8 THEN GOTO READ;
    IF RC^=0 THEN CALL IHEDUMP(RC);
    GET STRING(W) LIST (B);
    IF B=90 THEN GOTO DUMB;
    IF B>89 THEN GOTO MAXEL;
    IF B<1  THEN GOTO MINEL;
    S=S+1;
    IF KNT<2 THEN GOTO COM;
   RET2:
    CALL RAND(R1,R3);
    RTN2 =(R3+RTN-S)*100;
   COM:
    E=FLOOR(.5+T-(46500*SIN(2*B/57.3)));
    IF 100>ABS(E) THEN GOTO HIT;
    IF E>100      THEN GOTO SHORT;
    IF E<-100     THEN GOTO OVER;
    IF E=-100     THEN GOTO OVER;
                  ELSE GOTO SHORT;
   DUMB:
    W='You %<*@# idiot, you destroyed your own position ! ! !';
    GOTO ENDED;
   END:
    W='You have been destroyed by the enemy.';
   ENDED:
    CALL HTPUT(W);
    W='You  are  now  d e a d . . .';
   FINIS:
    CALL HTPUT(W);
    W='  ';
    CALL HTPUT(W);
    RETURN;
0HTPUT: PROC(S);
    DCL S CHAR(120) VAR;  DCL RC FIXED BIN(15);
    DCL TPUT ENTRY(CHAR(120) VAR,FIXED BIN(15));
0
   WR:
    CALL TPUT(S,RC);
    IF RC=8 THEN GOTO WR;
    IF RC^=0 THEN CALL IHEDUMP(RC);
    RETURN;
 END HTPUT;
 END TARGET;
