//COPYPROC JOB (3225,P136),'COPY TO PROCLIB',CLASS=X,MSGCLASS=F,
// NOTIFY=TSO67
/*XEQ N13
/*ROUTE PRINT N13
***********************************************************************
* THIS PROC WILL COPY THE TSSO STARTED TASK PROCLIB MEMBER INTO SYS1  *
* PROCLIB DATASET. THE TSSO STARTED TASK MUST BE PLACED IN SYS1.PROCLIB
* AS OPPOSED TO ANOTHER PROCLIB BECAUSE IT IS A SUBSYSTEM.            *
*                                                                     *
***********************************************************************
//COPYPROC EXEC PGM=IEBCOPY
//TSSOLIB  DD DSN=TSSO.VERS41.ASM,DISP=SHR
//PROCLIB  DD DSN=SYS1.PROCLIB,DISP=SHR
//SYSUT1   DD DSN=&&SYSUT1,UNIT=VIO,SPACE=(CYL,(20,20))
//SYSUT2   DD DSN=&&SYSUT2,UNIT=VIO,SPACE=(CYL,(20,20))
//SYSUT3   DD DSN=&&SYSUT3,UNIT=VIO,SPACE=(CYL,(20,20))
//SYSIN    DD *
    COPY INDD=((TSSOLIB,R)),OUTDD=PROCLIB
    SELECT MEMBER=TSSOPROC
