***********************************************************************
* THIS IS THE TSSO ADDRESS SPACE COMMON DATA DSECT. ALL TSSO MODULES  *
* NEEDING TO REFERENCE THIS DSECT CAN PICK IT UP AFTER INITIALIZATION *
* FROM THE TSSODSEC FIELD IN THE TSSO CVT.                            *
*                                                                     *
* THESE FIELDS ARE INITIALIZED MOSTLY IN THE TSSOINIT MODULE.         *
***********************************************************************
DATD     DSECT
WORKAREA DS    CL200            WORK AREA FOR CONVERSIONS AND STUFF
PARMPTR  DS    A                POINTER TO TSSO PARMS FROM JCL OR OP
*                               CONSOLE
************************************************************
* TSSO SUBSYSTEM PARAMETER SECTION. ALL THESE VALUES CAN BE*
* SET FROM THE TSSO PARMLIB MEMBER.
************************************************************
PARMMEM  DC    CL8' '           ADDRESS OF BUFFER FROM PARM READS
PARMBLK  DS    F                BLOCKSIZE OF SYS1.PARMLIB
PARMREAD DS    H                NUMBER OF BYTES READ THIS TIME
PARMBUF  DS    A                POINTER TO BUFFER FOR PARMLIB
*
TMPNAME  DS    CL8              NAME OF THE TERMINAL MONITOR PGM
TSSOSRC  DS    X                TSSO SUBSYSTEM RECOGNITION CHAR
TSSOSSSM DC    CL8' '           NAME OF TSSO SUB SYSTEM SUPPORT
*                               MODULE
INISEC   DS    CL4              MINI, MEDI OR MAXI
ININUMSS DS    F                NUMBER OF SUBSYSTEM CONSOLES REQUESTED
TSSOTABN DC    CL8' '           NAME OF TSSO SYSTEM CONTROL TABLE
MAXCMDS  DS    F                MAXIMUM NUMBER OF COMMANDS
TMEOTVL  DS    F                TSSO TIMEOUT VALUE.
MAXWTO   DS    F                MAXIMUM NUMBER OF WTOS FOR ANY 1
*                               COMMAND.
TSSOSWAP DS    X                SWAPPABLE OR NON-SWAPPABLE
*                               Y - NON SWAPPABLE
*                               N - SWAPPABLE
TSSOPROM DS    X                TSSO PROMPTS OPERATOR FOR PARMS
TSSORACF DS    CL9              TSSO RACF USER ID (AND LENGTH IN BYTE 1
STARFORC DS    C                FORCE START TSSO - Y = YES, N = NO
WTORECB  DS    A
PROMPINP DS    CL80             PROMPTING INPUT
SSIARRAY DS    CL360            ARRAY OF UP TO 10 SUBSYSTEM INTERFACE
*                               CHARACTERS.
* EACH ENTRY IN THE ARRAY WILL HAVE THE FOLLOWING ENTRIES.
* DC CL2'SUBSYSTEM FUNCTION NUMBER'
* DC CL6'RESERVED'
* DS CL8'LOAD MODULE NAME'
* DS CL4'LOAD MODULE ADDRESS IN CSA'
* DS CL8'DATE OF ASSEMBLY'
* DS CL8'TIME OF ASSEMBLY'
*
* DS CL36 CHARACTERS PER ENTRY.
*
SSICOUNT DS    H                COUNT OF SUPPORTED SSI CALLS  IN TSSO
************************************************************
* THESE VARIABLES ARE REQUIRED TO ISSUE A TSO COMMAND      *
* USING THE ISSUECMD SUBROUTINE. THE IDEA IS TO PLACE VALUE*
* IN THESE VARIABLES, WHEREAS THAT ROUTINE CAN THAT PICK   *
* UP THOSE VALUES AND EXECUTE THE COMMAND                  *
************************************************************
TSSOPFLG DS    F                PARAMETERS TO PASS TO DOCM.
*BYTE 1:
* X'80' - NO AUTHORITY CHECKING FOR THIS COMMAND.
TSSOPRMP DS    A                POINTER TO THE TSO PARM LIST.
TSSOPRMS DS    0H               TSSO PARAMETER TSO PARM LIST.
TSSOCMDL DS    H                LENGTH OF TSO COMMAND
TSSOCMD  DS    CL130            ACTUAL TSO COMMAND TO BE ISSUED
TSSOPECB DS    F                ECB TO WAIT ON WHILE TMP IS RUNNING
TSSOPTCB DS    A                ADDRESS OF THE TMP'S TCB
************************************************************
* TSSO MAINLINE PROGRAM VARIABLES
************************************************************
HOLDSSIB DS    A                TEMP STORAGE FOR TSSOSSIB FIELD
TSSOTCB  DC    F'0'             TSSO MAINLINE TCB
TSSOJSCB DC    F'0'             TSSO SUBSYSTEM INTERFACE BLOCK
TSSOASXB DS    F
TSSOACEE DS    A              ADDRESS OF TSSO'S ACEE.
TSSOSENV DS    F
RACFSENV DS    F              ACEE BEFORE WE MODIFY IT.
ATTCECB2 DC    F'0'
ATTCTCB2 DC    F'0'
TSSOSSNM DS    F              TSSO SSIB SUBSYSTEM NAME
WTOADDR  DS    A              ADDRESS OF TSSOWTO MODULE
TSSWPARM DS    A              TSSOWTO MODULE PARAMETERS.
DOUBLE   DS    D                DOUBLEWORD USED FOR PACKING
CMDRINGL DS    A              ADDRESS OF TSSO COMMAND RING- USED TO
*                             HOLD ADDRESS UNTIL WE GET TSSO CVT
CURRCMD  DS    A              CURRENT COMMAND ENTRY THAT TSSO IS
*                             PROCESSING
CONSPARM DS    F              CONSOLE ID TO BE USED AS A PARAMETER TO
*                             THE TSSOWTO MODULE.
TSSWFLAG DS    F              FLAG WORD TO BE USED AS A PARAMETER TO
*                             THE TSSOWTO MODULE.
CCMDFLAG DS    F              FLAG WORD TO BE USED AS OUTPUT FROM THE
*                             TSSOCCMD MODULE.
* CCMDFLAG: BYTE 1
*           X'80'  CONTROL COMMAND IS A REQUEST TO STOP TSSO
*           X'40'  AT THE COMPLETION OF THE CONTROL COMMAND, LIST THE
*                  SYSTSPRT FILE. THE CONSOLE WILL BE IN THE LOW
*                  ORDER THREE BYTES.
CURRCONS DS    F              CONSOLE FOR CURRENT COMMAND (I.E. CMD
*                             TSSO IS CURRENTLY WORKING ON.
***********************************************************************
*                                                                     *
*                                                                     *
* THESE VARIABLES ARE REQUIRED TO SUPPORT THE #.J FUNCTIONS OF TSSO   *
*                                                                     *
***********************************************************************
PRIMSSIB DC    0F'0',C'SSIB',AL2(36,0),C'JES2',CL16' ',XL8'00'
$SVSSIB  DS    9F
$SVSSOBA DS    F
$SVSSOB  DS    5F,7F
$SVRRECB DS    F
***********************************************************************
*                                                                     *
*                                                                     *
* THESE VARIABLES SUPPORT THE NEW SECURITY FEATURES IN TSSO 4.2       *
*                                                                     *
***********************************************************************
SECSYS   DS    CL4           (RACF, ACF2)
***********************************************************************
* THESE VARIABLES ARE REQUIRED TO FORM THE RE-ENTRANT FORMS OF THE    *
* MVS MACRO INSTRUCTIONS.                                             *
***********************************************************************
ESTAED   ESTAE 0,MF=L
*
ETDESD   ETDES  TOKEN=0,PURGE=YES,MF=L
*
WTO1D    WTO   'TSSI065S SUBSYSTEM NAME NOT DEFINED- TSSO TERMINATING',X
               DESC=(1),MF=L
*
WTO4D    WTO   'TSST060I  T S S O   VERSION 4.3.0 INITIALIZATION COMPLEX
               TED',MF=L
*
WTO5D    WTO   'TSST998E INVALID TSSO COMMAND',                        X
               DESC=(5),MCSFLAG=(REG0,NOCPY),MF=L
*
WTO9D    WTO   'TSST052S TSSO COULD NOT LOAD ITS ESTAE MODULE (TSSOESTAX
                AND IS TERMINATING',MF=L,DESC=(1)
*
WTO10D   WTO   'TSST061I TSSO IS WAITING FOR POST FROM SSSM',MF=L
*
WTO11D   WTO   'TSST062I TSSO HAS BEEN POSTED FROM SSSM',MF=L
*
WTO12D   WTO   'TSST004E TSSO COULD NOT OBTAIN A JOB INDENTIFIER FROM  X
               JES',MF=L
*
WTO14D   WTO   'TSST064I TSSO DISCONNECTED- SUBSYSTEM UNAVAILABLE',MF=L
*
WTO15D   WTO   'TSSC122I TSSO IS USING TABLE XXXXXXXX FOR THE AUTOMATEDX
                 OPERATIONS FACILITY',MCSFLAG=(REG0),MF=L
*
WTO16D   WTO   'TSSI007E PARMLIB PARAMETER "XXXXXXXX" IS INVALID',MF=L
*
WTO17D   WTO   'TSSI008E PARMLIB PARAMETER "XXXXXXXX" IS INCORRECTLY SPX
               ECIFIED',MF=L
*
WTO18D   WTO   'TSSI010E MEMBER XXXXXXXX IS NOT IN PARMLIB- TSSO DEFAULX
               TS USED',MF=L
*
WTO19D   WTO   'TSST055I TSSO IS USING TABLE NAME XXXXXXXX FOR THE AUTOX
               MATED OPERATIONS FACILITY',MF=L
*
WTO20D   WTO   'TSSC108S MODULE XXXXXXXX NOT FOUND, AUTOMATED OPERATIONX
               S FACILITY DEACTIVATED',DESC=1,MF=L
*
WTO21D   WTO   'TSSC109S MODULE XXXXXXXX IS NOT AN AUTOMATED OPERATIONSX
                FACILITY TABLE- FUNCTION DEACTIVATED',DESC=(1),MF=L
*
WTO22D   WTO   'TSSC117I TSSO MAXIMUM COMMANDS SET AT XX',MCSFLAG=(REG0X
               ),MF=L
*
WTO23D   WTO   'TSST014I TSSO SUBSYSTEM SUPPORT MODULE IS XXXXXXXX',   X
               MF=L
*
WTO24D   WTO   'TSSC114I TSSO DEFAULT SECURITY ID IS XXXXXXXX',MCSFLAG=X
               (REG0),MF=L
*
WTOR25D  WTOR  'TSSI001A ENTER PARMLIB MEMBER FOR TSSO PARAMETERS',MF=L
*
WTOR26D  WTOR  'TSSI012A ENTER TSSO PARAMETERS (OR "END")',MF=L
*
WTO27D   WTO   'TSSC112I T S S O  VERSION 4.3.0 --> DATE: &SYSDATE, TIMX
               E: &SYSTIME',MCSFLAG=(REG0),MF=L
*
WTO28D   WTO   'TSSC113I XXXXXXXXXXXXX -----------> DATE: XXXXXXXX, TIMX
               E: XXXXXXXX',MCSFLAG=(REG0),MF=L
*
WTO32D   WTO   'TSSC125S TABLE XXXXXXXX IS AT AN INCORRECT LEVEL- REASSX
               EMBLE',DESC=1,MF=L
*
*
WTO36D   WTO   'TSSC118I TSSO WILL OUTPUT A MAXIMUM OF XXXX WTO"S PER CX
               OMMAND',MCSFLAG=(REG0),MF=L
*
WTO38D   WTO   'TSSC123I TABLE ID: XXXXXXXX, DATE: XXXXXXXX, TIME: XXXXX
               XXXX',MCSFLAG=(REG0),MF=L
*
WTO39D   WTO   'TSST054A AN ERROR HAS OCCURED LOADING MODULE XXXXXXXX- X
               TSSO IS TERMINATING',DESC=(1),MF=L
*
WTO48D   WTO   'TSSC119I SUBSYSTEM CONSOLE XX,                         X
                         ',MCSFLAG=(REG0),MF=L
*
WTO49D   WTO   'TSSC140I XX SUBSYSTEM CONSOLES REQUESTED, XX ALLOCATED'X
               ,MCSFLAG=(REG0),MF=L
*
TWTOD    WTO   '                                                       X
                                        ',MF=L
READD    READ  DECB,SF,MF=L
PARMDCBD DCB   DDNAME=PARMLIB,DSORG=PO,MACRF=R
OPEND    OPEN  (,INPUT),MF=L
CLOSED   CLOSE  (,LEAVE),MF=L
ATTACHD  ATTACH SF=L
CALL1D   CALL  ,(0,0,0),MF=L
PARSPARM DS    0H
PARS1    DS    A
PARS2    DS    A
PARS3    DS    A
PARS4    DS    A
PARSSEP  DS    CL4
PARARRAY DS    CL130
PARMFLAG DS    X
* X'80'  STORAGE WAS OBTAINED
* X'40'  PROMPTING REQUESTED DURING PARMLIB INPUT
* X'20'  CURRENTLY IN PROMPT MODE.
* X'10'  A DEDICATED SUBSYSTEM CONSOLE IS REQUESTED.
* X'01'  SEVERE ERROR IN INITIALIZATION...
