*          DATA SET CBT1660    AT LEVEL 143 AS OF 07/24/90
//CBT1660 JOB 527TSO000S0008,'CBT1660',CLASS=0,MSGCLASS=A,
// NOTIFY=TS15500
/*JOBPARM ROOM=F04L
//STEP01   EXEC BANNER,P='CBT1660!!CBT1660',COPY=3
// EXEC ASMBLR,SO=A
         MACRO
&LABEL   SAVEDN &R1,&R2,&R3,&R4,&R5,&R6,&R7,&R8
&LABEL   DS    0H
         STM   14,12,12(13)
         AIF   (T'&R1 NE 'O').DN1
         BALR  3,0
         USING *,3
         AGO   .DN2
.DN1     ANOP
         BALR  &R1,0
         USING *,&R1
         AIF   (T'&R2 EQ 'O').DN2
DHN0001A B     DHN0003A
DHN0002A DC    A(DHN0001A+4096)
DHN0003A L     &R2,DHN0002A
         USING DHN0001A+4096,&R2
         AIF   (T'&R3 EQ 'O').DN2
DHN0004A B     DHN0006A
DHN0005A DC    A(DHN0001A+8192)
DHN0006A L     &R3,DHN0005A
         USING DHN0001A+8192,&R3
         AIF   (T'&R4 EQ 'O').DN2
DHN0007A B     DHN0009A
DHN0008A DC    A(DHN0001A+12288)
DHN0009A L     &R4,DHN0008A
         USING DHN0001A+12288,&R4
         AIF   (T'&R5 EQ 'O').DN2
DHN0010A B     DHN0012A
DHN0011A DC    A(DHN0001A+16384)
DHN0012A L     &R5,DHN0011A
         USING DHN0001A+16384,&R5
         AIF   (T'&R6 EQ 'O').DN2
DHN0013A B     DHN0015A
DHN0014A DC    A(DHN0001A+20470)
DHN0015A L     &R6,DHN0014A
         USING DHN0001A+20470,&R6
         AIF   (T'&R7 EQ 'O').DN2
DHN0016A B     DHN0018A
DHN0017A DC    A(DHN0001A+24566)
DHN0018A L     &R7,DHN0017A
         USING DHN0001A+24566,&R7
         AIF   (T'&R8 EQ 'O').DN2
DHN0019A B     DHN0021A
DHN0020A DC    A(DHN0001A+28662)
DHN0021A L     &R8,DHN0020A
         USING DHN0001A+28662,&R8
.DN2     ANOP
         CNOP  0,4
         B     *+8
DHN0&SYSNDX    DC  A(SAVE)
         ST    13,SAVE+4
         MVC   8(4,13),DHN0&SYSNDX
         LA    13,SAVE
         MEND
         MACRO
         REGDN
         B     DHNCONTN
SAVE     DS    18F           SAVE AREA FOR MACRO SAVEDN
**                           EQUATES FOR SYMBOLIC REG USAGE
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
DHNCONTN EQU   *
         MEND
MURPHY   CSECT
         SAVEDN 2,3,4,5,6
         L     R1,0(R1)               POINT TO PARM
         CLC   0(2,R1),=H'0'          Q. ANY PARM
         BE    STCK                   A. NO
         CLC   2(6,R1),=C'TESTIT'     Q. IS PARM TESTIT
         BNE   STCK                   A. YES
         SPACE 1
         MVI   TESTIT+1,X'00'         SET TEST SWITCH
         LA    R10,0                  FORCE 1ST ENTRY
         LA    R12,MLTBL              POINT TO 1ST MSG ADDR
         B     SETPTR
STCK     STCK  DWORD
         SR    R10,R10
         ICM   R11,7,DWORD+2          GET PART OF CLOCK
         LA    R11,0(R11)             PURIFY IT
         SPACE 1
         D     R10,=A((ML00000-MLTBL)/4)  DIVIDE BY NUMBER OF ENTRIES
         SLL   R10,2                  MULT REMAINDER BY 4
SETPTR   LA    R9,MLTBL(R10)          POINT TO MSG ADDRESS
         L     R8,0(R9)               GET THE MSG ADDRESS
         LA    R7,75                  STD MSG LENGTH
         B     TPUTLOOK
TPUTLOOK CLI   0(R8),X'FE'            Q. ANY MSG TO PUT OUT
         BE    TESTIT                 A. NO
         PRINT  GEN
         TPUT  (R8),(R7),R
         AR    R8,R7                  INDEX TO NEXT LINE
         B     TPUTLOOK
TESTIT   B     ENDIT
         LA    R12,4(R12)
         C     R12,=A(ML00000)        Q. END OF MSG LIST
         BE    ENDIT                  A. YES
         LA    R10,4(R10)             BUMP INDEX
         LR    R1,R10
         SRL   R1,2                   DIVIDE BY 4
         CVD   R1,DWORD               MAKE IT PACKED
         UNPK  WORK,DWORD
         OI    WORK+4,X'F0'           REMOVE SIGN
         TPUT  MSG#,L'MSG#
         B     SETPTR                 AND LOOP
ENDIT    EQU   *
RETURN  EQU  *
         L     R13,SAVE+4
         LA    15,0 LOAD ZERO (NO CODE) TO REG 15
         L     14,12(13,0) RESTORE REGISTER 14
         LM    0,12,20(13) RESTORE THE REGISTERS
         BR    14       RETURN
*        GETOUT
DWORD    DC    D'0'
MSG#     DS    0CL7
         DC    C'ML'
WORK     DC    CL5' '
         LTORG
         SPACE 1
         REGDN
MLTBL    DC    A(ML00000)
         DC    A(ML00001)
         DC    A(ML00002)
         DC    A(ML00003)
         DC    A(ML00004)
         DC    A(ML00005)
         DC    A(ML00006)
         DC    A(ML00007)
         DC    A(ML00008)
         DC    A(ML00009)
         DC    A(ML00010)
         DC    A(ML00011)
         DC    A(ML00012)
         DC    A(ML00013)
         DC    A(ML00014)
         DC    A(ML00015)
         DC    A(ML00016)
         DC    A(ML00017)
         DC    A(ML00018)
         DC    A(ML00019)
         DC    A(ML00020)
         DC    A(ML00021)
         DC    A(ML00022)
         DC    A(ML00023)
         DC    A(ML00024)
         DC    A(ML00025)
         DC    A(ML00026)
         DC    A(ML00027)
         DC    A(ML00028)
         DC    A(ML00029)
         DC    A(ML00030)
         DC    A(ML00031)
         DC    A(ML00032)
         DC    A(ML00033)
         DC    A(ML00034)
         DC    A(ML00035)
         DC    A(ML00036)
         DC    A(ML00037)
         DC    A(ML00038)
         DC    A(ML00039)
         DC    A(ML00040)
         DC    A(ML00041)
         DC    A(ML00042)
         DC    A(ML00043)
         DC    A(ML00044)
         DC    A(ML00045)
         DC    A(ML00046)
         DC    A(ML00047)
         DC    A(ML00048)
         DC    A(ML00049)
         DC    A(ML00050)
         DC    A(ML00051)
         DC    A(ML00052)
         DC    A(ML00053)
         DC    A(ML00054)
         DC    A(ML00055)
         DC    A(ML00056)
         DC    A(ML00057)
         DC    A(ML00058)
         DC    A(ML00059)
         DC    A(ML00060)
         DC    A(ML00061)
         DC    A(ML00062)
         DC    A(ML00063)
         DC    A(ML00064)
         DC    A(ML00065)
         DC    A(ML00066)
         DC    A(ML00067)
         DC    A(ML00068)
         DC    A(ML00069)
         DC    A(ML00070)
         DC    A(ML00071)
         DC    A(ML00072)
         DC    A(ML00073)
         DC    A(ML00074)
         DC    A(ML00075)
         DC    A(ML00076)
         DC    A(ML00077)
         DC    A(ML00078)
         DC    A(ML00079)
         DC    A(ML00080)
         DC    A(ML00081)
         DC    A(ML00082)
         DC    A(ML00083)
         DC    A(ML00084)
         DC    A(ML00085)
         DC    A(ML00086)
         DC    A(ML00087)
         DC    A(ML00088)
         DC    A(ML00089)
         DC    A(ML00090)
         DC    A(ML00091)
         DC    A(ML00092)
         DC    A(ML00093)
         DC    A(ML00094)
         DC    A(ML00095)
         DC    A(ML00096)
         DC    A(ML00097)
         DC    A(ML00098)
         DC    A(ML00099)
         DC    A(ML00100)
         DC    A(ML00101)
         DC    A(ML00102)
         DC    A(ML00103)
         DC    A(ML00104)
         DC    A(ML00105)
         DC    A(ML00106)
         DC    A(ML00107)
         DC    A(ML00108)
         DC    A(ML00109)
         DC    A(ML00110)
         DC    A(ML00111)
         DC    A(ML00112)
         DC    A(ML00113)
         DC    A(ML00114)
         DC    A(ML00115)
         DC    A(ML00116)
         DC    A(ML00117)
         DC    A(ML00118)
         DC    A(ML00119)
         DC    A(ML00120)
         DC    A(ML00121)
         DC    A(ML00122)
         DC    A(ML00123)
         DC    A(ML00124)
         DC    A(ML00125)
         DC    A(ML00126)
         DC    A(ML00127)
         DC    A(ML00128)
         DC    A(ML00129)
         DC    A(ML00130)
         DC    A(ML00131)
         DC    A(ML00132)
         DC    A(ML00133)
         DC    A(ML00134)
         DC    A(ML00135)
         DC    A(ML00136)
         DC    A(ML00137)
         DC    A(ML00138)
         DC    A(ML00139)
         DC    A(ML00140)
         DC    A(ML00141)
         DC    A(ML00142)
         DC    A(ML00143)
         DC    A(ML00144)
         DC    A(ML00145)
         DC    A(ML00146)
         DC    A(ML00147)
         DC    A(ML00148)
         DC    A(ML00149)
         DC    A(ML00150)
         DC    A(ML00151)
         DC    A(ML00152)
         DC    A(ML00153)
         DC    A(ML00154)
         DC    A(ML00155)
         DC    A(ML00156)
         DC    A(ML00157)
         DC    A(ML00158)
         DC    A(ML00159)
         DC    A(ML00160)
         DC    A(ML00161)
         DC    A(ML00162)
         DC    A(ML00163)
         DC    A(ML00164)
         DC    A(ML00165)
         DC    A(ML00166)
         DC    A(ML00167)
         DC    A(ML00168)
         DC    A(ML00169)
         DC    A(ML00170)
         DC    A(ML00171)
         DC    A(ML00172)
         DC    A(ML00173)
         DC    A(ML00174)
         DC    A(ML00175)
         DC    A(ML00176)
         DC    A(ML00177)
         DC    A(ML00178)
         DC    A(ML00179)
         DC    A(ML00180)
         DC    A(ML00181)
         DC    A(ML00182)
         DC    A(ML00183)
         DC    A(ML00184)
         DC    A(ML00185)
         DC    A(ML00186)
         DC    A(ML00187)
         DC    A(ML00188)
         DC    A(ML00189)
         DC    A(ML00190)
         DC    A(ML00191)
         DC    A(ML00192)
         DC    A(ML00193)
         DC    A(ML00194)
         DC    A(ML00195)
         DC    A(ML00196)
         DC    A(ML00197)
         DC    A(ML00198)
         DC    A(ML00199)
         DC    A(ML00200)
         DC    A(ML00201)
         DC    A(ML00202)
         DC    A(ML00203)
         DC    A(ML00204)
         DC    A(ML00205)
         DC    A(ML00206)
         DC    A(ML00207)
         DC    A(ML00208)
         DC    A(ML00209)
         DC    A(ML00210)
         DC    A(ML00211)
         DC    A(ML00212)
         DC    A(ML00213)
         DC    A(ML00214)
         DC    A(ML00215)
         DC    A(ML00216)
         DC    A(ML00217)
         DC    A(ML00218)
         DC    A(ML00219)
         DC    A(ML00220)
         DC    A(ML00221)
         DC    A(ML00222)
         DC    A(ML00223)
         DC    A(ML00224)
         DC    A(ML00225)
         DC    A(ML00226)
         DC    A(ML00227)
         DC    A(ML00228)
         DC    A(ML00229)
         DC    A(ML00230)
         DC    A(ML00231)
         DC    A(ML00232)
         DC    A(ML00233)
         DC    A(ML00234)
         DC    A(ML00235)
         DC    A(ML00236)
         DC    A(ML00237)
         DC    A(ML00238)
         DC    A(ML00239)
         DC    A(ML00240)
         DC    A(ML00241)
         DC    A(ML00242)
         DC    A(ML00243)
         DC    A(ML00244)
         DC    A(ML00245)
         DC    A(ML00246)
         DC    A(ML00247)
         DC    A(ML00248)
         DC    A(ML00249)
         DC    A(ML00250)
         DC    A(ML00251)
         DC    A(ML00252)
         DC    A(ML00253)
         DC    A(ML00254)
         DC    A(ML00255)
         DC    A(ML00256)
         DC    A(ML00257)
         DC    A(ML00258)
         DC    A(ML00259)
         DC    A(ML00260)
         DC    A(ML00261)
         DC    A(ML00262)
         DC    A(ML00263)
         DC    A(ML00264)
         DC    A(ML00265)
         DC    A(ML00266)
         DC    A(ML00267)
         DC    A(ML00268)
         DC    A(ML00269)
         DC    A(ML00270)
         DC    A(ML00271)
         DC    A(ML00272)
         DC    A(ML00273)
         DC    A(ML00274)
         DC    A(ML00275)
         DC    A(ML00276)
         DC    A(ML00277)
         DC    A(ML00278)
         DC    A(ML00279)
         DC    A(ML00280)
         DC    A(ML00281)
         DC    A(ML00282)
         DC    A(ML00283)
         DC    A(ML00284)
         DC    A(ML00285)
         DC    A(ML00286)
         DC    A(ML00287)
         DC    A(ML00288)
         DC    A(ML00289)
         DC    A(ML00290)
         DC    A(ML00291)
         DC    A(ML00292)
         DC    A(ML00293)
         DC    A(ML00294)
         DC    A(ML00295)
         DC    A(ML00296)
         DC    A(ML00297)
         DC    A(ML00298)
         DC    A(ML00299)
         DC    A(ML00300)
         DC    A(ML00301)
         DC    A(ML00302)
         DC    A(ML00303)
         DC    A(ML00304)
         DC    A(ML00305)
         DC    A(ML00306)
         DC    A(ML00307)
         DC    A(ML00308)
         DC    A(ML00309)
         DC    A(ML00310)
         DC    A(ML00311)
         DC    A(ML00312)
         DC    A(ML00313)
         DC    A(ML00314)
         DC    A(ML00315)
         DC    A(ML00316)
         DC    A(ML00317)
         DC    A(ML00318)
         DC    A(ML00319)
         DC    A(ML00320)
         DC    A(ML00321)
         DC    A(ML00322)
         DC    A(ML00323)
         DC    A(ML00324)
         DC    A(ML00325)
         DC    A(ML00326)
         DC    A(ML00327)
         DC    A(ML00328)
         DC    A(ML00329)
         DC    A(ML00330)
         DC    A(ML00331)
         DC    A(ML00332)
         DC    A(ML00333)
         DC    A(ML00334)
         DC    A(ML00335)
         DC    A(ML00336)
         DC    A(ML00337)
         DC    A(ML00338)
         DC    A(ML00339)
         DC    A(ML00340)
         DC    A(ML00341)
         DC    A(ML00342)
         DC    A(ML00343)
         DC    A(ML00344)
         DC    A(ML00345)
         DC    A(ML00346)
         DC    A(ML00347)
         DC    A(ML00348)
         DC    A(ML00349)
         DC    A(ML00350)
         DC    A(ML00351)
         DC    A(ML00352)
         DC    A(ML00353)
         DC    A(ML00354)
         DC    A(ML00355)
         DC    A(ML00356)
         DC    A(ML00357)
         DC    A(ML00358)
         DC    A(ML00359)
         DC    A(ML00360)
         DC    A(ML00361)
         DC    A(ML00362)
         DC    A(ML00363)
         DC    A(ML00364)
         DC    A(ML00365)
         DC    A(ML00366)
         DC    A(ML00367)
         DC    A(ML00368)
         DC    A(ML00369)
         DC    A(ML00370)
         DC    A(ML00371)
         DC    A(ML00372)
         DC    A(ML00373)
         DC    A(ML00374)
         DC    A(ML00375)
         DC    A(ML00376)
         DC    A(ML00377)
         DC    A(ML00378)
         DC    A(ML00379)
         DC    A(ML00380)
         DC    A(ML00381)
         DC    A(ML00382)
         DC    A(ML00383)
         DC    A(ML00384)
         DC    A(ML00385)
         DC    A(ML00386)
         DC    A(ML00387)
         DC    A(ML00388)
         DC    A(ML00389)
         DC    A(ML00390)
         DC    A(ML00391)
         DC    A(ML00392)
         DC    A(ML00393)
         DC    A(ML00394)
         DC    A(ML00395)
         DC    A(ML00396)
         DC    A(ML00397)
         DC    A(ML00398)
         DC    A(ML00399)
         DC    A(ML00400)
         DC    A(ML00401)
         DC    A(ML00402)
         DC    A(ML00403)
         DC    A(ML00404)
         DC    A(ML00405)
         DC    A(ML00406)
         DC    A(ML00407)
         DC    A(ML00408)
         DC    A(ML00409)
         DC    A(ML00410)
         DC    A(ML00411)
         DC    A(ML00412)
         DC    A(ML00413)
         DC    A(ML00414)
         DC    A(ML00415)
         DC    A(ML00416)
         DC    A(ML00417)
         DC    A(ML00418)
         DC    A(ML00419)
         DC    A(ML00420)
         DC    A(ML00421)
         DC    A(ML00422)
         DC    A(ML00423)
         DC    A(ML00424)
         DC    A(ML00425)
         DC    A(ML00426)
         DC    A(ML00427)
         DC    A(ML00428)
         DC    A(ML00429)
         DC    A(ML00430)
         DC    A(ML00431)
         DC    A(ML00432)
         DC    A(ML00433)
         DC    A(ML00434)
         DC    A(ML00435)
         DC    A(ML00436)
         DC    A(ML00437)
         DC    A(ML00438)
         DC    A(ML00439)
         DC    A(ML00440)
         DC    A(ML00441)
         DC    A(ML00442)
         DC    A(ML00443)
         DC    A(ML00444)
         DC    A(ML00445)
         DC    A(ML00446)
         DC    A(ML00447)
         DC    A(ML00448)
         DC    A(ML00449)
         DC    A(ML00450)
         DC    A(ML00451)
         DC    A(ML00452)
         DC    A(ML00453)
         DC    A(ML00454)
         DC    A(ML00455)
         DC    A(ML00456)
         DC    A(ML00457)
         DC    A(ML00458)
         DC    A(ML00459)
         DC    A(ML00460)
         DC    A(ML00461)
         DC    A(ML00462)
         DC    A(ML00463)
         DC    A(ML00464)
         DC    A(ML00465)
         DC    A(ML00466)
         DC    A(ML00467)
         DC    A(ML00468)
         DC    A(ML00469)
         DC    A(ML00470)
         DC    A(ML00471)
         DC    A(ML00472)
         DC    A(ML00473)
         DC    A(ML00474)
         DC    A(ML00475)
         DC    A(ML00476)
         DC    A(ML00477)
         DC    A(ML00478)
         DC    A(ML00479)
         DC    A(ML00480)
         DC    A(ML00481)
         DC    A(ML00482)
         DC    A(ML00483)
         DC    A(ML00484)
         DC    A(ML00485)
         DC    A(ML00486)
         DC    A(ML00487)
         DC    A(ML00488)
         DC    A(ML00489)
         DC    A(ML00490)
         DC    A(ML00491)
         DC    A(ML00492)
         DC    A(ML00493)
         DC    A(ML00494)
         DC    A(ML00495)
         DC    A(ML00496)
         DC    A(ML00497)
         DC    A(ML00498)
         DC    A(ML00499)
         DC    A(ML00500)
         DC    A(ML00501)
         DC    A(ML00502)
         DC    A(ML00503)
         DC    A(ML00504)
         DC    A(ML00505)
         DC    A(ML00506)
         DC    A(ML00507)
         DC    A(ML00508)
         DC    A(ML00509)
         DC    A(ML00510)
         DC    A(ML00511)
         DC    A(ML00512)
         DC    A(ML00513)
         DC    A(ML00514)
         DC    A(ML00515)
         DC    A(ML00516)
         DC    A(ML00517)
         DC    A(ML00518)
         DC    A(ML00519)
         DC    A(ML00520)
         DC    A(ML00521)
         DC    A(ML00522)
         DC    A(ML00523)
         DC    A(ML00524)
         DC    A(ML00525)
         DC    A(ML00526)
         DC    A(ML00527)
         DC    A(ML00528)
         DC    A(ML00529)
         DC    A(ML00530)
         DC    A(ML00531)
         DC    A(ML00532)
         DC    A(ML00533)
         DC    A(ML00534)
         DC    A(ML00535)
         DC    A(ML00536)
         DC    A(ML00537)
         DC    A(ML00538)
         DC    A(ML00539)
         DC    A(ML00540)
         DC    A(ML00541)
         DC    A(ML00542)
         DC    A(ML00543)
         DC    A(ML00544)
         DC    A(ML00545)
         DC    A(ML00546)
         DC    A(ML00547)
         DC    A(ML00548)
         DC    A(ML00549)
         DC    A(ML00550)
         DC    A(ML00551)
         DC    A(ML00552)
         DC    A(ML00553)
         DC    A(ML00554)
         DC    A(ML00555)
         DC    A(ML00556)
         DC    A(ML00557)
         DC    A(ML00558)
         DC    A(ML00559)
         DC    A(ML00560)
         DC    A(ML00561)
         DC    A(ML00562)
         DC    A(ML00563)
         DC    A(ML00564)
         DC    A(ML00565)
         DC    A(ML00566)
         DC    A(ML00567)
         DC    A(ML00568)
         DC    A(ML00569)
         DC    A(ML00570)
         DC    A(ML00571)
         DC    A(ML00572)
         DC    A(ML00573)
         DC    A(ML00574)
         DC    A(ML00575)
         DC    A(ML00576)
         DC    A(ML00577)
         DC    A(ML00578)
         DC    A(ML00579)
         DC    A(ML00580)
         DC    A(ML00581)
         DC    A(ML00582)
         DC    A(ML00583)
         DC    A(ML00584)
         DC    A(ML00585)
         DC    A(ML00586)
         DC    A(ML00587)
         DC    A(ML00588)
         DC    A(ML00589)
         DC    A(ML00590)
         DC    A(ML00591)
         DC    A(ML00592)
         DC    A(ML00593)
         DC    A(ML00594)
         DC    A(ML00595)
         DC    A(ML00596)
         DC    A(ML00597)
         DC    A(ML00598)
         DC    A(ML00599)
         DC    A(ML00600)
         DC    A(ML00601)
         DC    A(ML00602)
         DC    A(ML00603)
         DC    A(ML00604)
         DC    A(ML00605)
         DC    A(ML00606)
         DC    A(ML00607)
         DC    A(ML00608)
         DC    A(ML00609)
         DC    A(ML00610)
         DC    A(ML00611)
         DC    A(ML00612)
         DC    A(ML00613)
         DC    A(ML00614)
         DC    A(ML00615)
         DC    A(ML00616)
         DC    A(ML00617)
         DC    A(ML00618)
         DC    A(ML00619)
         DC    A(ML00620)
         DC    A(ML00621)
         DC    A(ML00622)
         DC    A(ML00623)
         DC    A(ML00624)
         DC    A(ML00625)
         DC    A(ML00626)
         DC    A(ML00627)
         DC    A(ML00628)
         DC    A(ML00629)
         DC    A(ML00630)
         DC    A(ML00631)
         DC    A(ML00632)
         DC    A(ML00633)
         DC    A(ML00634)
         DC    A(ML00635)
         DC    A(ML00636)
         DC    A(ML00637)
         DC    A(ML00638)
         DC    A(ML00639)
         DC    A(ML00640)
         DC    A(ML00641)
         DC    A(ML00642)
         DC    A(ML00643)
         DC    A(ML00644)
         DC    A(ML00645)
         DC    A(ML00646)
         DC    A(ML00647)
         DC    A(ML00648)
         DC    A(ML00649)
         DC    A(ML00650)
         DC    A(ML00651)
         DC    A(ML00652)
         DC    A(ML00653)
         DC    A(ML00654)
         DC    A(ML00655)
         DC    A(ML00656)
         DC    A(ML00657)
         DC    A(ML00658)
         DC    A(ML00659)
         DC    A(ML00660)
         DC    A(ML00661)
         DC    A(ML00662)
         DC    A(ML00663)
         DC    A(ML00664)
         DC    A(ML00665)
         DC    A(ML00666)
         DC    A(ML00667)
         DC    A(ML00668)
         DC    A(ML00669)
         DC    A(ML00670)
         DC    A(ML00671)
         DC    A(ML00672)
         DC    A(ML00673)
         DC    A(ML00674)
         DC    A(ML00675)
         DC    A(ML00676)
         DC    A(ML00677)
         DC    A(ML00678)
         DC    A(ML00679)
         DC    A(ML00680)
         DC    A(ML00681)
         DC    A(ML00682)
         DC    A(ML00683)
         DC    A(ML00684)
         DC    A(ML00685)
         DC    A(ML00686)
         DC    A(ML00687)
         DC    A(ML00688)
         DC    A(ML00689)
         DC    A(ML00690)
         DC    A(ML00691)
         DC    A(ML00692)
         DC    A(ML00693)
         DC    A(ML00694)
         DC    A(ML00695)
         DC    A(ML00696)
         DC    A(ML00697)
         DC    A(ML00698)
         DC    A(ML00699)
         DC    A(ML00700)
         DC    A(ML00701)
         DC    A(ML00702)
         DC    A(ML00703)
         DC    A(ML00704)
         DC    A(ML00705)
         DC    A(ML00706)
         DC    A(ML00707)
         DC    A(ML00708)
         DC    A(ML00709)
         DC    A(ML00710)
         DC    A(ML00711)
         DC    A(ML00712)
         DC    A(ML00713)
         DC    A(ML00714)
         DC    A(ML00715)
         DC    A(ML00716)
         DC    A(ML00717)
         DC    A(ML00718)
         DC    A(ML00719)
         DC    A(ML00720)
         DC    A(ML00721)
         DC    A(ML00722)
         DC    A(ML00723)
         DC    A(ML00724)
         DC    A(ML00725)
         DC    A(ML00726)
         DC    A(ML00727)
         DC    A(ML00728)
         DC    A(ML00729)
         DC    A(ML00730)
         DC    A(ML00731)
         DC    A(ML00732)
         DC    A(ML00733)
         DC    A(ML00734)
         DC    A(ML00735)
         DC    A(ML00736)
         DC    A(ML00737)
         DC    A(ML00738)
         DC    A(ML00739)
         DC    A(ML00740)
         DC    A(ML00741)
         DC    A(ML00742)
         DC    A(ML00743)
         DC    A(ML00744)
         DC    A(ML00745)
         DC    A(ML00746)
         DC    A(ML00747)
         DC    A(ML00748)
         DC    A(ML00749)
         DC    A(ML00750)
         DC    A(ML00751)
         DC    A(ML00752)
         DC    A(ML00753)
         DC    A(ML00754)
         DC    A(ML00755)
         DC    A(ML00756)
         DC    A(ML00757)
         DC    A(ML00758)
         DC    A(ML00759)
         DC    A(ML00760)
         DC    A(ML00761)
         DC    A(ML00762)
         DC    A(ML00763)
         DC    A(ML00764)
         DC    A(ML00765)
         DC    A(ML00766)
         DC    A(ML00767)
         DC    A(ML00768)
         DC    A(ML00769)
         DC    A(ML00770)
         DC    A(ML00771)
         DC    A(ML00772)
         DC    A(ML00773)
         DC    A(ML00774)
         DC    A(ML00775)
         DC    A(ML00776)
         DC    A(ML00777)
         DC    A(ML00778)
         DC    A(ML00779)
         DC    A(ML00780)
         DC    A(ML00781)
         DC    A(ML00782)
         DC    A(ML00783)
         DC    A(ML00784)
         DC    A(ML00785)
         DC    A(ML00786)
         DC    A(ML00787)
         DC    A(ML00788)
         DC    A(ML00789)
         DC    A(ML00790)
         DC    A(ML00791)
         DC    A(ML00792)
         DC    A(ML00793)
         DC    A(ML00794)
         DC    A(ML00795)
         DC    A(ML00796)
         DC    A(ML00797)
         DC    A(ML00798)
         DC    A(ML00799)
         DC    A(ML00800)
         DC    A(ML00801)
         DC    A(ML00802)
         DC    A(ML00803)
         DC    A(ML00804)
         DC    A(ML00805)
         DC    A(ML00806)
         DC    A(ML00807)
         DC    A(ML00808)
         DC    A(ML00809)
         DC    A(ML00810)
         DC    A(ML00811)
         DC    A(ML00812)
         DC    A(ML00813)
         DC    A(ML00814)
         DC    A(ML00815)
         DC    A(ML00816)
         DC    A(ML00817)
         DC    A(ML00818)
         DC    A(ML00819)
         DC    A(ML00820)
         DC    A(ML00821)
         DC    A(ML00822)
         DC    A(ML00823)
         DC    A(ML00824)
         DC    A(ML00825)
         DC    A(ML00826)
         DC    A(ML00827)
         DC    A(ML00828)
         DC    A(ML00829)
         DC    A(ML00830)
         DC    A(ML00831)
         DC    A(ML00832)
         DC    A(ML00833)
         DC    A(ML00834)
         DC    A(ML00835)
         DC    A(ML00836)
         DC    A(ML00837)
         DC    A(ML00838)
         DC    A(ML00839)
         DC    A(ML00840)
         DC    A(ML00841)
         DC    A(ML00842)
         DC    A(ML00843)
         DC    A(ML00844)
         DC    A(ML00845)
         DC    A(ML00846)
         DC    A(ML00847)
         DC    A(ML00848)
         DC    A(ML00849)
         DC    A(ML00850)
         DC    A(ML00851)
         DC    A(ML00852)
         DC    A(ML00853)
         DC    A(ML00854)
         DC    A(ML00855)
         DC    A(ML00856)
         DC    A(ML00857)
         DC    A(ML00858)
         DC    A(ML00859)
         DC    A(ML00860)
         DC    A(ML00861)
         DC    A(ML00862)
         DC    A(ML00863)
         DC    A(ML00864)
         DC    A(ML00865)
         DC    A(ML00866)
         DC    A(ML00867)
         DC    A(ML00868)
         DC    A(ML00869)
         DC    A(ML00870)
         DC    A(ML00871)
         DC    A(ML00872)
         DC    A(ML00873)
         DC    A(ML00874)
         DC    A(ML00875)
         DC    A(ML00876)
         DC    A(ML00877)
         DC    A(ML00878)
         DC    A(ML00879)
         DC    A(ML00880)
         DC    A(ML00881)
         DC    A(ML00882)
         DC    A(ML00883)
         DC    A(ML00884)
         DC    A(ML00885)
         DC    A(ML00886)
         DC    A(ML00887)
         DC    A(ML00888)
         DC    A(ML00889)
         DC    A(ML00890)
         DC    A(ML00891)
         DC    A(ML00892)
         DC    A(ML00893)
         DC    A(ML00894)
         DC    A(ML00895)
         DC    A(ML00896)
         DC    A(ML00897)
         DC    A(ML00898)
         DC    A(ML00899)
         DC    A(ML00900)
         DC    A(ML00901)
         DC    A(ML00902)
         DC    A(ML00903)
         DC    A(ML00904)
         DC    A(ML00905)
         DC    A(ML00906)
         DC    A(ML00907)
         DC    A(ML00908)
         DC    A(ML00909)
         DC    A(ML00910)
         DC    A(ML00911)
         DC    A(ML00912)
         DC    A(ML00913)
         DC    A(ML00914)
         DC    A(ML00915)
         DC    A(ML00916)
         DC    A(ML00917)
         DC    A(ML00918)
         DC    A(ML00919)
         DC    A(ML00920)
         DC    A(ML00921)
         DC    A(ML00922)
         DC    A(ML00923)
         DC    A(ML00924)
         DC    A(ML00925)
         DC    A(ML00926)
         DC    A(ML00927)
         DC    A(ML00928)
         DC    A(ML00929)
         DC    A(ML00930)
         DC    A(ML00931)
         DC    A(ML00932)
         DC    A(ML00933)
         DC    A(ML00934)
         DC    A(ML00935)
         DC    A(ML00936)
         DC    A(ML00937)
         DC    A(ML00938)
         DC    A(ML00939)
         DC    A(ML00940)
         DC    A(ML00941)
         DC    A(ML00942)
         DC    A(ML00943)
         DC    A(ML00944)
         DC    A(ML00945)
         DC    A(ML00946)
         DC    A(ML00947)
         DC    A(ML00948)
         DC    A(ML00949)
         DC    A(ML00950)
         DC    A(ML00951)
         DC    A(ML00952)
         DC    A(ML00953)
         DC    A(ML00954)
         DC    A(ML00955)
         DC    A(ML00956)
         DC    A(ML00957)
         DC    A(ML00958)
         DC    A(ML00959)
         DC    A(ML00960)
         DC    A(ML00961)
         DC    A(ML00962)
         DC    A(ML00963)
         DC    A(ML00964)
         DC    A(ML00965)
         DC    A(ML00966)
         DC    A(ML00967)
         DC    A(ML00968)
         DC    A(ML00969)
         DC    A(ML00970)
         DC    A(ML00971)
         DC    A(ML00972)
         DC    A(ML00973)
         DC    A(ML00974)
         DC    A(ML00975)
         DC    A(ML00976)
         DC    A(ML00977)
         DC    A(ML00978)
         DC    A(ML00979)
         DC    A(ML00980)
         DC    A(ML00981)
         DC    A(ML00982)
         DC    A(ML00983)
         DC    A(ML00984)
         DC    A(ML00985)
         DC    A(ML00986)
         DC    A(ML00987)
         DC    A(ML00988)
         DC    A(ML00989)
         DC    A(ML00990)
         DC    A(ML00991)
         DC    A(ML00992)
         DC    A(ML00993)
         DC    A(ML00994)
         DC    A(ML00995)
         DC    A(ML00996)
         DC    A(ML00997)
         DC    A(ML00998)
         DC    A(ML00999)
         DC    A(ML01000)
         DC    A(ML01001)
         DC    A(ML01002)
         DC    A(ML01003)
         DC    A(ML01004)
         DC    A(ML01005)
         DC    A(ML01006)
         DC    A(ML01007)
         DC    A(ML01008)
         DC    A(ML01009)
         DC    A(ML01010)
         DC    A(ML01011)
         DC    A(ML01012)
         DC    A(ML01013)
         DC    A(ML01014)
         DC    A(ML01015)
         DC    A(ML01016)
         DC    A(ML01017)
         DC    A(ML01018)
         DC    A(ML01019)
         DC    A(ML01020)
         DC    A(ML01021)
         DC    A(ML01022)
         DC    A(ML01023)
         DC    A(ML01024)
         DC    A(ML01025)
         DC    A(ML01026)
         DC    A(ML01027)
         DC    A(ML01028)
         DC    A(ML01029)
         DC    A(ML01030)
         DC    A(ML01031)
         DC    A(ML01032)
         DC    A(ML01033)
         DC    A(ML01034)
         DC    A(ML01035)
         DC    A(ML01036)
         DC    A(ML01037)
         DC    A(ML01038)
         DC    A(ML01039)
         DC    A(ML01040)
         DC    A(ML01041)
         DC    A(ML01042)
         DC    A(ML01043)
         DC    A(ML01044)
         DC    A(ML01045)
         DC    A(ML01046)
         DC    A(ML01047)
         DC    A(ML01048)
         DC    A(ML01049)
         DC    A(ML01050)
         DC    A(ML01051)
         DC    A(ML01052)
         DC    A(ML01053)
         DC    A(ML01054)
         DC    A(ML01055)
         DC    A(ML01056)
         DC    A(ML01057)
         DC    A(ML01058)
         DC    A(ML01059)
         DC    A(ML01060)
         DC    A(ML01061)
         DC    A(ML01062)
         DC    A(ML01063)
         DC    A(ML01064)
         DC    A(ML01065)
         DC    A(ML01066)
         DC    A(ML01067)
         DC    A(ML01068)
         DC    A(ML01069)
         DC    A(ML01070)
         DC    A(ML01071)
         DC    A(ML01072)
         DC    A(ML01073)
         DC    A(ML01074)
         DC    A(ML01075)
         DC    A(ML01076)
         DC    A(ML01077)
         DC    A(ML01078)
         DC    A(ML01079)
         DC    A(ML01080)
         DC    A(ML01081)
         DC    A(ML01082)
         DC    A(ML01083)
         DC    A(ML01084)
         DC    A(ML01085)
         DC    A(ML01086)
         DC    A(ML01087)
         DC    A(ML01088)
         DC    A(ML01089)
         DC    A(ML01090)
         DC    A(ML01091)
         DC    A(ML01092)
         DC    A(ML01093)
         DC    A(ML01094)
         DC    A(ML01095)
         DC    A(ML01096)
         DC    A(ML01097)
         DC    A(ML01098)
         DC    A(ML01099)
         DC    A(ML01100)
         DC    A(ML01101)
         DC    A(ML01102)
         DC    A(ML01103)
         DC    A(ML01104)
         DC    A(ML01105)
         DC    A(ML01106)
         DC    A(ML01107)
         DC    A(ML01109)
         DC    A(ML01110)
         DC    A(ML01111)
         DC    A(ML01112)
         DC    A(ML01113)
         DC    A(ML01114)
         DC    A(ML01115)
         DC    A(ML01116)
         DC    A(ML01117)
         DC    A(ML01118)
         DC    A(ML01119)
         DC    A(ML01120)
         DC    A(ML01121)
         DC    A(ML01122)
         DC    A(ML01123)
         DC    A(ML01124)
         DC    A(ML01125)
         DC    A(ML01126)
         DC    A(ML01127)
         DC    A(ML01128)
         DC    A(ML01129)
         DC    A(ML01130)
         DC    A(ML01131)
         DC    A(ML01132)
         DC    A(ML01133)
         DC    A(ML01134)
         DC    A(ML01135)
         DC    A(ML01136)
         DC    A(ML01137)
         DC    A(ML01138)
         DC    A(ML01139)
         DC    A(ML01140)
         DC    A(ML01141)
         DC    A(ML01142)
         DC    A(ML01143)
         DC    A(ML01144)
         DC    A(ML01145)
         DC    A(ML01146)
         DC    A(ML01147)
         DC    A(ML01148)
         DC    A(ML01149)
         DC    A(ML01150)
         DC    A(ML01151)
         DC    A(ML01152)
         DC    A(ML01153)
         DC    A(ML01154)
         DC    A(ML01155)
         DC    A(ML01156)
         DC    A(ML01157)
         DC    A(ML01158)
         DC    A(ML01159)
         DC    A(ML01160)
         DC    A(ML01161)
         DC    A(ML01162)
         DC    A(ML01163)
         DC    A(ML01164)
         DC    A(ML01165)
         DC    A(ML01166)
         DC    A(ML01167)
         DC    A(ML01168)
         DC    A(ML01169)
         DC    A(ML01170)
         DC    A(ML01171)
         DC    A(ML01172)
         DC    A(ML01173)
         DC    A(ML01174)
         DC    A(ML01175)
         DC    A(ML01176)
         DC    A(ML01177)
         DC    A(ML01178)
         DC    A(ML01179)
         DC    A(ML01180)
         DC    A(ML01181)
         DC    A(ML01182)
         DC    A(ML01183)
         DC    A(ML01184)
         DC    A(ML01185)
         DC    A(ML01186)
         DC    A(ML01187)
         DC    A(ML01188)
         DC    A(ML01189)
         DC    A(ML01190)
         DC    A(ML01191)
         DC    A(ML01192)
         DC    A(ML01193)
         DC    A(ML01194)
         DC    A(ML01195)
         DC    A(ML01196)
         DC    A(ML01197)
         DC    A(ML01198)
         DC    A(ML01199)
         DC    A(ML01200)
         DC    A(ML01201)
         DC    A(ML01202)
         DC    A(ML01203)
         DC    A(ML01204)
         DC    A(ML01205)
         DC    A(ML01206)
         DC    A(ML01207)
         DC    A(ML01208)
         DC    A(ML01209)
         DC    A(ML01210)
         DC    A(ML01211)
         DC    A(ML01212)
         DC    A(ML01213)
         DC    A(ML01214)
         DC    A(ML01215)
         DC    A(ML01216)
         DC    A(ML01217)
         DC    A(ML01218)
         DC    A(ML01219)
         DC    A(ML01220)
         DC    A(ML01221)
         DC    A(ML01222)
         DC    A(ML01223)
         DC    A(ML01224)
         DC    A(ML01225)
         DC    A(ML01226)
         DC    A(ML01227)
         DC    A(ML01228)
         DC    A(ML01229)
         DC    A(ML01230)
         DC    A(ML01231)
         DC    A(ML01232)
         DC    A(ML01233)
         DC    A(ML01234)
         DC    A(ML01235)
         DC    A(ML01236)
         DC    A(ML01237)
         DC    A(ML01238)
         DC    A(ML01239)
         DC    A(ML01240)
         DC    A(ML01241)
         DC    A(ML01242)
         DC    A(ML01243)
         DC    A(ML01244)
         DC    A(ML01245)
         DC    A(ML01246)
         DC    A(ML01247)
         DC    A(ML01248)
         DC    A(ML01249)
         DC    A(ML01250)
         DC    A(ML01251)
         DC    A(ML01252)
         DC    A(ML01253)
         DC    A(ML01254)
         DC    A(ML01255)
         DC    A(ML01256)
         DC    A(ML01257)
         DC    A(ML01258)
         DC    A(ML01259)
         DC    A(ML01260)
         DC    A(ML01261)
         DC    A(ML01262)
         DC    A(ML01263)
         DC    A(ML01264)
         DC    A(ML01265)
         DC    A(ML01266)
         DC    A(ML01267)
         DC    A(ML01268)
         DC    A(ML01269)
         DC    A(ML01270)
         DC    A(ML01271)
         DC    A(ML01272)
         DC    A(ML01273)
         DC    A(ML01274)
         DC    A(ML01275)
         DC    A(ML01276)
         DC    A(ML01277)
         DC    A(ML01278)
         DC    A(ML01279)
         DC    A(ML01280)
         DC    A(ML01281)
         DC    A(ML01282)
         DC    A(ML01283)
         DC    A(ML01284)
         DC    A(ML01285)
         DC    A(ML01286)
         DC    A(ML01287)
         DC    A(ML01288)
         DC    A(ML01289)
         DC    A(ML01290)
         DC    A(ML01291)
         DC    A(ML01292)
         DC    A(ML01293)
         DC    A(ML01294)
         DC    A(ML01295)
         DC    A(ML01296)
         DC    A(ML01297)
         DC    A(ML01298)
         DC    A(ML01299)
         DC    A(ML01300)
         DC    A(ML01301)
         DC    A(ML01302)
         DC    A(ML01303)
         DC    A(ML01304)
         DC    A(ML01305)
         DC    A(ML01306)
         DC    A(ML01307)
         DC    A(ML01308)
         DC    A(ML01309)
         DC    A(ML01310)
         DC    A(ML01311)
         DC    A(ML01312)
         DC    A(ML01313)
         DC    A(ML01314)
         DC    A(ML01315)
         DC    A(ML01316)
         DC    A(ML01317)
         DC    A(ML01318)
         DC    A(ML01319)
         DC    A(ML01320)
         DC    A(ML01321)
         DC    A(ML01322)
         DC    A(ML01323)
         DC    A(ML01324)
         DC    A(ML01325)
         DC    A(ML01326)
         DC    A(ML01327)
         DC    A(ML01328)
         DC    A(ML01329)
         DC    A(ML01330)
         DC    A(ML01331)
         DC    A(ML01332)
         DC    A(ML01333)
         DC    A(ML01334)
         DC    A(ML01335)
         DC    A(ML01336)
         DC    A(ML01337)
         DC    A(ML01338)
         DC    A(ML01339)
         DC    A(ML01340)
         DC    A(ML01341)
         DC    A(ML01342)
         DC    A(ML01343)
         DC    A(ML01344)
         DC    A(ML01345)
         DC    A(ML01346)
         DC    A(ML01347)
         DC    A(ML01348)
         DC    A(ML01349)
         DC    A(ML01350)
         DC    A(ML01351)
         DC    A(ML01352)
         DC    A(ML01353)
         DC    A(ML01354)
         DC    A(ML01355)
         DC    A(ML01356)
         DC    A(ML01357)
         DC    A(ML01358)
         DC    A(ML01359)
         DC    A(ML01360)
         DC    A(ML01361)
         DC    A(ML01362)
         DC    A(ML01363)
         DC    A(ML01364)
         DC    A(ML01365)
         DC    A(ML01366)
         DC    A(ML01367)
         DC    A(ML01368)
         DC    A(ML01369)
         DC    A(ML01370)
         DC    A(ML01371)
         DC    A(ML01372)
         DC    A(ML01373)
         DC    A(ML01374)
         DC    A(ML01375)
         DC    A(ML01376)
         DC    A(ML01377)
         DC    A(ML01378)
         DC    A(ML01379)
         DC    A(ML01380)
         DC    A(ML01381)
         DC    A(ML01382)
         DC    A(ML01383)
         DC    A(ML01384)
         DC    A(ML01385)
         DC    A(ML01386)
         DC    A(ML01387)
         DC    A(ML01388)
         DC    A(ML01389)
         DC    A(ML01390)
         DC    A(ML01391)
         DC    A(ML01392)
         DC    A(ML01393)
         DC    A(ML01394)
         DC    A(ML01395)
         DC    A(ML01396)
         DC    A(ML01397)
         DC    A(ML01398)
         DC    A(ML01399)
         DC    A(ML01400)
         DC    A(ML01401)
         DC    A(ML01402)
         DC    A(ML01403)
         DC    A(ML01404)
         DC    A(ML01405)
         DC    A(ML01406)
         DC    A(ML01407)
         DC    A(ML01408)
         DC    A(ML01409)
         DC    A(ML01410)
         DC    A(ML01411)
         DC    A(ML01412)
         DC    A(ML01413)
         DC    A(ML01414)
         DC    A(ML01415)
         DC    A(ML01416)
         DC    A(ML01417)
         DC    A(ML01418)
         DC    A(ML01419)
         DC    A(ML01420)
         DC    A(ML01421)
         DC    A(ML01422)
         DC    A(ML01423)
         DC    A(ML01424)
         DC    A(ML01425)
         DC    A(ML01426)
         DC    A(ML01427)
         DC    A(ML01428)
         DC    A(ML01429)
         DC    A(ML01430)
         DC    A(ML01431)
         DC    A(ML01432)
         DC    A(ML01433)
         DC    A(ML01434)
         DC    A(ML01435)
         DC    A(ML01436)
         DC    A(ML01437)
         DC    A(ML01438)
         DC    A(ML01439)
         DC    A(ML01440)
         DC    A(ML01441)
         DC    A(ML01442)
         DC    A(ML01443)
         DC    A(ML01444)
         DC    A(ML01445)
         DC    A(ML01446)
         DC    A(ML01447)
         DC    A(ML01448)
         DC    A(ML01449)
         DC    A(ML01450)
         DC    A(ML01451)
         DC    A(ML01452)
         DC    A(ML01453)
         DC    A(ML01454)
         DC    A(ML01455)
         DC    A(ML01456)
         DC    A(ML01457)
         DC    A(ML01458)
         DC    A(ML01459)
         DC    A(ML01460)
         DC    A(ML01461)
         DC    A(ML01462)
         DC    A(ML01463)
         DC    A(ML01464)
         DC    A(ML01465)
         DC    A(ML01466)
         DC    A(ML01467)
         DC    A(ML01468)
         DC    A(ML01469)
         DC    A(ML01470)
         DC    A(ML01471)
         DC    A(ML01472)
         DC    A(ML01473)
         DC    A(ML01474)
         DC    A(ML01475)
         DC    A(ML01476)
         DC    A(ML01477)
         DC    A(ML01478)
         DC    A(ML01479)
         DC    A(ML01480)
         DC    A(ML01481)
         DC    A(ML01482)
         DC    A(ML01483)
         DC    A(ML01484)
         DC    A(ML01485)
         DC    A(ML01486)
         DC    A(ML01487)
         DC    A(ML01488)
         DC    A(ML01489)
         DC    A(ML01490)
         DC    A(ML01491)
         DC    A(ML01492)
         DC    A(ML01493)
         DC    A(ML01494)
         DC    A(ML01495)
         DC    A(ML01496)
         DC    A(ML01497)
         DC    A(ML01498)
         DC    A(ML01499)
         DC    A(ML01500)
         DC    A(ML01501)
         DC    A(ML01502)
         DC    A(ML01503)
         DC    A(ML01504)
         DC    A(ML01505)
         DC    A(ML01506)
         DC    A(ML01507)
         DC    A(ML01508)
         DC    A(ML01509)
         DC    A(ML01510)
         DC    A(ML01511)
         DC    A(ML01512)
         DC    A(ML01513)
         DC    A(ML01514)
         DC    A(ML01515)
         DC    A(ML01516)
         DC    A(ML01517)
         DC    A(ML01518)
         DC    A(ML01519)
         DC    A(ML01520)
         DC    A(ML01521)
         DC    A(ML01522)
         DC    A(ML01523)
         DC    A(ML01524)
         DC    A(ML01525)
         DC    A(ML01526)
         DC    A(ML01527)
         DC    A(ML01528)
         DC    A(ML01529)
         DC    A(ML01530)
         DC    A(ML01531)
         DC    A(ML01532)
         DC    A(ML01533)
         DC    A(ML01534)
         DC    A(ML01535)
         DC    A(ML01536)
         DC    A(ML01537)
         DC    A(ML01538)
         DC    A(ML01539)
         DC    A(ML01540)
         DC    A(ML01541)
         DC    A(ML01542)
         DC    A(ML01543)
         DC    A(ML01544)
         DC    A(ML01545)
         DC    A(ML01546)
         DC    A(ML01547)
         DC    A(ML01548)
         DC    A(ML01549)
         DC    A(ML01550)
         DC    A(ML01551)
         DC    A(ML01552)
         DC    A(ML01553)
         DC    A(ML01554)
         DC    A(ML01555)
         DC    A(ML01556)
         DC    A(ML01557)
         DC    A(ML01558)
         DC    A(ML01559)
         DC    A(ML01560)
         DC    A(ML01561)
         DC    A(ML01562)
         DC    A(ML01563)
         DC    A(ML01564)
         DC    A(ML01565)
         DC    A(ML01566)
         DC    A(ML01567)
         DC    A(ML01568)
         DC    A(ML01569)
         DC    A(ML01570)
         DC    A(ML01571)
         DC    A(ML01572)
         DC    A(ML01573)
         DC    A(ML01574)
         DC    A(ML01575)
         DC    A(ML01576)
         DC    A(ML01577)
         DC    A(ML01578)
         DC    A(ML01579)
         DC    A(ML01580)
         DC    A(ML01581)
         DC    A(ML01582)
         DC    A(ML01583)
         DC    A(ML01584)
         DC    A(ML01585)
         DC    A(ML01586)
         DC    A(ML01587)
         DC    A(ML01588)
         DC    A(ML01589)
         DC    A(ML01590)
         DC    A(ML01591)
         DC    A(ML01592)
         DC    A(ML01593)
         DC    A(ML01594)
         DC    A(ML01595)
         DC    A(ML01596)
         DC    A(ML01597)
         DC    A(ML01598)
         DC    A(ML01599)
         DC    A(ML01600)
         DC    A(ML01601)
***********************************************************************
*                                                                     *
*  RULES:                                                             *
*    1) DOUBLE QUOTES (") CAN BE USED AT ANY TIME IN THE TEXT         *
*    2) IF A SINGLE QUOTE (') IS USED IN THE TEXT THEN YOU MUST       *
*       USE TWO SINGLE QUOTES ('') TO GET ONE QUOTE.                  *
*    3) NO MORE THAN 75 CHARACTERS CAN BE DISPLAYED ON A LINE.        *
*    4) USE MASK1 AND MASK2 FOR POSITIONING.                          *
*                                                                     *
*                                                                     *
* MASK1    ....+....1....+....2....+....3....+....4....+....5....+....6
* MASK2        ....+....7....+
***********************************************************************
ML00000  EQU   *
  DC  CL75'WHEN THINGS ARE GOING WELL, SOMEONE WILL INEVITABLY'
  DC  CL75'EXPERIMENT DETRIMENTALLY.'
  DC  X'FE'
ML00001  EQU   *
  DC  CL75'IF NOT CONTROLLED, WORK WILL FLOW TO THE COMPETENT'
  DC  CL75'MAN UNTIL HE SUBMERGES'
  DC  X'FE'
ML00002  EQU   *
  DC  CL75'THE DEFICIENCY WILL NEVER SHOW ITSELF DURING THE TEST RUNS'
  DC  X'FE'
ML00003  EQU   *
  DC  CL75'THE LAGGING ACTIVITY IN A PROJECT WILL INVARIABLY BE FOUND'
  DC  CL75'IN THE AREA WHERE THE HIGHEST OVERTIME RATES LIE WAITING'
  DC  X'FE'
ML00004  EQU   *
  DC  CL75'IT IS IMPOSSIBLE TO BUILD A FOOL PROOF SYSTEM;'
  DC  CL75'BECAUSE FOOLS ARE SO INGENIOUS'
  DC  X'FE'
ML00005  EQU   *
  DC  CL75'TALENT IN STAFF WORK OR SALES WILL CONTINUALLY BE'
  DC  CL75'INTERPRETED AS MANAGERIAL ABILITY.'
  DC  X'FE'
ML00006  EQU   *
  DC  CL75'INFORMATION TRAVELS MORE SURELY TO THOSE WITH A'
  DC  CL75'LESSER NEED TO KNOW.'
  DC  X'FE'
ML00007  EQU   *
  DC  CL75'THE "THINK POSITIVE" LEADER TENDS TO LISTEN TO HIS'
  DC  CL75'SUBORDINATE''S PREMONITIONS ONLY DURING THE POSTMORTEMS.'
  DC  X'FE'
ML00008  EQU   *
  DC  CL75'AN ORIGINAL IDEA CAN NEVER EMERGE FROM COMMITTEE'
  DC  CL75'IN ITS ORIGINAL FORM.'
  DC  X'FE'
ML00009  EQU   *
  DC  CL75'NO GOOD DEED GOES UNPUNISHED.'
  DC  X'FE'
ML00010  EQU   *
  DC  CL75'WHEN THE PRODUCT IS DESTINED TO FAIL, THE DELIVERY SYSTEM'
  DC  CL75'WILL PERFORM PERFECTLY.'
  DC  X'FE'
ML00011  EQU   *
  DC  CL75'CLEARLY STATED INSTRUCTIONS WILL CONSISTENTLY PRODUCE'
  DC  CL75'MULTIPLE INTERPRETATIONS'
  DC  X'FE'
ML00012  EQU   *
  DC  CL75'THE CRUCIAL MEMORANDUM WILL BE SNARED IN THE OUT-BASKET BY'
  DC  CL75'THE PAPER CLIP OF THE OVERLYING MEMO AND GO TO FILE.'
  DC  X'FE'
ML00013  EQU   *
  DC  CL75'ON SUCCESSIVE CHARTS OF THE SAME ORGANIZATION THE NUMBER OF'
  DC  CL75'BOXES WILL NEVER DECREASE.'
  DC  X'FE'
ML00014  EQU   *
  DC  CL75'IT IS OK TO BE IGNORANT IN SOME AREAS,'
  DC  CL75'BUT SOME PEOPLE ABUSE THE PRIVILEGE.'
  DC  X'FE'
ML00015  EQU   *
  DC  CL75'EVERYONE BREAKS MORE THAN THE SEVEN-YEAR-BAD-LUCK ALLOTMENT'
  DC  CL75'TO COVER ROTTEN LUCK THROUGHOUT AN ENTIRE LIFETIME.'
  DC  X'FE'
ML00016  EQU   *
  DC  CL75'SUCCESS CAN BE INSURED ONLY BY DEVISING A DEFENSE AGAINST'
  DC  CL75'FAILURE OF THE CONTINGENCY PLAN.'
  DC  X'FE'
ML00017  EQU   *
  DC  CL75'ADDING MANPOWER TO A LATE SOFTWARE PRODUCT MAKES IT LATER'
  DC  X'FE'
ML00018  EQU   *
  DC  CL75'PERFORMANCE IS DIRECTLY AFFECTED BY THE PERVERSITY OF'
  DC  CL75'INANIMATE OBJECTS'
  DC  X'FE'
ML00019  EQU   *
  DC  CL75'LEAKPROOF SEALS --- WILL.'
  DC  X'FE'
ML00020  EQU   *
  DC  CL75'NEVER OFFEND PEOPLE WITH STYLE'
  DC  CL75'WHEN YOU CAN OFFEND THEM WITH SUBSTANCE.'
  DC  X'FE'
ML00021  EQU   *
  DC  CL75'OUR CUSTOMERS PAPERWORK IS PROFIT'
  DC  CL75'OUR OWN PAPERWORK IS LOSS.'
  DC  X'FE'
ML00022  EQU   *
  DC  CL75'AT ANY LEVEL OF TRAFFIC, ANY DELAY IS INTOLERABLE.'
  DC  X'FE'
ML00023  EQU   *
  DC  CL75'AS THE ECONOMY GETS BETTER, EVERYTHING ELSE GETS WORSE.'
  DC  X'FE'
ML00024  EQU   *
  DC  CL75'THIS SPACE FOR RENT'
  DC  CL75'                   '
  DC  CL75'                   '
  DC  X'FE'
ML00025  EQU   *
  DC  CL75'THE MORE DIRECTIVES YOU ISSUE TO SOLVE A PROBLEM,'
  DC  CL75'THE WORSE IT GETS.'
  DC  X'FE'
ML00026  EQU   *
  DC  CL75'COP-OUT NUMBER 1.'
  DC  CL75'YOU SHOULD HAVE SEEN IT WHEN I GOT IT.'
  DC  X'FE'
ML00027  EQU   *
  DC  CL75'WHEN YOU''RE UP TO YOUR ASS IN ALLIGATORS, IT IS'
  DC  CL75'DIFFICULT TO KEEP YOUR MIND ON THE FACT THAT YOUR PRIMARY'
  DC  CL75'OBJECTIVE WAS TO DRAIN THE SWAMP.'
  DC  X'FE'
ML00028  EQU   *
  DC  CL75'THE ROAD TO HELL IS PAVED WITH GOOD INTENTIONS'
  DC  CL75'AND LITTERED WITH SLOPPY ANALYSES!'
  DC  X'FE'
ML00029  EQU   *
  DC  CL75'SELF STARTERS --- WON''T.'
  DC  X'FE'
ML00030  EQU   *
  DC  CL75'IF THE ASSUMPTIONS ARE WRONG,'
  DC  CL75'THE CONCLUSIONS AREN''T LIKELY TO BE VERY GOOD.'
  DC  X'FE'
ML00031  EQU   *
  DC  CL75'THE ORGANIZATION OF ANY PROGRAM REFLECTS THE ORGANIZATION'
  DC  CL75'OF THE PEOPLE WHO DEVELOPED IT.'
  DC  X'FE'
ML00032  EQU   *
  DC  CL75'THERE IS NO SUCH THNG AS A "DIRTY CAPITALIST",'
  DC  CL75'ONLY A CAPITALIST.'
  DC  X'FE'
ML00033  EQU   *
  DC  CL75'ANYTHING IS POSSIBLE, BUT NOTHING IS EASY.'
  DC  X'FE'
ML00034  EQU   *
  DC  CL75'THE MEEK WILL INHERIT THE EARTH'
  DC  CL75'AFTER THE REST OF US GO TO THE STARS.'
  DC  X'FE'
ML00035  EQU   *
  DC  CL75'CAPITALISM CAN EXIST IN ONE OF ONLY TWO STATES:'
  DC  CL75'WELFARE OR WARFARE.'
  DC  X'FE'
ML00036  EQU   *
  DC  CL75'HISTORY PROVES NOTHING.'
  DC  X'FE'
ML00037  EQU   *
  DC  CL75'A LOT OF WHAT APPEARS TO BE PROGRESS IS JUST SO MUCH'
  DC  CL75'TECHNOLOGICAL ROCCOCO.'
  DC  X'FE'
ML00038  EQU   *
  DC  CL75'A LITTLE HUMILITY IS ARROGANCE'
  DC  X'FE'
ML00039  EQU   *
  DC  CL75'INTERCHANGEABLE PARTS --- WON''T.'
  DC  X'FE'
ML00040  EQU   *
  DC  CL75'ANY TIME YOU WISH TO DEMONSTRATE SOMETHING, THE NUMBER OF'
  DC  CL75'FAULTS IS PROPORTIONAL TO THE NUMBER OF VIEWERS.'
  DC  X'FE'
ML00041  EQU   *
  DC  CL75'ALL AMERICAN CARS ARE BASICALLY CHEVROLETS.'
  DC  X'FE'
ML00042  EQU   *
  DC  CL75'A COUP THAT IS KNOWN IN ADVANCE IS A COUP THAT DOES NOT'
  DC  CL75'TAKE PLACE.'
  DC  X'FE'
ML00043  EQU   *
  DC  CL75'NO EXPERIMENT IS EVER A COMPLETE FAILURE.'
  DC  CL75'IT CAN ALWAYS BE USED AS A BAD EXAMPLE.'
  DC  X'FE'
ML00044  EQU   *
  DC  CL75'DESPITE THE SIGN THAT SAYS "WET PAINT",'
  DC  CL75'PLEASE DON''T'
  DC  X'FE'
ML00045  EQU   *
  DC  CL75'EVERYTHING TASTES MORE OR LESS LIKE CHICKEN.'
  DC  X'FE'
ML00046  EQU   *
  DC  CL75'PEOPLE DON''T CHANGE; THEY ONLY BECOME MORE SO.'
  DC  X'FE'
ML00047  EQU   *
  DC  CL75'I FINALLY GOT IT ALL TOGETHER...'
  DC  CL75'BUT I FORGOT WHERE I PUT IT.'
  DC  X'FE'
ML00048  EQU   *
  DC  CL75'IF YOUR NEXT POT OF CHILI TASTES BETTER, IT PROBABLY IS'
  DC  CL75'BECAUSE OF SOMETHING LEFT OUT, RATHER THAN ADDED.'
  DC  X'FE'
ML00049  EQU   *
  DC  CL75'THERE IS ALWAYS ONE MORE BUG.'
  DC  X'FE'
ML00050  EQU   *
  DC  CL75'THE BIG GUYS ALWAYS WIN.'
  DC  X'FE'
ML00051  EQU   *
  DC  CL75'NOTHING IS EVER ACCOMPLISHED BY A REASONABLE MAN.'
  DC  X'FE'
ML00052  EQU   *
  DC  CL75'ANY SUFFICIENTLY ADVANCED TECHNOLOGY IS'
  DC  CL75'INDISTINGUISHABLE FROM MAGIC.'
  DC  X'FE'
ML00053  EQU   *
  DC  CL75'IT''S ALWAYS DARKEST JUST BEFORE THE LIGHTS GO OUT.'
  DC  X'FE'
ML00054  EQU   *
  DC  CL75'IT IS BETTER TO BE PART OF THE IDLE RICH CLASS'
  DC  CL75'THAN BE PART OF THE IDLE POOR CLASS.'
  DC  X'FE'
ML00055  EQU   *
  DC  CL75'EACH PROBLEM SOLVED INTRODUCES A NEW UNSOLVED PROBLEM.'
  DC  X'FE'
ML00056  EQU   *
  DC  CL75'FOR EVERY CREDIBILITY GAP THERE IS A GULLIBILITY FILL.'
  DC  X'FE'
ML00057  EQU   *
  DC  CL75'IF YOU HAVE SOMETHING TO DO, AND YOU PUT IT OFF LONG ENOUGH'
  DC  CL75'CHANCES ARE SOMEONE ELSE WILL DO IT FOR YOU.'
  DC  X'FE'
ML00058  EQU   *
  DC  CL75'EVERYBODY''S GOTTA BE SOMEPLACE.'
  DC  X'FE'
ML00059  EQU   *
  DC  CL75'NATURE IS A MOTHER.'
  DC  X'FE'
ML00060  EQU   *
  DC  CL75'IF YOU''VE GOT THEM BY THE BALLS,'
  DC  CL75'THEIR HEARTS AND MINDS WILL FOLLOW.'
  DC  X'FE'
ML00061  EQU   *
  DC  CL75'PEOPLE WILL ACCEPT YOUR IDEA MUCH MORE READILY IF YOU TELL'
  DC  CL75'THEM BENJAMIN FRANKLIN SAID IT FIRST.'
  DC  X'FE'
ML00062  EQU   *
  DC  CL75'IF AT FIRST YOU DON''T SUCCEED, TRANSFORM YOUR DATASET.'
  DC  X'FE'
ML00063  EQU   *
  DC  CL75'ANY GIVEN PROGRAM, WHEN RUNNING, IS OBSOLETE.'
  DC  X'FE'
ML00064  EQU   *
  DC  CL75'ANY GIVEN PROGRAM COST MORE AND TAKE LONGER.'
  DC  X'FE'
ML00065  EQU   *
  DC  CL75'IF A PROGRAM IS USEFUL, IT WILL BE CHANGED.'
  DC  X'FE'
ML00066  EQU   *
  DC  CL75'IF A PROGRAM IS USELESS, IT WILL BE DOCUMENTED.'
  DC  X'FE'
ML00067  EQU   *
  DC  CL75'ANY GIVEN PROGRAM WILL EXPAND TO FILL ALL AVAILABLE MEMORY.'
  DC  X'FE'
ML00068  EQU   *
  DC  CL75'THE VALUE OF A PROGRAM IS PROPORTIONAL'
  DC  CL75'TO THE WEIGHT OF ITS OUTPUT.'
  DC  X'FE'
ML00069  EQU   *
  DC  CL75'DON''T MESS WITH MRS. MURPHY!'
  DC  X'FE'
ML00070  EQU   *
  DC  CL75'PROGRAM COMPLEXITY GROWS UNTIL IT EXCEEDS THE CAPABILITY'
  DC  CL75'OF THE PROGRAMMER WHO MUST MAINTAIN IT.'
  DC  X'FE'
ML00071  EQU   *
  DC  CL75'MAKE IT POSSIBLE FOR PROGRAMMERS TO WRITE PROGRAMS'
  DC  CL75'IN ENGLISH AND YOU WILL FIND THAT PROGRAMMERS CANNOT'
  DC  CL75'WRITE IN ENGLISH.'
  DC  X'FE'
ML00072  EQU   *
  DC  CL75'WHEN MORE AND MORE PEOPLE ARE THROWN OUT OF WORK'
  DC  CL75'UNEMPLOYMENT RESULTS.'
  DC  X'FE'
ML00073  EQU   *
  DC  CL75'IF YOU CAN''T MEASURE IT, I''M NOT INTERESTED'
  DC  X'FE'
ML00074  EQU   *
  DC  CL75'THE BEST WAY TO LIE IS TO TELL THE TRUTH.....'
  DC  CL75'CAREFULLY EDITED TRUTH.'
  DC  X'FE'
ML00075  EQU   *
  DC  CL75'THERE ARE THREE WAYS TO GET THINGS DONE'
  DC  CL75'DO IT YOURSELF'
  DC  CL75'HIRE SOMEONE TO DO IT OR'
  DC  CL75'FORBID YOUR KIDS TO DO IT.'
  DC  X'FE'
ML00076  EQU   *
  DC  CL75'I THINK ... THEREFORE I AM CONFUSED'
  DC  X'FE'
ML00077  EQU   *
  DC  CL75'A FAIL-SAFE CIRCUIT WILL DESTROY OTHERS.'
  DC  X'FE'
ML00078  EQU   *
  DC  CL75'HISTORY REPEATS ITSELF.'
  DC  CL75'THAT''S ONE OF THE THINGS WRONG WITH HISTORY'
  DC  X'FE'
ML00079  EQU   *
  DC  CL75'90% OF EVERYTHING IS CRUD.'
  DC  X'FE'
ML00080  EQU   *
  DC  CL75'NATURE WILL TELL YOU A DIRECT LIE IF SHE CAN.'
  DC  X'FE'
ML00081  EQU   *
  DC  CL75'THOSE WITH THE BEST ADVICE OFFER NO ADVICE.'
  DC  X'FE'
ML00082  EQU   *
  DC  CL75'SPEAK SOFTLY AND OWN A BIG, MEAN DOBERMAN.'
  DC  X'FE'
ML00083  EQU   *
  DC  CL75'DEMOCRACY IS THAT FORM OF GOVERNMENT WHERE'
  DC  CL75'EVERYBODY GETS WHAT THE MAJORITY DESERVES.'
  DC  X'FE'
ML00084  EQU   *
  DC  CL75'IF YOU''RE WORRIED ABOUT BEING CRAZY,'
  DC  CL75'DON''T BE OVERLY CONCERNED:'
  DC  CL75'IF YOU WERE, YOU WOULD THINK YOU WERE SANE.'
  DC  X'FE'
ML00085  EQU   *
  DC  CL75'PILLS TO BE TAKEN IN TWOS ALWAYS COME'
  DC  CL75'OUT OF THE BOTTLE IN THREES.'
  DC  X'FE'
ML00086  EQU   *
  DC  CL75'FLYNN IS DEAD'
  DC  CL75'TRON IS DEAD'
  DC  CL75'LONG LIVE THE MCP.'
  DC  X'FE'
ML00087  EQU   *
  DC  CL75'WHY WORRY ABOUT TOMORROW? WE MAY NOT MAKE IT THROUGH TODAY!'
  DC  X'FE'
ML00088  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T NUMBER PARAGRAPH NAMES'
  DC  CL75'CONSECUTIVELY.'
  DC  X'FE'
ML00089  EQU   *
  DC  CL75'IF YOU''RE FEELING GOOD, DON''T WORRY,'
  DC  CL75'YOU''LL GET OVER IT.'
  DC  X'FE'
ML00090  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T GRUMBLE ABOUT THE DISADVANTAGES'
  DC  CL75'OF COBOL WHEN THEY DON''T KNOW ANY OTHER LANGUAGE.'
  DC  X'FE'
ML00091  EQU   *
  DC  CL75'DEFINITION OF AN ELEPHANT:'
  DC  CL75'A MOUSE BUILT TO GOVERMENT SPECIFICATIONS'
  DC  X'FE'
ML00092  EQU   *
  DC  CL75'REAL PROGRAMMERS ARE KIND TO ROOKIES.'
  DC  X'FE'
ML00093  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T NOTCH THEIR DESKS FOR EACH'
  DC  CL75'COMPLETED SERVICE REQUEST.'
  DC  X'FE'
ML00094  EQU   *
  DC  CL75'YOU DON''T HAVE TO BE CRAZY TO WORK HERE'
  DC  CL75'BUT IT SURE HELPS!!!!!!!'
  DC  X'FE'
ML00095  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T ANNOUNCE HOW MANY TIMES THE'
  DC  CL75'OPERATIONS DEPARTMENT CALLED THEM LAST NIGHT.'
  DC  X'FE'
ML00096  EQU   *
  DC  CL75'A DAY WITHOUT SUNSHINE ....'
  DC  CL75'IS LIKE ... NIGHT!'
  DC  X'FE'
ML00097  EQU   *
  DC  CL75'REAL PROGRAMMERS ARE SECURE ENOUGH TO WRITE READABLE CODE,'
  DC  CL75'WHICH THEY THEN SELF-RIGHTEOUSLY REFUSE TO EXPLAIN.'
  DC  X'FE'
ML00098  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T PLAY VIDEO GAMES, THEY WRITE   THEM.X
               '
  DC  X'FE'
ML00099  EQU   *
  DC  CL75'ANYTHING THAT CAN GO WRONG, WILL GO WRONG.'
  DC  X'FE'
ML00100  EQU   *
  DC  CL75'REAL PROGRAMMERS UNDERSTAND PASCAL.'
  DC  X'FE'
ML00101  EQU   *
  DC  CL75'REAL PROGRAMMERS KNOW IT''S NOT OPERATIONS '
  DC  CL75'FAULT IF THEIR JOBS GO INTO "HOGS."'
  DC  X'FE'
ML00102  EQU   *
  DC  CL75'REAL PROGRAMMERS DO NOT EAT BREAKFAST FROM THE'
  DC  CL75'VENDING MACHINES'
  DC  X'FE'
ML00103  EQU   *
  DC  CL75'REAL PROGRAMMERS PUNCH UP THEIR OWN PROGRAMS.'
  DC  X'FE'
ML00104  EQU   *
  DC  CL75'WHEN LIFE HANDS YOU A LEMON'
  DC  CL75'MAKE LEMONADE'
  DC  X'FE'
ML00105  EQU   *
  DC  CL75'REAL PROGRAMMERS HAVE READ THE STANDARDS MANUAL'
  DC  CL75'BUT WON''T ADMIT IT'
  DC  X'FE'
ML00106  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T ADVERTISE THEIR HANGOVERS.'
  DC  X'FE'
ML00107  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T DRESS FOR SUCCESS UNLESS'
  DC  CL75'THEY ARE TRYING TO CONVINCE OTHERS THAT THEY ARE'
  DC  CL75'GOING ON INTERVIEWS.'
  DC  X'FE'
ML00108  EQU   *
  DC  CL75'REAL PROGRAMMERS DO NOT PRACTICE FOUR-SYLLABLE WORDS BEFORE'
  DC  CL75'WALKTHROUGHS.'
  DC  X'FE'
ML00109  EQU   *
  DC  CL75'ALL WARRANTIES EXPIRE UPON PAYMENT OF INVOICE.'
  DC  X'FE'
ML00110  EQU   *
  DC  CL75'REAL PROGRAMMERS ARGUE WITH THE SYSTEMS ANALYST AS A'
  DC  CL75'MATTER OF PRINCIPLE.'
  DC  X'FE'
ML00111  EQU   *
  DC  CL75'THE FINAL TEST IS WHEN IT GOES PRODUCTION ...'
  DC  CL75'W H E N I T  G O E S   P R O D U C T I O N  ...'
  DC  CL75'W H E N     I  T     G  O  E  S     P  R  O  D  U  C  T'
  DC  CL75'W H  E   N       I   T       G   O   E   S       P   R   O'
  DC  X'FE'
ML00112  EQU   *
  DC  CL75'REAL PROGRAMMERS DRINK TOO MUCH COFFEE SO THAT THEY WILL'
  DC  CL75'ALWAYS SEEM TENSE AND OVERWORKED.'
  DC  X'FE'
ML00113  EQU   *
  DC  CL75'REAL PROGRAMMERS ALWAYS HAVE A BETTER IDEA.'
  DC  X'FE'
ML00114  EQU   *
  DC  CL75'ANYONE WHO FOLLOWS A CROWD WILL'
  DC  CL75'NEVER BE FOLLOWED BY A CROWD.'
  DC  X'FE'
ML00115  EQU   *
  DC  CL75'REAL PROGRAMMERS CAN DO OCTAL, HEXADECIMAL AND'
  DC  CL75'BINARY MATH IN THEIR HEADS.'
  DC  X'FE'
ML00116  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE MEMOS.'
  DC  X'FE'
ML00117  EQU   *
  DC  CL75'REAL PROGRAMMERS KNOW WHAT SAAD MEANS.'
  DC  X'FE'
ML00118  EQU   *
  DC  CL75'REAL PROGRAMMERS DO NOT UTTER PROFANITIES AT AN ELEVATED'
  DC  CL75'DECIBLE LEVEL.'
  DC  X'FE'
ML00119  EQU   *
  DC  CL75'WHERE YOU STAND ON AN ISSUE DEPENDS ON WHERE YOU SIT.'
  DC  X'FE'
ML00120  EQU   *
  DC  CL75'REAL PROGRAMMERS DO NOT APPLY DP TERMINOLOGY TO NON-DP'
  DC  CL75'SITUATIONS'
  DC  X'FE'
ML00121  EQU   *
  DC  CL75'I NO LONGER GET LOST IN THE SHUFFLE....'
  DC  CL75'I SHUFFLE ALONG WITH THE LOST'
  DC  X'FE'
ML00122  EQU   *
  DC  CL75'REAL PROGRAMMERS DO NOT READ BOOKS LIKE'
  DC  CL75'"EFFECTIVE LISTENING" AND "COMMUNICATION SKILLS".'
  DC  X'FE'
ML00123  EQU   *
  DC  CL75'REAL PROGRAMMERS PRINT ONLY CLEAN COMPILES,'
  DC  CL75'FIXING ALL ERRORS THROUGH THE TERMINAL.'
  DC  X'FE'
ML00124  EQU   *
  DC  CL75'THE EARLY WORM DESERVES THE BIRD'
  DC  X'FE'
ML00125  EQU   *
  DC  CL75'LEAD, FOLLOW, OR GET THE HELL OUT OF THE WAY!!'
  DC  X'FE'
ML00126  EQU   *
  DC  CL75'ALL GOOD THINGS MUST COME TO AN END.'
  DC  CL75'I WANT TO KNOW WHEN THEY START!'
  DC  X'FE'
ML00127  EQU   *
  DC  CL75'A DIPLOMAT IS SOMEONE WHO CAN TELL YOU TO GO TO HELL'
  DC  CL75'IN SUCH A WAY THAT YOU LOOK FORWARD TO THE TRIP.'
  DC  X'FE'
ML00128  EQU   *
  DC  CL75'BLESSED ARE THOSE WHO GO AROUND IN CIRCLES,'
  DC  CL75'FOR THEY SHALL BE KNOWN AS WHEELS.'
  DC  X'FE'
ML00129  EQU   *
  DC  CL75'NEVER EAT PRUNES WHEN YOU ARE FAMISHED.'
  DC  X'FE'
ML00130  EQU   *
  DC  CL75'KEEP EMOTIONALLY ACTIVE,'
  DC  CL75'CATER TO YOUR FAVORITE NEUROSIS.'
  DC  X'FE'
ML00131  EQU   *
  DC  CL75'A RACF PROTECTED DATASET IS INACCESSIBLE'
  DC  X'FE'
ML00132  EQU   *
  DC  CL75'RACF IS A FOUR LETTER WORD'
  DC  X'FE'
ML00133  EQU   *
  DC  CL75'YOU MAY BE RECOGNIZED SOON.'
  DC  CL75'HIDE!'
  DC  CL75'IF THEY FIND YOU, LIE.'
  DC  X'FE'
ML00134  EQU   *
  DC  CL75'YOU CAN PRAY HARD ENOUGH TO MAKE WATER RUN UPHILL'
  DC  CL75'HOW HARD?'
  DC  CL75'HARD ENOUGH TO MAKE WATER RUN UPHILL'
  DC  X'FE'
ML00135  EQU   *
  DC  CL75'AVOID REALITY AT ALL COSTS.'
  DC  X'FE'
ML00136  EQU   *
  DC  CL75'PROGRAM DESIGN PHILOSOPHY:'
  DC  CL75'START AT THE BEGINNING AND CONTINUE UNTIL THE END,'
  DC  CL75'THEN STOP             (LEWIS CARROLL)'
  DC  X'FE'
ML00137  EQU   *
  DC  CL75'A CLOSED MOUTH GATHERS NO FOOT.'
  DC  X'FE'
ML00138  EQU   *
  DC  CL75'ONLY A MEDIOCRE PERSON IS ALWAYS AT THEIR BEST.'
  DC  X'FE'
ML00139  EQU   *
  DC  CL75'FRIENDS COME AND GO, BUT ENEMIES ACCUMULATE.'
  DC  X'FE'
ML00140  EQU   *
  DC  CL75'IN A HIERARCHICAL ORGANIZATION, THE HIGHER THE LEVEL,'
  DC  CL75'THE GREATER THE CONFUSION.'
  DC  X'FE'
ML00141  EQU   *
  DC  CL75'THE FIRST TIME IS FOR LOVE'
  DC  CL75'THE NEXT TIME IS $200.'
  DC  X'FE'
ML00142  EQU   *
  DC  CL75'OF TWO POSSIBLE EVENTS,'
  DC  CL75'ONLY THE UNDESIRED ONE WILL OCCUR.'
  DC  X'FE'
ML00143  EQU   *
  DC  CL75'THE FASTER THE PLANE,'
  DC  CL75'THE NARROWER THE SEATS.'
  DC  X'FE'
ML00144  EQU   *
  DC  CL75'IF YOU HAVE TO ASK, YOU ARE NOT ENTITLED TO KNOW.'
  DC  X'FE'
ML00145  EQU   *
  DC  CL75'IF ON AN ACTUARIAL BASIS THERE IS A 50 50 CHANCE THAT'
  DC  CL75'SOMETHING WILL GO WRONG,'
  DC  CL75'IT WILL ACTUALLY GO WRONG NINE TIMES OUT OF TEN.'
  DC  X'FE'
ML00146  EQU   *
  DC  CL75'A MAN OF QUALITY DOES NOT FEAR A WOMAN SEEKING EQUALITY.'
  DC  X'FE'
ML00147  EQU   *
  DC  CL75'THE FIRST RULE OF INTELLIGENT TINKERING IS TO'
  DC  CL75'SAVE ALL OF THE PARTS.'
  DC  X'FE'
ML00148  EQU   *
  DC  CL75'1) THINGS WILL GET WORSE BEFORE THEY GET BETTER'
  DC  CL75'2) WHO SAID THINGS WOULD GET BETTER?'
  DC  X'FE'
ML00149  EQU   *
  DC  CL75'IF YOU TRY TO PLEASE EVERYBODY, NOBODY WILL LIKE IT.'
  DC  X'FE'
ML00150  EQU   *
  DC  CL75'THERE IS A SOLUTION TO EVERY PROBLEM;'
  DC  CL75'THE ONLY DIFFICULTY IS FINDING IT.'
  DC  X'FE'
ML00151  EQU   *
  DC  CL75'DON''T MAKE YOUR DOCTOR YOUR HEIR.'
  DC  X'FE'
ML00152  EQU   *
  DC  CL75'DON''T ASK THE BARBER IF YOU NEED A HAIRCUT.'
  DC  X'FE'
ML00153  EQU   *
  DC  CL75'IF THERE ISN''T A LAW, THERE WILL BE.'
  DC  X'FE'
ML00154  EQU   *
  DC  CL75'IF YOU DON''T LIKE THE ANSWER,'
  DC  CL75'YOU SHOULDN''T HAVE ASKED THE QUESTION.'
  DC  X'FE'
ML00155  EQU   *
  DC  CL75'DO NOT BELIEVE IN MIRACLES -- RELY ON THEM.'
  DC  X'FE'
ML00156  EQU   *
  DC  CL75'YOU CAN''T EXPECT TO HIT THE JACKPOT'
  DC  CL75'IF YOU DON''T PUT A FEW NICKLES IN THE MACHINE.'
  DC  X'FE'
ML00157  EQU   *
  DC  CL75'UNLESS YOU INTEND TO KILL HIM IMMEDIATELY; NEVER KICK A MAN'
  DC  CL75'IN THE BALLS, NOT EVEN SYMBOLICALLY OR PERHAPS ESPECIALLY'
  DC  CL75'NOT SYMBOLICALLY.'
  DC  X'FE'
ML00158  EQU   *
  DC  CL75'FREUD''S 23RD LAW: IDEAS ENDURE AND PROSPER IN INVERSE'
  DC  CL75'PROPORTION TO THEIR SOUNDNESS AND VALIDITY.'
  DC  X'FE'
ML00159  EQU   *
  DC  CL75'A SHORT CUT IS THE LONGEST DISTANCE BETWEEN TWO POINTS.'
  DC  X'FE'
ML00160  EQU   *
  DC  CL75'IF YOU WANT TO MAKE AN ENEMY, DO SOMEONE A FAVOR.'
  DC  X'FE'
ML00161  EQU   *
  DC  CL75'IF YOU KNOW, YOU CAN''T SAY'
  DC  X'FE'
ML00162  EQU   *
  DC  CL75'THE MEEK SHALL INHERIT THE EARTH,'
  DC  CL75'BUT NOT ITS MINERAL RIGHTS.'
  DC  X'FE'
ML00163  EQU   *
  DC  CL75'1) YOU CAN''T WIN'
  DC  CL75'2) YOU CAN''T BREAK EVEN'
  DC  CL75'3) YOU CAN''T EVEN QUIT THE GAME'
  DC  X'FE'
ML00164  EQU   *
  DC  CL75'WHEN EATING AN ELEPHANT TAKE ONE BITE AT A TIME'
  DC  X'FE'
ML00165  EQU   *
  DC  CL75'COMMON SENSE IS NOT SO COMMON'
  DC  X'FE'
ML00166  EQU   *
  DC  CL75'IF WE LEARN BY OUR MISTAKES,'
  DC  CL75'I''M GETTING ONE HELL OF AN EDUCATION!!'
  DC  X'FE'
ML00167  EQU   *
  DC  CL75'FUZZY PROJECT OBJECTIVES ARE USED TO AVOID THE'
  DC  CL75'EMBARRASSMENT OF ESTIMATING THE CORRESPONDING COSTS.'
  DC  X'FE'
ML00168  EQU   *
  DC  CL75'USEFULNESS IS INVERSELY PROPORTIONAL TO ITS REPUTATION'
  DC  CL75'FOR BEING USEFUL'
  DC  X'FE'
ML00169  EQU   *
  DC  CL75'YOU WILL ALWAYS FIND SOMETHING IN THE LAST PLACE YOU LOOK.'
  DC  X'FE'
ML00170  EQU   *
  DC  CL75'THE PROBABILITY OF ANYTHING HAPPENING IS IN'
  DC  CL75'INVERSE RATIO TO ITS DESIRABILITY.'
  DC  X'FE'
ML00171  EQU   *
  DC  CL75'THE FIRST MYTH OF MANAGEMENT IS THAT IT EXISTS'
  DC  CL75'THE SECOND MYTH OF MANAGEMENT IS THAT SUCCESS EQUALS SKILL.'
  DC  X'FE'
ML00172  EQU   *
  DC  CL75'IF IT''S GOOD THEY WILL STOP MAKING IT.'
  DC  X'FE'
ML00173  EQU   *
  DC  CL75'INSIDE EVERY LARGE PROGRAM'
  DC  CL75'IS A SMALL PROGRAM STRUGGLING TO GET OUT'
  DC  X'FE'
ML00174  EQU   *
  DC  CL75'A MEMORANDUM IS WRITTEN NOT TO INFORM THE READER'
  DC  CL75'BUT TO PROTECT THE WRITER.'
  DC  X'FE'
ML00175  EQU   *
  DC  CL75'NEVER INSULT AN ALLIGATOR'
  DC  CL75'UNTIL AFTER YOU HAVE CROSSED THE RIVER.'
  DC  X'FE'
ML00176  EQU   *
  DC  CL75'ANYTHING HIT WITH A BIG ENOUGH HAMMER WILL FALL APART.'
  DC  X'FE'
ML00177  EQU   *
  DC  CL75'WHEN YOUR OPPONENT IS DOWN, KICK HIM.'
  DC  X'FE'
ML00178  EQU   *
  DC  CL75'THE MAN WHO CAN SMILE WHEN THINGS GO WRONG HAS THOUGHT OF'
  DC  CL75'SOMEONE HE CAN BLAME IT ON.'
  DC  X'FE'
ML00179  EQU   *
  DC  CL75'THE CHANCE OF A PIECE OF BREAD FALLING WITH THE BUTTERED SIDX
               E DOWN'
  DC  CL75'IS DIRECTLY PROPORTIONAL TO THE COST OF THE CARPET.'
  DC  X'FE'
ML00180  EQU   *
  DC  CL75'IN THE FIGHT BETWEEN YOU AND THE WORLD, BACK THE WORLD.'
  DC  X'FE'
ML00181  EQU   *
  DC  CL75'LAST GUYS DON''T FINISH NICE'
  DC  X'FE'
ML00182  EQU   *
  DC  CL75'NEVER ADMIT ANYTHING.'
  DC  CL75'NEVER REGRET ANYTHING'
  DC  CL75'WHATEVER IT IS, YOU''RE NOT RESPONSIBLE.'
  DC  X'FE'
ML00183  EQU   *
  DC  CL75'IF YOU HAVE ALWAYS DONE IT THAT WAY, IT IS PROBABLY WRONG.'
  DC  X'FE'
ML00184  EQU   *
  DC  CL75'WHEN WORKING TOWARD THE SOLUTION OF A PROBLEM,'
  DC  CL75'IT ALWAYS HELPS IF YOU KNOW THE ANSWER.'
  DC  CL75'PROVIDED OF COURSE YOU KNOW THERE IS A PROBLEM.'
  DC  X'FE'
ML00185  EQU   *
  DC  CL75'THE USEFULNESS OF ANY MEETING'
  DC  CL75'IS IN INVERSE PROPORTION TO THE ATTENDANCE.'
  DC  X'FE'
ML00186  EQU   *
  DC  CL75'THE SUN GOES DOWN JUST WHEN YOU NEED IT THE MOST.'
  DC  X'FE'
ML00187  EQU   *
  DC  CL75'PURE DRIVEL TENDS TO DRIVE ORDINARY'
  DC  CL75'DRIVEL OFF THE TV SCREEN'
  DC  X'FE'
ML00188  EQU   *
  DC  CL75'WHATEVER CREATES THE GREATEST INCONVENIENCE FOR THE LARGEST'
  DC  CL75'NUMBER MUST HAPPEN.'
  DC  X'FE'
ML00189  EQU   *
  DC  CL75'NO MATTER HOW LONG OR HARD YOU SHOP FOR AN ITEM, AFTER'
  DC  CL75'YOU HAVE BOUGHT IT, IT WILL BE ON SALE SOMEWHERE CHEAPER.'
  DC  X'FE'
ML00190  EQU   *
  DC  CL75'SANITY AND INSANITY OVERLAP A FINE GRAY LINE.'
  DC  X'FE'
ML00191  EQU   *
  DC  CL75'A DISAGREEABLE TASK IS ITS OWN REWARD.'
  DC  X'FE'
ML00192  EQU   *
  DC  CL75'IF THINGS WERE LEFT TO CHANCE, THEY''D BE BETTER.'
  DC  X'FE'
ML00193  EQU   *
  DC  CL75'THE PHONE WILL NOT RING UNTIL YOU LEAVE YOUR DESK AND WALK'
  DC  CL75'TO THE OTHER END OF THE BUILDING.'
  DC  X'FE'
ML00194  EQU   *
  DC  CL75'ANYBODY CAN WIN - UNLESS THERE HAPPENS TO BE A SECOND ENTRY'
  DC  X'FE'
ML00195  EQU   *
  DC  CL75'A PRESIDENT OF A DEMOCRACY IS A MAN WHO IS ALWAYS READY,'
  DC  CL75'WILLING, AND ABLE TO LAY DOWN YOUR LIFE FOR HIS COUNTRY.'
  DC  X'FE'
ML00196  EQU   *
  DC  CL75'IF A THING IS DONE WRONG OFTER ENOUGH'
  DC  CL75'IT BECOMES RIGHT.'
  DC  X'FE'
ML00197  EQU   *
  DC  CL75'PEOPLE WILL BUY ANYTHING THAT IS ONE TO A CUSTOMER.'
  DC  X'FE'
ML00198  EQU   *
  DC  CL75'IF YOU JUST TRY LONG ENOUGH AND HARD ENOUGH, YOU CAN ALWAYS'
  DC  CL75'MANAGE TO BOOT YOURSELF IN THE POSTERIOR.'
  DC  X'FE'
ML00199  EQU   *
  DC  CL75'NO ONE''S LIFE, LIBERTY, OR PROPERTY ARE SAFE'
  DC  CL75'WHILE THE LEGISLATURE IS IN SESSION.'
  DC  X'FE'
ML00200  EQU   *
  DC  CL75'NEVER SAY "OOPS" AFTER YOU HAVE SUBMITTED A JOB.'
  DC  X'FE'
ML00201  EQU   *
  DC  CL75'BAD NEWS DRIVES GOOD NEWS OUT OF THE MEDIA.'
  DC  X'FE'
ML00202  EQU   *
  DC  CL75'JUST WHEN YOU GET REALLY GOOD AT SOMETHING,'
  DC  CL75'YOU DON''T NEED TO DO IT ANYMORE.'
  DC  X'FE'
ML00203  EQU   *
  DC  CL75'IF FACTS DO NOT CONFORM TO THE THEORY,'
  DC  CL75'THEY MUST BE DISPOSED OF'
  DC  X'FE'
ML00204  EQU   *
  DC  CL75'ALMOST ANYTHING IS EASIER TO GET INTO THAN OUT OF.'
  DC  X'FE'
ML00205  EQU   *
  DC  CL75'WHEN PROPERLY ADMINISTERED, VACATIONS DO NOT DIMINISH'
  DC  CL75'PRODUCTIVITY.  FOR EVERY WEEK YOU ARE AWAY AND GET NOTHING'
  DC  CL75'DONE, THERE IS ANOTHER WEEK WHEN YOUR BOSS IS AWAY AND YOU'
  DC  CL75'GET TWICE AS MUCH DONE.'
  DC  X'FE'
ML00206  EQU   *
  DC  CL75'NO MATTER WHAT HAPPENS, THERE IS ALWAYS SOMEBODY'
  DC  CL75'WHO KNEW THAT IT WOULD.'
  DC  X'FE'
ML00207  EQU   *
  DC  CL75'THE OTHER LINE ALWAYS MOVES FASTER.'
  DC  X'FE'
ML00208  EQU   *
  DC  CL75'NEVER EAT AT A PLACE CALLED MOMS,'
  DC  CL75'NEVER PLAY CARDS WITH A MAN NAMED DOC,'
  DC  CL75'AND NEVER LIE DOWN WITH A WOMAN WHOS GOT MORE TROUBLES THAN X
               YOU'
  DC  X'FE'
ML00209  EQU   *
  DC  CL75'IN ORDER TO GET A LOAN, YOU MUST FIRST PROVE YOU DON''T   NEX
               ED IT'
  DC  X'FE'
ML00210  EQU   *
  DC  CL75'WHEN ALL ELSE FAILS, READ THE INSTRUCTIONS.'
  DC  X'FE'
ML00211  EQU   *
  DC  CL75'ANYTHING YOU TRY TO FIX WILL TAKE LONGER AND COST MORE THAN'
  DC  CL75'YOU THOUGHT.'
  DC  X'FE'
ML00212  EQU   *
  DC  CL75'CLOSE COUNTS IN HORSESHOES, HANDGRENADES AND'
  DC  CL75'THERMONUCLEAR DEVICES'
  DC  X'FE'
ML00213  EQU   *
  DC  CL75'THE LION AND THE CALF SHALL LIE DOWN TOGETHER,'
  DC  CL75'BUT THE CALF WON''T GET MUCH SLEEP.'
  DC  X'FE'
ML00214  EQU   *
  DC  CL75'IF YOU FOOL AROUND WITH A THING FOR VERY LONG YOU WILL SCREWX
                IT UP'
  DC  X'FE'
ML00215  EQU   *
  DC  CL75'IT IS BETTER FOR CIVILIZATION TO BE GOING DOWN THE DRAIN,'
  DC  CL75'THAN TO BE COMING UP IT.'
  DC  X'FE'
ML00216  EQU   *
  DC  CL75'A $300.00 PICTURE TUBE WILL PROTECT A 10Ö FUSE BY BLOWING FIX
               ST.'
  DC  X'FE'
ML00217  EQU   *
  DC  CL75'JUSTICE ALWAYS PREVAILS...'
  DC  CL75'THREE TIMES OUT OF SEVEN'
  DC  X'FE'
ML00218  EQU   *
  DC  CL75'IF IT JAMS --- FORCE IT. IF IT BREAKS,'
  DC  CL75'IT NEEDED REPLACING ANYWAY.'
  DC  X'FE'
ML00219  EQU   *
  DC  CL75'I HAVE YET TO SEE ANY PROBLEM, HOWEVER COMPLICATED, WHICH,'
  DC  CL75'WHEN YOU LOOKED AT IT IN THE RIGHT WAY, DID NOT BECOME'
  DC  CL75'STILL MORE COMPLICATED. '
  DC  X'FE'
ML00220  EQU   *
  DC  CL75'ANY TOOL DROPPED WHILE REPAIRING A CAR WILL ROLL UNDERNEATH'
  DC  CL75'TO THE EXACT CENTER.'
  DC  X'FE'
ML00221  EQU   *
  DC  CL75'NO MATTER WHICH DIRECTION YOU START,'
  DC  CL75'IT''S ALWAYS AGAINST THE WIND COMING BACK.'
  DC  X'FE'
ML00222  EQU   *
  DC  CL75'THE REPAIRMAN WILL NEVER HAVE SEEN A MODEL QUITE LIKE'
  DC  CL75'YOURS BEFORE.'
  DC  X'FE'
ML00223  EQU   *
  DC  CL75'DON''T FORCE IT,'
  DC  CL75'GET A BIGGER HAMMER.'
  DC  X'FE'
ML00224  EQU   *
  DC  CL75'WHEN A BROKEN APPLIANCE IS DEMONSTRATED FOR THE REPAIRMAN,'
  DC  CL75'IT WILL WORK PERFECTLY.'
  DC  X'FE'
ML00225  EQU   *
  DC  CL75'PITY THE POOR EGG;'
  DC  CL75'IT ONLY GETS LAID ONCE IN ITS LIFE'
  DC  X'FE'
ML00226  EQU   *
  DC  CL75'AN OPTIMIST IS A PERSON WHO LOOKS FORWARD TO MARRIAGE.'
  DC  CL75'A PESSIMIST IS A MARRIED OPTIMIST!'
  DC  X'FE'
ML00227  EQU   *
  DC  CL75'A PESSIMIST IS AN OPTIMIST WITH EXPERIENCE.'
  DC  X'FE'
ML00228  EQU   *
  DC  CL75'OLD PROGRAMMERS NEVER DIE - THEY JUST ABEND.'
  DC  X'FE'
ML00229  EQU   *
  DC  CL75'THE SUCCESS OF ANY VENTURE WILL BE HELPED BY PRAYER,'
  DC  CL75'EVEN IN THE WRONG DENOMINATION.'
  DC  X'FE'
ML00230  EQU   *
  DC  CL75'JUST ABOUT THE TIME WHEN YOU THINK YOU CAN MAKE ENDS MEET'
  DC  CL75'SOMEBODY MOVES THE ENDS!'
  DC  X'FE'
ML00231  EQU   *
  DC  CL75'JUST BECAUSE YOU ARE PARANOID'
  DC  CL75'DOESN''T MEAN "THEY" AREN''T OUT TO GET YOU'
  DC  X'FE'
ML00232  EQU   *
  DC  CL75'AN IRISHMAN IS NOT DRUNK AS LONG AS'
  DC  CL75'HE CAN HANG ONTO A SINGLE BLADE OF GRASS'
  DC  CL75'AND NOT FALL OFF THE FACE OF THE EARTH.'
  DC  X'FE'
ML00233  EQU   *
  DC  CL75'IF AN EXPERIMENT WORKS, YOU MUST BE USING THE WRONG EQUIPMENX
               T'
  DC  X'FE'
ML00234  EQU   *
  DC  CL75'SOME COME TO THE FOUNTAIN OF KNOWLEDGE TO DRINK,'
  DC  CL75'SOME PREFER TO JUST GARGLE.'
  DC  X'FE'
ML00235  EQU   *
  DC  CL75'EVERYTHING IS REVEALED TO HE WHO TURNS OVER ENOUGH STONES.'
  DC  CL75'(INCLUDING THE SNAKES THAT HE DID NOT WANT TO FIND.)'
  DC  X'FE'
ML00236  EQU   *
  DC  CL75'EVERYBODY SHOULD BELIEVE IN SOMETHING;'
  DC  CL75'I BELIEVE I''LL HAVE ANOTHER DRINK'
  DC  X'FE'
ML00237  EQU   *
  DC  CL75'THOSE WHOSE APPROVAL YOU SEEK THE MOST GIVE YOU THE LEAST'
  DC  X'FE'
ML00238  EQU   *
  DC  CL75'BUILD A SYSTEM THAT EVEN A FOOL CAN USE,'
  DC  CL75'AND ONLY A FOOL WILL USE IT.'
  DC  X'FE'
ML00239  EQU   *
  DC  CL75'YOU CAN LEAD A HORTICULTURE, BUT YOU CAN''T MAKE HER THINK  X
               .'
  DC  X'FE'
ML00240  EQU   *
  DC  CL75'EVERYONE HAS A SCHEME FOR GETTING RICH THAT WILL NOT WORK.'
  DC  X'FE'
ML00241  EQU   *
  DC  CL75'IT''S ALWAYS THE WRONG TIME OF THE MONTH'
  DC  X'FE'
ML00242  EQU   *
  DC  CL75'IN ANY HIERARCHY, EACH INDIVIDUAL RISES TO HIS OWN LEVEL'
  DC  CL75'OF INCOMPETENCE, AND THEN REMAINS THERE.'
  DC  X'FE'
ML00243  EQU   *
  DC  CL75'IT DOES NOT MATTER IF YOU FALL DOWN AS LONG AS YOU PICK'
  DC  CL75'UP SOMETHING FROM THE FLOOR WHILE YOU GET UP.'
  DC  X'FE'
ML00244  EQU   *
  DC  CL75'YOU WILL REMEMBER THAT YOU FORGOT TO TAKE OUT THE TRASH'
  DC  CL75'WHEN THE GARBAGE TRUCK IS TWO DOORS AWAY.'
  DC  X'FE'
ML00245  EQU   *
  DC  CL75'MISERY NO LONGER LOVES COMPANY'
  DC  CL75'NOWDAYS IT INSISTS ON IT.'
  DC  X'FE'
ML00246  EQU   *
  DC  CL75'THE RACE IS NOT ALWAYS TO THE SWIFT NOR THE BATTLE TO THE'
  DC  CL75'STRONG, BUT THAT''S THE WAY TO BET.'
  DC  X'FE'
ML00247  EQU   *
  DC  CL75'SOME OF IT PLUS THE REST OF IT IS ALL OF IT.'
  DC  X'FE'
ML00248  EQU   *
  DC  CL75'THERE''S NEVER TIME TO DO IT RIGHT, BUT THERE''S ALWAYS'
  DC  CL75'TIME TO DO IT OVER.'
  DC  X'FE'
ML00249  EQU   *
  DC  CL75'ON A BEAUTIFUL DAY LIKE THIS IT''S HARD TO BELIEVE ANYONE'
  DC  CL75'CAN BE UNHAPPY -- BUT WE WILL WORK ON IT.'
  DC  X'FE'
ML00250  EQU   *
  DC  CL75'WHEN IN DOUBT, MUMBLE. WHEN IN TROUBLE, DELEGATE.'
  DC  X'FE'
ML00251  EQU   *
  DC  CL75'THE MORE RIDICULOUS A BELIEF SYSTEM,'
  DC  CL75'THE HIGHER PROBABILITY OF ITS SUCCESS.'
  DC  X'FE'
ML00252  EQU   *
  DC  CL75'ANYTHING GOOD IN LIFE IS EITHER ILLEGAL, IMMORAL OR FATTENINX
               G.'
  DC  X'FE'
ML00253  EQU   *
  DC  CL75'OLD AGE IS ALWAYS FIFTEEN YEARS OLDER THAN I AM.'
  DC  X'FE'
ML00254  EQU   *
  DC  CL75'IT IS MORALLY WRONG TO ALLOW SUCKERS TO KEEP THEIR MONEY.'
  DC  X'FE'
ML00255  EQU   *
  DC  CL75'WHEN YOU''RE UP TO YOUR NOSE .......,'
  DC  CL75'BE SURE TO KEEP YOUR MOUTH SHUT.'
  DC  X'FE'
ML00256  EQU   *
  DC  CL75'ONE''S LIFE TENDS TO BE LIKE A BEAVER''S,'
  DC  CL75'ONE DAM THING AFTER ANOTHER.'
  DC  X'FE'
ML00257  EQU   *
  DC  CL75'A BIRD IN HAND IS SAFER THAN ONE OVERHEAD.'
  DC  X'FE'
ML00258  EQU   *
  DC  CL75'THE RATIO OF TIME INVOLVED IN WORK TO TIME AVAILABLE FOR'
  DC  CL75'WORK IS USUALLY ABOUT 0.6'
  DC  X'FE'
ML00259  EQU   *
  DC  CL75'REMEMBER THE GOLDEN RULE:'
  DC  CL75'THOSE THAT HAVE THE GOLD MAKE THE RULES.'
  DC  X'FE'
ML00260  EQU   *
  DC  CL75'BLESSED IS HE WHO HAS REACHED THE POINT OF NO RETURN AND'
  DC  CL75'KNOWS IT FOR HE SHALL ENJOY LIVING'
  DC  X'FE'
ML00261  EQU   *
  DC  CL75'EVERYTHING EAST OF THE SAN ANDREAS FAULT WILL EVENUTALLY'
  DC  CL75'PLUNGE INTO THE ATLANTIC OCEAN.'
  DC  X'FE'
ML00262  EQU   *
  DC  CL75'I FINALLY GOT IT ALL TOGETHER.....'
  DC  CL75'BUT I FORGOT WHERE I PUT IT.'
  DC  X'FE'
ML00263  EQU   *
  DC  CL75'NATURE ALWAYS SIDES WITH THE HIDDEN FLAW.'
  DC  X'FE'
ML00264  EQU   *
  DC  CL75'BLESSED IS HE WHO EXPECTS NO GRATITUDE,'
  DC  CL75'FOR HE SHALL NOT BE DISAPPOINTED'
  DC  X'FE'
ML00265  EQU   *
  DC  CL75'THE LIGHT AT THE END OF THE TUNNEL IS THE HEADLAMP OF'
  DC  CL75'AN ONCOMING TRAIN.'
  DC  X'FE'
ML00266  EQU   *
  DC  CL75'CELIBACY IS NOT HEREDITARY.'
  DC  X'FE'
ML00267  EQU   *
  DC  CL75'YOU CAN OBSERVE A LOT JUST BY WATCHING'
  DC  X'FE'
ML00268  EQU   *
  DC  CL75'IF IT CAN BE BORROWED AND IT CAN BE BROKEN,'
  DC  CL75'YOU WILL BORROW IT AND'
  DC  CL75'YOU WILL BREAK IT.'
  DC  X'FE'
ML00269  EQU   *
  DC  CL75'NEVER SLEEP WITH ANYONE CRAZIER THAN YOURSELF.'
  DC  X'FE'
ML00270  EQU   *
  DC  CL75'LIVE WITHIN YOUR INCOME,'
  DC  CL75'EVEN IF YOU HAVE TO BORROW TO DO SO.'
  DC  X'FE'
ML00271  EQU   *
  DC  CL75'BEAUTY IS ONLY SKIN DEEP, UGLY GOES CLEAR TO THE BONE.'
  DC  X'FE'
ML00272  EQU   *
  DC  CL75'NEVER GO TO A DOCTOR WHOSE OFFICE PLANTS HAVE DIED.'
  DC  X'FE'
ML00273  EQU   *
  DC  CL75'TO KNOW YOURSELF IS THE ULTIMATE FORM OF AGGRESSION.'
  DC  X'FE'
ML00274  EQU   *
  DC  CL75'AN OUNCE OF APPLICATION IS WORTH A TON OF ABSTRACTION.'
  DC  X'FE'
ML00275  EQU   *
  DC  CL75'NEVER PLAY LEAPFROG WITH A UNICORN.'
  DC  X'FE'
ML00276  EQU   *
  DC  CL75'A BIRD IN THE HAND IS DEAD.'
  DC  X'FE'
ML00277  EQU   *
  DC  CL75'A SMITH AND WESSON BEATS FOUR ACES.'
  DC  X'FE'
ML00278  EQU   *
  DC  CL75'NEVER PUT ALL YOUR EGGS IN YOUR POCKET.'
  DC  X'FE'
ML00279  EQU   *
  DC  CL75'IF EVERYTHING SEEMS TO BE GOING WELL,'
  DC  CL75'YOU OBVIOUSLY DON''T KNOW WHAT THE HELL IS GOING ON.'
  DC  X'FE'
ML00280  EQU   *
  DC  CL75'IF AT FIRST YOU DON''T SUCCEED,'
  DC  CL75'BLAME IT ON YOUR SUPERVISOR'
  DC  X'FE'
ML00281  EQU   *
  DC  CL75'IF MORE THAN ONE PERSON IS RESPONSIBLE FOR A'
  DC  CL75'MISCALCULATION, NO ONE WILL BE AT FAULT.'
  DC  X'FE'
ML00282  EQU   *
  DC  CL75'DON''T BITE THE HAND THAT HAS YOUR PAY CHECK IN IT.'
  DC  X'FE'
ML00283  EQU   *
  DC  CL75'IN CASE OF DOUBT, MAKE IT SOUND CONVINCING.'
  DC  X'FE'
ML00284  EQU   *
  DC  CL75'WHEN IN DOUBT, MUMBLE'
  DC  CL75'WHEN IN TROUBLE, DELEGATE'
  DC  CL75'WHEN IN CHARGE, PONDER'
  DC  X'FE'
ML00285  EQU   *
  DC  CL75'PLEASE DON''T STEAL, THE IRS HATES COMPETITION!'
  DC  X'FE'
ML00286  EQU   *
  DC  CL75'NEVER ARGUE WITH A FOOL,'
  DC  CL75'PEOPLE MIGHT NOT KNOW THE DIFFERENCE.'
  DC  X'FE'
ML00287  EQU   *
  DC  CL75'YOU CAN''T GUARD AGAINST THE ARBITRARY'
  DC  X'FE'
ML00288  EQU   *
  DC  CL75'PEOPLE CAN BE DIVIDED INTO THREE GROUPS:'
  DC  CL75'THOSE WHO MAKE THINGS HAPPEN,'
  DC  CL75'THOSE WHO WATCH THINGS HAPPEN AND'
  DC  CL75'THOSE WHO WONDER WHAT HAPPENED.'
  DC  X'FE'
ML00289  EQU   *
  DC  CL75'I NO LONGER GET LOST IN THE SHUFFLE,'
  DC  CL75'I SHUFFLE ALONG WITH THE LOST.'
  DC  X'FE'
ML00290  EQU   *
  DC  CL75'THE ONE THING THAT MONEY CAN NOT BUY IS POVERTY.'
  DC  X'FE'
ML00291  EQU   *
  DC  CL75'YOU ARE NOT DRUNK IF YOU CAN LAY ON THE FLOOR WITHOUT HOLDINX
               G ON'
  DC  X'FE'
ML00292  EQU   *
  DC  CL75'IN ANY HOUSEHOLD, JUNK ACCUMULATES TO THE THE SPACE'
  DC  CL75'AVAILABLE FOR ITS STORAGE.'
  DC  X'FE'
ML00293  EQU   *                               *****
  DC  CL75'DON''T STOP TO STOMP ON ANTS'
  DC  CL75'WHEN THE ELEPHANTS ARE STAMPEDING'
  DC  X'FE'
ML00294  EQU   *
  DC  CL75'THE LONGER THE TITLE THE LESS IMPORTANT THE JOB'
  DC  X'FE'
ML00295  EQU   *
  DC  CL75'ANY IMPROBABLE EVENT WHICH WOULD CREATE MAXIMUM CONFUSION'
  DC  CL75'IF IT DID OCCUR, WILL OCCUR.'
  DC  X'FE'
ML00296  EQU   *
  DC  CL75'WHEN YOU ARE RIGHT BE LOGICAL,'
  DC  CL75'WHEN YOU ARE WRONG BE-FUDDLE.'
  DC  X'FE'
ML00297  EQU   *
  DC  CL75'FOR EVERY HUMAN PROBLEM, THERE IS A NEAT, PLAIN SOLUTION --'
  DC  CL75'AND IT IS ALWAYS WRONG.'
  DC  X'FE'
ML00298  EQU   *
  DC  CL75'THERE ARE NO WINNERS IN LIFE: ONLY SURVIVORS.'
  DC  X'FE'
ML00299  EQU   *
  DC  CL75'WHEN THEY WANT IT BAD (IN A RUSH), THEY GET IT BAD.'
  DC  X'FE'
ML00300  EQU   *
  DC  CL75'THE YOO-HOO YOU YOO-HOO INTO THE FOREST IS THE YOO-HOO YOU GX
               ET BACK.'
  DC  X'FE'
ML00301  EQU   *
  DC  CL75'YOU CAN''T TELL HOW DEEP A PUDDLE IS UNTIL YOU STEP INTO IT'
  DC  X'FE'
ML00302  EQU   *
  DC  CL75'THE IDEA IS TO DIE YOUNG AS LATE AS POSSIBLE.'
  DC  X'FE'
ML00303  EQU   *
  DC  CL75'NO MAN IS LONELY WHILE EATING SPAGHETTI.'
  DC  X'FE'
ML00304  EQU   *
  DC  CL75'IT''S BETTER TO RETIRE TOO SOON THAN TOO LATE.'
  DC  X'FE'
ML00305  EQU   *
  DC  CL75'A MAN SHOULD BE GREATER THAN SOME OF HIS PARTS.'
  DC  X'FE'
ML00306  EQU   *
  DC  CL75'IF YOU DON''T SAY IT, THEY CAN''T REPEAT IT.'
  DC  X'FE'
ML00307  EQU   *
  DC  CL75'NOTHING IS EVER AS SIMPLE AS IT SEEMS.'
  DC  X'FE'
ML00308  EQU   *
  DC  CL75'EVERYTHING TAKES LONGER THAN YOU EXPECT.'
  DC  X'FE'
ML00309  EQU   *
  DC  CL75'LEFT TO THEMSELVES, ALL THINGS GO FROM BAD TO WORSE.'
  DC  X'FE'
ML00310  EQU   *
  DC  CL75'IF YOU SEE THAT THERE ARE FOUR POSSIBLE WAYS IN WHICH A'
  DC  CL75'PROCEDURE CAN GO WRONG, AND CIRCUMVENT THESE, THEN A'
  DC  CL75'FIFTH WAY, UNPREPARED FOR, WILL PROMPTLY DEVELOPE.'
  DC  X'FE'
ML00311  EQU   *
  DC  CL75'THINGS GET WORSE UNDER PRESSURE.'
  DC  X'FE'
ML00312  EQU   *
  DC  CL75'PERSONS DISAGREEING WITH YOUR FACTS ARE ALWAYS EMOTIONAL'
  DC  CL75'AND EMPLOY FAULTY REASONING.'
  DC  X'FE'
ML00313  EQU   *
  DC  CL75'A CONSULTANT IS AN ORDINARY PERSON A LONG WAY FROM HOME.'
  DC  X'FE'
ML00314  EQU   *
  DC  CL75'PROGRESS IS MADE ON ALTERNATE FRIDAYS.'
  DC  X'FE'
ML00315  EQU   *
  DC  CL75'THE FIRST 80 PERCENT OF THE TASK TAKES 20 PERCENT OF THE TIMX
               E,'
  DC  CL75'THE LAST 20 PERCENT TAKES THE OTHER 80 PERCENT.'
  DC  X'FE'
ML00316  EQU   *
  DC  CL75'IF TWO WRONGS DON''T MAKE A RIGHT, TRY THREE.'
  DC  X'FE'
ML00317  EQU   *
  DC  CL75'DON''T LOOK BACK, SOMETHING MAY BE GAINING ON YOU.'
  DC  X'FE'
ML00318  EQU   *
  DC  CL75'ALL THINGS BEING EQUAL, ALL THINGS ARE NEVER EQUAL.'
  DC  X'FE'
ML00319  EQU   *
  DC  CL75'EVEN PARANOIDS HAVE ENEMIES.'
  DC  X'FE'
ML00320  EQU   *
  DC  CL75'INCOMPETENCE KNOWS NO BARRIERS OF TIME OR PLACE.'
  DC  X'FE'
ML00321  EQU   *
  DC  CL75'WORK IS ACCOMPLISHED BY THOSE EMPLOYEES WHO HAVE NOT YET'
  DC  CL75'REACHED THEIR LEVEL OF INCOMPETENCE.'
  DC  X'FE'
ML00322  EQU   *
  DC  CL75'IF AT FIRST YOU DON''T SUCCEED, TRY SOMETHING ELSE.'
  DC  X'FE'
ML00323  EQU   *
  DC  CL75'IF YOU''RE COASTING, YOU''RE GOING DOWNHILL.'
  DC  X'FE'
ML00324  EQU   *
  DC  CL75'NEVER TELL THEM WHAT YOU WOULDN''T DO.'
  DC  X'FE'
ML00325  EQU   *
  DC  CL75'THE AMOUNT OF FLAK RECEIVED ON ANY SUBJECT IS INVERSELY'
  DC  CL75'PROPORTIONAL TO THE SUBJECT''S TRUE VALUE.'
  DC  X'FE'
ML00326  EQU   *
  DC  CL75'INDIFFERENCE IS THE ONLY SURE DEFENSE.'
  DC  X'FE'
ML00327  EQU   *
  DC  CL75'WHATEVER HITS THE FAN WILL NOT BE EVENLY DISTRIBUTED.'
  DC  X'FE'
ML00328  EQU   *
  DC  CL75'NEVER NEEDLESSLY DISTURB A THING AT REST.'
  DC  X'FE'
ML00329  EQU   *
  DC  CL75'IF YOU WANT TO GET ALONG, GO ALONG.'
  DC  X'FE'
ML00330  EQU   *
  DC CL75'EVERYTHING HAPPENS AT THE SAME TIME WITH NOTHING IN BETWEEN.'
  DC  X'FE'
ML00331  EQU   *
  DC  CL75'THE EASIEST WAY TO FIND SOMETHING LOST AROUND THE HOUSE'
  DC  CL75'IS TO BUY A REPLACEMENT.'
  DC  X'FE'
ML00332  EQU   *
  DC  CL75'BARE FEET MAGNETIZE SHARP METAL OBJECTS SO THEY ALWAYS'
  DC  CL75'POINT UPWARD FROM THE FLOOR -- ESPECIALLY IN THE DARK.'
  DC  X'FE'
ML00333  EQU   *
  DC  CL75'MAKE THREE CORRECT GUESSES CONSECTIVELY AND YOU WILL'
  DC  CL75'ESTABLISH YOURSELF AS AN EXPERT.'
  DC  X'FE'
ML00334  EQU   *
  DC  CL75'IT WORKS BETTER IF YOU PLUG IT IN.'
  DC  X'FE'
ML00335  EQU   *
  DC  CL75'QUIT WHILE YOUR STILL BEHIND.'
  DC  X'FE'
ML00336  EQU   *
  DC  CL75'IF YOU PLAN TO LEAVE YOU MARK IN THE SANDS OF TIME,'
  DC  CL75'YOU BETTER WEAR WORK SHOES.'
  DC  X'FE'
ML00337  EQU   *
  DC  CL75'IT''S ALWAYS EASIER TO GO DOWN HILL, BUT THE VIEW IS FROM THX
               E TOP.'
  DC  X'FE'
ML00338  EQU   *
  DC  CL75'ANY LINE, HOWEVER SHORT, IS STILL TOO LONG.'
  DC  X'FE'
ML00339  EQU   *
  DC  CL75'LAZINESS IS THE MOTHER OF NINE INVENTIONS OUT OF TEN.'
  DC  X'FE'
ML00340  EQU   *
  DC  CL75'IF YOU CAN''T MEASURE OUTPUT THEN YOU MEASURE INPUT.'
  DC  X'FE'
ML00341  EQU   *
  DC  CL75'ANY THEORY CAN BE MADE TO FIT ANY FACTS BY MEANS OF APPROPRIX
               ATE'
  DC  CL75'ADDITIONAL ASSUMPTIONS.'
  DC  X'FE'
ML00342  EQU   *
  DC  CL75'OLD SCOTTISH PRAYER: O LORD, GRANT THAT WE MAY ALWAYS BE'
  DC  CL75'RIGHT, FOR THOU KNOWEST WE WILL NEVER CHANGE OUR MINDS.'
  DC  X'FE'
ML00343  EQU   *
  DC  CL75'NEVER BE FIRST TO DO ANYTHING.'
  DC  X'FE'
ML00344  EQU   *
  DC  CL75'THE CHIEF CAUSE OF PROBLEMS IS SOLUTIONS.'
  DC  X'FE'
ML00345  EQU   *
  DC  CL75'THE ONLY WINNER IN THE WAR OF 1812 WAS TCHAIKOVSKY'
  DC  X'FE'
ML00346  EQU   *
  DC  CL75'A LITTLE IGNORANCE CAN GO A LONG WAY.'
  DC  X'FE'
ML00347  EQU   *
  DC  CL75'LEARN TO BE SINCERE.  EVEN IF YOU HAVE TO FAKE IT.'
  DC  X'FE'
ML00348  EQU   *
  DC  CL75'ENTROPY HAS US OUTNUMBERED.'
  DC  X'FE'
ML00349  EQU   *
  DC  CL75'EVERYTHING PUT TOGETHER SOONER OR LATER FALLS APART.'
  DC  X'FE'
ML00350  EQU   *
  DC  CL75'DO WHATEVER YOUR ENEMIES DON''T WANT YOU TO DO.'
  DC  X'FE'
ML00351  EQU   *
  DC  CL75'A LITTLE AMBIGUITY NEVER HURT ANYONE.'
  DC  X'FE'
ML00352  EQU   *
  DC  CL75'DON''T PERMIT YOURSELF TO GET BETWEEN A DOG AND A LAMPPOST.'
  DC  X'FE'
ML00353  EQU   *
  DC  CL75'GO WHERE THE MONEY IS.'
  DC  X'FE'
ML00354  EQU   *
  DC  CL75'WORK MAY BE THE CRABGRASS OF LIFE, BUT MONEY IS STILL THE'
  DC  CL75'WATER THAT KEEPS IT GREEN.'
  DC  X'FE'
ML00355  EQU   *
  DC  CL75'A STAGNANT SCIENCE IS AT A STANDSTILL.'
  DC  X'FE'
ML00356  EQU   *
  DC  CL75'HALF OF BEING SMART IS KNOWING WHAT YOU''RE DUMB AT.'
  DC  X'FE'
ML00357  EQU   *
  DC  CL75'FOR EVERY CREDIBILITY GAP THERE IS A GULLIBILITY GAP.'
  DC  X'FE'
ML00358  EQU   *
  DC  CL75'CANT PRODUCES COUNTERCANT'
  DC  X'FE'
ML00359  EQU   *
  DC  CL75'IF YOU SEE A MAN APPROACHING YOU WITH THE OBVIOUS INTENT'
  DC  CL75'OF DOING YOU GOOD, YOU SHOULD RUN FOR YOUR LIFE.'
  DC  X'FE'
ML00360  EQU   *
  DC  CL75'WHEN YOU ARE SURE YOU''RE RIGHT, YOU HAVE A MORAL DUTY'
  DC  CL75'TO IMPOSE YOU WILL UPON ANYONE WHO DISAGREES WITH YOU.'
  DC  X'FE'
ML00361  EQU   *
  DC  CL75'IF YOU CAN''T CONVINCE THEM, CONFUSE THEM.'
  DC  X'FE'
ML00362  EQU   *
  DC  CL75'ASSUMPTION IS THE MOTHER OF ALL FOUL-UPS.'
  DC  X'FE'
ML00363  EQU   *
  DC  CL75'ALL GENERAL STATEMENTS ARE FALSE.  (THINK ABOUT IT)'
  DC  X'FE'
ML00364  EQU   *
  DC  CL75'IF IT HAPPENS, IT MUST BE POSSIBLE.'
  DC  X'FE'
ML00365  EQU   *
  DC  CL75'THEM WHAT GETS--HAS.'
  DC  X'FE'
ML00366  EQU   *
  DC  CL75'IF YOU ARE ALREADY IN A HOLE, THERE''S NO USE TO CONTINUE DIX
               GGING.'
  DC  X'FE'
ML00367  EQU   *
  DC  CL75'IF BUILDERS BUILT BUILDINGS THE WAY PROGRAMMERS WROTE PROGRAX
               MS,'
  DC  CL75'THEN THE FIRST WOODPECKER THAT CAME ALONG WOULD DESTROY CIVIX
               LIZATION'
  DC  X'FE'
ML00368  EQU   *
  DC  CL75'PEOPLE WILL BELIEVE ANYTHING IF YOU WHISPER IT.'
  DC  X'FE'
ML00369  EQU   *
  DC  CL75'A PAT ON THE BACK IS ONLY A FEW INCHES FROM A KICK IN THE PAX
               NTS.'
  DC  X'FE'
ML00370  EQU   *
  DC  CL75'NEVER LEAVE HOLD OF WHAT YOU''VE GOT UNTIL YOU''VE GOT HOLD'
  DC  CL75'OF SOMETHING ELSE.'
  DC  X'FE'
ML00371  EQU   *
  DC  CL75'A THEORY IS BETTER THAN ITS EXPLANATION.'
  DC  X'FE'
ML00372  EQU   *
  DC  CL75'EAT A LIVE TOAD THE FIRST THING IN THE MORNING AND NOTHING'
  DC  CL75'WORSE WILL HAPPEN TO YOU THE REST OF THE DAY.'
  DC  X'FE'
ML00373  EQU   *
  DC  CL75'NOBODY NOTICES WHEN THINGS GO RIGHT.'
  DC  X'FE'
ML00374  EQU   *
  DC  CL75'THERE IS NO SAFETY IN NUMBERS, OR IN ANYTHING ELSE.'
  DC  X'FE'
ML00375  EQU   *
  DC  CL75'ROSES ARE RED VIOLETS ARE BLUE'
  DC  CL75'I AM SCHIZOPHRENIC AND SO AM I'
  DC  X'FE'
ML00376  EQU   *
  DC  CL75'IF ANYTHING CAN GO WRONG, IT WILL                      '
  DC  X'FE'
ML00377  EQU   *
  DC  CL75'IF ANYTHING CAN''T GO WRONG IT WILL                    '
  DC  X'FE'
ML00378  EQU   *
  DC  CL75'IF MUPRHY''S LAW CAN GO WRONG, IT WILL                 '
  DC  X'FE'
ML00379  EQU   *
  DC  CL75'IF A SERIES OF EVENTS CAN GO WRONG, IT WILL DO SO IN   '
  DC  CL75'IN THE WORST POSSIBLE SEQUENCE                         '
  DC  X'FE'
ML00380  EQU   *
  DC  CL75'AFTER THINGS HAVE GONE FROM BAD TO WORSE, THE CYCLE    '
  DC  CL75'WILL REPEAT ITSELF                                     '
  DC  X'FE'
ML00381  EQU   *
 DC  CL75'AN AUDITOR ENTERS THE BATTLEFIELD AFTER THE WAR IS OVER,'
  DC  CL75'AND ATTACKS THE WOUNDED                                '
  DC  X'FE'
ML00382  EQU   *
  DC  CL75'NOTHING IS EVER SO BAD THAT IT CAN''T GET WORSE        '
  DC  X'FE'
ML00383  EQU   *
  DC  CL75'NO MATTER WHAT GOES WRONG, THERE IS ALWAYS SOMEBODY    '
  DC  CL75'WHO KNEW IT WOULD                                      '
  DC  X'FE'
ML00384  EQU   *
  DC  CL75'NATURE ALWAYS SIDES WITH THE HIDDEN FLAW               '
  DC  X'FE'
ML00385  EQU   *
  DC  CL75'THE HIDDEN FLAW NEVER REMAINS HIDDEN                   '
  DC  X'FE'
ML00386  EQU   *
  DC  CL75'1. EVERYTHING DEPENDS                                  '
  DC  CL75'2. NOTHING IS ALWAYS                                   '
  DC  CL75'3. EVERYTHING IS SOMETIMES                             '
  DC  X'FE'
ML00387  EQU   *
  DC  CL75'IF YOU WAIT, IT WILL GO AWAY                           '
  DC  CL75'....HAVING DONE IT''S DAMAGE                           '
  DC  CL75'IT IT WAS BAD, IT''LL BE BACK                          '
  DC  X'FE'
ML00388  EQU   *
  DC  CL75'COMPLEX PROBLEMS HAVE SIMPLE, EASY-TO-UNDERSTAND       '
  DC  CL75'WRONG ANSWERS                                          '
  DC  X'FE'
ML00389  EQU   *
  DC  CL75'OPPORTUNITY ALWAYS KNOCKS AT THE LEAST OPPORTUNE       '
  DC  CL75'MOMENT                                                 '
  DC  X'FE'
ML00390  EQU   *
  DC  CL75'WHEN YOU NEED TO KNOCK ON WOOD IS WHEN YOU REALIZE THE '
  DC  CL75'WORLD''S COMPOSED OF ALUMINUM AND VINYL                '
  DC  X'FE'
ML00391  EQU   *
  DC  CL75'IN ORDER FOR SOMETHING TO BECOME CLEAN, SOMETHING      '
  DC  CL75'ELSE MUST BECOME DIRTY.                                '
  DC  CL75'...BUT YOU CAN GET EVERYTHING DIRTY WITHOUT GETTING    '
  DC  CL75'ANYTHING CLEAN.                                        '
  DC  X'FE'
ML00392  EQU   *
  DC  CL75'THINGS EQUAL TO NOTHING ELSE ARE EQUAL TO EACH OTHER   '
  DC  X'FE'
ML00393  EQU   *
  DC  CL75'THE FIRST PLACE TO LOOK FOR ANYTHING IS THE LAST PLACE '
  DC  CL75'YOU WOULD EXPECT TO FIND IT                            '
  DC  X'FE'
ML00394  EQU   *
  DC  CL75'YOU CAN ALWAYS FIND WHAT YOU''RE NOT LOOKING FOR       '
  DC  X'FE'
ML00395  EQU   *
  DC  CL75'IF YOU DON''T CARE WHERE YOU ARE, YOU AIN''T LOST      '
  DC  X'FE'
ML00396  EQU   *
  DC  CL75'IT IS IMPOSSIBLE FOR AN OPTIMIST TO BE PLEASANTLY      '
  DC  CL75'SUPRISED                                               '
  DC  X'FE'
ML00397  EQU   *
  DC  CL75'A CRISIS IS WHEN YOU CAN''T SAY "LET''S FORGET THE     '
  DC  CL75'WHOLE THING"                                           '
  DC  X'FE'
ML00398  EQU   *
  DC  CL75'WASHING YOUR CAR TO MAKE IT RAIN DOESN''T WORK         '
  DC  X'FE'
ML00399  EQU   *
  DC  CL75'WHEN THE GOING GETS TOUGH, EVERYONE LEAVES             '
  DC  X'FE'
ML00400  EQU   *
  DC  CL75'THE TIME IT TALKES TO RECTIFY A SITUTATION IS          '
  DC  CL75'INVERSELY PROPORTIONAL TO THE TIME IT TOOK             '
  DC  CL75'TO DO THE DAMAGE  '
  DC  X'FE'
ML00401  EQU   *
  DC  CL75'AN OPTIMIST BELIEVES WE LIVE IN THE BEST OF ALL        '
  DC  CL75'POSSIBLE WORLDS.                                       '
  DC  CL75'A PESSIMIST FEARS THIS IS TRUE.                        '
  DC  X'FE'
ML00402  EQU   *
  DC  CL75'YOU CAN MAKE IT FOOLPROOF, BUT YOU CAN''T MAKE IT      '
  DC  CL75'DAMNFOOLPROOF.                                         '
  DC  X'FE'
ML00403  EQU   *
  DC  CL75'IT TAKES LONGER TO GLUE A VASE TOGETHER THAN TO       '
  DC  CL75'BREAK ONE                                              '
  DC  X'FE'
ML00404  EQU   *
  DC  CL75'IT TAKES LONGER TO LOSE ''X'' NUMBER OF POUNDS THAN    '
  DC  CL75'TO GAIN ''X'' NUMBER OF POUNDS                         '
  DC  X'FE'
ML00405  EQU   *
  DC  CL75'THE ITEM YOU HAD YOUR EYE ON THE MINUTE YOU WALKED IN '
  DC  CL75'WILL BE TAKEN BY THE PERSON IN FRONT OF YOU            '
  DC  X'FE'
ML00406  EQU   *
  DC  CL75'THE OTHER LINE MOVES FASTER                            '
  DC  X'FE'
ML00407  EQU   *
  DC  CL75'IF YOU CHANGE LINES, THE ONE YOU JUST LEFT WILL START  '
  DC  CL75'TO MOVE FASTER THAN THE ONE YOU ARE NOW IN             '
  DC  X'FE'
ML00408  EQU   *
  DC  CL75'THE LONGER YOU WAIT IN LINE, THE GREATER THE           '
  DC  CL75'LIKELIHOOD THAT YOU ARE STANDING IN THE WRONG LINE     '
  DC  X'FE'
ML00409  EQU   *
  DC  CL75'THE SLOWEST CHECKER IS ALWAYS AT THE QUICK-CHECK-OUT   '
  DC  CL75'LANE                                                   '
  DC  X'FE'
ML00410  EQU   *
  DC  CL75'WHENEVER YOU CUT YOUR FINGERNAILS YOU WILL FIND A      '
  DC  CL75'NEED FOR THEM AN HOUR LATER                            '
  DC  X'FE'
ML00411  EQU   *
  DC  CL75'1.IF THE WEATHER IS EXTREMELY BAD,  CHURCH ATTENDANCE '
  DC  CL75'     WILL BE DOWN                                      '
  DC  CL75'2.IF THE WEATHER IS EXTREMELY GOOD, CHURCH ATTENDANCE  '
  DC  CL75'     WILL BE DOWN                                      '
  DC  CL75'3.IF THE BULLETIN COVERS ARE IN SHORT SUPPLY CHURCH    '
  DC  CL75'     ATTENDANCE WILL EXCEED ALL EXPECTATIONS           '
  DC  X'FE'
ML00412  EQU   *
  DC  CL75'IF A SITUTATION REQUIRES UNDIVIDED ATTENTION, IT WILL  '
  DC  CL75'OCCUR SIMULTANEOUSLY WITH A COMPELLING DISTRACTION     '
  DC  X'FE'
ML00413  EQU   *
  DC  CL75'THE FURTHER AWAY THE DISASTER OR ACCIDENT OCCURS, THE  '
  DC  CL75'GREATER THE NUMBER OF DEAD AND INJURED REQUIRED FOR IT '
  DC  CL75'TO BECOME A STORY '
  DC  X'FE'
ML00414  EQU   *
  DC  CL75'THE CLOSER YOU ARE TO THE FACTS OF A SITUATION, THE    '
  DC  CL75'MORE OBVIOUS ARE THE ERRORS IN ALL NEWS COVERAGE OF    '
  DC  CL75'THE SITUATION  '
  DC  X'FE'
ML00415  EQU   *
  DC  CL75'THE FURTHER YOU ARE FROM THE FACTS OF A SITUTATION,    '
  DC  CL75'THE MORE YOU TEND TO BELIEVE NEWS COVERAGE OF THE      '
  DC  CL75'SITUTATION                                             '
  DC  X'FE'
ML00416  EQU   *
  DC  CL75'THE BEST WAY TO INSPIRE FRESH THOUGHTS IS TO SEAL      '
  DC  CL75'THE LETTER                                             '
  DC  X'FE'
ML00417  EQU   *
  DC  CL75'THE MOST INTERESTING SPECIMEN WILL NOT BE LABELED      '
  DC  X'FE'
ML00418  EQU   *
  DC  CL75'SOME ERRORS WILL ALWAYS GO UNNOTICED UNTIL THE BOOK    '
  DC  CL75'IS IN PRINT                                            '
  DC  X'FE'
ML00419  EQU   *
  DC  CL75'THE FIRST PAGE THE AUTHOR TURNS TO UPON RECEIVING AN   '
  DC  CL75'ADVANCE COPY WILL BE THE PAGE CONTAINING THE WORST     '
  DC  CL75'ERROR '
  DC  X'FE'
ML00420  EQU   *
  DC  CL75'1. NEVER DRAW WHAT YOU CAN COPY                        '
  DC  CL75'2. NEVER COPY WHAT YOU CAN TRACE                       '
  DC  CL75'3. NEVER TRACE WHAT YOU CAN CUT OUT AND PASTE DOWN     '
  DC  X'FE'
ML00421  EQU   *
  DC  CL75'THE BEST SHOTS HAPPEN IMMEDIATELY AFTER THE LAST       '
  DC  CL75'FRAME IS EXPOSED                                       '
  DC  X'FE'
ML00422  EQU   *
  DC  CL75'THE BEST SHOTS ARE GENERALLY ATTEMPTED THROUGH THE     '
  DC  CL75'LENS CAP                                               '
  DC  X'FE'
ML00423  EQU   *
  DC  CL75'ANY SURVIVING BEST SHOTS ARE RUINED WHEN SOMEONE       '
  DC  CL75'INADVERTENTLY OPEN THE DARKROOM DOOR AND ALL OF THE    '
  DC  CL75'DARK LEAKS OUT '
  DC  X'FE'
ML00424  EQU   *
  DC  CL75'IF A THREE-STORY BUIDING SERVED BY ONE ELEVATOR NINE   '
  DC  CL75'TIMES OUT OF TEN THE ELEVATOR CARE WILL BE ON A FLOOR  '
  DC  CL75'WHERE YOU ARE NOT.'
  DC  X'FE'
ML00425  EQU   *
  DC  CL75'THE TENDENCY OF SMOKE FROM A CIGARETTE, BARBEQUE,      '
  DC  CL75'CAMPFIRE, ETC. TO DRIFT INTO A PERSON''S FACE VARIES   '
  DC  CL75'DIRECTLY WITH THAT PERSON''S SENSITIVITY TO SMOKE      '
  DC  X'FE'
ML00426  EQU   *
  DC  CL75'THE DISTANCE TO THE GATE IS INVERSELY PROPORTIONAL     '
  DC  CL75'TO THE TIME AVAILABLE TO CATCH YOU FLIGHT              '
  DC  X'FE'
ML00427  EQU   *
  DC  CL75'AS SOON AS THE STEWARDESS SERVES THE COFFEE, THE       '
  DC  CL75'AIRLINER ENCOUNTERS TURBULENCE                         '
  DC  X'FE'
ML00428  EQU   *
  DC  CL75'SERVING COFFEE ON AIRCRAFT CAUSES TURBULENCE           '
  DC  X'FE'
ML00429  EQU   *
  DC  CL75'WHATEVER CARROUSEL YOU STAND BY, YOUR BAGGAGE WILL     '
  DC  CL75'COME IN ON ANOTHER ONE                                 '
  DC  X'FE'
ML00430  EQU   *
  DC  CL75'WHEN TRAVELLING OVERSEAS, THE EXCHANGE RATE IMPROVES   '
  DC  CL75'MARKEDLY THE DAY AFTER ONE HAS PURCHASED FOREIGN       '
  DC  CL75'CURRENCY                                               '
  DC  X'FE'
ML00431  EQU   *
  DC  CL75'UPON RETURNING HOME, THE EXCHANGE RATE DROPS AGAIN AS  '
  DC  CL75'SOON AS ONE HAS CONVERTED ALL UNUSED FOREIGN CURRENCY  '
  DC  X'FE'
ML00432  EQU   *
  DC  CL75'THE BIGGER THEY ARE, THE HARDER THEY HIT               '
  DC  X'FE'
ML00433  EQU   *
  DC  CL75'FOR EVERY ACTION, THERE IS AN EQUAL AND OPPOSITE       '
  DC  CL75'CRITICISM                                              '
  DC  X'FE'
ML00434  EQU   *
  DC  CL75'AUTHORIZATION FOR A PROJECT WILL BE GRANTED ONLY WHEN  '
  DC  CL75'NONE OF THE AUTHORIZERS CAN BE BLAMED IF THE PROJECT   '
  DC  CL75'FAILS BUT WHEN ALL OF THE AUTHORIZERS CAN CLAIM CREDIT '
  DC  CL75'IF IT SUCCEEDS'
  DC  X'FE'
ML00435  EQU   *
  DC  CL75'IF AN IDEA CAN SURVIVE A BUREACRATIC REVIEW AND BE    '
  DC  CL75'IMPLEMENTED, IT WASN''T WORTH DOING                    '
  DC  X'FE'
ML00436  EQU   *
  DC  CL75'THE GREATER THE COST OF PUTTING A PLAN INTO OPERATION, '
  DC  CL75'THE LESS CHANCE THERE IS OF ABANDONING THE PLAN - EVEN '
  DC  CL75'IF IT SUBSEQUENTLY BECOMES IRRELEVANT'
  DC  X'FE'
ML00437  EQU   *
  DC  CL75'THE HIGHER THE LEVEL OF PRESTIGE ACCORDED THE PEOPLE   '
  DC  CL75'BEHIND THE PLAN. THE LEAST LESS CHANCE THERE IS OF     '
  DC  CL75'ABANDONING IT                                          '
  DC  X'FE'
ML00438  EQU   *
  DC  CL75'IN ANY ORGANIZATION THERE WILL ALWAYS BE ONE PERSON    '
  DC  CL75'WHO KNOWS WHAT IS GOING ON.                            '
  DC  CL75'THIS PERSON MUST BE FIRED.                             '
  DC  X'FE'
ML00439  EQU   *
  DC  CL75'IT IS EASIER TO GET FORGIVENESS THAN PERMISSION        '
  DC  X'FE'
ML00440  EQU   *
  DC  CL75'FAR-WAY TALENT ALWAYS SEEMS BETTER THAN HOME-DEVELOPED'
  DC  CL75'TALENT.                                                '
  DC  X'FE'
ML00441  EQU   *
  DC  CL75'PERSONNEL RECRUITING IS A TRIUMPH OF HOPE OVER         '
  DC  CL75'EXPERIENCE                                             '
  DC  X'FE'
ML00442  EQU   *
  DC  CL75'SOME PEOPLE MANAGE BY THE BOOK, EVEN THOUGH THEY       '
  DC  CL75'DON''T KNOW WHO WROTE THE BOOK OR EVEN WHAT BOOK       '
  DC  X'FE'
ML00443  EQU   *
  DC  CL75'DON''T LET YOUR SUPERIORS KNOW YOU''RE BETTER THAN     '
  DC  CL75'THEY ARE                                               '
  DC  X'FE'
ML00444  EQU   *
  DC  CL75'YOU NEVER KNOW WHO''S RIGHT, BUT YOU ALWAYS KNOW       '
  DC  CL75'WHO''S IN CHARGE                                       '
  DC  X'FE'
ML00445  EQU   *
  DC  CL75'1. ANYONE CAN MAKE A DECISION GIVEN ENOUGH FACTS       '
  DC  CL75'2. A GOOD MANAGER CAN MAKE A DECISION WITHOUT ENOUGH   '
  DC  CL75'   FACTS                                               '
  DC  CL75'3. A PERFECT MANAGER CAN OPERATE IN PERFECT IGNORANCE  '
  DC  X'FE'
ML00446  EQU   *
  DC  CL75'THE BOSS WHO ATTEMPTS TO IMPRESS EMPLOYEES WITH HIS    '
  DC  CL75'KNOWLEDGE OF INTRICATE DETAILS HAS LOST SIGHT OF HIS   '
  DC  CL75'FINAL OBJECTIVE '
  DC  X'FE'
ML00447  EQU   *
  DC  CL75'YOU WILL SAVE YOURSELF A LOT OF NEEDLESS WORRY IF YOU  '
  DC  CL75'DON''T BURN YOUR BRIDGES UNTIL YOU COME TO THEM        '
  DC  X'FE'
ML00448  EQU   *
  DC  CL75'IN A HIERARCHICAL SYSTEM, THE RATE OF PAY VARIES       '
  DC  CL75'INVERSELY WITH THE UNPLEASANTNESS AND DIFFICULTY       '
  DC  CL75'OF THE TASK'
  DC  X'FE'
ML00449  EQU   *
  DC  CL75'THE CLIENT WHO PAYS THE LEAST COMPLAINS THE MOST       '
  DC  X'FE'
ML00450  EQU   *
  DC  CL75'A LACK OF PLANNING ON YOUR PART                        '
  DC  CL75'DOES NOT CONSTITUTE AN EMERGENCY ON MY PART            '
  DC  X'FE'
ML00451  EQU   *
  DC  CL75'                                                       '
  DC  CL75'I KNOW YOU BELIEVE YOU UNDERSTAND                      '
  DC  CL75'   WHAT YOU THINK I SAID,                              '
  DC  CL75'      HOWEVER, I AM NOT SURE YOU REALIZE,              '
  DC  CL75'         THAT WHAT I THINK YOU HEARD                   '
  DC  CL75'            IS NOT WHAT I MEANT                        '
  DC  CL75'                                                       '
  DC  X'FE'
ML00452  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T EAT MUFFINS                    '
  DC  X'FE'
ML00453  EQU   *
  DC  CL75'IN ANY BUREAUCRACY, PAPERWORK INCREASES AS YOU SPEND   '
  DC  CL75'MORE AND MORE TIME REPORTING ON THE LESS AND LESS YOU  '
  DC  CL75'ARE DOING. STABILITY IS ACHIEVED WHEN YOU SPEND ALL OF '
  DC  CL75'YOUR TIME REPORTING ON THE NOTHING YOU ARE DOING       '
  DC  X'FE'
ML00454  EQU   *
  DC  CL75'CONSULTANTS ARE MYSTICAL PEOPLE WHO ASK A COMPANY FOR  '
  DC  CL75'A NUMBER AND THEN GIVE IT BACK TO THEM                 '
  DC  X'FE'
ML00455  EQU   *
  DC  CL75'WHEN SOMEBODY DROPS SOMETHING, EVERYBODY WILL KICK IT  '
  DC  CL75'AROUND INSTEAD OF PICKING IT UP                        '
  DC  X'FE'
ML00456  EQU   *
  DC  CL75'THE CHANCES OF ANYBODY DOING ANYTHING ARE INVERSELY    '
  DC  CL75'PROPORTIONAL TO THE NUMBER OF OTHER PEOPLE WHO ARE IN  '
  DC  CL75'A POSITION TO DO IT INSTEAD'
  DC  X'FE'
ML00457  EQU   *
  DC  CL75'NEVER MAKE A DECISION YOU CAN GET SOMEONE ELSE TO MAKE '
  DC  X'FE'
ML00458  EQU   *
  DC  CL75'NO ONE KEEPS A RECORD OF DECISIONS YOU COULD HAVE MADE '
  DC  CL75'BUT DIDN''T. EVERYONE KEEPS A RECORDS OF YOUR BAD ONES '
  DC  X'FE'
ML00459  EQU   *
  DC  CL75'FOR EVERY VISION, THERE IS AN EQUAL AND OPPOSITE REVISION'
  DC  X'FE'
ML00460  EQU   *
  DC  CL75'THE INSIDE CONTACT THAT YOU HAVE DEVELOPED AT GREAT    '
  DC  CL75'EXPENSE IS THE FIRST PERSON TO BE LET GO IN ANY        '
  DC  CL75'REORGANIZATION'
  DC  X'FE'
ML00461  EQU   *
  DC  CL75'IT''S TOUGH TO GET REALLOCATED WHEN YOU''RE THE ONE    '
  DC  CL75'WHO''S REDUNDANT                                       '
  DC  X'FE'
ML00462  EQU   *
  DC  CL75'WHATEVER HITS THE FAN WILL NOT BE EVENLY DISTRIBUTED   '
  DC  X'FE'
ML00463  EQU   *
  DC  CL75'IF YOU''RE EARLY, IT''BE CANCELLED                     '
  DC  CL75'IF YOU KNOCK YOURSELF OUT TO BE ON TIME, YOU WILL      '
  DC  CL75'   HAVE TO WAIT                                        '
  DC  CL75'IF YOU''RE LATE, YOU WILL BE TOO LATE                  '
  DC  X'FE'
ML00464  EQU   *
  DC  CL75'A MEETING IS AN EVENT AT WHICH THE MINUTES ARE KEPT    '
  DC  CL75'AND THE HOURS ARE LOST                                 '
  DC  X'FE'
ML00465  EQU   *
  DC  CL75'IF YOU LEAVE THE ROOM, YOU''RE ELECTED                 '
  DC  X'FE'
ML00466  EQU   *
  DC  CL75'THE CREAM RISES TO THE TOP.                            '
  DC  CL75'SO DOES THE SCUM.                                      '
  DC  X'FE'
ML00467  EQU   *
  DC  CL75'YOU CAN NEVER DO JUST ONE THING.                       '
  DC  X'FE'
ML00468  EQU   *
  DC  CL75'THERE''S NO TIME LIKE THE PRESENT FOR POSTPONING       '
  DC  CL75'WHAT YOU DON''T WANT TO DO                             '
  DC  X'FE'
ML00469  EQU   *
  DC  CL75'ANY TASK WORTH DOING WAS WORTH DOING YESTERDAY.        '
  DC  X'FE'
ML00470  EQU   *
  DC  CL75'THE MORE COMPLICATED AND GRANDIOSE THE PLAN, THE       '
  DC  CL75'GREATER THE CHANCE OF FAILURE                          '
  DC  X'FE'
ML00471  EQU   *
  DC  CL75'SIMPLE JOBS ALWAYS GET PUT OFF BECAUSE THERE WILL BE   '
  DC  CL75'TIME TO DO THEM LATER                                  '
  DC  X'FE'
ML00472  EQU   *
  DC  CL75'ASSUMPTION IS THE MOTHER OF ALL SCREW-UPS              '
  DC  X'FE'
ML00473  EQU   *
  DC  CL75'A WORK PROJECT EXPANDS TO FILL THE SPACE AVAILABLE     '
  DC  X'FE'
ML00474  EQU   *
  DC  CL75'NO MATTER HOW LARGE THE WORK SPACE, IF TWO PROJECT     '
  DC  CL75'MUST BE DONE AT THE SAME TIME THEY WILL REQUIRE THE    '
  DC  CL75'SAME PART OF THE WORK SPACE'
  DC  X'FE'
ML00475  EQU   *
  DC  CL75'THE ONE WRENCH OR DRILL BIT YOU NEED WILL BE THE ONE   '
  DC  CL75'MISSING FROM THE TOOL CHEST                            '
  DC  X'FE'
ML00476  EQU   *
  DC  CL75'MOST PROJECTS REQUIRE THREE HANDS                      '
  DC  X'FE'
ML00477  EQU   *
  DC  CL75'LEFTOVER NUTS NEVER MATCH LEFTOVER BOLTS               '
  DC  X'FE'
ML00478  EQU   *
  DC  CL75'THE MORE CAREFULLY YOU PLAN A PROJECT, THE MORE        '
  DC  CL75'CONFUSION THERE IS WHEN SOMETHING GOES WRONG           '
  DC  X'FE'
ML00479  EQU   *
  DC  CL75'MURPHY''S RULE FOR PRECISION :                         '
  DC  CL75'   MEASURE WITH A MICROMETER                           '
  DC  CL75'   MARK WITH CHALK                                     '
  DC  CL75'   CUT WITH AN AXE                                     '
  DC  X'FE'
ML00480  EQU   *
  DC  CL75'YOU CAN''T FIX IT IF IT AIN''T BROKE                   '
  DC  X'FE'
ML00481  EQU   *
  DC  CL75'FIRST RULE OF INTELLIGENT TINKERING:                   '
  DC  CL75'    SAVE ALL THE PARTS                                 '
  DC  X'FE'
ML00482  EQU   *
  DC  CL75'ACCESS HOLES WILL BE 1/2" TOO SMALL                    '
  DC  CL75'HOLES THAT ARE THE RIGHT SIZE WILL BE IN THE WRONG PLACE'
  DC  X'FE'
ML00483  EQU   *
  DC  CL75'IF IT WOULD BE CHEAPER TO BUY A NEW UNIT, THE COMPANY  '
  DC  CL75'WILL INSIST UPON REPAIRING THE OLD ONE                 '
  DC  X'FE'
ML00484  EQU   *
  DC  CL75'IF IT WOULD BE CHEAPER TO REPAIR THE OLD ONE, THE      '
  DC  CL75'COMPANY WILL INSIST ON THE LATEST MODEL                '
  DC  X'FE'
ML00485  EQU   *
  DC  CL75'THE PRIMARY FUNCTION OF THE DESIGN ENGINEER IS TO MAKE '
  DC  CL75'THINGS DIFFICULT FOR THE FABRICATOR AND IMPOSSIBLE     '
  DC  CL75'FOR THE SERVICEMAN                                     '
  DC  X'FE'
ML00486  EQU   *
  DC  CL75'THAT COMPONENT OF ANY CIRCUIT WHICH HAS THE SHORTEST   '
  DC  CL75'SERVICE LIFE WILL BE PLACED IN THE LEAST               '
  DC  CL75'ACCESSIBLE LOCATION                                    '
  DC  X'FE'
ML00487  EQU   *
  DC  CL75'ANY CIRCUIT DESIGN MUST CONTAIN AT LEAST ONE PART WHICH'
  DC  CL75'IS OBSOLETE, TWO PARTS WHICH ARE UNOBTAINABLE AND THREE'
  DC  CL75'PARTS WHICH AT STILL UNDER DEVELOPMENT                 '
  DC  X'FE'
ML00488  EQU   *
  DC  CL75'IMPORTANT LETTERS WHICH CONTAIN NO ERRORS WILL DEVELOP '
  DC  CL75'ERRORS IN THE MAIL                                     '
  DC  X'FE'
ML00489  EQU   *
  DC  CL75'OFFICE MACHINES WHICH FUNCTION PERFECTLY DURING NORMAL '
  DC  CL75'BUSINESS HOURS WILL BREAK DOWN WHEN YOU RETURN TO THE  '
  DC  CL75'OFFICE AT NIGHT TO USE THEM FOR PERSONAL BUSINESS.     '
  DC  X'FE'
ML00490  EQU   *
  DC  CL75'MACHINES THAT HAVE BROKEN DOWN WILL WORK PERFECTLY     '
  DC  CL75'WHEN THE REPAIRMAN ARRIVES                             '
  DC  X'FE'
ML00491  EQU   *
  DC  CL75'ENVELOPES AND STAMPS WHICH DON''T STICK WHEN YOU LICK  '
  DC  CL75'THEM WILL STICK TO OTHER THINGS WHEN YOU DON''T WANT   '
  DC  CL75'THEM TO'
  DC  X'FE'
ML00492  EQU   *
  DC  CL75'VITAL PAPERS WILL DEMONSTRATE THEIR VITALITY BY        '
  DC  CL75'SPONTANEOUSLY MOVING FROM WHERE YOU LEFT THEM TO WHERE '
  DC  CL75'YOU CAN''T FIND THEM.'
  DC  X'FE'
ML00493  EQU   *
  DC  CL75'THE LAST PERSON WHO QUIT OR WAS FIRED WILL BE HELD     '
  DC  CL75'RESPONSIBLE FOR EVERYTHING THAT GOES WRONG -- UNTIL    '
  DC  CL75'THE NEXT PERSON QUITS OR IS FIRED.                     '
  DC  X'FE'
ML00494  EQU   *
  DC  CL75'IF YOU HIT TWO KEYS ON THE TYPEWRITER, THE ONE YOU     '
  DC  CL75'DON''T WANT HIS THE PAPER                              '
  DC  X'FE'
ML00495  EQU   *
  DC  CL75'THE ONE TIME IN THE DAY THAT YOU LEAN BACK AND RELAX   '
  DC  CL75'IS THE ONE TIME THE BOSS WALKS THROUGH THE OFFICE      '
  DC  X'FE'
ML00496  EQU   *
  DC  CL75'HOT GLASS LOOKS EXACTLY THE SAME AS COLD GLASS         '
  DC  X'FE'
ML00497  EQU   *
  DC  CL75'WHEN YOU DO NOT KNOW WHAT YOU ARE GOING, DO IT NEATLY  '
  DC  X'FE'
ML00498  EQU   *
  DC  CL75'TEAMWORK IS ESSENTIAL. IT ALLOWS YOU TO BLAME          '
  DC  CL75'SOMEONE ELSE                                           '
  DC  X'FE'
ML00499  EQU   *
  DC  CL75'SCIENCE IS TRUE. DON''T BE MISLED BY FACTS             '
  DC  X'FE'
ML00500  EQU   *
  DC  CL75'1. IF IT''S GREEN OR IT WIGGLES, IT''S BIOLOGY         '
  DC  CL75'2. IF IT STINKS, IT''S CHEMISTRY                       '
  DC  CL75'3. IF IT DOESN''T WORK, IT''S PHYSICS                  '
  DC  X'FE'
ML00501  EQU   *
  DC  CL75'NOTHING IMPROVES AN INNOVATION LIKE LACK OF CONTROLS   '
ML00502  EQU   *
  DC  CL75'THE QUALITY OF CORRELATION IS INVERSELY PROPORTIONAL   '
  DC  CL75'TO THE DENSITY OF CONTROL                              '
  DC  X'FE'
ML00503  EQU   *
  DC  CL75'IF REPRODUCIBILITY MAY BE A PROBLEM CONDUCT THE        '
  DC  CL75'TEST ONLY ONCE                                         '
  DC  X'FE'
ML00504  EQU   *
  DC  CL75'IF A STRAIGHT LINE FIT IS REQUIRED, OBTAIN ONLY TWO    '
  DC  CL75'DATA POINTS                                            '
  DC  X'FE'
ML00505  EQU   *
  DC  CL75'ANY TECHNICAL PROBLEM CAN BE OVERCOME GIVEN ENOUGH     '
  DC  CL75'TIME AND MONEY                                         '
  DC  X'FE'
ML00506  EQU   *
  DC  CL75'YOU ARE NEVER GIVEN ENOUGH TIME OR MONEY               '
  DC  X'FE'
ML00507  EQU   *
  DC  CL75'UNLESS THE RESULTS ARE KNOWN IN ADVANCE, FUNDING       '
  DC  CL75'AGENCIES WILL REJECT THE PROPOSAL                      '
  DC  X'FE'
ML00508  EQU   *
  DC  CL75'IT IS BETTER TO SOLVE A PROBLEM WITH A CRUDE '
  DC  CL75'APPROXIMATION AND KNOW THE TRUTH, THAN TO DEMAND AN    '
  DC  CL75'EXACT SOLUTION AND NOT KNOW THE TRUTH AT ALL.'
  DC  X'FE'
ML00509  EQU   *
  DC  CL75'AN EASILY-UNDERSTOOD, WORKABLE FALSEHOOD IS MORE USEFUL'
  DC  CL75'THAN A COMPLES, INCOMPRESHENSIBLE TRUTH                '
  DC  X'FE'
ML00510  EQU   *
  DC  CL75'ANYONE WHO MAKE A SIGNIFICANT CONTRIBUTION TO ANY FIELD'
  DC  CL75'OF ENDEAVOR, AND STAYS IN THAT FIELD LONG ENOUGH,      '
  DC  CL75'BECOMES AN OBSTRUCTION OT ITS PROGRESS -- IN DIRECT    '
  DC  CL75'PROPORTION TO THE IMPORTANCE OF HIS ORIGINAL CONTRIBUTION'
  DC  X'FE'
ML00511  EQU   *
  DC  CL75'IF A SCIENTIST ENCOVERS A PUBLISHABLE FACT, IT WILL    '
  DC  CL75'BECOME CENTRAL TO HIS THEORY.                          '
  DC  CL75'   '
  DC  CL75'HIS THEORY, IN TURN, WILL BECOME CENTRAL TO ALL        '
  DC  CL75'SCIENTIFIC THOUGH.'
  DC  X'FE'
ML00512  EQU   *
  DC  CL75'THERE IS NO SUCH THING AS A  STRAIGHT LINE             '
  DC  X'FE'
ML00513  EQU   *
  DC  CL75'IN ANY SERIES OF CALCULATIONS, ERRORS TEND TO OCCUR    '
  DC  CL75'AT THE OPPOSITE END TO THE END AT WHICH YOU BEGIN      '
  DC  CL75'CHECKING FOR ERRORS.'
  DC  X'FE'
ML00514  EQU   *
  DC  CL75'ONLY ERRORS EXIST                                      '
  DC  X'FE'
ML00515  EQU   *
  DC  CL75'ONE MAN''S ERROR IS ANOTHER MAN''S DATA.               '
  DC  X'FE'
ML00516  EQU   *
  DC  CL75'TO ERR IS HUMAN, BUT TO REALLY FOUL THINGS UP REQUIRES '
  DC  CL75'A COMPUTER                                             '
  DC  X'FE'
ML00517  EQU   *
  DC  CL75'WHEN PUTTING IT INTO MEMORY, REMEMBER WHERE YOU PUT IT '
  DC  X'FE'
ML00518  EQU   *
  DC  CL75'NEVER TEST FOR AN ERROR CONDITION YOU DON''T KNOW      '
  DC  CL75'HOW TO HANDLE                                          '
  DC  X'FE'
ML00519  EQU   *
  DC  CL75'EVERYBODY LIES; BUT IT DOESN''T MATTER, SINCE          '
  DC  CL75'NOBODY LISTENS                                         '
  DC  X'FE'
ML00520  EQU   *
  DC  CL75'PEOPLE WHO LOVE SAUSAGE AND RESPECT THE LAW SHOULD     '
  DC  CL75'NEVER WATCH EITHER ONE BEING MADE                      '
  DC  X'FE'
ML00521  EQU   *
  DC  CL75'NO MATTER WHAT THEY''RE TELLING YOU, THEY''RE NOT      '
  DC  CL75'TELLING YOU THE WHOLE TRUTH                            '
  DC  X'FE'
ML00522  EQU   *
  DC  CL75'NO MATTER WHAT THEY''RE TALKING ABOUT, THEY''RE        '
  DC  CL75'TALKING ABOUT MONEY                                    '
  DC  X'FE'
ML00523  EQU   *
  DC  CL75'IN ANY DEALINGS WITH A COLLECTIVE BODY OF PEOPLE, THE  '
  DC  CL75'PEOPLE WILL ALWAYS BE MORE TACKY THAN ORIGINALLY EXPECTED'
  DC  X'FE'
ML00524  EQU   *
  DC  CL75'IF YOU CAN KEEP YOUR HEAD WHEN ALL ABOUT YOU ARE LOSING'
  DC  CL75'THEIRS, THEN YOU JUST DON''T UNDERSTAND THE PROBLEM    '
  DC  X'FE'
ML00525  EQU   *
 DC CL75'INFORMATION DETERIORATES UPWARD THROUGH THE BUREAUCRACIES'
  DC  X'FE'
ML00526  EQU   *
  DC  CL75'WHEN AN EXAGGERATED EMPHASIS IS PLACED UPON DELEGATION,'
  DC  CL75'RESPONSIBILITY, LIKE SEDIMENT, SINKS TO THE BOTTOM     '
  DC  X'FE'
ML00527  EQU   *
  DC  CL75'WHEN OUTRAGEOUS EXPENDITURES ARE DIVIDED FINELY ENOUGH '
  DC  CL75'THE PUBLIC WILL NOT HAVE ENOUGH STAKE IN ANY ONE       '
  DC  CL75'EXPENDITURE TO SQUELCH IT.'
  DC  X'FE'
ML00528  EQU   *
  DC  CL75'WHEN THE GOVERNMENT BUREAU''S REMEDIES DO NOT MATCH YOUR'
  DC  CL75'PROBLEM, YOU MODIFY THE PROBLEM, NOT THE REMEDY        '
  DC  X'FE'
ML00529  EQU   *
  DC  CL75'A FOOL AND YOUR MONEY ARE SOON PARTNERS                '
  DC  X'FE'
ML00530  EQU   *
  DC  CL75'YOU MAY KNOW WHERE THE MARKET IS GOING, BUT YOU CAN''T '
  DC  CL75'POSSIBLY KNOW WHERE IT''S GOING AFTER THAT             '
  DC  X'FE'
ML00531  EQU   *
  DC  CL75'AMONG ECONOMISTS, THE REAL WORLD IS OFTEN A SPECIAL CASE'
  DC  X'FE'
ML00532  EQU   *
  DC  CL75'TRIAL BALANCES DON''T                                  '
  DC  X'FE'
ML00533  EQU   *
  DC  CL75'WORKING CAPITAL DOESN''T                               '
  DC  X'FE'
ML00534  EQU   *
  DC  CL75'LIQUIDITY TENDS TO RUN OUT                             '
  DC  X'FE'
ML00535  EQU   *
  DC  CL75'RETURN ON INVESTMENTS WON''T                           '
  DC  X'FE'
ML00536  EQU   *
  DC  CL75'IF EVERYBODY DOESN''T WANT IT, NOBODY GETS IT          '
  DC  X'FE'
ML00537  EQU   *
  DC  CL75'MASS MAN MUST BE SERVED BY MASS MEANS                  '
  DC  X'FE'
ML00538  EQU   *
  DC  CL75'EVERYTHING IS CONTAGIOUS                               '
  DC  X'FE'
ML00539  EQU   *
  DC  CL75'NOTHING IS EVER DONE FOR THE RIGHT REASONS             '
  DC  X'FE'
ML00540  EQU   *
  DC  CL75'THE SECRET OF SUCCESS IS SINCERITY. ONCE YOU CAN FAKE  '
  DC  CL75'THAT YOU''VE GOT IT MADE                               '
  DC  X'FE'
ML00541  EQU   *
  DC  CL75'AN EXPERT IS ANYONE FROM OUT OF TOWN                   '
  DC  X'FE'
ML00542  EQU   *
  DC  CL75'AN EXPERT IS ONE WHO KNOWS MORE AND MORE ABOUT LESS    '
  DC  CL75'AND LESS UNITIL HE KNOWS ABSOLUTELY EVERYTHING         '
  DC  CL75'ABOUT NOTHING.'
  DC  X'FE'
ML00543  EQU   *
  DC  CL75'TO SPOT THE EXPERT, PICK THE ONE WHO PERDICTS THE JOB  '
  DC  CL75'WIL TAKE THE LONGEST AND COST THE MOST                '
  DC  X'FE'
ML00544  EQU   *
  DC  CL75'IF IT SITS ON YOUR DESK FOR 15 MINUTES, YOU''VE JUST   '
  DC  CL75'BECOME THE EXPERT                                      '
  DC  X'FE'
ML00545  EQU   *
  DC  CL75'INDECISION IS THE BASIS FOR FLEXIBILITY                '
  DC  X'FE'
ML00546  EQU   *
  DC  CL75'ANYTHING IS POSSIBLE IF YOU DON''T KNOW WHAT YOU''RE   '
  DC  CL75'TALKING ABOUT                                          '
  DC  X'FE'
ML00547  EQU   *
  DC  CL75'NEVER CREATE A PROBLEM FOR WHICH YOU DO NOT HAVE       '
  DC  CL75'THE ANSWER                                             '
  DC  X'FE'
ML00548  EQU   *
  DC  CL75'CREATE PROBLEMS FOR WHICH ONLY YOU HAVE THE ANSWER     '
  DC  X'FE'
ML00549  EQU   *
 DC CL75'A CONCLUSION IS THE PLACE WHERE YOU GOT TIRED OF THINKING'
  DC  X'FE'
ML00550  EQU   *
  DC  CL75'HINDSIGHT IS AN EXACT SCIENCE                          '
  DC  X'FE'
ML00551  EQU   *
  DC  CL75'HISTORY DOESN''T REPEAT ITSELF -- HISTORIANS MERELY    '
  DC  CL75'REPEAT EACH OTHER                                      '
  DC  X'FE'
ML00552  EQU   *
  DC  CL75'FACT IS SOLIDIFIED OPINION                             '
  DC  X'FE'
ML00553  EQU   *
  DC  CL75'FACTS MAY WEAKEN UNDER EXTREME HEAT AND PRESSURE       '
  DC  X'FE'
ML00554  EQU   *
  DC  CL75'TRUTH IS ELASTIC                                       '
  DC  X'FE'
ML00555  EQU   *
  DC  CL75'WHEN IN DOUBT, PREDICT THAT THE TREND WILL CONTINUE    '
  DC  X'FE'
ML00556  EQU   *
  DC  CL75'WHEN IN TROUBLE, OBFUSCATE                             '
  DC  X'FE'
ML00557  EQU   *
  DC  CL75'PROGRESS DOES NOT CONSIST IN REPLACING A THEORY THAT IS'
  DC  CL75'WRONG WITH ONE THAT IS RIGHT. IT CONSISTS IN REPLACING '
 DC CL75'A THEORY THAT IS WRONG WITH ONE THAT IS MORE SUBLTY WRONG'
  DC  X'FE'
ML00558  EQU   *
  DC  CL75'IT IS A SIMPLE TASK TO MAKE THINGS COMPLEX, BUT A COMPLEX'
  DC  CL75'TASK TO MAKE THEM SIMPLE                               '
  DC  X'FE'
ML00559  EQU   *
  DC  CL75'IF YOU HAVE A DIFFICULT TASK GIVE IT TO A LAZY MAN, HE '
  DC  CL75'WILL FIND AN EASIER WAY TO DO IT                       '
  DC  X'FE'
ML00560  EQU   *
  DC  CL75'EVERY GREAT IDEA HAS A DISADVANTAGE EQUAL TO OR       '
  DC  CL75'EXCEEDING THE GREATNESS OF THE IDEA                    '
  DC  X'FE'
ML00561  EQU   *
  DC  CL75'NEVER ATTRIBUTE TO MALICE THAT WHICH IS ADEQUATELY     '
  DC  CL75'EXPLAINED BY STUPIDITY                                 '
  DC  X'FE'
ML00562  EQU   *
  DC  CL75'NEW SYSTEMS GENERATE NEW PROBLEMS                      '
  DC  X'FE'
ML00563  EQU   *
  DC  CL75'SYSTEMS SHOULD NOT BE UNNECESSARILY MULTIPLIED         '
  DC  X'FE'
ML00564  EQU   *
  DC  CL75'SYSTEMS TEND TO GROW, AND AS THEY GROW THEY ENCROACH   '
  DC  X'FE'
ML00565  EQU   *
  DC  CL75'COMPLICATED SYSTEMS PRODUCE UNEXPECTED OUTCOMES        '
  DC  X'FE'
ML00566  EQU   *
  DC  CL75'THE TOTAL BEHAVIOR OF LARGE SYSTEMS CANNOT BE PREDICTED'
  DC  X'FE'
ML00567  EQU   *
  DC  CL75'A LARGE SYSTEM, PRODUCED BY EXPANDING THE DIMENSIONS OF'
 DC CL75'A SMALLER SYSTEM, DOES NOT BEHAVE LIKE THE SMALLER SYSTEM'
  DC  X'FE'
ML00568  EQU   *
  DC  CL75'PEOPLE IN SYSTEMS DO NOT DO WHAT THE SYSTEMS SAYS      '
  DC  CL75'THEY ARE DOING                                         '
  DC  X'FE'
ML00569  EQU   *
  DC  CL75'THE SYSTEM ITSELF DOES NOT DO WHAT IT SAYS IT IS DOING '
  DC  X'FE'
ML00570  EQU   *
  DC  CL75'A COMPLEX SYSTEM THAT WORKS IS INVARIABLY FOUND TO HAVE'
  DC  CL75'EVOLVED FROM A SIMPLE SYSTEM THAT WORKS                '
  DC  X'FE'
ML00571  EQU   *
  DC  CL75'A COMPLEX SYSTEM DESIGNED FROM SCRATCH NEVER WORKS AND '
  DC  CL75'CANNOT BE PATCHED UP TO MAKE IT WORK. YOU HAVE TO START'
  DC  CL75'OVER, BEGINNING WITH A WORKING SIMPLE SYSTEM'
  DC  X'FE'
ML00572  EQU   *
  DC  CL75'1. EVERYTHING IS A SYSTEM                              '
  DC  CL75'2. EVERYTHING IS PART OF A LARGER SYSTEM               '
  DC  CL75'3. THE UNIVERSE IS INFINITELY SYSTEMATIZED BOTH UPWARD '
  DC  CL75'   (LARGER SYSTEMS) AND DOWNWARD (SMALLER SYSTEMS)     '
  DC  CL75'4. ALL SYSTEMS ARE INFINITELY COMPLEX. (THE ILLUISON   '
  DC  CL75'   OF SIMPLICITY COMES FROM FOCUSSING ATTENTION ON     '
  DC  CL75'   ONE OR A FEW VARIABLES).'
  DC  X'FE'
ML00573  EQU   *
  DC  CL75'COMPLEX SYSTEMS TEND TO OPPOSE THEIR OWN PROPER FUNCTION'
  DC  X'FE'
ML00574  EQU   *
  DC  CL75'IF THE COURSE YOU WANTED MOST HAS ROOM FOR ''N'' STUDENTS'
  DC  CL75'YOU WILL BE THE ''N + 1'' TO APPLY                     '
  DC  X'FE'
ML00575  EQU   *
  DC  CL75'CLASS SCHEDULES ARE DESIGNED SO THAT EVERY STUDENT WILL'
  DC  CL75'WASTE THE MAXIMUM TIME BETWEEN CLASSES                 '
  DC  X'FE'
ML00576  EQU   *
  DC  CL75'SHOW ME A PERSON WHO''S NEVER MADE A MISTAKE AND I''LL '
  DC  CL75'SHOW YOU SOMEBODY WHO''S NEVER ACHIEVED MUCH           '
  DC  X'FE'
ML00577  EQU   *
  DC  CL75'WHEN YOU CONSIDER THERE ARE 24 HOURS IN A DAY, IT''S   '
  DC  CL75'SAD TO KNOW THAT ONLY ONE IS CALLED THE HAPPY HOUR     '
  DC  X'FE'
ML00578  EQU   *
  DC  CL75'WHEN YOU ARE ABLE TO SCHEDULE TWO CLASSES IN A ROW,    '
  DC  CL75'THEY WILL BE HELD IN CLASSROOMS AT OPPOSITE END OF     '
  DC  CL75'THE CAMPUS'
  DC  X'FE'
ML00579  EQU   *
  DC  CL75'A PREREQUISITE FOR A DESIRED COURSE WILL BE OFFERED    '
  DC  CL75'ONLY DURING THE SEMESTER FOLLOWING THE DESIRED COURSE  '
  DC  X'FE'
ML00580  EQU   *
  DC  CL75'WHEN REVIEWING YOUR NOTES BEFORE AN EXAM, THE MOST     '
  DC  CL75'IMPORTANT ONES WILL BE ILLEGIBLE                       '
  DC  X'FE'
ML00581  EQU   *
  DC  CL75'THE MORE STUDYING YOU DID FOR THE EXAM, THE LESS SURE  '
  DC  CL75'YOU ARE AS TO WHICH ANSWER THEY WANT                   '
  DC  X'FE'
ML00582  EQU   *
  DC  CL75'80% OF THE FINAL EXAM WILL BE BASED ON THE ONE LECTURE '
  DC  CL75'YOU MISSED ABOUT THE ONE BOOK YOU DIDN''T READ         '
  DC  X'FE'
ML00583  EQU   *
  DC  CL75'THE NIGHT BEFORE THE ENGLISH HISTORY MID-TERM, YOUR    '
  DC  CL75'BIOLOGY INSTRUCTOR WILL ASSIGN 200 PAGES ON PLANARIA   '
  DC  X'FE'
ML00584  EQU   *
  DC  CL75'EVERY INSTRUCTOR ASSUMES THAT YOU HAVE NOTHING ELSE    '
  DC  CL75'TO DO EXCEPT STUDY FOR THAT INSTRUCTOR''S COURSE       '
  DC  X'FE'
ML00585  EQU   *
  DC  CL75'IF YOU ARE GIVEN AN OPEN-BOOK EXAM, YOU WILL FORGET    '
  DC  CL75'YOUR BOOK                                              '
  DC  CL75'IF YOU ARE GIVEN A TAKE-HOME  EXAM, YOU WILL FORGET    '
  DC  CL75'WHERE YOU LIVE                                         '
  DC  X'FE'
ML00586  EQU   *
  DC  CL75'AT THE END OF THE SEMESTER YOU WILL RECALL HAVING      '
  DC  CL75'ENROLLED IN A COURSE AT THE BEGINNING OF THE SEMESTER  '
  DC  CL75'-- AND NEVER ATTENDING'
  DC  X'FE'
ML00587  EQU   *
  DC  CL75'THE ONE COURSE YOU MUST TAKE TO GRADUATE WILL NOT BE   '
  DC  CL75'OFFERED DURING YOUR LAST SEMESTER                      '
  DC  X'FE'
ML00588  EQU   *
  DC  CL75'THE MORE GENERAL THE TITLE OF A COURSE, THE LESS       '
  DC  CL75'YOU WILL LEARN FROM IT                                 '
  DC  X'FE'
ML00589  EQU   *
  DC  CL75'THE MORE SPECIFIC THE TITLE OF A COURSE, THE LESS YOU '
  DC  CL75'WILL BE ABLE TO APPLY IT LATER                         '
  DC  X'FE'
ML00590  EQU   *
  DC  CL75'THE MOST VALUABLE QUOTATION WILL BE THE ONE FOR WHICH  '
  DC  CL75'YOU CANNOT DETERMINE THE SOURCE                        '
  DC  X'FE'
ML00591  EQU   *
  DC  CL75'THE SOURCE FOR AN UNATTRIBUTED QUOTATION WILL APPEAR   '
  DC  CL75'IN THE MOST HOSTILE REVIEW OF YOUR WORK                '
  DC  X'FE'
ML00592  EQU   *
  DC  CL75'WHEN A WRITER PREPARES A MANUSCRIPT ON A SUBJECT HE DOES'
  DC  CL75'NOT UNDERSTAND, HIS WORK WILL BE UNDERSTOOD ONLY BY    '
  DC  CL75'READERS WHO KNOW MORE ABOUT THAT SUBJECT THAN HE DOES  '
  DC  X'FE'
ML00593  EQU   *
  DC  CL75'WRITINGS PREPARED WITHOUT UNDERSTANDING MUST FAIL IN THE'
  DC  CL75'FIRST OJBECTIVE OF COMMUNICATION -- INFORMING          '
  DC  CL75'THE UNINFORMED'
  DC  X'FE'
ML00594  EQU   *
  DC  CL75'WHEN A STUDENT ASKS FOR A SECOND TIME IF YOU HAVE READ '
  DC  CL75'HIS BOOK REPORT, HE DID NOT READ THE BOOK              '
  DC  X'FE'
ML00595  EQU   *
  DC  CL75'IF DAILY CLASS ATTENDANCE IS MANDATORY, A SCHEDULED    '
  DC  CL75'EXAM WILL PRODUCT INCREASED ABSENTEEISM. IF ATTENDANCE '
  DC  CL75'IS OPTIONAL, A SCHEDULED EXAM WILL PRODUCE PERSONS YOU '
  DC  CL75'HAVE NEVER SEEN BEFORE'
  DC  X'FE'
ML00596  EQU   *
  DC  CL75'JUST BECAUSE YOUR DOCTOR HAS A NAME FOR YOUR CONDITION '
  DC  CL75'DOESN''T MEAN HE KNOWS WHAT IT IS                      '
  DC  X'FE'
ML00597  EQU   *
  DC  CL75'THE MORE BORING AND OUT-OF-DATE THE MAGAZINES IN THE   '
  DC  CL75'WAITING ROOM, THE LONGER YOU WILL HAVE TO WAIT FOR     '
  DC  CL75'YOUR SCHEDULED APPOINTMENT'
  DC  X'FE'
ML00598  EQU   *
  DC  CL75'ONLY ADULTS HAVE DIFFICULTY WITH CHILD-PROOF BOTTLES   '
  DC  X'FE'
ML00599  EQU   *
  DC  CL75'YOU NEVER HAVE THE RIGHT NUMBER OF PILLS LEFT ON THE   '
  DC  CL75'LAST DAY OF A PRESSCRIPTION                            '
  DC  X'FE'
ML00600  EQU   *
  DC  CL75'THE PILLS TO BE TAKEN WITH MEALS WILL BE THE LEAST     '
  DC  CL75'APPETIZING ONES                                        '
  DC  X'FE'
ML00601  EQU   *
  DC  CL75'EVEN WATER TASTES BAD WHEN TAKEN ON DOCTORS ORDERS     '
  DC  X'FE'
ML00602  EQU   *
  DC  CL75'IF YOUR CONDITION SEEMS TO BE GETTING BETTER, IT''S    '
  DC  CL75'PROBABLY YOUR DOCTOR GETTING SICK                      '
  DC  X'FE'
ML00603  EQU   *
  DC  CL75'BEWARE OF THE PHYSICIAN WHO IS GREAT AT GETTING        '
  DC  CL75'OUT OF TROUBLE                                         '
  DC  X'FE'
ML00604  EQU   *
  DC  CL75'A DRUG IS THAT SUBSTANCE WHICH, WHEN INJECTED INTO A   '
  DC  CL75'RAT,  WILL PRODUCE A SCIENTIFIC REPORT                 '
  DC  X'FE'
ML00605  EQU   *
  DC  CL75'BEFORE ORDERING A TEST DECIDE WHAT YOU WILL DO IF IT   '
  DC  CL75'IS 1) POSITIVE, OR 2) NEGATIVE. IF BOTH ANSWERS ARE THE'
  DC  CL75'SAME, DON''T DO THE TEST'
  DC  X'FE'
ML00606  EQU   *
  DC  CL75'THE RADIOLOGISTS'' NATIONAL FLOWER IS THE HEDGE        '
  DC  X'FE'
ML00607  EQU   *
  DC  CL75'THE FEASIBILITY OF AN OPERATION IS NOT THE BEST        '
  DC  CL75'INDICIATION FOR ITS PERFORMANCE                        '
  DC  X'FE'
ML00608  EQU   *
  DC  CL75'A PHYSICIAN''S ABILITY IS INVERSELY PROPORTIONAL       '
  DC  CL75'TO HIS AVAILABILITY                                    '
  DC  X'FE'
ML00609  EQU   *
  DC  CL75'THERE ARE TWO KINDS OF ADHESIVE TAPE: THAT WHICH WON''T'
  DC  CL75'STAY ON AND THAT WHICH WON''T COME OFF                 '
  DC  X'FE'
ML00610  EQU   *
  DC  CL75'EVERBODY WANTS A PAIN SHOT AT THE SAME TIME            '
  DC  X'FE'
ML00611  EQU   *
  DC  CL75'EVERYBODY WHO DIDN''T WANT A PAIN SHOT WHEN YOU WERE   '
  DC  CL75'PASSING OUT PAIN SHOTS WANTS ONE WHEN YOU ARE PASSING  '
  DC  CL75'OUT SLEEPING PILLS'
  DC  X'FE'
ML00612  EQU   *
  DC  CL75'AN ALCOHOLIC IS A PERSON WHO DRINKS MORE THAT HIS      '
  DC  CL75'OWN PHYSICIAN                                          '
  DC  X'FE'
ML00613  EQU   *
  DC  CL75'FOOLS RUSH IN -- AND GET THE BEST SEATS                '
  DC  X'FE'
ML00614  EQU   *
  DC  CL75'AT ANY EVENT, THE PEOPLE WHOSE SEATS ARE FURTHEST FROM '
  DC  CL75'THE AISLE ARRIVE LAST                                  '
  DC  X'FE'
ML00615  EQU   *
  DC  CL75'EXCITING PLAYS OCCUR ONLY WHILE YOU ARE WATCHING THE    '
  DC  CL75'SCOREBOARD OR OUT BUYING A HOT DOG                     '
  DC  X'FE'
ML00616  EQU   *
  DC  CL75'NOTHING IS EVER SO BAD IT CAN''T BE MADE WORSE BY      '
  DC  CL75'FIRING THE COACH                                       '
  DC  X'FE'
ML00617  EQU   *
  DC  CL75'THE WRONG QUATERBACK IS THE ONE THAT''S IN THERE       '
  DC  X'FE'
ML00618  EQU   *
  DC  CL75'A FREE AGENT IS ANYTHING BUT                           '
  DC  X'FE'
ML00619  EQU   *
  DC  CL75'HOCKEY IS A GAME PLAYED BY SIX GOOD PLAYERS AND THE    '
  DC  CL75'HOME TEAM                                              '
  DC  X'FE'
ML00620  EQU   *
  DC  CL75'WHATEVER CAN GO TO NEW YORK, WILL                      '
  DC  X'FE'
ML00621  EQU   *
  DC  CL75'WHENEVER A SUPERSTAR IS TRADED TO YOUR FAVORITE TEAM,  '
  DC  CL75'HE FADES. WHENEVER YOUR TEAM TRADES AWAY A USLESS      '
  DC  CL75'NO-NAME, HE IMMEDIATELY RISES TO STARDOM               '
  DC  X'FE'
ML00622  EQU   *
  DC  CL75'NEVER LEAVE HOLD OF WHAT YOU''VE GOT UNTIL YOU''VE     '
  DC  CL75'GOT HOLD OF SOMETHING ELSE                             '
  DC  X'FE'
ML00623  EQU   *
  DC  CL75'A MEDIOCRE PLAYER WILL SINK TO THE LEVEL OF HIS OR     '
  DC  CL75'HER OPPOSITION                                         '
  DC  X'FE'
ML00624  EQU   *
  DC  CL75'THE ONLY WAY TO MAKE UP FOR BEING LOST IS TO MAKE      '
  DC  CL75'RECORD TIME WHILE YOU ARE LOST                         '
  DC  X'FE'
ML00625  EQU   *
  DC  CL75'THE AMOUNT OF WIND WILL VARY INVERSELY WITH THE NUMBER '
  DC  CL75'AND EXPERIENCE OF THE PEOPLE YOU HAVE ON BOARD         '
  DC  X'FE'
ML00626  EQU   *
  DC  CL75'NO MATTER HOW STRONG THE BREEZE WHEN YOU LEAVE THE DOCK'
  DC  CL75'ONCE YOU HAVE REACHED THE FURTHEST POINT FROM PORT     '
  DC  CL75'THE WIND WILL DIE'
  DC  X'FE'
ML00627  EQU   *
  DC  CL75'THE TIME AVAILABLE TO GO FISHING SHRINKS AS THE FISHING'
  DC  CL75'SEASON DRAWS NEARER   '
  DC  X'FE'
ML00628  EQU   *
  DC  CL75'THE LEAST EXPERIENCE FISHERMAN ALWAYS CATCHES THE      '
  DC  CL75'BIGGEST FISH                                           '
  DC  X'FE'
ML00629  EQU   *
  DC  CL75'THE MORE ELABORATE AND COSTLY THE EQUIPMENT, THE GREATER'
  DC  CL75'THE CHANCE OF HAVING TO STOP AT THE FISH MARKET        '
  DC  CL75'ON THE WAY HOME                                        '
  DC  X'FE'
ML00630  EQU   *
  DC  CL75'THE WORSE YOUR LINE IS TANGLED, THE BETTER IS THE      '
  DC  CL75'FISHING AROUND YOU                                     '
  DC  X'FE'
ML00631  EQU   *
  DC  CL75'THE MOUNTAIN GETS STEEPER AS YOU GET CLOSER            '
  DC  X'FE'
ML00632  EQU   *
  DC  CL75'THE MOUNTAIN LOOKS CLOSER THAN IT IS                   '
  DC  X'FE'
ML00633  EQU   *
  DC  CL75'ALL TRAILS HAVE MORE UPHILL SECTIONS THAT THEY HAVE    '
  DC  CL75'LEVEL OR DOWNHILL SECTIONS                             '
  DC  X'FE'
ML00634  EQU   *
  DC  CL75'THE ONE WHO LEASTS WANTS TO PLAY IS THE ONE WHO WILL WIN'
  DC  X'FE'
ML00635  EQU   *
  DC  CL75'ALL THINGS BEING EQUAL, YOU LOSE                       '
  DC  CL75'                                                       '
  DC  CL75'ALL THINGS BEING IN YOUR FAVOR, YOU STILL LOSE         '
  DC  X'FE'
ML00636  EQU   *
  DC  CL75'WIN OR LOSE, YOU LOSE                                  '
  DC  X'FE'
ML00637  EQU   *
  DC  CL75'NO MATTER WHERE YOU GO, THERE YOU ARE !                '
  DC  X'FE'
ML00638  EQU   *
  DC  CL75'IT ALWAYS TAKES LONGER TO GET THERE THAN TO GET BACK   '
  DC  X'FE'
ML00639  EQU   *
  DC  CL75'IF EVERYTHING IS COMING YOUR WAY, YOU''RE IN THE       '
  DC  CL75'WRONG LANE                                             '
  DC  X'FE'
ML00640  EQU   *
  DC  CL75'IF YOU ALLOW SOMEONE TO GET IN FRONT OF YOU EITHER:    '
  DC  CL75'A. THE CAR IN FRONT WILL BE THE LAST ONE OVER A        '
  DC  CL75'   RAILROAD CROSSING, AND YOU WILL BE STUCK WAITING    '
  DC  CL75'   FOR A LONG, SLOW-MOVING TRAIN; OR                   '
  DC  CL75'B. YOU BOTH WILL HAVE THE SAME DESTINATION AND THE     '
  DC  CL75'   OTHER CAR WILL GET THE LAST PARKING SPACE           '
  DC  X'FE'
ML00641  EQU   *
  DC  CL75'IF YOU HAVE TO PARK SIX BLOCKS AWAY, YOU WILL FIND TWO '
  DC  CL75'NEW PARKING SPACES RIGHT IN FRONT OF THE BUILDING      '
  DC  CL75'ENTRANCE                                               '
  DC  X'FE'
ML00642  EQU   *
  DC  CL75'WHEN YOU''RE NOT IN A HURRY, THE TRAFFIC LIGHT WILL TURN'
  DC  CL75'GREEN AS SOON AS YOUR VEHICLE COMES TO A COMPLETE STOP '
  DC  X'FE'
ML00643  EQU   *
  DC  CL75'A CAR AND A TRUCK APPROACHING EACH OTHER ON AN OTHERWISE'
  DC  CL75'DESERTED ROAD WILL MEET AT THE NARROW BRIDGE           '
  DC  X'FE'
ML00644  EQU   *
 DC  CL75'THE SPEED OF AN ONCOMING VEHICLE IS DIRECTLY PROPORTIONAL'
 DC  CL75'TO THE LENGTH OF THE PASSING ZONE                      '
  DC  X'FE'
ML00645  EQU   *
  DC  CL75'THE FIRST BUG TO HIT A CLEAN WINDSHIELD LANDS DIRECTLY '
  DC  CL75'IN FRONT OF YOUR EYES                                  '
  DC  X'FE'
ML00646  EQU   *
  DC  CL75'IF YOU CAN GET TO THE FAULTY PART, YOU DON''T HAVE THE '
  DC  CL75'TOOL TO GET IT OFF                                     '
  DC  X'FE'
ML00647  EQU   *
  DC  CL75'IF YOU CAN GET THE FAULTY PART OFF, THE PARTS HOUSE    '
  DC  CL75'WILL HAVE IT BACK-ORDERED                              '
  DC  X'FE'
ML00648  EQU   *
  DC  CL75'IF THE FAULTY PART IS IN STOCK, IT DIDN''T NEED REPLACING'
  DC  CL75'IN THE FIRST PLACE                                     '
  DC  X'FE'
ML00649  EQU   *
  DC  CL75'WHEN THE NEED ARISES, ANY TOOL OR OBJECT CLOSEST TO YOU'
  DC  CL75'BECOMES A HAMMER                                       '
  DC  X'FE'
ML00650  EQU   *
  DC  CL75'NO MATTER HOW MINOR THE TASK, YOU WILL INEVITABLY END  '
  DC  CL75'UP COVERED WITH GREASE AND MOTOR OIL                   '
  DC  X'FE'
ML00651  EQU   *
  DC  CL75'WHEN NECESSARY, METRIC AND INCH TOOLS CAN BE USED      '
  DC  CL75'INTERCHANGEABLY                                        '
  DC  X'FE'
ML00652  EQU   *
  DC  CL75'AUTOMOTIVE ENGINEERING REPAIR LAW:                  '
  DC  CL75'IF YOU DROP SOMETHING, IT WILL NEVER REACH THE GROUND  '
  DC  X'FE'
ML00653  EQU   *
  DC  CL75'IF YOU LIVED HERE YOU''D BE HOME NOW                   '
  DC  X'FE'
ML00654  EQU   *
  DC  CL75'IF IT''S GOOD, THEY DISCONTINUE IT                     '
  DC  X'FE'
ML00655  EQU   *
  DC  CL75'IT THE SHOE FITS, IT''S UGLY                           '
  DC  X'FE'
ML00656  EQU   *
  DC  CL75'1. IF YOU LIKE IT, THEY DON''T HAVE IT IN YOUR SIZE    '
  DC  CL75'2. IF YOU LIKE IT AND IT''S IN YOUR SIZE, IT DOESN''T  '
  DC  CL75'   FIT ANYWAY                                          '
  DC  CL75'3. IF YOU LIKE IT AND IT FITS, YOU CAN''T AFFORD IT    '
  DC  CL75'4. IF YOU LIKE IT, IT FITS AND YOU CAN AFFORD IT, IT   '
  DC  CL75'   FALLS APART THE FIRST TIME YOU WEAR IT              '
  DC  X'FE'
ML00657  EQU   *
  DC  CL75'THE ONE YOU WANT IS NEVER THE ONE ON SALE              '
  DC  X'FE'
ML00658  EQU   *
  DC  CL75'ANYTHING LABELED "NEW" AND/OR "IMPROVED" ISN''T        '
  DC  X'FE'
ML00659  EQU   *
  DC  CL75'THE LABEL "NEW" AND/OR "IMPROVED" MEANS THE PRICE WENT UP'
  DC  X'FE'
ML00660  EQU   *
  DC  CL75'THE LABEL "ALL NEW," "COMPLETELY NEW" OR "GREAT NEWS"  '
  DC  CL75'MEANS THE PRICE WENT WAY WAY UP                        '
  DC  X'FE'
ML00661  EQU   *
  DC  CL75'IF AN ITEM IS ADVERTISED AS "UNDER $50," YOU CAN BET   '
  DC  CL75'IT''S NOT $19.95                                       '
  DC  X'FE'
ML00662  EQU   *
  DC  CL75'ACF2 IS A FOUR LETTER WORD                             '
  DC  X'FE'
ML00663  EQU   *
  DC  CL75'IF ONLY ONE PRICE CAN BE OBTAINED FOR ANY QUOTATION,   '
  DC  CL75'THE PRICE WILL BE UNREASONABLE                         '
  DC  X'FE'
ML00664  EQU   *
  DC  CL75'A 60-DAY WARRANTY GUARANTEES THAT THE PRODUCT WILL     '
  DC  CL75'SELF-DESTRUCT ON THE 61ST DAY                          '
  DC  X'FE'
ML00665  EQU   *
  DC  CL75'THE "CONSUMER REPORT" ON THE ITEM WILL COME OUT A WEEK '
  DC  CL75'AFTER YOU''VE MADE YOUR PURCHASE:                      '
  DC  CL75'                                                       '
  DC  CL75'  1. THE ONE YOU BOUGHT WILL BE RATED "UNACCEPTABLE"   '
  DC  CL75'  2. THE ONE YOU ALMOST BOUGHT WILL BE RATED "BEST BUY"'
  DC  X'FE'
ML00666  EQU   *
  DC  CL75'IF YOU DON''T WRITE TO COMPLAIN, YOU''LL NEVER RECEIVE '
  DC  CL75'YOUR ORDER.                                            '
  DC  CL75'IF YOU DO WRITE, YOU''LL RECEIVE THE MERCHANDISE BEFORE'
  DC  CL75'YOUR ANGRY LETTER REACHES ITS DESTINATION              '
  DC  X'FE'
ML00667  EQU   *
  DC  CL75'THE MOST IMPORTANT ITEM IN AN ORDER WILL NO LONGER     '
  DC  CL75'BE AVAILABLE                                           '
  DC  X'FE'
ML00668  EQU   *
  DC  CL75'DURING THE TIME AN ITEM IS ON BACK-ORDER, IT WILL BE   '
  DC  CL75'AVAILABLE CHEAPER AND QUICKER FROM MANY OTHER SOURCES  '
  DC  X'FE'
ML00669  EQU   *
  DC  CL75'PEOPLE WILL BUY ANTHING THAT''S ONE TO A CUSTOMER      '
  DC  X'FE'
ML00670  EQU   *
  DC  CL75'SECURITY ISN''T                                        '
  DC  X'FE'
ML00671  EQU   *
  DC  CL75'MANAGEMENT CAN''T                                      '
  DC  X'FE'
ML00672  EQU   *
  DC  CL75'SALE PROMOTIONS DON''T                                 '
  DC  X'FE'
ML00673  EQU   *
  DC  CL75'CONSUMER ASSISTANCE DOESN''T                           '
  DC  X'FE'
ML00674  EQU   *
  DC  CL75'WORKERS WON''T                                         '
  DC  X'FE'
ML00675  EQU   *
  DC  CL75'CLEANLINESS IS NEXT TO IMPOSSIBLE                      '
  DC  X'FE'
ML00676  EQU   *
  DC  CL75'MULTIPLE-FUNCTION GADGETS WILL NOT PERFORM ANY         '
  DC  CL75'FUNCTION ADEQUATELY                                    '
  DC  X'FE'
ML00677  EQU   *
  DC  CL75'THE MORE EXPENSIVE THE GADGET, THE LESS OFTEN YOU      '
  DC  CL75'WILL USE IT                                            '
  DC  X'FE'
ML00678  EQU   *
  DC  CL75'THE SIMPLER THE INSTRUCTION (E.G. "PRESS HERE"), THE   '
  DC  CL75'MORE DIFFICULT IT WILL BE TO OPEN THE PACKAGE          '
  DC  X'FE'
ML00679  EQU   *
  DC  CL75'IN A FAMILY RECIPE YOU JUST DISCOVERED IN AN OLD BOOK, '
  DC  CL75'THE MOST VITAL MEASUREMENT WILL BE ILLEGIBLE           '
  DC  X'FE'
ML00680  EQU   *
  DC  CL75'ONCE A DISH IS FOULED UP. ANYTHING ADDED TO SAVE IT    '
  DC  CL75'ONLY MAKES IT WORSE                                    '
  DC  X'FE'
ML00681  EQU   *
  DC  CL75'YOU ARE ALWAYS COMPLIMENTED ON THE ITEM WHICH TOOK THE '
  DC  CL75'LEAST EFFORT TO PREPARE                                '
  DC  CL75'                                                       '
  DC  CL75'EXAMPLE:                                               '
  DC  CL75'                                                       '
  DC  CL75' IF YOU MAKE "DUCK A L''ORANGE" YOU WILL BE            '
  DC  CL75' COMPLIMENTED ON THE BAKED POTATO.                     '
  DC  X'FE'
ML00682  EQU   *
  DC  CL75'THE ONE INGREDIENT YOU MADE A SPECIAL TRIP TO THE STORE'
  DC  CL75'TO GET WILL BE THE ONE THING YOUR GUEST IS ALLERGIC TO '
  DC  X'FE'
ML00683  EQU   *
  DC  CL75'THE MORE TIME AND ENERGY YOU PUT INTO PREPARING A MEAL '
  DC  CL75'THE GREATER THE CHANCE YOU GUESTS WILL SPEND THE ENTIRE'
  DC  CL75'MEAL DISCUSSING OTHER MEALS THEY HAVE HAD              '
  DC  X'FE'
ML00684  EQU   *
  DC  CL75'SOUFFLES RISE AND CREAM WHIPS ONLY FOR THE FAMILY AND  '
  DC  CL75'FOR GUESTS YOU DIDN''T REALLY WANT TO INVITE ANYWAY    '
  DC  X'FE'
ML00685  EQU   *
  DC  CL75'THE ROTTEN EGG WILL BE THE ONE YOU BREAK INTO THE      '
  DC  CL75'CAKE BATTER                                            '
  DC  X'FE'
ML00686  EQU   *
  DC  CL75'ANY COOKING UTENSIL PLACED IN THE DISHWASHER WILL BE   '
  DC  CL75'NEEDED IMMEDIATELY THEREAFTER FOR SOMETHING ELSE       '
  DC  X'FE'
ML00687  EQU   *
  DC  CL75'ANY MEASURING UTENSIL USED FOR LIQUID INGREDIENTS WILL '
  DC  CL75'BE NEEDED IMMEDIATELY THEREAFTER FOR DRY INGREDIENTS   '
  DC  X'FE'
ML00688  EQU   *
  DC  CL75'TIME SPENT CONSUMING A MEAL IS IN INVERSE PROPORTION   '
  DC  CL75'TO TIME SPENT PREPARING IT                             '
  DC  X'FE'
ML00689  EQU   *
  DC  CL75'WHATEVER IT IS, SOMEBODY WILL HAVE HAD IT FOR LUNCH    '
  DC  X'FE'
ML00690  EQU   *
  DC  CL75'IF YOU''RE WONDERING IF YOU TOOK THE MEAT OUT TO       '
  DC  CL75'THAW, YOU DIDN''T                                      '
  DC  X'FE'
ML00691  EQU   *
  DC  CL75'IF YOU''RE WONDERING IF YOU LEFT THE COFFEE POT        '
  DC  CL75'PLUGGED IN, YOU DID                                    '
  DC  X'FE'
ML00692  EQU   *
  DC  CL75'IF YOU''RE WONDERING IF YOU NEED TO STOP AND PICK UP  '
  DC  CL75'BREAD AND EGGS ON THE WAY HOME, YOU DO                 '
  DC  X'FE'
ML00693  EQU   *
  DC  CL75'IF YOU''RE WOUNDERING IF YOU HAVE ENOUGH MONEY TO TAKE '
  DC  CL75'THE FAMILY OUT TO EAT TONIGHT, YOU DON''T              '
  DC  X'FE'
ML00694  EQU   *
  DC  CL75'THE SPOT YOU ARE SCRUBBING ON GLASSWARE IS ALWAYS ON   '
  DC  CL75'THE OTHER SIDE                                         '
  DC  X'FE'
ML00695  EQU   *
  DC  CL75'WASHING MACHINES ONLY BREAK DOWN DURING THE WASH CYCLE '
  DC  X'FE'
ML00696  EQU   *
  DC  CL75'ALL BREAK DOWNS OCCUR ON THE PLUMBER''S DAY OFF        '
  DC  X'FE'
ML00697  EQU   *
  DC  CL75'COST OF REPAIR CAN BE DETERMINED BY MULTIPLYING THE    '
  DC  CL75'COST OF YOUR NEW COAT BY 1.75, OR BY MULTIPLYING THE   '
  DC  CL75'COST OF A NEW WASHER BY .75                            '
  DC  X'FE'
ML00698  EQU   *
  DC  CL75'THERE IS ALWAYS MORE DIRTY LAUNDRY THEN CLEAN LAUNDRY  '
  DC  X'FE'
ML00699  EQU   *
  DC  CL75'IF IT''S CLEAN, IT ISN''T LAUNDRY                      '
  DC  X'FE'
ML00700  EQU   *
  DC  CL75'A CHILD WILL NOT SPILL ON A DIRTY FLOOR                '
  DC  X'FE'
ML00701  EQU   *
  DC  CL75'AN UNBREAKABLE TOY IS USEFUL FOR BREAKING OTHER TOYS   '
  DC  X'FE'
ML00702  EQU   *
  DC  CL75'ANY CHILD WHO CHATTERS NON-STOP AT HOME WILL ADAMANTLY '
  DC  CL75'REFUSE TO UTTER A WORD WHEN REQUESTED TO DEMONSTRATE   '
  DC  CL75'FOR AN AUDIENCE'
  DC  X'FE'
ML00703  EQU   *
  DC  CL75'A SHY, INTROVERTED CHILD WILL CHOOSE A CROWDED PUBLIC  '
  DC  CL75'AREA TO LOUDLY DEMONSTRATE NEW ACQUIRED VOCABULARY    '
  DC  X'FE'
ML00704  EQU   *
  DC  CL75'THE PROBABLILITY OF A CAT EATING ITS DINNER HAS        '
  DC  CL75'ABSOLUTELY NOTHING TO DO WITH THE PRICE OF THE FOOD    '
  DC  CL75'PLACED BEFORE IT'
  DC  X'FE'
ML00705  EQU   *
  DC  CL75'THE PROBABILITY THAT A HOUSEHOLD PET WILL RAISE A FUSS '
  DC  CL75'TO GO IN OR OUT IS DIRECTLY PROPORTIONAL TO THE NUMBER '
  DC  CL75'AND IMPORTANCE OF YOUR DINNER GUESTS'
  DC  X'FE'
ML00706  EQU   *
  DC  CL75'THE STOMACH EXPANDS TO ACCOMMODATE THE AMOUNT OF       '
  DC  CL75'JUNK FOOD AVAILABLE                                    '
  DC  X'FE'
ML00707  EQU   *
  DC  CL75'IF YOU BUY BANANAS OR AVOCADOS BEFORE THEY ARE RIPE,   '
  DC  CL75'THERE WON''T BE ANY LEFT BY THE TIME THEY ARE RIPE. IF '
  DC  CL75'YOU BUY THEM RIPE, THEY ROT BEFORE THEY ARE EATEN     '
  DC  X'FE'
ML00708  EQU   *
  DC  CL75'HOW LONG A MINUTE IS DEPENDS ON WHICH SIDE OF THE      '
  DC  CL75'BATHROOM DOOR YOU''RE ON                               '
  DC  X'FE'
ML00709  EQU   *
  DC  CL75'THE LIFE EXPECTANCY OF A HOUSE PLANT VARIES INVERSELY  '
  DC  CL75'WITH ITS PRICE AND DIRECTLY WITH ITS UGLINESS          '
  DC  X'FE'
ML00710  EQU   *
  DC  CL75'IF YOU HAVE WATCHED A TV SERIES ONLY ONCE, AND YOU WATCH'
  DC  CL75'IT AGAIN, IT WILL BE A RERUN OF THE SAME EPISODE       '
  DC  X'FE'
ML00711  EQU   *
  DC  CL75'IF THERE ARE ONLY 2 SHOWS WORTH WATCHING, THEY WILL BE '
  DC  CL75'ON TOGETHER                                            '
  DC  X'FE'
ML00712  EQU   *
  DC  CL75'THE ONLY NEW TV SHOW WORTH WATCHING WILL BE CANCELLED  '
  DC  X'FE'
ML00713  EQU   *
  DC  CL75'THE TV SHOW YOU''VE BEEN LOOKING FORWARD TO ALL WEEK   '
  DC  CL75'WILL BE PREEMPTED                                      '
  DC  X'FE'
ML00714  EQU   *
  DC  CL75'MOST PEOPLE DESERVE EACH OTHER                         '
  DC  X'FE'
ML00715  EQU   *
  DC  CL75'POSSESSIONS INCREASE TO FILL THE SPACE AVAILABLE FOR   '
  DC  CL75'THEIR STORAGE                                          '
  DC  X'FE'
ML00716  EQU   *
  DC  CL75'WHEN YOU DIAL A WRONG NUMBER, YOU NEVER GET A BUSY SIGNAL'
  DC  X'FE'
ML00717  EQU   *
  DC  CL75'1. THE TELEPHONE WILL RING WHEN YOU ARE OUTSIDE THE    '
  DC  CL75'   DOOR, FUMBLING FOR YOUR KEYS.                       '
  DC  CL75'                                                       '
  DC  CL75'2. YOU WILL REACH IT JUST IN TIME TO HEAR THE CLICK    '
  DC  CL75'   OF THE CALLER HANGING UP.                           '
  DC  X'FE'
ML00718  EQU   *
  DC  CL75'PEOPLE TO WHOM YOU ARE ATTRACTED INVARIABLY THING YOU  '
  DC  CL75'REMIND THEM OF SOMEONE ELSE                            '
  DC  X'FE'
ML00719  EQU   *
  DC  CL75'THE ONE WHO SNORES WILL FALL ASLEEP FIRST              '
  DC  X'FE'
ML00720  EQU   *
  DC  CL75'NEVER GET EXCITED ABOUT A BLIND DATE BECAUSE OF HOW    '
  DC  CL75'IT SOUNDS OVER THE PHONE                               '
  DC  X'FE'
ML00721  EQU   *
  DC  CL75'THE LOVE LETTER YOU FINALLY GOT THE COURAGE TO SEND    '
  DC  CL75'WILL BE DELAYED IN THE MAIL LONG ENOUGH FOR YOU TO     '
  DC  CL75'MAKE A FOOL OF YOURSELF IN PERSON                      '
  DC  X'FE'
ML00722  EQU   *
  DC  CL75'OTHER PEOPLE''S ROMANTIC GESTURES SEEM NOVEL AND EXCITING'
  DC  CL75'                                                       '
  DC  CL75'YOUR OWN ROMANTIC GESTURES SEEM FOOOLISH AND CLUMSY   '
  DC  X'FE'
ML00723  EQU   *
  DC  CL75'THE LENGTH OF A MARRIAGE IS INVERSELY PROPORTIONAL     '
  DC  CL75'TO THE AMOUNT SPENT ON THE WEDDING                     '
  DC  X'FE'
ML00724  EQU   *
  DC  CL75'   ALL PROBABILITIES ARE 50%. EITHER A THING WILL       '
  DC  CL75'   HAPPEN OR IT WON''T.                                 '
  DC  CL75'                                                        '
  DC  CL75'   THIS IS ESPECIALLY TRUE WHEN DEALING WITH WOMEN      '
  DC  CL75'                                                        '
  DC  CL75'   LIKELIHOODS, HOWEVER, ARE 90% AGAINST YOU            '
  DC  X'FE'
ML00725  EQU   *
  DC  CL75'SOW YOUR WILD OATS ON SATURDAY NIGHT - THEN ON         '
  DC  CL75'SUNDAY PRAY FOR CROP FAILURE                           '
  DC  X'FE'
ML00726  EQU   *
  DC  CL75'THE PROBABLILITY OF MEETING SOMEONE YOU KNOW INCREASES '
  DC  CL75'WHEN YOU ARE WITH SOMEONE YOU DON''T WANT TO BE SEEN WITH'
  DC  X'FE'
ML00727  EQU   *
  DC  CL75'IF YOU HELP A FRIEND IN NEED, HE IS SURE TO REMEMBER   '
  DC  CL75'YOU - THE NEXT TIME HE''S IN NEED                      '
  DC  X'FE'
ML00728  EQU   *
  DC  CL75'VIRTUE IS ITS OWN PUNISHMENT                           '
  DC  X'FE'
ML00729  EQU   *
  DC  CL75'IF YOU DO SOMETHING RIGHT ONCE, SOMEONE WILL ASK       '
  DC  CL75'YOU TO DO IT AGAIN                                     '
  DC  X'FE'
ML00730  EQU   *
  DC  CL75'THE ONE DAY YOU''D SELL YOUR SOUL FOR SOMETHING,       '
  DC  CL75'SOULS ARE A GLUT                                       '
  DC  X'FE'
ML00731  EQU   *
  DC  CL75'THE SCRATCH ON THE RECORD IS ALWAYS THROUGH THE SONG   '
  DC  CL75'YOU LIKE MOST                                          '
  DC  X'FE'
ML00732  EQU   *
  DC  CL75'SUPERIORITY IS RECESSIVE                               '
  DC  X'FE'
ML00733  EQU   *
  DC  CL75'FORGIVE AND REMEMBER                                   '
  DC  X'FE'
ML00734  EQU   *
  DC  CL75'ANYTHING GOOD IN LIFE IS EITHER ILLEGAL, IMMORAL       '
  DC  CL75'OR FATTENING                                           '
  DC  X'FE'
ML00735  EQU   *
  DC  CL75'ANYTHING GOOD IN LIFE EITHER CAUSES CANCER IN          '
  DC  CL75'LABORATORY MICE OR IS TAXED BEYOND REALITY             '
  DC  X'FE'
ML00736  EQU   *
  DC  CL75'TO ERR IS HUMAN -- TO BLAME IT ON SOMEONE ELSE IS      '
  DC  CL75'EVEN MORE HUMAN                                        '
  DC  X'FE'
ML00737  EQU   *
  DC  CL75'WHATEVER HAPPENS TO YOU, IT WILL PREVIOUSLY HAVE       '
  DC  CL75'HAPPENED TO EVERYONE YOU KNOW ONLY MORE SO             '
  DC  X'FE'
ML00738  EQU   *
  DC  CL75'HE WHO LAUGHS LAST -- PROBABLY DIDN''T GET THE JOKE    '
  DC  X'FE'
ML00739  EQU   *
  DC  CL75'DON''T WORRY OVER WHAT OTHER PEOPLE ARE THINKING ABOUT '
  DC  CL75'YOU. THEY''RE TOO BUSY WORRYING OVER WHAT YOU ARE     '
  DC  CL75'THINKING ABOUT THEM.'
  DC  X'FE'
ML00740  EQU   *
  DC  CL75'IN A BUREAUCRATIC HIERARCHY, THE HIGHER UP THE         '
  DC  CL75'ORGANIZATION THE LESS PEOPLE APPRECIATE MURPHY''S LAW, '
  DC  CL75'THE PETER PRINCIPLE, ETC.                              '
  DC  X'FE'
ML00741  EQU   *
  DC  CL75'LAW EXPANDS IN PROPORTION TO THE RESOURCES AVAILABLE   '
  DC  CL75'FOR ITS ENFORCEMENT                                    '
  DC  X'FE'
ML00742  EQU   *
  DC  CL75'BAD LAW IS MORE LIKELY TO BE SUPPLEMENTED THAN REPEALED'
  DC  X'FE'
ML00743  EQU   *
  DC  CL75'THERE ARE SOME THINGS WHICH ARE IMPOSSIBLE TO KNOW -   '
  DC  CL75'BUT IT IS IMPOSSIBLE TO KNOW THESE THINGS              '
  DC  X'FE'
ML00744  EQU   *
  DC  CL75'WHEN WE TRY TO PICK OUT ANYTHING BY ITSELF WE FIND     '
  DC  CL75'IT HITCHED TO EVERYTHING ELSE IN THE UNIVERSE          '
  DC  X'FE'
ML00745  EQU   *
  DC  CL75'IF ONE VIEWS HIS PROBLEM CLOSELY ENOUGH HE WILL        '
  DC  CL75'RECOGINIZE HIMSELF AS PART OF THE PROBLEM              '
  DC  X'FE'
ML00746  EQU   *
  DC  CL75'ANYTHING MAY BE DIVIDED INTO AS MANY PARTS AS YOU PLEASE'
  DC  X'FE'
ML00747  EQU   *
 DC CL75'EVERYTHING MAY BE DIVIDED INTO AS MANY PARTS AS YOU PLEASE'
 DC X'FE'
ML00748  EQU   *
  DC  CL75'IF SEVERAL THINGS THAT COULD HAVE GONE WRONG HAVE NOT  '
  DC  CL75'GONE WRONG, IT WOULD HAVE BEEN ULTIMATELY BENEFICIAL   '
  DC  CL75'FOR THEM TO HAVE GONE WRONG                            '
  DC  X'FE'
ML00749  EQU   *
  DC  CL75'THE QUICKEST WAY TO EXPERIMENT WITH ACUPUNCTURE IS TO  '
  DC  CL75'TRY ON A NEW SHIRT                                     '
  DC  X'FE'
ML00750  EQU   *
  DC  CL75'ABSOLUTELY NOTHING IN THE WORLD IS FRIENDLIER THAN     '
  DC  CL75'A WET DOG                                              '
  DC  X'FE'
ML00751  EQU   *
  DC  CL75'THE SEVERITY OF AN ITCH IS INVERSELY PROPORTIONAL      '
  DC  CL75'TO THE REACH                                           '
  DC  X'FE'
ML00752  EQU   *
  DC  CL75'A HUG IS THE PERFECT GIFT - ONE SIZE FITS ALL, AND     '
  DC  CL75'NOBODY MINDS IF YOU EXCHANGE IT                        '
  DC  X'FE'
ML00753  EQU   *
  DC  CL75'THE ONLY GAME THAT CAN''T BE FIXED IS PEEK-A-BOO       '
  DC  X'FE'
ML00754  EQU   *
  DC  CL75'IGNORANCE SHOULD BE PAINFUL                            '
  DC  X'FE'
ML00755  EQU   *
  DC  CL75'THE FIRST INSURANCE AGENT WAS DAVID -                  '
  DC  CL75'HE GAVE GOLIATH A PIECE OF THE ROCK                    '
  DC  X'FE'
ML00756  EQU   *
  DC  CL75'KING ARTHUR RAN THE FIRST KNIGHT CLUB                  '
  DC  X'FE'
ML00757  EQU   *
  DC  CL75'MAGELLAN WAS THE FIRST STRAIT MAN                      '
  DC  X'FE'
ML00758  EQU   *
  DC  CL75'IF YOU SMILE WHEN EVERYTHING GOES WRONG, YOU ARE       '
  DC  CL75'EITHER A NITWIT OR A REPARIMAN                         '
  DC  X'FE'
ML00759  EQU   *
  DC  CL75'IF IT WEREN''T FOR THE OPINION POLLS WE''D NEVER KNOW  '
  DC  CL75'WHAT PEOPLE ARE UNDECIDED ABOUT                        '
  DC  X'FE'
ML00760  EQU   *
  DC  CL75'NO NEWS IS... IMPOSSIBLE                               '
  DC  X'FE'
ML00761  EQU   *
  DC  CL75'LAUGH AND THE WORLD LAUGHS WITH YOU. CRY AND ...       '
  DC  CL75'YOU HAVE TO BLOW YOUR NOSE                             '
  DC  X'FE'
ML00762  EQU   *
  DC  CL75'A PENNY SAVED IS ...NOT MUCH                           '
  DC  X'FE'
ML00763  EQU   *
  DC  CL75'HE WHO MARRIES FOR MONEY...BETTER BE NICE TO HIS WIFE  '
  DC  X'FE'
ML00764  EQU   *
  DC  CL75'IT''S ALWAYS DARKEST BEFORE ...DAYLIGHT SAVING TIME    '
  DC  X'FE'
ML00765  EQU   *
  DC  CL75'IF AT FIRST YOU DON''T SUCCEED...GET NEW BATTERIES     '
  DC  X'FE'
ML00766  EQU   *
  DC  CL75'WHEN THE BLIND LEADETH THE BLIND...GET OUT OF THEIR WAY'
  DC  X'FE'
ML00767  EQU   *
  DC  CL75'LIFE IS LIKE AN ICE-CREAM CONE: YOU HAVE TO LEARN TO   '
  DC  CL75'LICK IT                                                '
  DC  X'FE'
ML00768  EQU   *
  DC  CL75'ONE PLACE WHERE YOU''RE SURE TO FIND THE PERFECT       '
  DC  CL75'DRIVER IS IN THE BACK SEAT                             '
  DC  X'FE'
ML00769  EQU   *
  DC  CL75'NOTHING IS INDESTRUCTIBLE, WITH THE POSSIBLE EXCEPTION '
  DC  CL75'OF DISCOUNT-PRICED FRUITCAKES                          '
  DC  X'FE'
ML00770  EQU   *
  DC  CL75'HOW DO THEY KNOW NO TWO SNOWFLAKES ARE ALIKE           '
  DC  X'FE'
ML00771  EQU   *
 DC  CL75'HOW DID THEY MEASURE HAIL BEFORE THE GOLF BALL WAS INVENTED'
  DC  X'FE'
ML00772  EQU   *
  DC  CL75'TO ERR IS HUMAN, TO FORGIVE IS DIVINE --               '
  DC  CL75'BUT TO FORGET IT ALTOGETHER IS HUMANE                  '
  DC  X'FE'
ML00773  EQU   *
  DC  CL75'"WATCHING A BIRDIE" IN HAND IS SAFER THAT WATCHING     '
  DC  CL75' ONE OVERHEAD                                          '
  DC  X'FE'
ML00774  EQU   *
  DC  CL75'THE LIGHT AT THE END OF THE TUNNEL CAN BE A HELLUVA    '
  DC  CL75'NUISANCE, ESPECIALLY IF YOUR''RE USING THE TUNNEL      '
  DC  CL75'AS A DARKROOM                                          '
  DC  X'FE'
ML00775  EQU   *
  DC  CL75'NEVER PLAY LEEPFROG WITH A PHOTO ENLARGER              '
  DC  X'FE'
ML00776  EQU   *
  DC  CL75'NEVER ARGUE WITH AN ARTIST                             '
  DC  X'FE'
ML00777  EQU   *
  DC  CL75'WHEN IN DOUBT, DON''T MUMBLE, OVEREXPOSE...THEN MUMBLE  '
  DC  X'FE'
ML00778  EQU   *
  DC  CL75'THE LIGHT AT THE END OF THE TUNNEL REALLY IS A TRAIN   '
  DC  X'FE'
ML00779  EQU   *
  DC  CL75'A BUDGET IS SAVING QUARTERS IN A MASON JAR FOR         '
  DC  CL75'CHRISTMAS AND SPENDING THEM BY EASTER                  '
  DC  X'FE'
ML00780  EQU   *
  DC  CL75'A BUDGET IS SPENDING $15.00 ON GAS TO DRIVE TO A       '
  DC  CL75'SHOPPING MALL TO SAVE $4.30 ON A 20 POUND TURKEY       '
  DC  X'FE'
ML00781  EQU   *
  DC  CL75'A BUDGET IS  WONDERING WHY YOU SHOULD BALANCE YOURS    '
  DC  CL75'IF THE GOVERNMENT CAN NOT BALANCE THEIRS               '
  DC  X'FE'
ML00782  EQU   *
  DC  CL75'A BUDGET IS TRYING TO FIGURE OUT HOW THE FAMILY NEXT   '
  DC  CL75'DOOR IS DOING IT                                       '
  DC  X'FE'
ML00783  EQU   *
  DC  CL75'A BUDGET IS A PLAN THAT FALLS APART WHEN THE PLUMBER   '
  DC  CL75'HAS TO MAKE AN EMERGENCY VISIT                         '
  DC  X'FE'
ML00784  EQU   *
  DC  CL75'A BUDGET IS TRYING TO MAKE $25.00 GO AS FAR TODAY AS   '
  DC  CL75'IT DID WHEN YOU WERE FIRST MARRIED                     '
  DC  X'FE'
ML00785  EQU   *
  DC  CL75'A BUDGET IS BUYING A DRESS TWO SIZES TOO SMALL BECAUSE '
  DC  CL75'IT WAS MARKED DOWN                                     '
  DC  X'FE'
ML00786  EQU   *
  DC  CL75'YOU SURE HAVE TO BORROW A LOT OF MONEY THESE DAYS TO   '
  DC  CL75'BE AN AVERAGE CONSUMER                                 '
  DC  X'FE'
ML00787  EQU   *
  DC  CL75'HE WHO DIES WITH THE MOST TOYS WINS                    '
  DC  X'FE'
ML00788  EQU   *
  DC  CL75'A FOOL AND HIS MONEY SOON GO PARTYING                  '
  DC  X'FE'
ML00789  EQU   *
  DC  CL75'IF HIS IQ WAS ANY LOWER HE''D BE A PLANT               '
  DC  X'FE'
ML00790  EQU   *
  DC  CL75'EVERYBODY IS IGNORANT, ONLY ON DIFFERENT SUBJECTS      '
  DC  X'FE'
ML00791  EQU   *
  DC  CL75'IT IS FAR BETTER TO DO NOTHING THAT TO DO              '
  DC  CL75'SOMETHING EFFICIENTLY                                  '
  DC  CL75'                        SIEZBO                         '
  DC  X'FE'
ML00792  EQU   *
  DC  CL75'THE MAN WHO HAS NO MORE PROBLEMS IS OUT OF THE GAME    '
  DC  X'FE'
ML00793  EQU   *
  DC  CL75'THE RACE GOES NOT ALWAYS TO THE SWIFT, NOR THE BATTLE  '
  DC  CL75'TO THE STRONG, BUT THAT''S THE WAY TO BET              '
  DC  X'FE'
ML00794  EQU   *
  DC  CL75'A FOOL AND HIS MONEY ARE INVITED PLACES                '
  DC  X'FE'
ML00795  EQU   *
  DC  CL75'ALL THINGS COME TO HIM WHOSE NAME IS ON A MAILING LIST '
  DC  X'FE'
ML00796  EQU   *
  DC  CL75'THE HAND THAT ROCKS THE CRADDLE USUALLY IS ATTACHED    '
  DC  CL75'TO SOMEONE WHO ISN''T GETTING ENOUGH SLEEP             '
  DC  X'FE'
ML00797  EQU   *
  DC  CL75'AFTER WINNING AN ARGUMENT WITH HIS WIFE,               '
  DC  CL75'THE WISEST THING A MAN CAN DO IS APOLOGIZE            '
  DC  X'FE'
ML00798  EQU   *
  DC  CL75'IF OPPORTUNITY CAME DISGUISED AS TEMPTATION,           '
  DC  CL75'ONE KNOCK WOULD BE ENOUGH                              '
  DC  X'FE'
ML00799  EQU   *
  DC  CL75'IF THERE WAS ANY JUSTICE IN THIS WORLD, PEOPLE WOULD   '
  DC  CL75'OCCASIONALLY BE PERMITTED TO FLY OVER PIGEONS          '
  DC  X'FE'
ML00800  EQU   *
  DC  CL75'EASY DOESN''T DO IT                                    '
  DC  X'FE'
ML00801  EQU   *
  DC  CL75'MOST PEOPLE WANT TO BE DELIVERED FROM TEMPTATION BUT   '
  DC  CL75' WOULD LIKE IT TO KEEP IN TOUCH                        '
  DC  X'FE'
ML00802  EQU   *
  DC  CL75'WHEN A DISTINGUISED SCIENTIST STATES SOMETHING IS      '
  DC  CL75'POSSIBLE, HE IS ALMOST CERTAINLY RIGHT. WHEN HE        '
  DC  CL75'STATES THAT SOMETHING IS IMPOSSIBLE, HE IS VERY        '
  DC  CL75'PROBABLY WRONG                                         '
  DC  X'FE'
ML00803  EQU   *
  DC  CL75'EARLY TO RISE AND EARLY TO BED MAKES A MALE            '
  DC  CL75'HEALTHY AND WEALTHY AND DEAD                           '
  DC  X'FE'
ML00804  EQU   *
  DC  CL75'EVERYONE GETS AWAY WITH SOMETHING.                     '
  DC  CL75'NO ONE GETS AWAY WITH EVERYTHING                       '
  DC  X'FE'
ML00805  EQU   *
  DC  CL75'REMAIN SILENT ABOUT YOUR INTENTIONS UNTIL YOU ARE SURE '
  DC  X'FE'
ML00806  EQU   *
  DC  CL75'CALM DOWN .... IT IS ONLY ONES AND ZEROS'
  DC  X'FE'
ML00807  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE COBOL.'
  DC  CL75'COBOL IS FOR WIMPY APPLICATIONS PROGRAMMERS.'
  DC  X'FE'
ML00808  EQU   *
  DC  CL75'I HAVE NOT LOST MY MIND -- '
  DC  CL75'   IT IS BACKED UP ON TAPE SOMEWHERE                '
  DC  X'FE'
ML00809  EQU   *
  DC  CL75'REAL PROGRAMMERS DO NOT DOCUMENT.'
  DC  CL75'DOCUMENTATION IS FOR SIMPS WHO CAN''T READ LISTINGS'
  DC  CL75' OR OBJECT CODE'
  DC  X'FE'
ML00810  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE SPECS -- USERS SHOULD '
  DC  CL75'CONSIDER THEMSELVES LUCKY TO GET ANY PROGRAMS AT ALL AND'
  DC  CL75'TAKE WHAT THEY GET.'
  DC  X'FE'
ML00811  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T COMMENT THEIR CODE. IF IT IS HARD'
  DC  CL75'TO WRITE, IT SHOULD BE HARD TO UNDERSTAND.'
  DC  X'FE'
ML00812  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE APPLICATIONS PROGRAMS; THEY'
  DC  CL75'PROGRAM RIGHT DOWN ON THE BARE METAL.  APPLICATION       '
  DC  CL75'PROGRAMMING IS FOR FEEBS WHO CAN''T DO SYSTEMS PROGRAMMING'
  DC  X'FE'
ML00813  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T EAT QUICHE.   IN FACT, REAL      '
  DC  CL75'PROGRAMMERS DON''T KNOW HOW TO SPELL QUICHE. THEY EAT    '
  DC  CL75'TWINKIES AND SZECHWAN FOOD.'
  DC  X'FE'
ML00814  EQU   *
  DC  CL75'REAL PROGRAMMER''S PROGRAMS NEVER WORK THE FIRST TIME. BUT'
  DC  CL75'IF YOU THROW THEM ON THE MACHINE, THEY CAN BE PATCHED INTO'
  DC  CL75'WORKING IN "ONLY A FEW" 30-HOUR DEBUGGING SESSIONS.'
  DC  X'FE'
ML00815  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN FORTRAN. FORTRAN IS FOR '
  DC  CL75'PIPE STRESS FREAKS AND CRYSTALLOGRAPHY WEENIES.'
  DC  X'FE'
ML00816  EQU   *
  DC  CL75'REAL PROGRAMMERS NEVER WORK 9 TO 5. IF ANY REAL      '
  DC  CL75'PROGRAMMERS ARE AROUND AT 9 A.M., IT''S BECAUSE THEY '
  DC  CL75'WERE UP ALL NIGHT.'
  DC  X'FE'
ML00817  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN BASIC. ACTUALLY, NO'
  DC  CL75'PROGRAMMERS WRITE IN BASIC AFTER AGE 12.'
  DC  X'FE'
ML00818  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN PL/1. PL/1 IS FOR '
  DC  CL75'PROGRAMMERS WHO CAN''T DECIDE WHETHER TO WRITE IN '
  DC  CL75'COBOL OR FORTRAN.'
  DC  X'FE'
ML00819  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T PLAY TENNIS OR ANY OTHER SPORT'
  DC  CL75'THAT REQUIRES YOU TO CHANGE CLOTHES. MOUNTAIN CLIMBING IS'
  DC  CL75'OK, AND REAL PROGRAMMERS WEAR THEIR CLIMBING BOOTS TO WORK'
  DC  CL75'IN CASE A MOUNTAIN SHOULD SUDDENLY SPRING UP IN THE MIDDLE'
  DC  CL75'OF THE MACHINE ROOM.'
  DC  X'FE'
ML00820  EQU   *
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN PASCAL, BLISS, OR ADA, OR'
  DC  CL75'ANY OF THOSE PINKO COMPUTER SCIENCE LANGUAGES. STRONG '
  DC  CL75'TYPING IS FOR PEOPLE WITH WEAK MEMORIES.'
  DC  X'FE'
ML00821  EQU   *
  DC  CL75'ON A CLEAR DISK, YOU CAN SEEK FOREVER'
  DC  X'FE'
ML00822  EQU   *
  DC  CL75'HOLLERITH GOT US INTO THIS HOLE MESS!'
  DC  X'FE'
ML00823  EQU   *
  DC  CL75'NO MAJOR PROJECT IS EVER INSTALLED ON TIME, WITHIN BUDGETS,'
  DC  CL75'WITH THE SAME STAFF THAT STARTED IT. YOURS WILL NOT BE THE'
  DC  CL75'FIRST.'
  DC  X'FE'
ML00824  EQU   *
  DC  CL75'WHEN THINGS ARE GOING WELL, SOMETHING WILL GO WRONG.'
  DC  X'FE'
ML00825  EQU   *
  DC  CL75'WHEN THINGS JUST CAN''T GET ANY WORSE, THEY WILL.'
  DC  X'FE'
ML00826  EQU   *
  DC  CL75'  WHEN THINGS APPEAR TO BE GOING BETTER YOU HAVE OVERLOOKED'
  DC  CL75'  SOMETHING.'
  DC  X'FE'
ML00827  EQU   *
  DC  CL75'IF PROJECT CONTENT IS ALLOWED TO CHANGE FREELY, THE RATE OF'
  DC  CL75'CHANGE WILL EXCEED THE RATE OF PROGRESS.'
  DC  X'FE'
ML00828  EQU   *
  DC  CL75'NO SYSTEM IS EVER COMPLETELY DEBUGGED: ATTEMPTS TO DEBUG'
  DC  CL75'A SYSTEM WILL INEVITABLY INTRODUCE NEW BUGS THAT ARE EVEN'
  DC  CL75'HARDER TO FIND.'
  DC  X'FE'
ML00829  EQU   *
  DC  CL75'A CARELESSLY PLANNED PROJECT WILL TAKE THREE TIMES    '
  DC  CL75'LONGER THAN EXPECTED; A CAREFULLY PLANNED PROJECT WILL'
  DC  CL75'TAKE ONLY TWICE AS LONG.'
  DC  X'FE'
ML00830  EQU   *
  DC  CL75'IT HAS BEEN SAID THAT THE TEN MOST FEARED WORDS IN THE '
  DC  CL75' ENGLISH LANGUAGE ARE :                                '
  DC  CL75'                                                       '
  DC  CL75'   I''M FROM THE FEDERAL GOVERNMENT AND I''M HERE TO HELP'
  DC  X'FE'
ML00831  EQU   *
  DC  CL75'I OWE, I OWE                                           '
  DC  CL75'SO IT''S OFF TO WORK I GO                              '
  DC  X'FE'
ML00832  EQU   *
  DC  CL75'WHEN A DISTINGUISED, BUT ELDERLY, SCIENTIST SAYS THAT  '
  DC  CL75'SOMETHING IS IMPOSSIBLE, HE IS PROBABLY WRONG          '
  DC  X'FE'
ML00833  EQU   *
  DC  CL75'SUPPORT YOUR LOCAL BLOODHOUND, GET LOST !              '
  DC  X'FE'
ML00834  EQU   *
  DC  CL75'WHEN I FLY, I THINK ABOUT ONLY THREE THINGS --         '
  DC  CL75'     FAITH, HOPE AND GRAVITY                           '
  DC  X'FE'
ML00835  EQU   *
  DC  CL75'THE THREE STAGES OF BEING SICK: ILL, PILL, BILL        '
  DC  X'FE'
ML00836  EQU   *
  DC  CL75'THERE ARE THREE WAYS TO BECOME A MILLIONAIRE THESE     '
  DC  CL75'DAYS: INHERIT IT, EARN IT, SUE.                        '
  DC  X'FE'
ML00837  EQU   *
  DC  CL75'DON''T TRY TO TEACH A PIG TO SING .                    '
  DC  CL75'IT WON''T WORK, AND IT ANNOYS THE PIG .                '
  DC  X'FE'
ML00838  EQU   *
  DC  CL75'  ONLY FOUR THINGS IN LIFE ARE CERTAIN:                '
  DC  CL75'    1.  DEATH                                          '
  DC  CL75'    2.  TAXES                                          '
  DC  CL75'    3.  IBM WILL DOMINATE IN MAINFRAMES                '
  DC  CL75'    4.  IBM WILL ONCE AGAIN JACK UP SOFTWARE PRICES    '
  DC  X'FE'
ML00839  EQU   *
  DC  CL75' IT''S MORE BLESSED TO GIVE THAN TO RECEIVE --         '
  DC  CL75'       ESPECIALLY KITTENS                              '
  DC  X'FE'
ML00840  EQU   *
  DC  CL75'ALL THE WORLD LOVES A LOVER - EXCEPT THOSE WHO ARE     '
  DC  CL75' WAITING TO USE THE PHONE                              '
  DC  X'FE'
ML00841  EQU   *
  DC  CL75'YOU CAN''T FOOL ALL THE PEOPLE ALL THE TIME.           '
  DC  CL75' HIGHWAY-INTERCAHNGE SIGNS COME PRETTY CLOSE, HOWEVER. '
  DC  X'FE'
ML00842  EQU   *
  DC  CL75'TALK IS CHEAP - UNLESS YOU HIRE A LAWYER               '
  DC  X'FE'
ML00843  EQU   *
  DC  CL75'IN SPITE OF THE COST OF LIVING, IT''S STILL POPULAR    '
  DC  X'FE'
ML00844  EQU   *
  DC  CL75'WINNING ISN''T EVERYTHING, BUT IT BEATS ANYTHING THAT  '
  DC  CL75' COMES IN SECOND                                       '
  DC  X'FE'
ML00845  EQU   *
  DC  CL75' IN THE APPROVAL CYCLE FOR AN ARTICLE:                 '
  DC  CL75'  THE FIRST  LEVEL OF MANAGEMENT WILL ADD A FACT       '
  DC  CL75'  THE SECOND LEVEL OF MANAGEMENT WILL EDIT THAT FACT   '
  DC  CL75'  THE THIRD  LEVEL OF MANAGEMENT WILL REMOVE THAT FACT '
  DC  X'FE'
ML00846  EQU   *
  DC  CL75'AS SOON AS YOU SIT DOWN TO A HOT CUP OF COFFEE, YOUR   '
  DC  CL75'BOSS WILL ASK YOU TO DO SOMETHING THAT WILL LAST       '
  DC  CL75'UNTIL THE COFFEE IS COLD                               '
  DC  X'FE'
ML00847  EQU   *
  DC  CL75'A CLOSED MOUTH GATHERS NO FOOD.'
  DC  X'FE'
ML00848  EQU   *
  DC  CL75' MURPHY''S AXIOM OF PREVENTITIVE DIVORCE:              '
  DC  CL75'  AN OUNCE OF "I DON''T" IS WORTH                      '
  DC  CL75'   MEGATONS OF "I WISH I DIDN''T"                      '
  DC  X'FE'
ML00849  EQU   *
  DC  CL75' MARRIAGE IS LIKE QUICKSAND:                           '
  DC  CL75'   IF YOU NEVER GET INTO IT                            '
  DC  CL75'   YOU NEVER HAVE TO WORRY ABOUT                       '
  DC  CL75'   GETTING OUT OF IT                                   '
  DC  X'FE'
ML00850  EQU   *     06/87
  DC  CL75'IF YOU''RE NOT THE LEAD DOG THE SCENERY NEVER CHANGES  '
  DC  X'FE'
ML00851  EQU   *     06/87
  DC  CL75'BIRDS OF A FEATHER FLOCK TO A NEWLY WASHED CAR         '
  DC  X'FE'
ML00852  EQU   *     06/87
  DC  CL75'A WORD TO THE WISE IS OFTEN ENOUGH TO START AN ARGUEMNT'
  DC  X'FE'
ML00853  EQU   *     06/87
  DC  CL75'A BIRD IN THE HAND IS BAD TABLE MANNERS                '
  DC  X'FE'
ML00854  EQU   *     06/87
  DC  CL75'THOSE WHO CAN, DO. THOSE WHO CAN''T, WRITE THE INSTRUCTION'
  DC  X'FE'
ML00855  EQU   *     06/87
  DC  CL75'NEVER SERVE MEALS ON TIME; THE STARVING EAT ANYTHING   '
  DC  X'FE'
ML00856  EQU   *     06/87
  DC  CL75'THE TIME IT TAKES TO FIND SOMETHING IS DIRECTLY        '
  DC  CL75'PROPORTIONAL TO ITS IMPORTANCE                         '
  DC  X'FE'
ML00857  EQU   *     06/87
  DC  CL75'ANYONE WHO EVEN HAS TO THINK ABOUT THE COST HAD        '
  DC  CL75'BETTER NOT GET ONE                                     '
  DC  X'FE'
ML00858  EQU   *     06/87
  DC  CL75'THE GOVERNMENT''S BIGGEST PROBLEM:                    '
  DC  CL75'     TRYING TO GET MORE MONEY FROM THE                '
  DC  CL75'     TAXPAYER WITHOUT ANGERING THE VOTER              '
  DC  X'FE'
ML00859  EQU   *     07/87
  DC  CL75' ON THE OTHER HAND, GIVE SOME PEOPLE ENOUGH ROPE AND   '
  DC  CL75' THEY''LL HANG YOU                                     '
  DC  X'FE'
ML00860  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE COBOL.'
  DC  CL75'COBOL IS FOR WIMPY APPLICATIONS PROGRAMMERS.'
  DC  X'FE'
ML00861  EQU   *     07/87
  DC  CL75'I HAVE NOT LOST MY MIND -- IT IS BACKED UP ON TAPE SOMEWHEREX
               .'
  DC  X'FE'
ML00862  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DO NOT DOCUMENT.'
  DC  CL75'DOCUMENTATION IS FOR SIMPS WHO CAN''T READ LISTINGS OR OBJECX
               T CODE.'
  DC  X'FE'
ML00863  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE SPECS -- USERS SHOULD '
  DC  CL75'CONSIDER THEMSELVES LUCKY TO GET ANY PROGRAMS AT ALL AND'
  DC  CL75'TAKE WHAT THEY GET.'
  DC  X'FE'
ML00864  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T COMMENT THEIR CODE. IF IT IS HARD'
  DC  CL75'TO WRITE, IT SHOULD BE HARD TO UNDERSTAND.'
  DC  X'FE'
ML00865  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE APLLICATIONS PROGRAMS; THEY'
  DC  CL75'PROGRAM RIGHT DOWN ON THE BARE METAL.  APPLICATION       '
  DC  CL75'PROGRAMMING IS FOR FEEBS WHO CAN''T DO SYSTEMS PROGRAMMING'
  DC  X'FE'
ML00866  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T EAT QUICHE.   IN FACT, REAL      '
  DC  CL75'PROGRAMMERS DON''T KNOW HOW TO SPELL QUICHE. THEY EAT    '
  DC  CL75'TWINKIES AND SZECHWAN FOOD.'
  DC  X'FE'
ML00867  EQU   *     07/87
  DC  CL75'REAL PROGRAMMER''S PROGRAMS NEVER WORK THE FIRST TIME. BUT'
  DC  CL75'IF YOU THROW THEM ON THE MACHINE, THEY CAN BE PATCHED INTO'
  DC  CL75'WORKING IN "ONLY A FEW" 30-HOUR DEBUGGING SESSIONS.'
  DC  X'FE'
ML00868  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN FORTRAN. FORTRAN IS FOR '
  DC  CL75'PIPE STRESS FREAKS AND CRYSTALLOGRAPHY WEENIES.'
  DC  X'FE'
ML00869  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS NEVER WORK 9 TO 5. IF ANY REAL      '
  DC  CL75'PROGRAMMERS ARE AROUND AT 9 A.M., IT''S BECAUSE THEY '
  DC  CL75'WERE UP ALL NIGHT.'
  DC  X'FE'
ML00870  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN BASIC. ACTUALLY, NO'
  DC  CL75'PROGRAMMERS WRITE IN BASIC AFTER AGE 12.'
  DC  X'FE'
ML00871  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN PL/1. PL/1 IS FOR '
  DC  CL75'PROGRAMMERS WHO CAN''T DECIDE WHETHER TO WRITE IN '
  DC  CL75'COBOL OR FORTRAN.'
  DC  X'FE'
ML00872  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T PLAY TENNIS OR ANY OTHER SPORT'
  DC  CL75'THAT REQUIRES YOU TO CHANGE CLOTHES. MOUNTAIN CLIMBING IS'
  DC  CL75'OK, AND REAL PROGRAMMERS WEAR THEIR CLIMBING BOOTS TO WORK'
  DC  CL75'IN CASE A MOUNTAIN SHOULD SUDDENLY SPRING UP IN THE MIDDLE'
  DC  CL75'OF THE MACHINE ROOM.'
  DC  X'FE'
ML00873  EQU   *     07/87
  DC  CL75'REAL PROGRAMMERS DON''T WRITE IN PASCAL, BLISS, OR ADA, OR'
  DC  CL75'ANY OF THOSE PINKO COMPUTER SCIENCE LANGUAGES. STRONG '
  DC  CL75'TYPING IS FOR PEOPLE WITH WEAK MEMORIES.'
  DC  X'FE'
ML00874  EQU   *     07/87
  DC  CL75'ON A CLEAR DISK, YOU CAN SEEK FOREVER'
  DC  X'FE'
ML00875  EQU   *     07/87
  DC  CL75'HOLLERITH GOT US INTO THIS HOLE MESS!'
  DC  X'FE'
ML00876  EQU   *     07/87
  DC  CL75'NO MAJOR PROJECT IS EVER INSTALLED ON TIME, WITHIN BUDGETS,'
  DC  CL75'WITH THE SAME STAFF THAT STARTED IT. YOURS WILL NOT BE THE'
  DC  CL75'FIRST.'
  DC  X'FE'
ML00877  EQU   *     07/87
  DC  CL75'WHEN THINGS ARE GOING WELL, SOMETHING WILL GO WRONG.'
  DC  CL75'- WHEN THINGS JUST CAN''T GET ANY WORSE, THEY WILL.'
  DC  CL75'- WHEN THINGS APPEAR TO BE GOING BETTER YOU HAVE OVERLOOKED'
  DC  CL75'  SOMETHING.'
  DC  X'FE'
ML00878  EQU   *     07/87
  DC  CL75'IF PROJECT CONTENT IS ALLOWED TO CHANGE FREELY, THE RATE OF'
  DC  CL75'CHANGE WILL EXCEED THE RATE OF PROGRESS.'
  DC  X'FE'
ML00879  EQU   *     07/87
  DC  CL75'NO SYSTEM IS EVER COMPLETELY DEBUGGED: ATTEMPTS TO DEBUG'
  DC  CL75'A SYSTEM WILL INEVITABLY INTRODUCE NEW BUGS THAT ARE EVEN'
  DC  CL75'HARDER TO FIND.'
  DC  X'FE'
ML00880  EQU   *     07/87
  DC  CL75'A CARELESSLY PLANNED PROJECT WILL TAKE THREE TIMES    '
  DC  CL75'LONGER THAN EXPECTED; A CAREFULLY PLANNED PROJECT WILL'
  DC  CL75'TAKE ONLY TWICE AS LONG.'
  DC  X'FE'
ML00881  EQU   *     07/87
  DC  CL75' "MYSTICS ALWAYS HOPE THAT SCIENCE         '
  DC  CL75'   WILL SOME DAY OVERTAKE THEM."           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              BOOTH TARKINGTON             '
  DC  X'FE'
ML00882  EQU   *     07/87
  DC  CL75' "GOD BLESS US EVERY ONE!"                 '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              CHARLES DICKENS              '
  DC  X'FE'
ML00883  EQU   *     07/87
  DC  CL75' "FOR THERE IS NO SUCH FLATTERER AS A      '
  DC  CL75'   MAN''S SELF; AND THERE IS NO SUCH REMEDY'
  DC  CL75'   AGAINST FLATTERY OF A MAN''S SELF AS THE'
  DC  CL75'   LIBERTY OF A FRIEND."                   '
  DC  CL75'              FRANCIS BACON                '
  DC  X'FE'
ML00884  EQU   *     07/87
  DC  CL75' "A DOOR IS WHAT A DOG IS PERPETUALLY      '
  DC  CL75'   ON THE WRONG SIDE OF."                  '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              OGDEN NASH                   '
  DC  X'FE'
ML00885  EQU   *     07/87
  DC  CL75' TRIVIA:  "48"                             '
  DC  CL75'   FRECKLES ON PUPPET HOWDY DOODY''S FACE  '
  DC  CL75'   (STOOD FOR THE 48 STATES IN THE 1950S)  '
  DC  CL75'          "1-0"                            '
  DC  CL75'   SCORE OF A FORFEITED FOOTBALL GAME      '
  DC  X'FE'
ML00886  EQU   *     07/87
  DC  CL75' "FREEDOM OF THE PRESS IS LIMITED TO       '
  DC  CL75'   THOSE WHO OWN ONE."                     '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              A. J. LIEBLING               '
  DC  X'FE'
ML00887  EQU   *     07/87
  DC  CL75' TRIVIA: "BOOPADOOP"                       '
  DC  CL75'  BLONDIE''S MAIDEN NAME (FROM COMIC STRIP)'
  DC  CL75'         "5Ö"                              '
  DC  CL75'  LUCY VAN PELT''S FEE FOR PSYCHIATRIC     '
  DC  CL75'  ADVICE (PEANUTS COMIC STRIP)             '
  DC  X'FE'
ML00888  EQU   *     07/87
  DC  CL75' "HEARTS WILL NEVER BE PRACTICAL UNTIL     '
  DC  CL75'   THEY CAN BE MADE UNBREAKABLE."          '
  DC  CL75'                                           '
  DC  CL75'              THE WIZARD OF OZ             '
  DC  CL75'               TO THE TIN MAN              '
  DC  X'FE'
ML00889  EQU   *     07/87
  DC  CL75' TRIVIA: "GREAT STONE FACE"                '
  DC  CL75'  NICKNAME OF JOSEPH "BUSTER" KEATON       '
  DC  CL75'         "KRELLS"                          '
  DC  CL75'  SUPER-INTELLIGENT CREATURES THAT LIVED   '
  DC  CL75'  BELOW THE SURFACE OF ALTAIR IV.          '
  DC  X'FE'
ML00890  EQU   *     07/87
  DC  CL75' "A SHARP KNIFE CUTS THE QUICKEST AND      '
  DC  CL75'   HURTS THE LEAST."                       '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              KATHARINE HEPBURN            '
  DC  X'FE'
ML00891  EQU   *     07/87
  DC  CL75' "WOMEN ARE LIKE ELEPHANTS TO ME.          '
  DC  CL75'   I LIKE TO LOOK AT THEM, BUT I           '
  DC  CL75'   WOULDN''T WANT TO OWN ONE."             '
  DC  CL75'                                           '
  DC  CL75'              W.C. FIELDS.                 '
  DC  X'FE'
ML00892  EQU   *     07/87
  DC  CL75' TRIVIA: "MUHAMMAD ALI"                    '
  DC  CL75'  RELIGIOUS NAME ADOPTED BY CASSIUS        '
  DC  CL75'  MARCELLUS CLAY.                          '
  DC  CL75'         "$400"                            '
  DC  CL75'  COST OF BOARDWALK (MONOPOLY GAME).       '
  DC  X'FE'
ML00893  EQU   *     07/87
  DC  CL75' "THE ONLY GROUNDS FOR DIVORCE IN          '
  DC  CL75'   CALIFORNIA ARE MARRIAGE."               '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              CHER                         '
  DC  X'FE'
ML00894  EQU   *     07/87
  DC  CL75' TRIVIA: BOY SCOUTS AGES:                  '
  DC  CL75'     CUB SCOUTS-      AGE  8-10            '
  DC  CL75'     BOY SCOUTS-      AGE 10-13            '
  DC  CL75'     EXPLORER SCOUTS- AGE 14 AND ABOVE     '
  DC  CL75'                                           '
  DC  X'FE'
ML00895  EQU   *     07/87
  DC  CL75' "WHEN ONE HUNDRED SENATORS TALK FOR       '
  DC  CL75'   THIRTY-SEVEN HOURS, ENOUGH NATURAL GAS  '
  DC  CL75'   IS PRODUCED."                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY KISSINGER              '
  DC  X'FE'
ML00896  EQU   *     07/87
  DC  CL75' "EDUCATION IS A METHOD BY WHICH ONE       '
  DC  CL75'   ACQUIRES A HIGHER GRADE OF              '
  DC  CL75'   PREJUDICES."                            '
  DC  CL75'                                           '
  DC  CL75'              LAURENCE J. PETER            '
  DC  X'FE'
ML00897  EQU   *     07/87
  DC  CL75' "THE SECRET OF EDUCATION IS               '
  DC  CL75'   RESPECTING THE PUPIL."                  '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              RALPH WALDO EMERSON          '
  DC  X'FE'
ML00898  EQU   *     07/87
  DC  CL75' "HISTORY IS A SET OF LIES                 '
  DC  CL75'   AGREED UPON."                           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              NAPOLEON BONAPARTE           '
  DC  X'FE'
ML00899  EQU   *     07/87
  DC  CL75' "THE NATURAL PROGRESS OF THINGS IS FOR    '
  DC  CL75'   LIBERTY TO YIELD AND GOVERNMENT TO      '
  DC  CL75'   GAIN GROUND."                           '
  DC  CL75'                                           '
  DC  CL75'              THOMAS JEFFERSON             '
  DC  X'FE'
ML00900  EQU   *     07/87
  DC  CL75' "THE BEST AUDIENCE IS ONE THAT IS         '
  DC  CL75'   INTELLIGENT, WELL-EDUCATED              '
  DC  CL75'   -AND A LITTLE DRUNK."                   '
  DC  CL75'                                           '
  DC  CL75'              ALBEN W. BARKLEY             '
  DC  X'FE'
ML00901  EQU   *     07/87
  DC  CL75' "PROBLEMS ARE ONLY OPPORTUNITIES IN       '
  DC  CL75'   WORK CLOTHES."                          '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00902  EQU   *     07/87
  DC  CL75' "YOU CAN''T SIT ON THE LID OF PROGRESS.   '
  DC  CL75'   IF YOU DO, YOU WILL BE BLOWN TO PIECES."'
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00903  EQU   *     07/87
  DC  CL75' "IT ISN''T POWER, IT''S PERSUASION THAT   '
  DC  CL75'   MAKES THINGS SUCCESSFUL. THE MORE WE    '
  DC  CL75'   GROW IN SIZE, IT WILL BE BY             '
  DC  CL75'   PERSUASION."                            '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00904  EQU   *     07/87
  DC  CL75' "THE ONLY LIMIT TO OUR REALIZATION OF     '
  DC  CL75'   TOMORROW WILL BE OUR DOUBTS OF TODAY.   '
  DC  CL75'   LET US MOVE FORWARD WITH STRONG AND     '
  DC  CL75'   ACTIVE FAITH."                          '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00905  EQU   *     07/87
  DC  CL75' "THERE''S ONLY ONE TIME TO DO ANYTHING    '
  DC  CL75'   AND THAT''S TODAY."                     '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00906  EQU   *     07/87
  DC  CL75' "BEWARE OF THE MAN WHO GOES TO COCKTAIL   '
  DC  CL75'   PARTIES NOT TO DRINK BUT TO LISTEN."    '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              PIERRE DANINOS               '
  DC  X'FE'
ML00907  EQU   *     07/87
  DC  CL75' "ONE NICE THING ABOUT EGOTISTS:           '
  DC  CL75'   THEY DON''T TALK ABOUT OTHER PEOPLE."   '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              LUCILLE S. HARPER            '
  DC  X'FE'
ML00908  EQU   *     07/87
  DC  CL75' "SATAN HASN''T A SINGLE SALARIED HELPER;  '
  DC  CL75'   THE OPPOSITION EMPLOYS A MILLION."      '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              MARK TWAIN                   '
  DC  X'FE'
ML00909  EQU   *     07/87
  DC  CL75' "EVERYONE IS A GENIUS AT LEAST ONCE A     '
  DC  CL75'   YEAR; A REAL GENIUS HAS HIS ORIGINAL    '
  DC  CL75'   IDEAS CLOSER TOGETHER."                 '
  DC  CL75'                                           '
  DC  CL75'              G.C. LICHTENBERG             '
  DC  X'FE'
ML00910  EQU   *     07/87
  DC  CL75' "ABRAHAM LINCOLN WROTE THE GETTYSBURG     '
  DC  CL75'   ADDRESS WHILE TRAVELLING FROM           '
  DC  CL75'   WASHINGTON TO GETTYSBURG ON THE BACK    '
  DC  CL75'   OF AN ENVELOPE." (SIC)                  '
  DC  CL75'              LOUIS UNTERMEYER             '
  DC  X'FE'
ML00911  EQU   *     07/87
  DC  CL75' "THE DIFFERENCE BETWEEN A POLITICIAN AND  '
  DC  CL75'   A STATESMAN IS: A POLITICIAN THINKS     '
  DC  CL75'   OF THE NEXT ELECTION AND A STATESMAN    '
  DC  CL75'   THINKS OF THE NEXT GENERATION."         '
  DC  CL75'              JAMES FREEMAN CLARKE         '
  DC  X'FE'
ML00912  EQU   *     07/87
  DC  CL75' "COURTROOM: A PLACE WHERE JESUS CHRIST AND'
  DC  CL75'   JUDAS ISCARIOT WOULD BE EQUALS, WITH    '
  DC  CL75'   THE BETTING ODDS IN FAVOR OF JUDAS."    '
  DC  CL75'                                           '
  DC  CL75'              H.L. MENCKEN                 '
  DC  X'FE'
ML00913  EQU   *     07/87
  DC  CL75' "SANITY IS MADNESS PUT TO GOOD USE."      '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              GEORGE SANTAYANA             '
  DC  X'FE'
ML00914  EQU   *     07/87
  DC  CL75' "ONLY THE PAST IS IMMORTAL."              '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              DELMORE SCHWARTZ             '
  DC  X'FE'
ML00915  EQU   *     07/87
  DC  CL75' "WHOEVER NAMED IT NECKING WAS A POOR      '
  DC  CL75'   JUDGE OF ANATOMY."                      '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              GROUCHO MARX                 '
  DC  X'FE'
  DC  X'FE'
ML00916  EQU   *     07/87
  DC  CL75' "THE END MOVE IN POLITICS IS ALWAYS       '
  DC  CL75'   TO PICK UP THE GUN."                    '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               BUCKMINSTER FULLER          '
  DC  X'FE'
ML00917  EQU   *     07/87
  DC  CL75'"EVERYONE IS THE CHILD OF HIS PAST."      '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              EDNA G. ROSTOW               '
  DC  X'FE'
ML00918  EQU   *     07/87
  DC  CL75' "TO MANY PEOPLE DRAMATIC CRITICISM MUST   '
  DC  CL75'   BE LIKE TRYING TO TATTOO SOAP BUBBLES." '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              JOHN MASON BROWN             '
  DC  X'FE'
ML00919  EQU   *     07/87
  DC  CL75' "AN INTELLECTUAL IS SOMEONE WHOSE MIND    '
  DC  CL75'   WATCHES ITSELF."                        '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              ALBERT CAMUS                 '
  DC  X'FE'
ML00920  EQU   *     07/87
  DC  CL75' "THERE''S A SUCKER BORN EVERY MINUTE."    '
  DC  CL75'              P. T. BARNUM                 '
  DC  X'FE'
ML00921  EQU   *     07/87
  DC  CL75' "A FOOL AND HIS MONEY ARE SOON PARTED."   '
  DC  CL75'              JAMES HOWELL                 '
  DC  X'FE'
ML00922  EQU   *     07/87
  DC  CL75' "I KNOW ONLY TWO TUNES: ONE OF THEM IS    '
  DC  CL75'   ''YANKEE DOODLE,'' AND THE OTHER        '
  DC  CL75'   ISN''T."                                '
  DC  CL75'                                           '
  DC  CL75'              ULYSSES S. GRANT             '
  DC  X'FE'
ML00923  EQU   *     07/87
  DC  CL75' "FIND A NEED AND FILL IT."                '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00924  EQU   *     07/87
  DC  CL75' "DON''T BRING ME ANY THING BUT TROUBLE.   '
  DC  CL75'   GOOD NEWS WEAKENS ME."                  '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00925  EQU   *     07/87
  DC  CL75' "LET''S KEEP ON BEING THE KIND OF         '
  DC  CL75'   ORGANIZATION THAT''S NEVER SATISFIED    '
  DC  CL75'   WITH ITSELF."                           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00926  EQU   *     07/87
  DC  CL75' "LET''S NOT STIFLE IDEAS BY INACTION.     '
  DC  CL75'   WE CAN, IF WE WILL, KEEP FOREVER        '
  DC  CL75'   BUILDING THE TOMORROW THAT IS BETTER    '
  DC  CL75'   THAN YESTERDAY."                        '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00927  EQU   *     07/87
  DC  CL75' UMBRELLA LAW:                             '
  DC  CL75'  "YOU WILL NEED THREE UMBRELLAS:          '
  DC  CL75'    ONE TO LEAVE AT THE OFFICE, ONE TO     '
  DC  CL75'    LEAVE AT HOME, AND ONE TO LEAVE ON THE '
  DC  CL75'    TRAIN."                                '
  DC  X'FE'
ML00928  EQU   *     07/87
  DC  CL75' BELL''S RULE. "THE AVERAGE TIME BETWEEN   '
  DC  CL75'   THROWING SOMETHING AWAY AND NEEDING IT  '
  DC  CL75'   BADLY IS TWO WEEKS.  THIS TIME CAN BE   '
  DC  CL75'   REDUCED TO ONE WEEK BY RETAINING THE    '
  DC  CL75'   THING FOR A LONG TIME FIRST."           '
  DC  X'FE'
ML00929  EQU   *     07/87
  DC  CL75' ROWE''S RULE.  "THE ODDS ARE 6 TO 5 THAT  '
  DC  CL75'   THE LIGHT AT THE END OF THE TUNNEL IS A '
  DC  CL75'   HEADLIGHT ON AN ONCOMMING EXPRESS       '
  DC  CL75'   TRAIN."                                 '
  DC  CL75'                                           '
  DC  X'FE'
ML00930  EQU   *     07/87
  DC  CL75' OGDEN''S LAW:                             '
  DC  CL75'   "THE SOONER YOU FALL BEHIND, THE MORE   '
  DC  CL75'     TIME YOU HAVE TO CATCH UP."      '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  X'FE'
ML00931  EQU   *     07/87
  DC  CL75' AIR FORCE LAW: "TWO % DON''T GET THE WORD"'
  DC  CL75'                                           '
  DC  CL75' BERRA''S LAW:                             '
  DC  CL75'  "YOU CAN OBSERVE A LOT JUST BY WATCHING."'
  DC  CL75'                                           '
  DC  X'FE'
ML00932  EQU   *     07/87
  DC  CL75' "THE DEVIL CAN CITE SCRIPTURE FOR HIS     '
  DC  CL75'  PURPOSE."                                '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               WILLIAM SHAKESPEARE         '
  DC  X'FE'
ML00933  EQU   *     07/87
  DC  CL75' "THE GOOD NEIGHBOR LOOKS BEYOND THE       '
  DC  CL75'   EXTERNAL ACCIDENTS AND DISCERNS THOSE   '
  DC  CL75'   INNER QUALITIES THAT MAKE ALL MEN       '
  DC  CL75'   HUMAN AND, THEREFORE, BROTHERS."        '
  DC  CL75'               MARTIN LUTHER KING, JR.     '
  DC  X'FE'
ML00934  EQU   *     07/87
  DC  CL75' "THERE IS A SUFFICIENCY IN THE WORLD      '
  DC  CL75'   FOR MAN''S NEED BUT NOT FOR MAN''S      '
  DC  CL75'   GREED."                                 '
  DC  CL75'                                           '
  DC  CL75'               MOHANDAS GANDHI             '
  DC  X'FE'
ML00935  EQU   *     07/87
  DC  CL75' "OUR EXISTENCE IS BUT A BRIEF CRACK       '
  DC  CL75'   OF LIGHT BETWEEN TWO ETERNITIES         '
  DC  CL75'   OF DARKNESS."                           '
  DC  CL75'                                           '
  DC  CL75'               VLADIMIR NABOKOV            '
  DC  X'FE'
ML00936  EQU   *     07/87
  DC  CL75' "GROSS IGNORANCE: 144 TIMES WORSE THAN    '
  DC  CL75'  ORDINARY IGNORANCE."                     '
  DC  CL75'               BENNETT CERF                '
  DC  X'FE'
ML00937  EQU   *     07/87
  DC  CL75' "IGNORANCE IS NO EXCUSE--- IT''S THE REAL '
  DC  CL75'  THING."      IRENE PETER                 '
  DC  X'FE'
ML00938  EQU   *     07/87
  DC  CL75' "THE MAXIM OF THE BRITISH PEOPLE IS       '
  DC  CL75'  ''BUSINESS AS USUAL.''"                  '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               WINSTON CHURCHILL           '
  DC  X'FE'
ML00939  EQU   *     07/87
  DC  CL75' "OH, TO BE IN ENGLAND                     '
  DC  CL75'   NOW THAT APRIL''S THERE."               '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               ROBERT BROWNING             '
  DC  X'FE'
ML00940  EQU   *     07/87
  DC  CL75' "ENGLISHMAN: A CREATURE WHO THINKS HE IS  '
  DC  CL75'   BEING VIRTUOUS WHEN HE IS ONLY BEING    '
  DC  CL75'   UNCOMFORTABLE."                         '
  DC  CL75'                                           '
  DC  CL75'               GEORGE BERNARD SHAW         '
  DC  X'FE'
ML00941  EQU   *     07/87
  DC  CL75' "CONTRARY TO POPULAR BELIEF, ENGLISH      '
  DC  CL75'   WOMEN DO NOT WEAR TWEED NIGHTGOWNS.     '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               HERMIONE GINGOLD            '
  DC  X'FE'
ML00942  EQU   *     07/87
  DC  CL75' "IF A PLAYWRIGHT IS FUNNY, THE ENGLISH    '
  DC  CL75'   LOOK FOR A SERIOUS MESSAGE, AND IF HE''S'
  DC  CL75'   SERIOUS, THEY LOOK FOR THE JOKE."       '
  DC  CL75'                                           '
  DC  CL75'               SACHA GUITRY                '
  DC  X'FE'
ML00943  EQU   *     07/87
  DC  CL75' "ETERNAL VIGILANCE IS THE                 '
  DC  CL75'    PRICE OF LIBERTY."                     '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               WENDEL PHILLIPS             '
  DC  X'FE'
ML00944  EQU   *     07/87
  DC  CL75' "NO NEGRO AMERICAN CAN BE FREE UNTIL THE  '
  DC  CL75'   LOWEST NEGRO IN MISSISSIPPI IS NO LONGER'
  DC  CL75'   DISADVANTAGED BECAUSE OF HIS RACE."     '
  DC  CL75'                                           '
  DC  CL75'               RALPH BUNCHE                '
  DC  X'FE'
ML00945  EQU   *     07/87
  DC  CL75' "LIBERTY MEANS RESPONSIBILITY.            '
  DC  CL75'   THAT IS WHY MOST MEN DREAD IT."         '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               GEORGE BERNARD SHAW         '
  DC  X'FE'
ML00946  EQU   *     07/87
  DC  CL75' "FREEDOM IS NOT ENOUGH."                  '
  DC  CL75'               LYNDON B. JOHNSON           '
  DC  X'FE'
ML00947  EQU   *     07/87
  DC  CL75' "LIBERTY DOESN''T WORK AS WELL IN PRACTICE'
  DC  CL75'   AS IT DOES IN SPEECHES."                '
  DC  CL75'               WILL ROGERS                 '
  DC  X'FE'
ML00948  EQU   *     07/87
  DC  CL75' "AT NO TIME IS FREEDOM OF SPEECH MORE     '
  DC  CL75'   PRECIOUS THAN WHEN A MAN HITS HIS       '
  DC  CL75'   THUMB WITH A HAMMER."                   '
  DC  CL75'                                           '
  DC  CL75'               MARSHALL LUMSDEN            '
  DC  X'FE'
ML00949  EQU   *     07/87
  DC  CL75' "ALL WORK AND NO PLAY MAKES JACK A DULL   '
  DC  CL75'   BOY--- AND JILL A WEALTHY WIDOW."       '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               EVAN ESAR                   '
  DC  X'FE'
ML00950  EQU   *     07/87
  DC  CL75' "I''M A GREAT BELIEVER IN LUCK,           '
  DC  CL75'   AND I FIND THE HARDER I WORK THE MORE   '
  DC  CL75'   I HAVE OF IT."                          '
  DC  CL75'                                           '
  DC  CL75'               THOMAS JEFFERSON            '
  DC  X'FE'
ML00951  EQU   *     07/87
  DC  CL75' "THE WORLD WILL NEVER HAVE LASTING        '
  DC  CL75'   PEACE SO LONG AS MEN RESERVE FOR        '
  DC  CL75'   WAR THE FINEST HUMAN QUALITIES."        '
  DC  CL75'                                           '
  DC  CL75'               JOHN FOSTER DULLES          '
  DC  X'FE'
ML00952  EQU   *     07/87
  DC  CL75' "IT IS NOT THE EMPLOYER WHO PAYS THE      '
  DC  CL75'   WAGES--- HE ONLY HANDLES THE MONEY.     '
  DC  CL75'   IT IS THE PRODUCT THAT PAYS WAGES."     '
  DC  CL75'                                           '
  DC  CL75'               HENRY FORD                  '
  DC  X'FE'
ML00953  EQU   *     07/87
  DC  CL75' "ASK NOT WHAT YOUR COUNTRY CAN DO FOR YOU '
  DC  CL75'   BUT WHAT YOU CAN DO FOR YOUR COUNTRY."  '
  DC  CL75' "THE UNITED STATES HAS TO MOVE VERY FAST  '
  DC  CL75'   TO EVEN STAND STILL."                   '
  DC  CL75'               JOHN F. KENNEDY             '
  DC  X'FE'
ML00954  EQU   *     07/87
  DC  CL75' "ONE FIFTH OF THE PEOPLE ARE AGAINST      '
  DC  CL75'   EVERYTHING ALL THE TIME."        R.F.K. '
  DC  X'FE'
ML00955  EQU   *     07/87
  DC  CL75' "IT ISN''T THAT I''M A SAINT.  IT''S JUST '
  DC  CL75'   THAT I''VE NEVER FOUND IT NECESSARY     '
  DC  CL75'   TO BE A SINNER."                 R.F.K  '
  DC  X'FE'
ML00956  EQU   *     07/87
  DC  CL75' "LET US NEVER NEGOTIATE OUT OF FEAR,      '
  DC  CL75'   BUT LET US NEVER FEAR TO NEGOTIATE."    '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               JOHN F. KENNEDY             '
  DC  X'FE'
ML00957  EQU   *     07/87
  DC  CL75' "IS THERE SUCH A THING AS SHOPPERS        '
  DC  CL75'   ANONYMOUS?"                             '
  DC  CL75'                                           '
  DC  CL75'   JOHN F. KENNEDY, ON RECEIVING A $40,000 '
  DC  CL75'             BILL FOR HIS WIFE''S CLOTHES. '
  DC  X'FE'
ML00958  EQU   *     07/87
  DC  CL75' "IF A FREE SOCIETY CANNNOT HELP THE MANY  '
  DC  CL75'   WHO ARE POOR, IT CANNOT SAVE THE FEW    '
  DC  CL75'   WHO ARE RICH."                   J.F.K  '
  DC  X'FE'
ML00959  EQU   *     07/87
  DC  CL75' "MANKIND MUST PUT AN END TO WAR, OR WAR   '
  DC  CL75'   WILL PUT AN END TO MANKIND."     J.F.K. '
  DC  X'FE'
ML00960  EQU   *     07/87
  DC  CL75' "WHEN CHOOSING BETWEEN TWO EVILS,         '
  DC  CL75'   I ALWAYS LIKE TO TRY THE ONE            '
  DC  CL75'   I''VE NEVER TRIED BEFORE."              '
  DC  CL75'                                           '
  DC  CL75'               MAE WEST                    '
  DC  X'FE'
ML00961  EQU   *     07/87
  DC  CL75' "I NAME THEE OLD GLORY."                  '
  DC  CL75'               CAPTAIN WILLIAM DRIVER      '
  DC  X'FE'
ML00962  EQU   *     07/87
  DC  CL75' "IF ANYONE ATTEMPTS TO HAUL DOWN THE      '
  DC  CL75'   AMERICAN FLAG, SHOOT HIM ON THE SPOT."  '
  DC  CL75'               JOHN A. DIX                 '
  DC  X'FE'
ML00963  EQU   *     07/87
  DC  CL75' "MOST PEOPLE LIKE HARD WORK.              '
  DC  CL75'   PARTICULARLY WHEN THEY ARE              '
  DC  CL75'   PAYING FOR IT."                         '
  DC  CL75'                                           '
  DC  CL75'               FRANKLIN P. JONES           '
  DC  X'FE'
ML00964  EQU   *     07/87
  DC  CL75' "CRIME IS CONTAGIOUS.                     '
  DC  CL75'   IF THE GOVERNMENT BECOMES A LAW-BREAKER,'
  DC  CL75'   IT BREEDS CONTEMPT FOR THE LAW."        '
  DC  CL75'                                           '
  DC  CL75'               JUSTICE LOUIS D. BRANDEIS   '
  DC  X'FE'
ML00965  EQU   *     07/87
  DC  CL75' "COMPUTERS CAN FIGURE OUT ALL KINDS OF    '
  DC  CL75'   PROBLEMS, EXCEPT THE THINGS THAT        '
  DC  CL75'   JUST DON''T ADD UP."                    '
  DC  CL75'                                           '
  DC  CL75'               JAMES MAGARY                '
  DC  X'FE'
ML00966  EQU   *     07/87
  DC  CL75' "SINCE WE CANNOT KNOW ALL THAT IS TO BE   '
  DC  CL75'   KNOWN OF EVERYTHING, WE OUGHT TO KNOW   '
  DC  CL75'   A LITTLE ABOUT EVERYTHING."             '
  DC  CL75'                                           '
  DC  CL75'               BLAISE PASCAL               '
  DC  X'FE'
ML00967  EQU   *     07/87
  DC  CL75' "THE LAST THING THAT WE FIND IN MAKING    '
  DC  CL75'   A BOOK IS TO KNOW WHAT WE MUST PUT      '
  DC  CL75'   FIRST."                                 '
  DC  CL75'                                           '
  DC  CL75'               BLAISE PASCAL               '
  DC  X'FE'
ML00968  EQU   *     07/87
  DC  CL75' "IF ALL MEN KNEW WHAT EACH SAID OF THE    '
  DC  CL75'   OTHER, THERE WOULD NOT BE FOUR FRIENDS  '
  DC  CL75'   IN THE WORLD."                          '
  DC  CL75'                                           '
  DC  CL75'               BLAISE PASCAL               '
  DC  X'FE'
ML00969  EQU   *     07/87
  DC  CL75' "JUSTICE WITHOUT FORCE IS POWERLESS;      '
  DC  CL75'   FORCE WITHOUT JUSTICE IS TYRANNICAL."   '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               BLAISE PASCAL               '
  DC  X'FE'
ML00970  EQU   *     07/87
  DC  CL75' "THE HEART HAS ITS REASONS WHICH REASON   '
  DC  CL75'   DOES NOT UNDERSTAND."                   '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               BLAISE PASCAL               '
  DC  X'FE'
ML00971  EQU   *     07/87
  DC  CL75' "I ADMIT I MAY HAVE DOZED THOUGH SOME     '
  DC  CL75'   OF THE SESSIONS.  BUT I HAVEN''T        '
  DC  CL75'   HAD A GOOD REST SINCE THE CAMPAIGN."    '
  DC  CL75'                                           '
  DC  CL75'               S. I. HAYAKAWA              '
  DC  X'FE'
ML00972  EQU   *     07/87
  DC  CL75' "MORE MEN HAVE BEEN ELECTED BETWEEN       '
  DC  CL75'   SUNDOWN AND SUNUP THAN EVER WERE ELECTED'
  DC  CL75'   ELECTED BETWEEN SUNUP AND SUNDOWN."     '
  DC  CL75'                                           '
  DC  CL75'               WILL ROGERS                 '
  DC  X'FE'
ML00973  EQU   *     07/87
  DC  CL75' "IT MAKES NO DIFFERENCE WHO YOU VOTE FOR--'
  DC  CL75'   THE TWO PARTIES ARE REALLY ONE PARTY    '
  DC  CL75'   REPRESENTING 4 PRECENT OF THE PEOPLE."  '
  DC  CL75'                                           '
  DC  CL75'               GORE VIDAL                  '
  DC  X'FE'
ML00974  EQU   *     07/87
  DC  CL75' "WE''RE GOING TO MOVE LEFT AND RIGHT      '
  DC  CL75'   AT THE SAME TIME."                      '
  DC  CL75'                                           '
  DC  CL75'                                           '
  DC  CL75'               GOVERNOR JERRY BROWN        '
  DC  X'FE'
ML00975  EQU   *     07/87
  DC  CL75' "I ALWAYS HAVE TO DREAM UP THERE AGAINST  '
  DC  CL75'   THE STARS.  IF I DON''T DREAM I''LL MAKE'
  DC  CL75'   IT, I WON''T EVEN GET CLOSE."           '
  DC  CL75'                                           '
  DC  CL75'              HENRY J. KAISER              '
  DC  X'FE'
ML00976  EQU   *     07/87
  DC  CL75'CALM DOWN .... IT IS ONLY ONES AND ZEROS'
  DC  X'FE'
ML00977  EQU   *     07/87
  DC  CL75' "THANK HEAVEN FOR THE MILITARY-INDUSTRIAL '
  DC  CL75'   COMPLEX.  ITS ULTIMATE AIM IS PEACE     '
  DC  CL75'   IN OUR TIME."                           '
  DC  CL75'                                           '
  DC  CL75'               BARRY GOLDWATER             '
  DC  X'FE'
ML00978  EQU   *        08/01
  DC  CL75'ALL THAT GILTTERS HAS A HIGH REFRACTIVE INDEX          '
  DC  X'FE'
ML00979  EQU   *        08/01
  DC  CL75'MANUFACTURERS REBATE - COMPANY''S WAY OF LETTING YOU   '
  DC  CL75'KNOW YOU''VE BEEN OVERCHARGED                          '
  DC  X'FE'
ML00980  EQU   *        08/87
  DC  CL75'TRUST EVERYBODY BUT CUT THE CARDS                      '
  DC  X'FE'
ML00981  EQU   *        08/87
  DC  CL75'IT''S NOT THE PRINCIPAL OF THE THING, IT''S THE INTEREST'
  DC  X'FE'
ML00982  EQU   *        08/87
  DC  CL75'THE BEST HELPING HAND I EVER GOT                       '
  DC  CL75'WAS AT THE END OF MY OWN ARM                           '
  DC  X'FE'
ML00983  EQU   *        09/87
  DC  CL75'NEVER PUT OFF TILL TOMORROW WHAT YOU CAN DO THE        '
  DC  CL75'DAY AFTER                                              '
  DC  X'FE'
ML00984  EQU   *         09/87
  DC  CL75'A CLICHE IS ONLY SOMETHING WELL SAID IN THE FIRST PLACE'
  DC  X'FE'
ML00985  EQU   *         09/87
  DC  CL75'IF YOU CAN''T BE KIND, AT LEASE BE VAGUE               '
  DC  X'FE'
ML00986  EQU   *         09/87
  DC  CL75'ALL PROGRESS IS BASED UPON A UNIVERSAL INNATE DESIRE ON'
  DC  CL75'THE PART OF EVERY ORGANISM TO LIVE BEYOND ITS INCOME   '
  DC  X'FE'
ML00987  EQU   *         09/87
  DC  CL75'A BILLION HERE, A BILLION THERE, PRETTY SOON IT ADDS   '
  DC  CL75'UP TO REAL MONEY                                       '
  DC  CL75'                                                       '
  DC  CL75'              SENATOR EVERETT DIRKSEN                  '
  DC  X'FE'
ML00988  EQU   * 09/87
  DC  CL75'INSIDE EVERY LARGE PROGRAM IS A SMALL PROGRAM          '
  DC  CL75'STRUGGLING TO GET OUT                                  '
  DC  X'FE'
ML00989  EQU   * 09/87
  DC  CL75'THE ATTENTION SPAN OF A COMPUTER IS ONLY AS LONG AS    '
  DC  CL75'ITS ELECTRICAL CORD                                    '
  DC  X'FE'
ML00990  EQU   * 09/87
  DC  CL75'ONE GOOD REASON WHY COMPUTERS CAN DO MORE WORK THAT    '
  DC  CL75'PEOPLE IS THAT THEY NEVER HAVE TO STOP AND ANSWER      '
  DC  CL75'THE PHONE                                              '
  DC  X'FE'
ML00991  EQU   * 09/87
  DC  CL75'VSAM IS A FOUR LETTER WORD'
  DC  X'FE'
ML00992  EQU   * 09/87
  DC  CL75'EVERYONE HAS THE RIGHT TO DO WHAT THEY WANT,           '
  DC  CL75' BUT IS IT RIGHT TO DO IT                              '
  DC  X'FE'
ML00993  EQU   *
  DC  CL75'THE LIKELIHOOD OF SOMEONE DOING 50 MPH IN THE FAST     '
  DC  CL75'LANE IS DIRECTLY PROPORTIONAL TO HOW LATE YOU ARE      '
  DC  CL75'FOR WORK                                               '
  DC  X'FE'
ML00994  EQU   *
  DC  CL75'TRAFFIC ALWAYS FLOWS FASTER IN THE OTHER LANES         '
  DC  X'FE'
ML00995  EQU   *
  DC  CL75'THE CHANGES OF SOMEONE MAKING A RIGHT TURN FROM THE    '
  DC  CL75'LEFT-TURN LANE ARE A CONSTANT ONE IN THREE             '
  DC  X'FE'
ML00996  EQU   *
  DC  CL75'CHANCES OF THE INDIVIDUAL MAKING THIS TURN WHILE       '
  DC  CL75'FLASHING HIS LEFT TURN SIGNAL ARE A CONSTANT ONE IN SIX'
  DC  X'FE'
ML00997  EQU   *
  DC  CL75'THE WINDSHIELD WIPER ON THE PASSENGER SIDE ALWAYS      '
  DC  CL75'WORK BETTER                                            '
  DC  X'FE'
ML00998  EQU   *
  DC  CL75'THE WINDSHIELD WIPERS WILL DISINTEGRATE ONLY WHEN      '
  DC  CL75'YOU TURN THEM ON DURING THE WORST RAINSTORM OF THE     '
  DC  CL75'DECADE                                                 '
  DC  X'FE'
ML00999  EQU   *
  DC  CL75'THE CHANCES OF THE SPARE TIRE BEING FLAT ARE IN DIRECT '
  DC  CL75'RATIO TO THE DISTANCE FROM THE NEAREST TOWN            '
  DC  X'FE'
ML01000  EQU   *
  DC  CL75'A TIRE WILL NEVER GO FLAT UNLESS:                      '
  DC  CL75'     A. THE GRADE IS AT LEAST 10 PERCENT               '
  DC  CL75'     B. THE TOOL KIT IS COVERED BY AT LEAST 87 POUNDS  '
  DC  CL75'        OF LUGGAGE                                     '
  DC  CL75'     C. YOU LOANED YOUR JACK TO A FRIEND               '
  DC  X'FE'
ML01001  EQU   *
  DC  CL75'THE ONLY POINT UNDER THE CAR FROM WHICH OIL WILL DRIP  '
  DC  CL75'IS DIRECTLY ABOVE WHERE YOU WILL BE LYING              '
  DC  X'FE'
ML01002  EQU   *
  DC  CL75'IF THERE IS ANY POSSIBILITY OF INSTALLING A PART       '
  DC  CL75'BACKWARDS, THAT''S THE ONLY WAY IT WILL LOOK CORRECT   '
  DC  X'FE'
ML01003  EQU   *
  DC  CL75'THE USEFULNESS OF A COMPUTER PRINTOUT IS INVERSELY     '
  DC  CL75'PROPORTIONAL TO ITS WEIGHT                             '
  DC  X'FE'
ML01004  EQU   *
  DC  CL75'THE WORLD IS FULL OF WILLING PEOPLE, SOME WILLING TO   '
  DC  CL75'WORK, THE REST WILLING TO LET THEM                     '
  DC  X'FE'
ML01005  EQU   *
  DC  CL75'MY FATHER TAUGHT ME TO WORK, HE DID NOT TEACH ME TO    '
  DC  CL75'LOVE IT                                                '
  DC  X'FE'
ML01006  EQU   *
  DC  CL75'MOST PEOPLE LIKE HARD WORK.                            '
  DC  CL75'PARTICULARLY WHEN THEY ARE PAYING FOR IT.              '
  DC  X'FE'
ML01007  EQU   *
  DC  CL75'IF A THING IS WORTH DOING, ITS WORTH DOING BADLY       '
  DC  X'FE'
ML01008  EQU   *
  DC  CL75'WORK IS THE GREATEST THING IN THE WORLD, SO WE SHOULD  '
  DC  CL75'ALWAYS SAVE SOME OF IT FOR TOMORROW.                   '
  DC  X'FE'
ML01009  EQU   *
  DC  CL75'HE HAD INSOMNIA SO BAD THAT HE COULDN''T SLEEP         '
  DC  CL75'WHEN HE WAS WORKING                                    '
  DC  X'FE'
ML01010  EQU   *
  DC  CL75'YOU CAN''T GET THERE FROM HERE                         '
  DC  X'FE'
ML01011  EQU   *
  DC  CL75'IF YOUR PROJECT DOESN''T WORK, LOOK FOR THE PART YOU   '
  DC  CL75'DIDN''T THINK WAS IMPORTANT                            '
  DC  X'FE'
ML01012  EQU   *
  DC  CL75'NOTHING IS AS EASY AS IT LOOKS                         '
  DC  X'FE'
ML01013  EQU   *
  DC  CL75'BEAUTY IS ONLY SKIN DEEP, BUT UGLY GOES RIGHT TO THE BONE'
  DC  X'FE'
ML01014  EQU   *
  DC  CL75'YOU MAY KNOW WHERE THE MARKET IS GOING BUT YOU CAN''T  '
  DC  CL75'KNOW WHERE IT''S GOING AFTER THAT                      '
  DC  X'FE'
ML01015  EQU   *
  DC  CL75'IF YOU''RE EARLY, IT WILL BE CANCELED. IT YOU''RE ON   '
  DC  CL75'TIME IT WILL BE OVER                                   '
  DC  X'FE'
ML01016  EQU   *
  DC  CL75'WHEN OPPORTUNITY KNOCKS, YOU''VE GOT HEADPHONES ON     '
  DC  X'FE'
ML01017  EQU   *
  DC  CL75'ANY BUREAUCRACY REORGANIZED TO ENHANCE EFFICIENCY IS   '
  DC  CL75'IMMEDIATELY INDISTINGUISHEABLE FROM ITS PREDECESSOR    '
  DC  X'FE'
ML01018  EQU   *
  DC  CL75'ANY ORDER THAT CAN BE MISUNDERSTOOD HAS BEEN           '
  DC  CL75'MISUNDERSTOOD                                          '
  DC  X'FE'
ML01019  EQU   *
  DC  CL75'IF YOUR CONDITION SEEMS TO BE GETTING BETTER, YOUR     '
  DC  CL75'DOCTOR IS PROBABLY GETTING SICK                        '
  DC  X'FE'
ML01020  EQU   *
  DC  CL75'THERE IS ALWAYS ROOM AT THE TOP - AFTER AN INVESTIGATION'
  DC  X'FE'
ML01021  EQU   *
  DC  CL75'THERE ARE TWO TYPES OF PEOPLE :                        '
  DC  CL75'    THOSE WHO DIVIDE PEOPLE INTO TWO GROUPS            '
  DC  CL75'    AND THOSE WHO DON''T                               '
  DC  X'FE'
ML01022  EQU   *
  DC  CL75'YOU ARE ALWAYS COMPLIMENTED ON THE DISH THAT TOOK THE  '
  DC  CL75'LEAST EFFORT TO PREPARE                                '
  DC  X'FE'
ML01023  EQU   *
  DC  CL75'THE PERSON WITH THE LEAST EXPERTISE HAS THE MOST OPINIONS'
  DC  X'FE'
ML01024  EQU   *
  DC  CL75'IF IT''S IN FRENCH, YOU CAN''T AFFORD IT               '
  DC  X'FE'
ML01025  EQU   *
  DC  CL75'THE ONE YOU WANT IS NEVER THE ONE ON SALE              '
  DC  X'FE'
ML01026  EQU   *
  DC  CL75'WHEN YOU DROP CHANGE AT THE VENDING MACHINE, THE       '
  DC  CL75'PENNIES WILL FALL NEARBY WHILE ALL THE OTHER COINS     '
  DC  CL75'WIL ROLL OUT OF SIGHT                                  '
  DC  X'FE'
ML01027  EQU   *
  DC  CL75'WIND VELOCITY INCREASES IN DIRECT PROPORTION TO THE    '
  DC  CL75'COST OF THE HAIRDO                                     '
  DC  X'FE'
ML01028  EQU   *
  DC  CL75'AFTER YOU''VE MAILED YOUR LAST CHRISTMAS CARD, YOU     '
  DC  CL75'WILL RECIEVE ONE FROM SOMENONE YOU''VE OVERLOOKED      '
  DC  X'FE'
ML01029  EQU   *
  DC  CL75'IF IT WEREN''T FOR THE LAST MINUTE, NOTHING WOULD      '
  DC  CL75'EVER GET DONE                                          '
  DC  X'FE'
ML01030  EQU   *
  DC  CL75'UNBREAKABLE TOYS AREN''T                               '
  DC  X'FE'
ML01031  EQU   *
  DC  CL75'NOTHING IS EVER SO BAD THAT IT CAN''T GET WORSE        '
  DC  X'FE'
ML01032  EQU   *
  DC  CL75'LAW OF REGRESSIVE ACHIEVEMENT:                         '
  DC  CL75'  LAST YEAR''S WAS ALWAYS BETTER                       '
  DC  X'FE'
ML01033  EQU   *
  DC  CL75'NOTHING IS AS INEVITABLE AS A MISTAKE WHOSE TIME       '
  DC  CL75'HAS COME                                               '
  DC  X'FE'
ML01034  EQU   *
  DC  CL75'IF IT''S WORTH DOING, IT''S WORTH OVERDOING            '
  DC  X'FE'
ML01035  EQU   *
  DC  CL75'THE MOST EXPENSIVE COMPONENT IS THE ONE THAT BREAKS    '
  DC  X'FE'
ML01036  EQU   *
  DC  CL75'CLEANLINESS IS NEXT TO IMPOSSIBLE                      '
  DC  X'FE'
ML01037  EQU   *
  DC  CL75'YOU NEVER WANT THE ONE YOU CAN AFFORD                  '
  DC  X'FE'
ML01038  EQU   *
  DC  CL75'IT REQUIES LESS ENERGY TO TAKE AN OBJECT OUT OF ITS    '
  DC  CL75'PROPER PLACE THAN TO PUT IT BACK                       '
  DC  X'FE'
ML01039  EQU   *
  DC  CL75'EVERYBODY SHOULD BELIEVE IN SOMETHING....I BELIEVE     '
  DC  CL75'I''LL HAVE ANOTHER DRINK                               '
  DC  X'FE'
ML01040  EQU   *
  DC  CL75'WHEN SOMEONE YOU ADMIRE APPEARS TO BE THINKING DEEP    '
  DC  CL75'THOUGHTS, HE IS PROBABLY THINKING ABOUT LUNCH          '
  DC  X'FE'
ML01041  EQU   *
  DC  CL75'IF ANYTHING CAN''T GO WRONG IT WILL                    '
  DC  X'FE'
ML01042  EQU   *
  DC  CL75'NO MATTER WHAT GOES WRONG, THERE IS ALWAYS SOMEONE     '
  DC  CL75'WHO KNEW IT WOULD                                      '
  DC  X'FE'
ML01043  EQU   *
  DC  CL75'IF THEY SAY YOU''LL GET USED TO IT, YOU WON''T         '
  DC  X'FE'
ML01044  EQU   *
  DC  CL75'2 WRONGS ARE ONLY THE BEGINNING                        '
  DC  X'FE'
ML01045  EQU   *
  DC  CL75'GOVERNMENT CORRUPTION WILL BE REPORTED IN THE PAST TENSE'
  DC  X'FE'
ML01046  EQU   *
  DC  CL75'THE ONLY WAY TO DISCOVER THE LIMITS OF THE POSSIBLE    '
  DC  CL75'IS TO GO BEYOUND THEM                                  '
  DC  X'FE'
ML01047  EQU   *
  DC  CL75'THERE''S NO TIME LIKE THE PRESENT FOR POSTPONING       '
  DC  CL75'WHAT YOU DON''T WANT TO DO                             '
  DC  X'FE'
ML01048  EQU   *
  DC  CL75'NOBODY NOTICES THE BIG ERRORS                          '
  DC  X'FE'
ML01049  EQU   *
  DC  CL75'WHEN THE REMEDIES DON''T CURE THE PROBLEM, GOVERNMENT  '
  DC  CL75'MODIFIES THE PROBLEM NOT THE REMEDIES                  '
  DC  X'FE'
ML01050  EQU   *
  DC  CL75'THE ONE TIME YOU RELAX IS THE ONE TIME THE BOSS WALKS  '
  DC  CL75'INTO YOUR OFFICE                                       '
  DC  X'FE'
ML01051  EQU   *
  DC  CL75'NATURE WILL TELL YOU A DIRECT LIE IF SHE CAN           '
  DC  X'FE'
ML01052  EQU   *
  DC  CL75'ONLY ADULTS HAVE DIFFICULTY WITH CHILD PROOF BOTTLES   '
  DC  X'FE'
ML01053  EQU   *
  DC  CL75'IT IS A SIMPLE TASK TO MAKE THINGS COMPLEX, BUT A      '
  DC  CL75'COMPLEX TASK TO MAKE THEM SIMPLE                       '
  DC  X'FE'
ML01054  EQU   *
  DC  CL75'A DANDELION FROM A LOVER MEANS MORE THAN AN ORCHID     '
  DC  CL75'FROM A FRIEND                                          '
  DC  X'FE'
ML01055  EQU   *
  DC  CL75'ALMOST ANYTHING IS EASIER TO GET INTO THAT TO GET OUT OF'
  DC  X'FE'
ML01056  EQU   *
  DC  CL75'NO MATTER HOW OFTEN A LIE IS PROVEN TO BE FALSE, THERE '
  DC  CL75'WILL BE POPLE WHO BELIEVE IT TO BE TRUE                '
  DC  X'FE'
ML01057  EQU   *
  DC  CL75'ONLY GOD CAN MAKE A RANDOM SELECTION                   '
  DC  X'FE'
ML01058  EQU   *
  DC  CL75'VITAL PAPER WILL SHOW THEIR VITALITY BE MOVING FROM    '
  DC  CL75'WHERE YOU LEFT THEM TO WHERE YOU CAN''T FIND THEM      '
  DC  X'FE'
ML01059  EQU   *
  DC  CL75'NO MAN''S LIFE, LIBERTY OR PROPERTY IS SAFE WHEN THE   '
  DC  CL75'LEGISLATURE IS IN SESSION                              '
  DC  X'FE'
ML01060  EQU   *
  DC  CL75'LAW OF TAXES: WHATEVER GOES UP, STAYS UP               '
  DC  X'FE'
ML01061  EQU   *
  DC  CL75'ALL THINGS BEING EQUAL, YOU LOSE                       '
  DC  X'FE'
ML01062  EQU   *
  DC  CL75'EVERYTHING PUT TOGETHER FALLS APART SOONER OR LATER    '
  DC  X'FE'
ML01063  EQU   *
  DC  CL75'WOMEN''S LIBERATION DIDN''T                            '
  DC  X'FE'
ML01064  EQU   *
  DC  CL75'YOU CAN ALWAYS FIND WHAT YOU''RE NOT LOOKING FOR       '
  DC  X'FE'
ML01065  EQU   *
  DC  CL75'WHEN PEOPLE ARE FREE TO DO AS THEY PLEASE, THEY        '
  DC  CL75'USUALLY IMITATE EACH OTHER                             '
  DC  X'FE'
ML01066  EQU   *
  DC  CL75'IRON LAW OF DISTRIBUTION:                              '
  DC  CL75'  THEM THAT HAS, GETS                                  '
  DC  X'FE'
ML01067  EQU   *
  DC  CL75'LAW OF SPORTS CONTRACTS:                               '
  DC  CL75' THE MORE MONEY A FREE AGENT SIGNS FOR, THE LESS       '
  DC  CL75' EFFECTIVE HE BECOMES                                  '
  DC  X'FE'
ML01068  EQU   *
  DC  CL75'THE REVOLUTIONARY LAW:                                 '
  DC  CL75' THE SCROUNGIER THE REBEL UNIFORM, THE MORE LIKELY     '
  DC  CL75' A COUP DETAT                                          '
  DC  X'FE'
ML01069  EQU   *
  DC  CL75'WHEN PARKING, IF YOU ALLOW SOMEONE IN FRONT OF YOU,    '
  DC  CL75'THAT DRIVER WILL TAKE THE LAST AVAILABLE PARKING SPACE '
  DC  X'FE'
ML01070  EQU   *
  DC  CL75'WHEN WE TRY TO PICK OUT ONLY ONE THING, WE FIND IT     '
  DC  CL75'HITCHED TO EVERYTHING ELSE IN THE UNIVERSE             '
  DC  X'FE'
ML01071  EQU   *
  DC  CL75'HISTORY REPEATS ITSELF, THAT''S ONE OF THE THINGS      '
  DC  CL75'WRONG WITH HISTORY                                     '
  DC  X'FE'
ML01072  EQU   *
  DC  CL75'OF TWO POSSIBLE EVENTS, ONLY THE UNDESIRED ONE WILL OCCUR'
  DC  X'FE'
ML01073  EQU   *
  DC  CL75'THERE IS NOTHING SO SMALL THAT IT CAN''T BE BLOWN      '
  DC  CL75'OUT OF PROPORTION                                      '
  DC  X'FE'
ML01074  EQU   *
  DC  CL75'THERE IS ALWAYS MORE DIRTY LAUNDRY THAN CLEAN LAUNDRY  '
  DC  X'FE'
ML01075  EQU   *
  DC  CL75'THE COLDER THE X-RAY TABLE, THE MORE OF YOUR BODY YOU '
  DC  CL75'ARE REQUIRED TO PLACE ON IT                            '
  DC  X'FE'
ML01076  EQU   *
  DC  CL75'AS SOON AS THE STEWARDESS SERVES THE COFFEE,           '
  DC  CL75' THE AIRPLACE ENCOUNTERS TURBULENCE                    '
  DC  X'FE'
ML01077  EQU   *
  DC  CL75'YOU CAN LEAD A HORSE TO WATER, BUT IF YOU GET HIM TO   '
  DC  CL75' FLOAT ON HIS BACK YOU''VE GOT SOMETHING               '
  DC  X'FE'
ML01078  EQU   *
  DC  CL75'AS SOON AS YOU''RE DOING WHAT YOU WANTED TO BE DOING,  '
  DC  CL75'YOU WANT TO BE DOING SOMETHING ELSE                    '
  DC  X'FE'
ML01079  EQU   *
  DC  CL75'IT ALWAYS TAKE LONGER TO GET THERE THAN TO GET BACK    '
  DC  X'FE'
ML01080  EQU   *
  DC  CL75'ANYTHING CAN HAPPEN, IF IT''S NOT COVERED BY YOUR      '
  DC  CL75'INSURANCE                                              '
  DC  X'FE'
ML01081  EQU   *
  DC  CL75'THE CANDY BAR YOU PLANNED TO EAT ON THE WAY HOME FROM  '
  DC  CL75'THE MARKET IS HIDDEN AT THE BOTTOM OF THE GROCERY BAG  '
  DC  X'FE'
ML01082  EQU   *
  DC  CL75'THE SHOPPING CART WITH THE WORSE WHEELS IS THE ONE     '
  DC  CL75'YOU CHOSE                                              '
  DC  X'FE'
ML01083  EQU   *
  DC  CL75'SOW YOUR WILD OATS ON SATURDAY NIGHT -- THEN ON SUNDAY '
  DC  CL75'PRAY FOR A CROP FAILURE                                '
  DC  X'FE'
ML01084  EQU   *
  DC  CL75'WHERE YOU STAND DEPENDS ON WHERE YOU SIT               '
  DC  X'FE'
ML01085  EQU   *
  DC  CL75'DOING IT THE HARD WAY IS ALWAYS EASIER                 '
  DC  X'FE'
ML01086  EQU   *
  DC  CL75'WISDOM CONSISTS OF KNOWING WHEN TO AVOID PERFECTION    '
  DC  X'FE'
ML01087  EQU   *
  DC  CL75'THE DRIVER BEHIND YOU ALWAYS WANTS TO GO FASTER        '
  DC  CL75'THAN YOU DO                                            '
  DC  X'FE'
ML01088  EQU   *
  DC  CL75'IF IT LOOKS EASY, IT''S TOUGH, IF IT LOOKS TOUGH,      '
  DC  CL75'IT''S IMPOSSIBLE                                       '
  DC  X'FE'
ML01089  EQU   *
  DC  CL75'THE LIGHTEST-COLORED FABRIC ATTRACTS THE               '
  DC  CL75' DARKEST-COLORED STAIN                                 '
  DC  X'FE'
ML01090  EQU   *
  DC  CL75'IF YOU UNDERSTAND IT, IT''S OBSOLETE                   '
  DC  X'FE'
ML01091  EQU   *
  DC  CL75'A CRISIS IS WHEN YOU CAN''T SAY:                       '
  DC  CL75'  LET''S FORGET THE WHOLE THING                        '
  DC  X'FE'
ML01092  EQU   *
  DC  CL75'EVERY SOLUTION BREEDS NEW PROBLEMS                     '
  DC  X'FE'
ML01093  EQU   *
  DC  CL75'WHEN YOU TRY TO PROVE TO SOMEONE THAT A MACHINE        '
  DC  CL75'WON''T WORK, IT WILL                                   '
  DC  X'FE'
ML01094  EQU   *
  DC  CL75'THE BIGGER THEY ARE, THE HARDER THEY HIT               '
  DC  X'FE'
ML01095  EQU   *
  DC  CL75'WHENEVER YOU SET OUT TO DO SOMETHING, SOMETHING ELSE   '
  DC  CL75' MUST BE DONE FIRST                                    '
  DC  X'FE'
ML01096  EQU   *
  DC  CL75'THE CLIENT WHO PAYS THE LEAST COMPLAINS THE MOST       '
  DC  X'FE'
ML01097  EQU   *
  DC  CL75'THE ONE REMAINING COURSE YOU MUST TAKE TO GRADUATE WILL'
  DC  CL75'NOT BE OFFERED DURING YOUR LAST SEMESTER               '
  DC  X'FE'
ML01098  EQU   *
  DC  CL75'THE ONLY LABOR WORTH LABORING FOR IS A LABOR OF LOVE   '
  DC  X'FE'
ML01099  EQU   *
  DC  CL75'ANY SIMPLE PROBLEM CAN BE MADE INSOLUBLE IF ENOUGH     '
  DC  CL75'MEETING ARE HELD TO DISCUSS IT                         '
  DC  X'FE'
ML01100  EQU   *
  DC  CL75'ANTHING THAT CAN BE CHANGED WILL BE CHANGED UNTIL      '
  DC  CL75'THERE IS NOT TIME LEFT TO CHANGE ANYTHING              '
  DC  X'FE'
ML01101  EQU   *
  DC  CL75'WHEN YOU''RE NOT IN A HURRY, THE TRAFFIC LIGHT WILL    '
  DC  CL75'TURN GREEN AS SOON AS YOUR CAR COMES TO A COMPLETE STOP'
  DC  X'FE'
ML01102  EQU   *
  DC  CL75'NO POST OFFICE EVER LOSES YOUR JUNK MAIL               '
  DC  X'FE'
ML01103  EQU   *
  DC  CL75'THERE IS NO LIMIT TO HOW WEIRD THINGS CAN GET          '
  DC  X'FE'
ML01104  EQU   *
  DC  CL75'NO MATTER HOW WELL YOU PERFORM YOUR JOB, A SUPERIOR    '
  DC  CL75'WILL SEEK TO MODIFY THE RESULTS                        '
  DC  X'FE'
ML01105  EQU   *
  DC  CL75'HOCKEY IS A GAME PLAYED BY SIX GOOD PLAYERS AND        '
  DC  CL75'THE HOME TEAM                                          '
  DC  X'FE'
ML01106  EQU   *
  DC  CL75'IF SOMETHING IS CONFIDENTIAL IT WILL BE LEFT           '
  DC  CL75'IN THE COPIER                                          '
  DC  X'FE'
ML01107  EQU   *
  DC  CL75'NO PATIENT SHOULD ATTEMPT TO LEAVE THE HOSPITAL UNTIL  '
  DC  CL75'HE IS STRONG ENOUGH TO FACE THE CASHIER                '
  DC  X'FE'
ML01109  EQU   *
  DC  CL75'TALL PEOPLE HAVE HIGHER STANDARDS                      '
  DC  X'FE'
ML01110  EQU   *
  DC  CL75'WHAT CAN YOU EXPECT OF A DAY THAT BEINGS WITH GETTING  '
  DC  CL75'UP IN THE MORNING                                      '
  DC  X'FE'
ML01111  EQU   *
  DC  CL75'I CAN''T BE OVERDRAWN, I STILL HAVE SOME CHECKS        '
  DC  X'FE'
ML01112  EQU   *
  DC  CL75'AGE IS A STATE OF MIND                                 '
  DC  CL75'DON''T ASK ME WHAT STATE I''M IN                       '
  DC  X'FE'
ML01113  EQU   *
  DC  CL75'I''M NOT DEAF                                          '
  DC  CL75'L'' IGNORING YOU                                       '
  DC  X'FE'
ML01114  EQU   *
  DC  CL75' I REFUSE TO HAVE A BATTLE OF WITS WITH AN             '
  DC  CL75'  UNARMED PERSON                                       '
  DC  X'FE'
ML01115  EQU   *
  DC  CL75'EVERYONE IS ENTITLED TO MY OPINION                     '
  DC  X'FE'
ML01116  EQU   *
  DC  CL75'AGE IS NOT IMPORTANT UNLESS YOU''RE A BOTTLE OF WINE   '
  DC  X'FE'
ML01117  EQU   *
  DC  CL75'WHOEVER SAYS MONEY CAN''T BUY HAPPINESS DOESN''T       '
  DC  CL75'KNOW WHERE TO SHOP                                     '
  DC  X'FE'
ML01118  EQU   *
  DC  CL75'I''M NOT OVERWEIGHT, I''M UNDERTALL                    '
  DC  X'FE'
ML01119  EQU   *
  DC  CL75'MONEY ISN''T EVERYTHING BUT IT SURE KEEPS THE          '
  DC  CL75'KIDS IN TOUCH                                          '
  DC  X'FE'
ML01120  EQU   *
  DC  CL75'LIFE IS TOO SHORT TO DRINK CHEAP WINE                  '
  DC  X'FE'
ML01121  EQU   *
  DC  CL75'NEUROTICS BUILD CASTLES IN THE SKY                     '
  DC  CL75'PSYCHOTICS LIVE IN THEM                                '
  DC  CL75'PSYCHOLOGISTS COLLECT THE RENT                         '
  DC  X'FE'
ML01122  EQU   *
  DC  CL75'MY TASTES ARE SIMPLE                                   '
  DC  CL75' I ONLY LIKE THE BEST                                  '
  DC  X'FE'
ML01123  EQU   *
  DC  CL75'LINDBERG WAS THE FIRST MAN TO FLY THE ATLANTIC ALONE   '
  DC  CL75'AND THE LAST TO ARRIVE THE SAME TIME AS HIS LUGGAGE    '
  DC  X'FE'
ML01124  EQU   *
  DC  CL75'LIGHTNING IS SAID NEVER STRIKES TWICE IN THE SAME PLACE'
  DC  CL75'UNLESS, OF COURSE, YOU LET YOUR INSURANCE LAPSE        '
  DC  X'FE'
ML01125  EQU   *
  DC  CL75'ALWAYS REMEMBER THAT WE PASS THIS WAY BUT ONCE, UNLESS '
  DC  CL75'YOU SPOUSE IS READING THE ROAD MAP                     '
  DC  X'FE'
ML01126  EQU   *
  DC  CL75'THE SAME WORK UNDER THE SAME CONDITIONS WILL BE        '
  DC  CL75'ESTIMATED DIFFERENTLY BY TEN DIFFERENT ESTIMATORS      '
  DC  CL75'OR BY ONE ESTIMATOR AT TEN DIFFERENT TIMES.            '
  DC  X'FE'
ML01127  EQU   *
  DC  CL75'THE MOST VALUABLE AND LEAST USED WORKD IN A PROJECT    '
  DC  CL75'MANAGER''S VOCABULARY IS "NO"                          '
  DC  X'FE'
ML01128  EQU   *
  DC  CL75'YOU CAN CON A SUCKER INTO COMMITTING AN UNREASONABLE   '
  DC  CL75'DEADLINE, BUT YOU CAN''T BULLY HIM INTO MEETING IT     '
  DC  X'FE'
ML01129  EQU   *
  DC  CL75'THE MORE RIDICULOUS THE DEADLINE, THE MORE IT COSTS TO '
  DC  CL75'TRY TO MEET IT                                         '
  DC  X'FE'
ML01130  EQU   *
  DC  CL75'THE MORE DESPERATE THE SITUATION, THE MORE OPTIMISTIC  '
  DC  CL75' THE SITUATEE                                          '
  DC  X'FE'
ML01131  EQU   *
  DC  CL75'TOO FEW PEOPLE ON A PROJECT CAN''T SOLVE THE PROBLEMS  '
  DC  CL75'TOO MANY CREATE MORE PROBLEMS THAN THEY SOLVE          '
  DC  X'FE'
ML01132  EQU   *
  DC  CL75'YOU CAN FREEZE THE USER''S SPECS BUT HE WON''T         '
  DC  CL75'STOP EXPECTING                                         '
  DC  X'FE'
ML01133  EQU   *
  DC  CL75'FROZEN SPECS AND THE ABOMINABLE SNOWMAN ARE ALIKE:     '
  DC  CL75'THEY ARE BOTH MYTH AND THEY BOTH MELT WHEN SUFFICIENT  '
  DC  CL75'HEAT IS APPLIED                                        '
  DC  X'FE'
ML01134  EQU   *
  DC  CL75'THE CONDITIONS ATTACHED TO A PROMISE ARE FORGOTTEN     '
  DC  CL75'AND THE PROMISE IS REMEMBERED                          '
  DC  X'FE'
ML01135  EQU   *
  DC  CL75'A USER WILL TELL YOU ANYTHING YOU ASK ABOUT-NORTHING MORE'
  DC  X'FE'
ML01136  EQU   *
  DC  CL75'OF SEVERAL POSSIBLE INTERPRETATIONS OF A COMMUNICATION '
  DC  CL75'THE LEAST CONVENIENT ONE IS THE ONLY CORRECT ONE       '
  DC  X'FE'
ML01137  EQU   *
  DC  CL75'WHAT IS NOT ON PAPER HAS NOT BEEN SAID                 '
  DC  X'FE'
ML01138  EQU   *
  DC  CL75'PARKINSON AND MURPHY ARE ALIVE AND WELL-IN YOUR PROJECT'
  DC  X'FE'
ML01139  EQU   *
  DC  CL75'I LEAD A LIFE OF WINE, WOMEN AND SONG -                '
  DC  CL75' IT''S CHEAPER THAN GAS, FOOD AND RENT                 '
  DC  X'FE'
ML01140  EQU   *
  DC  CL75'I''M NOT AFRAID OF THE UNKNOWN, THE STUFF WE ALREADY   '
  DC  CL75'KNOWS SCARES ME                                        '
  DC  X'FE'
ML01141  EQU   *
  DC  CL75'THE BEST CURE FOR INSOMNIA IS A MONDAY MORNING         '
  DC  X'FE'
ML01142  EQU   *
  DC  CL75'IT''S A STRANGE WORLD OF LANGUAGE IN WHICH SKATING ON  '
  DC  CL75'THIN ICE CAN GET YOU INTO HOT WATER                    '
  DC  X'FE'
ML01143  EQU   *
  DC  CL75'GOOD COMMUNICATION IS AS STIMULATING AS BLACK COFFEE   '
  DC  CL75'AND JUST AS HARD TO SLEEP AFTER                        '
  DC  X'FE'
ML01144  EQU   *
  DC  CL75'MONDAYS ARE THE POTHOLES IN THE ROAD OF LIFE           '
  DC  X'FE'
ML01145  EQU   *
  DC  CL75'THOSE WHO FLEE TEMPTATION GENERALLY LEAVE A            '
  DC  CL75'  FORWARDING ADDRESS                                   '
  DC  X'FE'
ML01146  EQU   *
  DC  CL75'WHEN YOU GET TO THE END OF YOUR ROPE, TIE A KNOT       '
  DC  CL75' AND HANG ON. AND SWING!                               '
  DC  X'FE'
ML01147  EQU   *
  DC  CL75'IGNORANCE DOESN''T KILL YOU, BUT IT MAKES YOU SWEAT A LOG'
  DC  X'FE'
ML01148  EQU   *
  DC  CL75'THE MORE EQUIPMENT YOU OWN, THE LESS THAT WILL WORK    '
  DC  X'FE'
ML01149  EQU   *
  DC  CL75'IF YOU FIX ONE THING ANOTHER THING BREAKS              '
  DC  X'FE'
ML01150  EQU   *
  DC  CL75'IF ONE THING BREAKS, ANOTHER THINGS MYSTERIOUSLY       '
  DC  CL75' RESUMES WORKING                                       '
  DC  X'FE'
ML01151  EQU   *
  DC  CL75'IF YOU WANT TO KNOW WHAT THE TEMPERATURE IS, COUNT     '
  DC  CL75'CRICKET CHIRPS FOR 14 SECONDS, THEN ADD 40. THAT''S    '
  DC  CL75'THE TEMPERATURE AT THE CRICKETS' LOCATION              '
  DC  X'FE'
ML01152  EQU   *
  DC  CL75'RMDS IS A FOUR LETTER WORD                             '
  DC  X'FE'
ML01153  EQU   *
  DC  CL75'ONE THING THAT''S GOOD ABOUT PROCRASTINATION IS THAT   '
  DC  CL75'YOU ALWAYS HAVE SOMETHING PLANNED FOR TOMORROW         '
  DC  X'FE'
ML01154  EQU   *
  DC  CL75'EVERY MORNING I GET UP AND LOOK THROUGHT THE FORBES    '
  DC  CL75'LIST OF THE RICHEST PEOPLE IN AMERICA. IF I''M NOT     '
  DC  CL75'THERE, I GO TO WORK.                                   '
  DC  X'FE'
ML01155  EQU   *
  DC  CL75'WHY IS IT THAT YOU NEVER GET A FLAT TIRE ON THE CURB SIDE'
  DC  X'FE'
ML01156  EQU   *
  DC  CL75' PEOPLE WHO ARRIVE LATE FOR THE THEATER NEVER HAVE     '
  DC  CL75' AISLE SEATS                                           '
  DC  X'FE'
ML01157  EQU   *
  DC  CL75'I''M ON A ROTATION DIET OF MY OWN. EVERY TIME I TURN   '
  DC  CL75'AROUND I EAT!                                          '
  DC  X'FE'
ML01158  EQU   *
  DC  CL75'THE NICE THING ABOUT BUYING BEER IS THAT NO ONE EVER   '
  DC  CL75' ASKS WHAT YEAR YOU WANT                               '
  DC  X'FE'
ML01159  EQU   *
  DC  CL75'HE''S THE KIND OF FRIEND YOU CAN DEPEND ON - ALWAYS    '
  DC  CL75'AROUND WHEN HE NEEDS YOU                               '
  DC  X'FE'
ML01160  EQU   *
  DC  CL75'I''M EXHAUSTED. I HAD TO KEEP INSISTING TO MY KIDS THAT'
  DC  CL75'I WAS SANTA CLAUS, AND TO MY WIFE THAT I WASN''T      '
  DC  X'FE'
ML01161  EQU   *
  DC  CL75'I DON''T MIND HIM BEING BORN AGAIN - BUT DID HE HAVE   '
  DC  CL75'TO COME BACK AS HIMSELF                                '
  DC  X'FE'
ML01162  EQU   *
  DC  CL75'I EAT FROM THE THREE BASIC FOOD                        '
  DC  CL75' GROUPS - CANNED, FROZEN AND TAKE-OUT                  '
  DC  X'FE'
ML01163  EQU   *
  DC  CL75'YES, THE DOCTOR HAS NO OBJECTIONS TO HOUSE CALLS.      '
  DC  CL75' WHAT TIME CAN YOU BE AT HIS HOUSE?                    '
  DC  X'FE'
ML01164  EQU   *
  DC  CL75'ANYONE WHO SAYS HE CAN SEE THROUGH WOMEN IS MISSING A LOT'
  DC  X'FE'
ML01165  EQU   *
  DC  CL75'MY PROGRAM   - A GEM OF ALGORISTIC PRECISION, OFFERING '
  DC  CL75'  THE MOST SUBLIME BALANCE BETWEEN COMPACT, EFFICIENT  '
  DC  CL75'  CODING ON THE ONE HAND, AND FULLY COMMENTED LEGIBILITY'
  DC  CL75'  FOR POSTERITY ON THE OTHER.                          '
  DC  CL75'YOUR PROGRAM - A MAZE OF NON SEQUITURS LITTERED WITH   '
  DC  CL75'  CLEVER-CLEVER TRICKS AND IRRELEVANT COMMENTS         '
  DC  X'FE'
ML01166  EQU   *
  DC  CL75' "START EVERY DAY OFF WITH A SMILE AND     '
  DC  CL75'   GET IT OVER WITH."                      '
  DC  CL75'                                           '
  DC  CL75'              W.C. FIELDS.                 '
  DC  X'FE'
ML01167  EQU   *
 DC C' OSBORNE COMPUTER SCHOOL OF ECONOMICS:                 '
 DC C' LOSE MONEY ON EACH ONE AND TRY TO MAKE IT UP ON THE VOLUME'
  DC  X'FE'
ML01168  EQU   *
  DC  CL75'TRUTH EMERGES MORE READILY FROM ERROR THEN FROM CONFUSION'
  DC  X'FE'
ML01169  EQU   *
  DC  CL75'THE EVOLUTION OF EVERY BUSINESS ENTERPRISE IS AWAY FROM'
  DC  CL75'QUALITY. PRODUCTS ALWAYS GET SMALLER, WORSE AND        '
  DC  CL75'MORE EXPENSIVE                                         '
  DC  X'FE'
ML01170  EQU   *
  DC  CL75'PEOPLE WILL GENERALLY ACCEPT FACTS AS TRUTH ONLY IF    '
  DC  CL75'THE FACTS AGREE WITH WHAT THEY ALREADY BELIEVE         '
  DC  X'FE'
ML01171  EQU   *
  DC  CL75'NO ONE WANTS TO READ A LOT OF GOOD WRITING. THERE''S   '
  DC  CL75' JUST SO MUCH GOOD WRTING A READER CAN TAKE.           '
  DC  X'FE'
ML01172  EQU   *
  DC  CL75'GETTING UP EARLY IN THE MORNING IS A GOOD WAY TO GAIN  '
  DC  CL75' RESPECT WITHOUT EVER ACTUALLY HAVING TO DO ANYTHING.  '
  DC  X'FE'
ML01173  EQU   *
  DC  CL75'NO MATTER HOW BIG THE UMBRELLA YOU CARRY OR HOW GOOD   '
  DC  CL75' YOUR RAINCOAT IS, IF IT RAINS YOU GET WET.            '
  DC  X'FE'
ML01174  EQU   *
  DC  CL75'IF DOGS COULD TALK, IT WOULD TAKE A LOT OF FUN OUT OF  '
  DC  CL75' OWNING ONE.                                           '
  DC  X'FE'
ML01175  EQU   *
  DC  CL75'WE''RE ALL PROUD OF ADMITTING LITTLE MISTAKES. IT GIVES'
  DC  CL75' US THE FEELING WE DON''T MAKE ANY BIG ONES            '
  DC  X'FE'
ML01176  EQU   *
  DC  CL75'PEOPLE WHO ARE WRONG SEEM TO TALK LOUDER THAN ANYONE ELSE'
  DC  X'FE'
ML01177  EQU   *
  DC  CL75'THERE AREN''T MANY TIMES IN YOUR LIFE WHEN YOUR BODY   '
  DC  CL75' HAS ABSOLUTELY NOTHING WRONG WITH IT                  '
  DC  X'FE'
ML01178  EQU   *
  DC  CL75'VACATIONS AREN''T NECESSARILY BETTER THAN OTHER TIMES, '
  DC  CL75' THEY''RE JUST DIFFERENT                               '
  DC  X'FE'
ML01179  EQU   *
  DC  CL75'KEY RING - A DEVICE FOR LOSING ALL YOUR KEYS AT ONCE   '
  DC  X'FE'
ML01180  EQU   *
  DC  CL75'POLITICS IS MORE DANGEROUS THEN WAR, FOR IN WAR YOU    '
  DC  CL75' ARE ONLY KILLED ONCE                                  '
  DC  X'FE'
ML01181  EQU   *
  DC  CL75'A CONSULTANT IS SOMEONE WHO BORROWS YOUR WATCH, THEN   '
  DC  CL75'GIVES YOU THE TIME                                     '
  DC  X'FE'
ML01182  EQU   *
  DC  CL75'PEOPLE WHO WRITE SUBSYSTEMS USUALLY USE FOUR LETTER WORDS'
  DC  X'FE'
ML01183  EQU   *
  DC  CL75'YOU CAN''T FOOL ALL THE PEOPLE ALL THE TIME            '
  DC  CL75'HIGHWAY - INTERCHANGE SIGNS COME PRETTY CLOSE, HOWEVER '
  DC  X'FE'
ML01184  EQU   *
  DC  CL75'HYPOCRISY IS THE HOMAGE THAT VICE PAYS TO VIRTURE      '
  DC  X'FE'
ML01185  EQU   *
  DC  CL75'HE WHO LAUGHS LAST PROBABLY HAS A BACKUP               '
  DC  X'FE'
ML01186  EQU   *
  DC  CL75'THE WORST WAY TO MAKE AN ARGUMENT IS BY REASON AND     '
  DC  CL75' GOOD INFORMATION.  YOU MUST APPEAL TO PEOPLE''S       '
  DC  CL75' EMOTIONS AND TO THEIR FEARS OF BEING MADE TO          '
  DC  CL75' LOOK RIDICULOUS.                                      '
  DC  X'FE'
ML01187  EQU   *
  DC  CL75'FEW THINGS ARE MORE SATISFYING THAN SEEING YOUR        '
  DC  CL75'CHILDREN HAVE TEENAGERS OF THEIR OWN                   '
  DC  X'FE'
ML01188  EQU   *
  DC  CL75'THE OPTIMIST IS THE KIND OF PERSON WHO BELIEVES A      '
  DC  CL75'HOUSEFLY IS LOOKING FOR A WAY OUT                      '
  DC  X'FE'
ML01189  EQU   *
  DC  CL75'COMEDY IS SIMPLY A FUNNY WAY OF BEING SERIOUS          '
  DC  X'FE'
ML01190  EQU   *
  DC  CL75'IT''S NOT EASY TAKING MY PROBLEMS ONE AT A TIME WHEN   '
  DC  CL75'THEY FUSE TO GET IN LINE                               '
  DC  X'FE'
ML01191  EQU   *
  DC  CL75'BE CAUTIOUS. OPPORTINITY DOES THE KNOCKING FOR         '
  DC  CL75' TEMPTATION TOO.                                       '
  DC  X'FE'
ML01192  EQU   *
  DC  CL75'THE IMPORTANT THING ABOUT YOU LOT IN LIFE IS WHETHER   '
  DC  CL75' YOU USE IT FOR BUILDING OR PARKING                    '
  DC  X'FE'
ML01193  EQU   *
  DC  CL75'I USED TO BE INDECISIVE, BUT NOW I''M NOT TO SURE      '
  DC  X'FE'
ML01194  EQU   *
  DC  CL75'WITH PROPER SLEEP, DIET AND CARE, A HEALTHY BODY       '
  DC  CL75' WILL LAST A LIFETIME                                  '
  DC  X'FE'
ML01195  EQU   *
  DC  CL75'WHILE MONEY CAN''T BUY EVERYTHING, IT CERTAINLY PUTS   '
  DC  CL75' YOU IN A GREAT BARGAINING POSITION                    '
  DC  X'FE'
ML01196  EQU   *
  DC  CL75'IF YOU WAIT FOR A REPAIRMAN, YOU''LL WAIT ALL DAY.     '
  DC  CL75' IF YOU GO OUT FOR FIVE MINUTES, HE''LL ARRIVE AND     '
  DC  CL75' LEAVE WHILE YOU''RE GONE.                             '
  DC  X'FE'
ML01197  EQU   *
  DC  CL75' ZUCCINI IS GREEN TOFU                                 '
  DC  X'FE'
ML01198  EQU   *
  DC  CL75'PEOPLE WHO HAVE THE MOST BIRTHDAYS LIVE THE LONGEST    '
  DC  X'FE'
ML01199  EQU   *
  DC  CL75'INSIDE THIS BODY IS A THIN PERSON SCREAMING TO GET OUT '
  DC  CL75'   ...I ATE HER                                        '
  DC  X'FE'
ML01200  EQU   *
  DC  CL75'IF A SEVERE PROBLEM MANIFESTS ITSELF, NO SOLUTION IS   '
  DC  CL75' ACCEPTABLE UNLESS IT IS INVOLVED, EXPENSIVE AND       '
  DC  CL75' TIME CONSUMING                                        '
  DC  X'FE'
ML01201  EQU   *
  DC  CL75'EVERYTHING TAKES LONGER THAN IT TAKES                  '
  DC  X'FE'
ML01202  EQU   *
  DC  CL75'NOTHING IS IMPOSSIBLE FOR THE PERSON WHO DOESN''T      '
  DC  CL75'  HAVE TO DO IT                                        '
  DC  X'FE'
ML01203  EQU   *
  DC  CL75'IN GOD WE TRUST. ALL OTHERS WE POLYGRAPH               '
  DC  X'FE'
ML01204  EQU   *
  DC  CL75'IT''S THE LUCK OF THE DRAW:                            '
  DC  CL75'   SOMETIMES YOU GET THE ELEVATOR                      '
  DC  CL75'   SOMETIMES YOU GET THE SHAFT                         '
  DC  X'FE'
ML01205  EQU   *
  DC  CL75'IF YOU DON''T FIND ME HERE LOOK THERE.'
  DC  CL75'IF I''M NOT THERE THEN TRY SOME WHERE ELSE.'
  DC  CL75'IF YOU STILL CAN''T FIND ME THEN I DON''T WANT TO'
  DC  CL75'    FOUND.'
  DC  X'FE'
ML01206  EQU   *
  DC  CL75'UPPER MANAGEMENT IS WHERE PROGRAMMERS GO WHEN'
  DC  CL75'THEY HAVE FORGOTTEN HOW TO PROGRAM.'
  DC  X'FE'
ML01207  EQU   *
  DC  CL75'PROGRAMMERS ARE THE WORKERS.'
  DC  CL75'MANAGEMENT IS WHAT IS LEFT OVER.'
  DC  X'FE'
ML01208  EQU   *
  DC  CL75'THE DAY YOUR SHIP COMES IN'
  DC  CL75'YOU WILL PROBABLY BE AT THE AIRPORT.'
  DC  X'FE'
ML01209  EQU   *
  DC  CL75'AFTER ALL IS SAID AND DONE, A HELL OF A LOT MORE IS    '
  DC  CL75'SAID THAN DONE                                         '
  DC  X'FE'
ML01210  EQU   *
  DC  CL75'IF IT''S NOT IN THE COMPUTER, IT DOESN''T EXIST        '
  DC  X'FE'
ML01211  EQU   *
  DC  CL75'NEVER WRESTLE WITH A PIG, YOU BOTH GET DIRT, AND THE   '
  DC  CL75'PIG LIKES IT                                           '
  DC  X'FE'
ML01212  EQU   *
  DC  CL75'NEVER ARGUE WITH AN IDOT: PEOPLE WATCHING MAY NOT BE   '
  DC  CL75'ABLE TO TELL THE DIFFERENCE                            '
  DC  X'FE'
ML01213  EQU   *
  DC  CL75'DON''T FIGHT WITH A BEAR IN HIS OWN CAGE               '
  DC  X'FE'
ML01214  EQU   *
  DC  CL75'THE SIX STEPS OF PROGRAM MANAGEMENT ARE:               '
  DC  CL75'     1. WILD ENTHUSIASM                                '
  DC  CL75'     2. DISENCHANTMENT                                 '
  DC  CL75'     3. TOTAL CONFUSION                                '
  DC  CL75'     4. SEARCH FOR THE GUILTY                          '
  DC  CL75'     5. PUNISHMENT OF THE INNOCENT                     '
  DC  CL75'     6. PROMOTION OF THE NON-PARTICIPANTS              '
  DC  X'FE'
ML01215  EQU   *
  DC  CL75'HE WHO HESITATES IS NOT ONLY LOST, BUT SEVERAL MILES   '
  DC  CL75'FROM THE NEXT FREEWAY EXIT                             '
  DC  X'FE'
ML01216  EQU   *
  DC  CL75'AN EXPERT DOESN''T KNOW ANY MORE THAN YOU DO, HE OR SHE'
  DC  CL75'IS MERELY BETTER ORGANIZED AND USES SLIDES             '
  DC  X'FE'
ML01217  EQU   *
  DC  CL75'NOTHING IS IMPOSSIBLE FOR THE PERSON WHO DOESN''T HAVE '
  DC  CL75'TO DO IT HIMSELF/HERSELF                               '
  DC  X'FE'
ML01218  EQU   *
  DC  CL75'YOU CAN LEAD A HORSE TO WATER, BUT IF YOU CAN GET HIM TO'
  DC  CL75'FLOAT ON HIS BACK, YOU''VE REALLY GOT SOMETHING        '
  DC  X'FE'
ML01219  EQU   *
  DC  CL75'YOU WIN SOME, LOSE SOME, AND SOME GET RAINED OUT: BUT YOU'
  DC  CL75'GOTTA SUIT UP FOR THEM ALL                             '
  DC  X'FE'
ML01220  EQU   *
  DC  CL75'PEOPLE ARE PROMOTED NOT BY WHAT THEY CAN DO, BUT WHAT  '
  DC  CL75'PEOPLE THINK THEY CAN DO                               '
  DC  X'FE'
ML01221  EQU   *
  DC  CL75'DON''T SOME IN BED - THE ASHES ON THE FLOOR MIGHT BE YOURS'
  DC  X'FE'
ML01222  EQU   *
  DC  CL75'THE ONLY THING WE LEARN FROM HISTORY IS THAT WE LEARN  '
  DC  CL75' NOTHING FROM HISTORY                                  '
  DC  X'FE'
ML01223  EQU   *
  DC  CL75'HUMPTY DUMPTY WAS PUSHED                               '
  DC  X'FE'
ML01224  EQU   *
  DC  CL75'FORGETFULLNESS IS A SIGN OF GENUIS,                    '
  DC  CL75' BUT I FORGOT WHO SAID IT                              '
  DC  X'FE'
ML01225  EQU   *
  DC  CL75' THE GREAT DEBUGGER IS..........                      ^'
  DC  CL75'   METHODICAL, PERSISTEND "DETECTIVE" SEARCHING OUT   ^'
  DC  CL75'   THE GUILTY PERPETRATORS OF PROGRAMMING CRIMES      ^'
  DC  X'FE'
ML01226  EQU   *
  DC  CL75' THE GREAT DEBUGGER IS..........                      ^'
  DC  CL75'   LOOKING FOR THE PROVERBIAL NEEDLE-IN-THE-HAYSTACK; ^'
  DC  CL75'   A BUG IS ONLY A FEW BITS OUT OF 100 MILLION ZEROES ^'
  DC  CL75'   AND ONES                                           ^'
  DC  X'FE'
ML01227  EQU   *
  DC  CL75' THE GREAT DEBUGGER IS..........                      ^'
  DC  CL75'   MUST USE MANY DIFFERENT TOOLS, NEVER RELYING ON JUST ONE'
  DC  X'FE'
ML01228  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01229  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01230  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01231  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01232  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01233  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01234  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01235  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01236  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01237  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01238  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01239  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01240  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01241  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01242  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01243  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01244  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01245  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01246  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01247  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01248  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01249  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01250  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01251  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01252  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01253  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01254  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01255  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01256  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01257  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01258  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01259  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01260  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01261  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01262  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01263  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01264  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01265  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01266  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01267  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01268  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01269  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01270  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01271  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01272  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01273  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01274  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01275  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01276  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01277  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01278  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01279  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01280  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01281  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01282  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01283  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01284  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01285  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01286  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01287  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01288  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01289  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01290  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01291  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01292  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01293  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01294  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01295  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01296  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01297  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01298  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01299  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01300  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01301  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01302  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01303  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01304  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01305  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01306  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01307  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01308  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01309  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01310  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01311  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01312  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01313  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01314  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01315  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01316  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01317  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01318  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01319  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01320  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01321  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01322  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01323  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01324  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01325  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01326  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01327  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01328  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01329  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01330  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01331  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01332  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01333  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01334  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01335  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01336  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01337  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01338  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01339  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01340  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01341  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01342  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01343  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01344  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01345  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01346  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01347  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01348  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01349  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01350  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01351  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01352  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01353  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01354  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01355  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01356  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01357  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01358  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01359  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01360  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01361  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01362  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01363  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01364  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01365  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01366  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01367  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01368  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01369  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01370  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01371  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01372  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01373  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01374  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01375  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01376  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01377  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01378  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01379  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01380  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01381  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01382  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01383  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01384  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01385  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01386  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01387  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01388  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01389  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01390  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01391  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01392  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01393  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01394  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01395  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01396  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01397  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01398  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01399  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01400  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01401  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01402  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01403  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01404  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01405  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01406  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01407  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01408  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01409  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01410  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01411  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01412  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01413  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01414  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01415  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01416  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01417  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01418  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01419  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01420  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01421  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01422  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01423  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01424  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01425  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01426  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01427  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01428  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01429  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01430  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01431  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01432  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01433  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01434  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01435  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01436  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01437  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01438  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01439  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01440  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01441  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01442  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01443  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01444  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01445  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01446  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01447  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01448  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01449  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01450  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01451  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01452  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01453  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01454  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01455  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01456  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01457  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01458  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01459  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01460  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01461  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01462  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01463  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01464  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01465  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01466  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01467  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01468  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01469  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01470  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01471  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01472  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01473  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01474  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01475  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01476  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01477  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01478  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01479  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01480  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01481  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01482  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01483  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01484  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01485  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01486  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01487  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01488  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01489  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01490  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01491  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01492  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01493  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01494  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01495  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01496  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01497  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01498  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01499  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01500  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01501  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01502  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01503  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01504  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01505  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01506  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01507  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01508  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01509  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01510  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01511  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01512  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01513  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01514  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01515  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01516  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01517  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01518  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01519  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01520  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01521  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01522  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01523  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01524  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01525  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01526  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01527  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01528  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01529  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01530  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01531  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01532  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01533  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01534  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01535  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01536  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01537  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01538  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01539  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01540  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01541  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01542  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01543  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01544  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01545  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01546  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01547  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01548  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01549  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01550  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01551  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01552  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01553  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01554  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01555  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01556  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01557  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01558  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01559  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01560  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01561  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01562  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01563  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01564  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01565  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01566  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01567  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01568  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01569  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01570  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01571  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01572  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01573  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01574  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01575  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01576  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01577  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01578  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01579  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01580  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01581  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01582  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01583  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01584  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01585  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01586  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01587  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01588  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01589  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01590  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01591  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01592  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01593  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01594  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01595  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01596  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01597  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01598  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01599  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01600  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
ML01601  EQU   *
  DC  CL75'                                                      ^'
  DC  CL75'                                                      ^'
  DC  X'FE'
   END
// EXEC LINKX,SO=A,NAME=CBT1660,LIB='SYS2.MLINKLIB'
