         MACRO
         IEFWKTAB
* 002800                                                         A24901
*                                                                 19200
         EJECT
*              MARCH 30,1965
         DS    0F
AWTCTROL DSECT
*                        ALLOCATE TABLES CONTROL
AWTCCLTB DS    F         CHANNEL LOAD TABLE
AWTCFEVS DS    F         FIRST EMPTY VOLUME SLOT IN AWT
AWTCPUDT DS    F         POTENTIAL USER ON DEVICE TABLE
AWTCWTST DS    F         START ADDRESS OF WORK TABLE
AWTCSTVB DS    F         START OF WORK TABLE VOL BLOCK
AWTCSCTV DS    F         START OF SCT VOL BLOCK
AWTCSBIT DS    F             POINTER TO RECOVERY BIT PATTERN     A24901
AWTCCALE DS    H         COUNT OF ALLOCATED ENTRIES
AWTCCUAE DS    H         COUNT OF UNALLOCATED ENTRIES
AWTCWTSZ DS    H         SIZE OF WORK TABLE ENTRY (BYTES)
AWTCNSEP DS    H         NO. WORK TABLE ENTRIES WITH SEP.
AWTCNBPW DS    H         NO. OF BIT PATTERN WORDS
AWTCNDDC DS    H         NO. OF DDS
AWTCNVAF DS    H        NUMBER OF VOL AFFINITY CHAINS
AWTCNDEV DS    H         NUMBER OF DEVICES IN SYSTEM
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *
         EJECT
         DS    0F
AWT      EQU   *
*                        ALLOCATE WORK TABLE
AWTEPDEV DS    XL2       POSSIBLE NUMBER OF DEVICES IN PRIM BIT PAT000G
AWTEDPND DS    XL1       INTRASTEP SUBALLOCATE/POOL/SPLIT LINK
AWTERDEV DS    XL1       NUMBER OF REQUESTED DEVICES
AWTESTTA DS    XL1       STATUS A
*
AWTDUMMY EQU   128       BIT 0 DUMMY DATA SET
AWTSYSIN EQU   64        BIT 1 SYSIN DATA SET
AWTSPLTP EQU   32        BIT 2 SPLIT (PRIMARY)
AWTSPLTS EQU   16        BIT 3 SPLIT (SECONDARY)
AWTSBALC EQU   8         BIT 4 SUBALLOCATE
AWTPARMT EQU   4         BIT 5 PAR. MOUNT
AWTUNAFF EQU   2         BIT 6 UNIT AFFINITY
AWTUNSEP EQU   1         BIT 7 UNIT SEPARATION
*
AWTESTTB DS    XL1       STATUS B
*
AWTCHAFF EQU   128       BIT 0 CHANNEL AFFINITY
AWTCHSEP EQU   64        BIT 1 CHANNEL SEPARATION
AWTVOLAF EQU   32        BIT 2 VOLUME AFFINITY
AWTJOBLB EQU   16        BIT 3 JOBLIB DD STMNT
AWTUNLBD EQU   8         BIT 4 UNLABELED
AWTLABEL EQU   4         BIT 5 NON STANDARD LABEL                  000D
AWTDEFER EQU   2         BIT 6 DEFER MOUNTING
AWTRECVD EQU   1         BIT 7 RECEIVED DATA SET
*
AWTESTTC DS    XL1       STATUS C
*
AWTEBIT1 EQU   128       BIT 0 WORK
AWTRETAI EQU   64        BIT 1 RETAIN
AWTPRIV  EQU   32        BIT 2 PRIVATE
AWTPASS  EQU   16        BIT 3 PASS
AWTPOOLR EQU   8         BIT 4 POOL REFERENCE
AWTDADSM EQU   4         BIT 5 DADSM REQUIRED
AWTEBIT2 EQU   2         BIT 6 WORK
AWTEBIT3 EQU   1         BIT 7 WORK
*
AWTESTTD DS    XL1       STATUS D
*
AWTAVR0  EQU   128                 STORAGE VOLUME REQUESTED.
* NO STORAGE VOLUMES.  VOLUME=PRIVATE ASSUMED.
AWTAVR1  EQU   64        BIT 1 PRIV. VOL. D.A.  NO.VOL SER (AVR)
AWTAVR2  EQU   32        BIT 2 SCRATCH TAPE REQUEST (AVR)
AWTEALOC EQU   16        BIT 3 ALLOCATED
AWTESYSO EQU   8         BIT 4 SYSOUT
AWTEISSA EQU   2         BIT 6 INTRASTEP SUBALLOCATE
*
AWTENVOL DS    XL1       NUMBER OF VOLUMES                         000G
AWTEADEV DS    XL1       NUMBER OF DEVICES ALLOCATED
AWTESHDV DS    XL1       NUMBER OF DEVICES SHARED
AWTEUDEV DS    XL1       NUMBER OF DEVICES USED
AWTELINK DS    XL1       UNIT AFFINITY LINK
AWTESTT1 DS    XL1                     STATUS BYTE 1              19200
AWTSASCI EQU   128                     USASI LABEL BIT           19200
AWTRECOV EQU   64                  HAVE RECOVERED BIT            A24901
AWTEFVOL DS    XL2       RELATIVE POINTER TO VOL BLOCK
AWTESDEV DS    XL2       POSSIBLE NUMBER OF DEVICES IN SEC. BIT PAT000G
AWTEDDNM DS    XL1      INTERNAL DATA SET NUMBER
         DS    XL1       RESERVED
AWTETYPE DS    XL4       DEVICE TYPE CODE
AWTESRTS DS    XL4       PRIMARY BIT PATTERN
AWTESBIT DS    XL4       SECONDARY BIT PATTERN
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *
         DS    0F
AVT      EQU   *                             START OF VOL BLOCK ENTRIES
*                        ALLOCATE VOLUME TABLE
AVTEDDNM DS    XL1       INTERNAL DD NUMBER
AVTESTTE DS    XL1       STATUS E
*
AVTNOVID EQU   16        BIT 3 NO VOL ID IN SCT VOL BLOCK
AVTVOLAF EQU   1         BIT 7 VOL AFF - NO VOL ID IN SCT
*
AVTERSRT DS    XL2       RELATIVE SRT POINTER
AVTEVPTR DS    XL2       RELATIVE VOL. SER. PTR.
AVTEVAFL DS    XL2       RELATIVE VOL. AFF. PTR
AVTESERP EQU   AVTEVPTR
AVTEVOLK EQU   AVTEVAFL
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *
         MEND
