*
*        %GOTO QDBL1;  /*
         MACRO
         IHAQDB &DSECT=YES    */
*%QDBL1 : ;
*
*/* **************************************************************** */
*/*                                                                  */
*/*                         QUEUE DESCRIPTOR BLOCK                   */
*/*                                                                  */
*/*  OS/VS2 RELEASE 2, 08/02/72, LEVEL=1                             */
*/*                                                                  */
*/*  METHOD OF ACCESS                                                */
*/*      BAL   - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.     */
*/*              USING ON QDB GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */
*/*      PL/S  - DCL QDBPTR PTR                                      */
*/*                                                                  */
*/* **************************************************************** */
*%GOTO QDBL2;  /*
         SPACE 1
         AIF ('DSECT' EQ 'NO').QDB10
QDB      DSECT
         AGO   .QDB20
.QDB10    ANOP
         DS    0D
QDB      EQU   *
.QDB20   ANOP
QDBQDB   DS    CL4 -          ACRONYM IN EBCDIC -QDB-
QDBATTR  DS    BL2 -          QUEUE ATTRIBUTES
QDBRV001 DS    H -            RESERVED
QDBNELMS DS    F -            NUMBER OF ELEMENTS ON QUEUE
QDBFELMP DS    A -            POINTER TO FIRST ELEMENT
QDBLELMP DS    A -            POINTER TO LAST ELEMENT
QDBFPTDS DS    H -            FORWARD POINTER DISPLACEMENT
QDBBPTDS DS    H -            BACKWARD POINTER DISPLACEMENT
QDBPRSZ  DS    H -            PRIORITY FIELD SIZE
QDBPRDS  DS    H -            PRIORITY FIELD DISPLACEMENT
QDBRV002 DS    A -            RESERVED
         MEND  , -  */
*%QDBL2 : ;
*
*DECLARE
*  1 QDB     BASED(QDBPTR)  BDY(WORD),
*   2 QDBQDB      CHAR(4) BDY(WORD),     /* ACRONYM IN EBCIDIC -QDB- */
*   2 QDBATTR     CHAR(2),               /* QUEUE ATTRIBUTES         */
*   2 QDBRV001    FIXED(15),             /* RESERVED                 */
*   2 QDBNELMS    FIXED(31),             /* NUMBER OF ELEMENTS ON
*                                           QUEUE                    */
*   2 QDBFELMP    PTR(31),               /* POINTER TO FIRST ELEMENT */
*   2 QDBLELMP    PTR(31),               /* POINTER TO LAST ELEMENT  */
*   2 QDBFPTDS    FIXED(15),             /* FORWARD POINTER
*                                           DISPLACEMENT             */
*   2 QDBBPTDS    FIXED(15),             /* BACKWARD POINTER
*                                           DISPLACEMENT             */
*   2 QDBPRSZ     FIXED(15),             /* PRIORITY FIELD SIZE      */
*   2 QDBPRDS     FIXED(15),             /* PRIORITY FIELD
*                                           DISPLACEMENT             */
*   2 QDBRV002    PTR(31);               /* RESERVED                 */
