         MACRO
         GPUSTOP
         SPACE
*   *     *     *     *     *     *     *     *     *     *     *
*  ***   ***   ***   ***   ***   ***   ***   ***   ***   ***   ***
* ***** ***** ***** ***** ***** ***** ***** ***** ***** ***** *****
* *****************   G. P. U. LOCAL MODIFICATION ******************
         SPACE 2
         MEND
