         TITLE 'ISTINCMS: TOLTEP INTERFACE ROUTINE                     *
                        '
ISTINCMS CSECT ,                                                   0001
@MAINENT BALR  @15,0                                               0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTINCMS  78.205'                                 0001
         DROP  @15
@PROLOG  BALR  @07,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@07                                         0001
*                                                                  0006
* /*                   END OF CVT MACRO                              */
*                                                                  0007
* DO;                                                              0007
*/***  CRRMAINT  PROCNM(ISTINCMS)COMP(VY)FUNC(MAIN)  ***/          0008
* DCL CMZK0002 PTR(31) REG(1);                                     0008
* RFY (CMZK0002) RSTD;                                             0009
*                                                                  0009
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0010
*/* RPL HEADER                                                        *
*/*  REVISIONS                                         006 04/09/75   *
*DCL RPHPTR PTR(31) REGISTER(1) RESTRICTED;                        0010
*DCL  1  ISTRPH BDY(WORD) BASED(RPHPTR),                           0011
*       2  RPHCNTL FIXED(32),          /* CONTROL INFORMATION         *
*       3  RPHTYPE CHAR(1),            /* CONTROL BLOCK TYPE          *
*       3  RPHLNGTH PTR(8),            /* LENGTH IN BYTES             *
*       3  RPHFLAGS BIT(8),            /* SYSTEM DEPENDENT FLAGS      *
*         4  RPHOGIND BIT(1),          /* OPEN GATE INDICATOR         *
*         4  RPHSPGIN BIT(1),          /* SPECIAL GATE OPEN IND.      *
*         4  RPHAPTYP BIT(1),          /* APS IS A USER EXIT          *
*            5  RPHAUTEX BIT(1),        /*EXIT TO AUTHORIZED USER VS2 *
*         4  RPHSMQ BIT(1),            /* INDICATOR IF RPH IS TO BE   *
*                                      /* QUEUED                      *
*         4  RPHSMTYP BIT(1),          /* REQUEST TYPE IS BUFFER OR   *
*                                      /* DOUBLE-WORD                 *
*         4  RPHSMCLR BIT(1),          /* INDICATOR IF BUFFER TO BE   *
*                                      /* CLEARED                     *
*           4  RPHMLTCP BIT(1),        /* USED BY LOCAL 3270  SUPPORT *
*                                      /* WHEN BUILDING MULTIPLE CHAN *
*                                      /* PROGRAM                     *
*           4  RPHFSTLC BIT(1),        /* USED BY LOCAL 3270 SUPPORT  *
*                                      /* TO INDICATE FIRST LCCW      *
*              5  RPHFNFLG BIT(1),     /* LCCW SET FUNCTION FLAGS     *
*        3  RPHFLGB BIT(8),            /* SECOND FLAG BYTE            *
*           4  RPHLOCK BIT(1),         /* LOCKING OPTION              *
*           4  RPHBSSP BIT(1),         /* SYSTEM SERVICES PROGRESS    *
*           4  RPHFBAPS BIT(1),        /* STG. OBTAINED BY APS        *
*           4  RPHPGCMP BIT(1),        /* BIT ON INDICATES RESOURCE   *
*                                      /* MGR HAS COMPLETED UNLOCK    *
*           4  RPHNRSAV BIT(1),        /* DO NOT SAVE ON ACTIVATE     *
*           4  RPHRLCRA BIT(1),        /* RPH CAN BE RELEASED         *
*                                      /* WHEN PURGE COMPLETE         *
*           4  *        BIT(2),        /* RESERVED                    *
*       2  RPHRPHA PTR(31),            /* ADDR.OF NEXT RPL HEADER     *
*         3  RPHCVFLG BIT(8),          /*                    @ZA30004*/
*           4  RPHGATE BIT(1),         /* GATING FLAG                 *
*             5  RPHVYRPH BIT(1),      /* THIS IS VARYS RPH   @ZA30004*
*           4  RPHPSRPH BIT(1),        /*WAIT ON PORTSOL PURGE@ZA30004*
*           4  RPHCDRPH BIT(1),        /*WAIT ON CLSDST PURGE @ZA30004*
*           4  RPHOWRPH BIT(1),        /* WAIT ON OWN PURGE   @ZA30004*
*           4  RPHFRRPH BIT (1),       /* WAIT IN OCCFR       @ZA30004*
*           4  *       BIT(3),         /* RESERVED                    *
*         3  RPHRPHAP PTR(24),         /* RPH WAITING ON PURGE        *
*       2  RPHTSKID PTR(31),           /* TASK IDENTIFICATION         *
*                                      /* OR ADDR.OF APS TABLE        *
*          3  *     CHAR(3),           /* RPH TSK ID                  *
*          3  RPHTIK PTR(8),           /* TIK                         *
*       2  RPHDVTA PTR(31),            /* ADDR.OF  CURRENT DVT        *
*       2  RPHRESMA PTR(31) BDY(WORD), /* TPWAIT-POST INFO */      0011
*         3 RPHWPFLG CHAR(1),          /* WAIT-POST FLAGS */       0011
*           4 RPHRSKEY BIT(4),         /* STORAGE PROTECT KEY TO RESUME
*                                         PROCESSING                  *
*           4 RPHWT BIT(1),            /* WAIT BIT */              0011
*           4 RPHPT BIT(1),            /* POST BIT */              0011
*           4 RPHPURGE BIT(1),         /* RPH FLAGGED BY RECOVERY    */
*                                      /* TO BE PURGED BY PSS        */
*                                      /* VS/2 ONLY                  */
*           4 RPHRSV01 BIT(1),        /* RESERVED                    */
*         3 RPHRESUM PTR(24),          /* RESUME ADDRESS */        0011
*       2  RPHPABOF PTR(8),            /* OFFSET OF PAB IN CONTROL BLK*
*       2  RPHMAJCB PTR(24),           /* ADDR.OF MAJOR CONTROL BLOCK *
*       2  RPHWEA PTR(31),             /* ADDR.OF WORK ELEMENT        *
*         3  RPHCSPA PTR(31),          /* ADDR OF ISTCSP              *
*           4  RPHWEGT BIT(1),         /* GATE FOR WORK ELEMENT PROC. *
*       2  RPHSRPRM PTR(31),           /* SERVICE ROUTINE PARM.FIELD  *
*         3 RPHSRP12 FIXED(15),        /* COUNT OF Q'ED SMS REQUESTS  *
*         3 RPHSRP34 FIXED(15),        /* SIZE OF Q'ED SMS REQUESTS   *
*       2  RPHCRR PTR(31),             /* ADDR.OF COMPONENT RECOVERY  *
*                                      /* RECORD                      *
*       2  RPHPABQA PTR(31),           /* PAB QUEUE ADDRESS           *
*          3 RPHPABFG CHAR(1),         /* FLAG BYTE CARRIED FROM PAB  *
*          3 RPHPABQP PTR(24),         /* POINTER TO QUEUE OF PAB'S   *
*       2  RPHWORK CHAR(64) BDY(WORD), /* 16 WORD WORK AREA           *
*         3  RPHSAVE1 FIXED(31),       /*                             *
*           4  RPHSBYTE CHAR(1),       /* 1-BYTE SAVE FIELD           *
*           4  RPHSBITS BIT(8),        /* SAVE FIELD FOR FLAG BYTE    *
*              5  RPHSBIT1 BIT(1),     /* 1ST SAVE FIELD              *
*              5  RPHSBIT2 BIT(1),     /* 2ND SAVE FIELD              *
*              5  RPHSBIT3 BIT(1),     /* 3RD SAVE FIELD              *
*              5  RPHSBIT4 BIT(1),     /* 4TH SAVE FIELD              *
*              5  RPHSBIT5 BIT(1),     /* 5TH SAVE FIELD              *
*              5  RPHSBIT6 BIT(1),     /* 6TH SAVE FIELD              *
*              5  RPHSBIT7 BIT(1),     /* 7TH SAVE FIELD              *
*              5  RPHSBIT8 BIT(1),     /* 8TH SAVE FIELD              *
*           4  RPHSHALF FIXED(15),     /* HALF WORD SAVE AREA         *
*         3  RPHSAVE2 FIXED(31),       /*                             *
*         3  RPHSAVE3 FIXED(31),       /*                             *
*         3  RPHSAVE4 FIXED(31),       /*                             *
*         3  RPHSAVE5 FIXED(31),       /*                             *
*         3  RPHSAVE6 FIXED(31),       /*                             *
*         3  RPHSAVE7 FIXED(31),       /*                             *
*         3  RPHSAVE8 FIXED(31),       /*                             *
*         3  RPHSAVE9 FIXED(31),       /*                             *
*         3  RPHSAV10 FIXED(31),       /*                             *
*         3  RPHSAV11 FIXED(31),       /*                             *
*         3  RPHSAV12 FIXED(31),       /*                             *
*         3  RPHSAV13 FIXED(31),       /*                             *
*         3  RPHSAV14 FIXED(31),       /*                             *
*         3  RPHSAV15 FIXED(31),       /*                             *
*         3  RPHSAV16 FIXED(31),       /*                             *
*       2  RPHNEXPO PTR(31);           /* ADDR.NEXT RPH TO BE POSTED  *
* DCL RPTYPE BIT(8) CONSTANT('01'X);   /* TYPE CODE FOR RPH           *
* DCL RPHWT0 BIT(32) CONSTANT('F7FFFFFF'X);   /* TURN RPHWT OFF */ 0013
* DCL RPHWT1 BIT(32) CONSTANT('08000000'X);   /* TURN RPHWT ON */  0014
* DCL RPHPT0 BIT(32) CONSTANT('FBFFFFFF'X);   /* TURN RPHPT OFF */ 0015
* DCL RPHPT1 BIT(32) CONSTANT('04000000'X);   /* TURN RPHPT ON */  0016
* DCL RPHPABQ1 BIT(24) CONSTANT('000000'X); /* TURN RPHPBQ GATE */ 0017
*/* LOGICAL CHANNEL COMMAND WORD                                      *
*/* ADD A DECLARE                                      003 10/18/74   *
*DCL  1  ISTLCCW BDY(WORD) BASED,                                  0018
*        2  LCCWOP    CHAR(1),         /* OPERATION CODE -CONTROL     *
*           3  LCCWSI BIT(1),          /* SESS INIT / START DIALOG FLG*
*           3  LCCWSD BIT(1),          /* SESS DISCON/END DIALOG FLG  *
*           3  LCCWRWOP BIT(6),        /* READ/WRITE OPERATION CODE   *
*              4  * BIT(1),            /* RESERVED                    *
*              4  LCCWSOP BIT(1),      /* SPECIAL OPERATION LIKE   0018
*                                         ERASE OR READ CONT          *
*              4  LCCWCTL BIT(4),      /* CONTROL TYPE                *
*                 5  LCCWMODE BIT(2),  /* MODE TYPE                   *
*                 5  LCCWTYPE BIT(2),  /* OPERATION TYPE              *
*        2  LCCWFLAG  CHAR(1),         /* FLAG BYTE                   *
*           3  LCCWCD BIT(1),          /* CHAIN DATA                  *
*           3  LCCWCC BIT(1),          /* CHAIN COMMAND               *
*           3  LCCWCKPT BIT(1),        /* SUPPRESS 3705 CHECK POINT
*                                         RECORD                      *
*           3  LCCWNTVC BIT(1),        /* DO NOT PERFORM VALCHEK      *
*           3  LCCWIDAT BIT(1),        /* LCCWDATA CONTAINS DATA      *
*           3  LCCWLSI BIT(1),         /* LCCW SYNCH INDICATOR        *
*              4  LCCWPER BIT(1),      /* POST=RESP                   *
*           3  LCCWRFI BIT(1),         /* REQUEST FEEDBACK INDICATOR  *
*           3  LCCWACI BIT(1),         /* ADDITION COMMAND INDICATOR  *
*        2  LCCWCNT FIXED(16),         /* DATA COUNT                  *
*        2  LCCWDATA PTR(31);          /* DATA ADDRESS OR IMMED. DATA *
*/* LOGICAL COMMAND CODES */                                       0019
*DCL  LXDQ     BIT(8) CONSTANT('3B'X), /* RESET DEVICE QUEUE          *
*     LXEC     BIT(8) CONSTANT('4B'X), /* RESET AT END OF COMMAND     *
*     LXO      BIT(8) CONSTANT('5B'X), /* RESET ORDERLY               *
*     LCCWPRGE BIT(8) CONSTANT('6B'X), /* PURGE                       *
*     LWH      BIT(8) CONSTANT('0F'X), /* WRITE HEADER INDI. 1ST BLOCK*
*     LWRVI    BIT(8) CONSTANT('1F'X), /* WRITE RVI                   *
*     LWNA     BIT(8) CONSTANT('2F'X), /* WRITE NEGATIVE ACK          *
*     LWAA     BIT(8) CONSTANT('3F'X), /* WRITE ALTERNATE ACK         *
*     LWPLG    BIT(8) CONSTANT('5F'X), /* WRITE ACK LEADING GRAPHICS  *
*     LWNLG    BIT(8) CONSTANT('6F'X), /* WRITE NACK LEADING GRAPHICS *
*     LSMDE    BIT(8) CONSTANT('4F'X), /* SET MODE                    *
*     LIFBM    BIT(8) CONSTANT('7F'X), /* INDIC 1ST BLOCK OF MESSAGE  *
*     LTEST    BIT(8) CONSTANT('FE'X), /* TEST LCCW                   *
*     LPRMPT   BIT(8) CONSTANT('13'X), /* PREEMPT LCCW                *
*     LRSTR    BIT(8) CONSTANT('43'X), /* RESTORE LCCW                *
*     LEXEC    BIT(8) CONSTANT('FF'X), /* SPECIAL CONTROL OPERATION   *
*     LREAD    BIT(2) CONSTANT('10'B),  /* READ TYPE LCCW             *
*     LWRITE   BIT(2) CONSTANT('01'B),  /* WRITE TYPE LCCW            *
*     LCNTRL   BIT(2) CONSTANT('11'B),  /* CONTROL TYPE LCCW          *
*     LRESET   BIT(4) CONSTANT('1011'B),/* RESET COMMANDS             *
*     LTIC     BIT(8) CONSTANT('08'X),  /* LOGICAL TIC                *
*     LWR      BIT(6) CONSTANT('000001'B),  /* WRITE CONVERSATIONAL   *
*     LWB      BIT(6) CONSTANT('000101'B),  /* WRITE BLOCK            *
*     LWM      BIT(6) CONSTANT('001001'B),  /* WRITE MESSAGE          *
*     LWT      BIT(6) CONSTANT('001101'B),  /* WRITE TRANSMISSION     *
*     LEWM     BIT(6) CONSTANT('011001'B),  /* ERASE/WRITE MESSAGE    *
*     LEWT     BIT(6) CONSTANT('011101'B),  /* ERASE/WRITE TRNSMSSN   *
*     LEAU     BIT(6) CONSTANT('010001'B),  /* ERASE ALL UNPROTECTED  *
*     LRB      BIT(6) CONSTANT('000110'B),  /* READ BLOCK             *
*     LRM      BIT(6) CONSTANT('001010'B),  /* READ MESSAGE           *
*     LRT      BIT(6) CONSTANT('001110'B),  /* READ TRANSMISSION      *
*     LRMOD    BIT(6) CONSTANT('010010'B),  /* READ MODIFIED          *
*     LRBUF    BIT(6) CONSTANT('010110'B),  /* READ BUFFER            *
*     LRCONT   BIT(6) CONSTANT('011010'B),  /* READ CONTINUOUS        *
*     LRPEP    BIT(6) CONSTANT('011110'B),  /* READ PERPETUAL         *
*     LCPYM    BIT(6) CONSTANT('101001'B),  /* COPY MESSAGE           *
*     LCPYT    BIT(6) CONSTANT('101101'B),  /* COPY TRANSMISSION      *
*     LD       BIT(8) CONSTANT('23'X),  /* DISCONNECT                 *
*     LDEC     BIT(8) CONSTANT('33'X),  /* DISCONNECT WITH END OF CALL*
*     LEOC     BIT(8) CONSTANT('53'X),  /* END OF CALL COMMAND        *
*     LXEL     BIT(8) CONSTANT('0B'X),  /* RESET ERROR LOCK           *
*     LXC      BIT(8) CONSTANT('1B'X),  /* RESET CONDITIONAL          *
*     LXI      BIT(8) CONSTANT('2B'X),  /* RESET IMMEDIATE            *
*     LC       BIT(8) CONSTANT('03'X),  /* CONTACT                    *
*     LWPA     BIT(8) CONSTANT('FD'X); /* WRITE POSITIVE ACK          *
*DCL  LMT      BIT(2) CONSTANT('11'B), /* TRANSMISSION MODE           *
*     LMS      BIT(2) CONSTANT('00'B), /* SPECIAL MODE LIKE CONV, EAU *
*     LMB      BIT(2) CONSTANT('01'B), /* BLOCK MODE                  *
*     LMM      BIT(2) CONSTANT('10'B); /* MSG OR CONTINUOUS MODE      *
*/* FOLLOWING EQUATES FOR  - PORT SOLICITOR (DIAL)                    *
*/* PORT SOLICITOR COMMAND CODES                                      *
*DCL PSOL    BIT(8) CONSTANT('FE'X), /* SPECIAL PORT SOLICITOR     0021
*                                       COMMAND                       *
*    STCTL    BIT(8) CONSTANT('01'X), /* START CONTROL                *
*    RESTCTL  BIT(8) CONSTANT('02'X), /* RESET & CONTROL - REDRIVE    *
*    STIPUT   BIT(8) CONSTANT('03'X); /* START INPUT                  *
*/*   FOLLOWING EQUATES FOR SDLC SUPPORT                              *
*DCL  LCCHOLD  BIT(8) CONSTANT('01'X),  /* HOLD                       *
*     LCCRHOLD BIT(8) CONSTANT('02'X),  /* RELEASE HOLD               *
*     LSEND    BIT(8) CONSTANT ('F1'X), /* SEND                       *
*     LCLEAR   BIT(8) CONSTANT ('F2'X), /* CLEAR                      *
*     LCRUD    BIT(8) CONSTANT ('F3'X), /* CLEAR, UNBIND              *
*     LCRUDNFY BIT(8) CONSTANT ('F4'X), /* CLEAR, UNBIND, NOTIFY      *
*     LNFY     BIT(8) CONSTANT ('F5'X), /* NOTIFY                     *
*     LRELCB   BIT(8) CONSTANT ('F6'X), /* RELEASE CB                 *
*     LRESTSR  BIT(8) CONSTANT ('F7'X), /* RESETSR                    *
*     LCLRNFY  BIT(8) CONSTANT('F8'X),  /* CLEAR/NOTIFY               *
*     LCHPUR   BIT(8) CONSTANT('F9'X);  /* PURGE                      *
*DCL  LCCWSIZE FIXED(8) CONSTANT(8);    /* LCCW SIZE                  *
*DCL  LRDS     BIT(8) CONSTANT('FF'X);  /* RECORD DEV STATS COMMAND   *
*DCL  LQUIS    BIT(8) CONSTANT('FE'X);  /* QUIESCE COMMAND            *
*/*              LOGICAL CHANNEL PROGRAM BLOCK                       */
*/*                                                                  */
*/*  REVISIONS                                         007 05/19/75  */
*/*                                                                  */
*DCL  1  ISTLCPB BDY(WORD) BASED(LCPBPTR),                         0026
*        2 LCPTYPE CHAR(1),            /* TYPE CODE                  */
*        2 LCPLNGTH  PTR(8),           /* LENGTH IN BYTES            */
*        2 LCPREQTG CHAR(2),           /* LCPB REQ. TAG FIELD        */
*          3 LCPFLAGS BIT(8),          /* FLAG BYTE                  */
*            4 LCPZRT00 BIT(1),        /* LOGICAL ERROR FLAG         */
*            4 LCPZRT01 BIT(1),        /* CONTROL BLOCK ERROR        */
*            4 LCPZF001 BIT(1),        /* LCP START PROCESS FLAG     */
*              5 LCPZRT02 BIT(1),      /* I/O INITIATION DISABLED    */
*                6 LCPZRTL2 BIT(1),    /* END OF SCHEDULABLE BLOCK   */
*            4 LCPZF002 BIT(1),        /* LCP IN PROCESSING FLAG     */
*              5 LCPZRT03 BIT(1),      /* GO LOOK AT FMCB LINE STATE */
*                                      /* FIELD (REQ. TAG OVERLAY)   */
*                6 LCPZRTL3 BIT(1),    /* WRITE/READ REQUEST         */
*            4 LCPZF003 BIT(1),        /* LCP PROCESSING COMPLETE FLAG*
*              5 LCPZRT04 BIT(1),      /* STPR SET IN BDU FLAG       */
*                                      /* (REQ. TAG OVERLAY)         */
*                6 LCPZRTL4 BIT(1),    /* FEEDBACK REQUESTED         */
*            4 LCPZF004 BIT(1),        /* SINGLE LCCW/LCP FLAG       */
*              5 LCPZRT05 BIT(1),      /* FEEDBACK TO BE ROUTED TO   */
*                                      /* ICNCB FMCB (REQ. TAG       */
*                                      /* OVERLAY)                   */
*                6 LCPZRTL5 BIT(1),    /* DECREMENT SCHED COUNT ON DEQ*
*            4 LCPZRT06 BIT(1),        /* CRITICAL TEXT BLOCK        */
*                                      /* FLAG (REQ. TAG OVERLAY)    */
*              5 LCPZRTL6 BIT(1),      /* WRITE REQUEST              */
*            4 LCPZRT07 BIT(1),        /* BUFFER TRACE ACTIVE        */
*                                      /* FLAG (REQ. TAG OVERLAY)    */
*              5 LCPZRTL7 BIT(1),      /* SCHEDULING FLAG            */
*          3 LCPMNRCD CHAR(1),         /* LCP MINOR REJECTION CODE   */
*            4 LCPZRT08 BIT(1),        /* I/O TRACE ACTIVE FLAG      */
*                                      /* (REQ. TAG OVERLAY)         */
*              5 LCPZRTL8 BIT(1),      /* DEVICE END NOTIFICATION    */
*            4 LCPZRT09 BIT(1),        /* DIALOGUE SCHED DISABLED    */
*              5 LCPZRTL9 BIT(1),      /* CRITICAL TEXT FLAG         */
*            4 LCPZRT0A BIT(1),        /* SIMULATED CONTACT FLAG     */
*            4 LCPZRT0B BIT(1),        /* SIMULATED DISCONNECT FLAG  */
*        2 LCPCHAIN PTR(31),           /* APS CHAIN                  */
*          3 LCPCHAI1 PTR(8),                                      0026
*            4 LCPCHNG BIT(1),         /* GATE BIT                   */
*          3 LCPCHAI2 PTR(24),         /* ADDRESS FIELD              */
*        2 LCPRUCNT PTR(8),            /* NUMBER OF RU FOR THIS LCPB */
*          3 LCPZMIRC CHAR(1),         /* MINOR RETURN CODE          */
*        2 LCPFLAG2 CHAR(1),           /* SECOND FLAG BYTE           */
*          3 LCPPRFLG BIT(1),          /* PACING REQUIRED            */
*          3 LCPASYN  BIT(1),          /* ASYNCHRONOUS LCPB          */
*          3 LCPRSTRT BIT(1),          /* RESTART LCPB               */
*          3 LCPTLBPI BIT(1),          /* TPIOS BLOCK LCCW           */
*            4 LCPZRIMM BIT(1),        /* RESET IMMED REQUIRED ON ERR*/
*          3 LCPFID0  BIT(1),          /* FID0 TH INDICATOR FOR RECORD*
*            4 LCPEXRES BIT(1),        /* EXCEP. RESPONSE SPEC. 3270R*/
*          3 LCPDSTAT BIT(1),          /* DIALOGUE STATE BIT, 3270R  */
*                                      /* 0=REQ. REJECT,1=STATE ERROR*/
*          3 LCPFREE  BIT(1),          /* DEALLOCATE LCPB 3270R      */
*          3 LCPATOP  BIT(1),          /* ATOP LCPB  3270R           */
*        2 LCPSEQ   FIXED(16),         /* OUTBOUND SEQUENCE NUMBER   */
*          3 LCPRRCCT PTR(8),          /* COUNT OF RESPONSES RECEIVED*/
*          3 LCPRRCNT PTR(8),          /* COUNT OF RESPONSES REQUESTED*
*        2 LCPLCCW1 PTR(31),           /* ADDR FIRST LCCW FOR FID1   */
*        2 LCPCID CHAR(4) BDY(WORD),   /* COMMUNICATION ID           */
*          3 LCPSAF BIT(16),           /* SOURCE IDENTIFICATION      */
*          3 LCPDAF BIT(16),           /* DESTINATION IDENTIFICATION */
*        2 LCPNXLCW PTR(31),           /* ADDR NEXT LCCW             */
*        2 LCPFDBA PTR(31),            /* BTU ADDRESS                */
*          3 LCPFDB1 PTR(8),                                       0026
*          3 LCPFDB2 PTR(24),          /* ADDRESS FIELD              */
*        2 LCPTLBAD PTR(31),           /* ADDRESS OF TLB             */
*        2 LCPFOSN  BIT(16),           /* SEQUENCE NUMBER FIRST RU   */
*        2 LCPFSNCH FIXED(16),         /* 1ST SEQ NUMBER IN RU CHAIN */
*        2 LCPSTYPE FIXED(8),          /* LCPB SUB-TYPE X'FF' = RESET,*
*                                      /* X'00' = NON-RESET          */
*        2 LCPFLG1 CHAR(1),            /* FLAGS                      */
*          3 LCPRESET BIT(1),          /* A TPQUE WITH RESET QUEUED  */
*                                      /* THIS ELEMENT               */
*          3 LCPINTER BIT(1),          /* INTERNAL LCPB              */
*          3 LCPDIRPT BIT(1),          /* NOT SEND W/POST=SCHED=0    */
*          3 LCPREDRV BIT(1),          /* LCPB IS FOR REDRIVE        */
*          3 LCPSTLB  BIT(1),          /* TLB NOT TO BE FREED        */
*          3 LCPTRANS BIT(1),          /* DATA INCLUDES CONTROL CHARS*/
*          3 LCPRSV78 BIT(2),          /* RESERVED                   */
*        2 LCPLCCWC BIT(8),            /* COUNT OF LCCWS             */
*        2 LCPRSV77 CHAR(1),           /* RESERVED                   */
*        2 LCPFLCCW PTR(31),           /* ADDR OF FIRST LCCW         */
*          3 LCPUBFSB PTR(31),         /* UNBIND FSB ADDRESS         */
*        2 LCPCLREP PTR(31),           /* PTR TO CLEAR LCPB IN UCB   */
*/*  NOTE:  THE FOLLOWING FIELD - LCPLCCW MUST BE THE LAST FIELD     */
*/*         IN THIS CONTROL BLOCK.  THE CONTROL BLOCK ISTDCLCP HAS   */
*/*         FIELDS IN IT WHICH MUST BE CONTIGUOUS WITH LCPLCCW       */
*        2 LCPLCCW  CHAR(LENGTH(ISTLCCW)) BDY(WORD), /* FIRST LCCW   */
*          3 LCPRSTQH PTR(31),         /* RESET LCPB QUEUE HEADER    */
*          3 LCPPABA  PTR(31),         /* PAB POINTER                */
*            4 LCPRPHA  PTR(31),       /* RPH POINTER                */
*              5 LCPFTYPE BIT(1);      /* FEEDBACK TYPE              */
*/*     CONSTANTS FOR LCPTYPE                                         *
*DCL  LCRPHFT  BIT(1) CONSTANT('1'B);                              0027
*DCL  LCPABFT  BIT(1) CONSTANT('0'B);                              0028
*DCL LCPBFIRM BIT(8) CONSTANT('10'X);  /* LU FAILED, CLSDST, SCHED LOST
*                                         TERM, OPNDST MAY BE TRIED   *
*DCL LCPBTERM BIT(8) CONSTANT('11'X);  /* TERM RECEIVED,CLSDST,    0030
*                                         SCHED LOST TERM             *
*/*                                                                   *
*                                                                  0031
*DCL 1 LCPZTIE BDY(WORD) DEFINED(LCPCID), /* TOLTEP INTERFACE      0031
*                                         ELEMENT OVERLAY            */
*       2  LCPZFMCA PTR(31),           /* ACTIVE FMCB ADDRESS        */
*       2  LCPZSNA PTR(31),            /* SYMBOLIC NAME ADDRESS      */
*       2  LCPZSNAM CHAR(8) BDY(WORD), /* SYMBOLIC NAME              */
*          3  LCPZTRV1 PTR(31),        /* RESERVED FOR RESTORE LCP   */
*          3  LCPZTRV4 PTR(31);        /* RESERVED FOR RESTORE LCP   */
*DCL LCTYPE BIT(8) CONSTANT('04'X);                                0032
*DCL PLCPTYPE BIT(8) CONSTANT('28'X);  /* PURGE LCPB TYPE ID         */
*DCL LCPCLACB BIT(8) CONSTANT('04'X);  /* LCPB FROM CLOSE ACB        */
*DCL LSRSTYPE BIT(8) CONSTANT('FF'X);  /* RESET SUBTYPE              */
*DCL LCPETYPE BIT(8) CONSTANT('40'X);  /* EXTENDED LCPB TYPE ID      */
*/*                                                                  */
*/*  MINOR RETURN CODES                                              */
*/*                                                                  */
*DCL LCMCRSTR BIT(8) CONSTANT('F7'X),  /* MINOR RC FOR RESETSR       */
*    LCPMNEW  BIT(8) CONSTANT('02'X),  /* EARLY WARNING,             */
*                                      /* RECOVERY IN PROGRESS       */
*    LCPMNPF  BIT(8) CONSTANT('03'X),  /* PERM. I/O FAILURE          */
*    LCPMNAS  BIT(8) CONSTANT('04'X),  /* AUTO NETWORK SHUTDOWN      */
*    LCPMNCL  BIT(8) CONSTANT('06'X),  /* CLOSE/CLSDST OCCURED       */
*    LCPMNVD  BIT(8) CONSTANT('07'X),  /* VARY DEACTIVATE            */
*    LCPMNTF  BIT(8) CONSTANT('10'X),  /* TEMP RECORD DEVICE FAILURE */
*    LCPMNSF  BIT(8) CONSTANT('01'X),  /* TEMP BASIC FAILURE /       */
*    LCPMNTS  BIT(8) CONSTANT('11'X),  /* TERMINATE SELF             */
*    LCPMNAP  BIT(8) CONSTANT('0A'X),  /* APPL. ISSUED CLEAR         */
*    LCPMNPR  BIT(8) CONSTANT('0B'X),  /* PREEMPT                    */
*    LCPMNRE  BIT(8) CONSTANT('0C'X);  /* RESTORE                    */
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              0038
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 0038
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */
*/*                                                                0039
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     0039
*BE ABLE TO TAKE IT.                                               0039
*                                                                    */
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */
*/* PREFIX FOR CRR                                                   */
*/*                                                                  */
*/* RELEASE 1 - JUNE 28, 1973                                        */
*/*                                                                  */
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION
*                                          FOR OLD CRR PTR           */
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         0041
*                                          DEFINITION OF OLD FRR PTR */
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              0045
*                                          PSS - VS1 AND 2           */
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              0046
*                                          TPIOS VS1 AND 2           */
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              0047
*                                          STORAGE MANAGEMENT DOS    */
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            0054
*                                          TPIOS - DOS               */
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            0055
*                                          CONTROL LAYER             */
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            0056
*                                          PSS - DOS                 */
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            0057
*                                          STORAGE MANAGEMENT        */
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       0058
*                                          PROCESSING (VS2)          */
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */
*/* CRR FOR COMMAND FACILITIES                                      */
*/*  REVISIONS                                         001 06/02/75 */
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */
*                                  /* FACILITIES ENTERED            */
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */
*                                  /* FACILITIES RUNNING            */
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         0064
*/*  DELTA                                             006 02/10/75  */
*DCL                                                               0064
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */
*      3  ZCRRESET BIT(1),                                         0064
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ*
*      3  *        BIT(7),      /* RESERVED                          */
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */
*         3  *        BIT(1),    /* RESERVED                         */
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */
*         3  ZCRMDATA BIT(1),    /* LCCW DATA HAS BEEN MOVED @ZA29724*/
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */
*      3  ZCRMLNG FIXED(16),     /* LENGTH TO MOVE         @ZA28610  */
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */
*         4  ZCRPRES BIT(1),     /* RESERVED                         */
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK*
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN
*                                   OR LAST BUFFER IN CHANNEL PGM    */
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */
*                                /* CHECK WAITQ =0                   */
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         *
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              0064
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */
*         4  *        BIT(1),    /* NOT USED                         */
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */
*        4 ZCRRH    CHAR(3),            /* RH                        */
*        4 ZCRRU    CHAR(*);            /* RU                        */
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   0068
*                                         LOCAL SUPPORT              */
*/* *** EQUATES FOR ZCRRCDSV *** */                                0069
*                                                                  0069
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB
*                                         TO PROCESS                 */
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH
*                                         REQUEST QUEUE              */
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE
*                                         FSB                        */
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB *
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH
*                                         SCHED NONE                 */
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH
*                                         SCHED NORM                 */
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)*
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)*
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */
*/* COMPONENT RECOVERY                                               */
*/*                                                                  */
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          0098
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 0098
*                                          OPTION                    */
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 0098
*                                          14 - 1                    */
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       0098
*                                          REGS 1 - 4                */
*/*  INITIAL LEVEL                                      001 04/09/75 */
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   0099
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */
*        3  APC53E BIT(1),              /* ISTAPC53                  */
*        3  APC54E BIT(1),                                         0099
*        3  APC56E BIT(1),                                         0099
*        3  APC57E BIT(1),                                         0099
*        3  APC58E BIT(1),                                         0099
*        3  APC31E BIT(1),                                         0099
*        3 * BIT(8),                    /* RESERVED                  */
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */
*        3  APC53R BIT(1),                                         0099
*        3  APC54R BIT(1),                                         0099
*        3  APC56R BIT(1),                                         0099
*        3  APC57R BIT(1),                                         0099
*        3  APC58R BIT(1),                                         0099
*        3  APC31R BIT(1),                                         0099
*        3  *      BIT(8),              /* RESERVED                  */
*     2  APCPSTA PTR(31),               /* PST@                      */
*     2  APCTCBA PTR(31),               /* TCB@                      */
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/
*     2  APCSAVE CHAR(72),                                         0099
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */
*        3  APCCOMF1 CHAR(2),                                      0099
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB*
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB*
*           4  * BIT(8),                /* RESERVED                  */
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */
*        3  *       BIT(5),       /* RESERVED                        */
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */
*        3    *      BIT(2),      /* RESERVED                        */
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/
*        3  * BIT(7),             /* RESERVED                        */
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */
*        3  *   BIT(6),           /* RESERVED                        */
*     2  * CHAR(15);              /* RESERVED                        */
*/*               COMPONENT RECOVERY AREA                            */
*/*  REVISIONS                                         005 04/09/75  */
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          0100
*                                          OWNERSHIP FLAGS           */
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */
*      3 CRALAPTR PTR(31),              /* RESERVED                  */
*/*                                                                  */
*/*   VS1/VS2 EXTENSION                                              */
*/*                                                                  */
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     0100
*                                          THIS CRH                  */
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION*
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   *
*     2  CRARSV01 PTR(31),              /* RESERVED                  */
*     2  CRARSV02 PTR(31),              /* RESERVED                  */
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE
*                                          CRA TO PREALLOCATE QUEUE
*                                          WHEN NOT IN USE           */
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */
* /* COMPLETED DCR SOLUTIONS                                         */
* /* 1H0540 APRIL 28, 1973 MB                                        */
*/* ZTR4417 JUNE 20, 73 DNM */                                     0134
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     0134
*                                          COMPONENT RECOVERY RECORD */
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        0134
*                                          FOR CRR                   */
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  0134
*                                          SATION EXIT       ZTR4417 */
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      0134
*                                          ENTERED                   */
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       0134
*                                          CONNECTION                */
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */
*        3  CNSACONA BIT(1),            /* ACONNECT                  */
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     0134
*                                          GETSTORE                  */
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     0134
*                                          FREESTORE                 */
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           0134
*                                          ACCOUNTING EXIT           */
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         0134
*                                          CURRENT ACTIVITY          */
*        3  CNSMRINB BIT(1),                                       0134
*        3  CNSAUTHB BIT(1),                                       0134
*        3  CNSAQINB BIT(1),                                       0134
*        3  CNSXREQB BIT(1),                                       0134
*        3  CNSQREQB BIT(1),                                       0134
*        3  CNSRLINB BIT(1),                                       0134
*        3  CNSDORLB BIT(1),                                       0134
*        3  CNSTRRLB BIT(1),                                       0134
*        3  CNSRQRLB BIT(1),                                       0134
*        3  CNSPSINB BIT(1),                                       0134
*        3  CNSACINB BIT(1),                                       0134
*        3  CNSLGINB BIT(1),                                       0134
*        3  CNSGBINB BIT(1),                                       0134
*        3  CNSCLINB BIT(1),                                       0134
*        3  CNSCLAQB BIT(1),                                       0134
*        3  CNSTCONB BIT(1),                                       0134
*        3  CNSACONB BIT(1),                                       0134
*        3  CNSQUEUB BIT(1),                                       0134
*        3  CNSSEARB BIT(1),                                       0134
*        3  CNSGETSB BIT(1),                                       0134
*        3  CNSFREEB BIT(1),                                       0134
*        3  CNSACCTB BIT(1),                                       0134
*        3  CNSLOG0B BIT(1),                                       0134
*        3  CNSRSV05 BIT(1);                                       0134
*/*    CRR FOR VARY                                                  */
*/*  REVISIONS                                         009 03/24/75  */
*/*                                                                  */
* DCL 1 ISTVYCRR BDY(WORD) BASED,       /* CRR FOR SSCP              */
*     2  VYCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     0135
*                                          CONN. SVCS. AUDIT         */
*     2  VYCAUDIT,                      /* AUDIT TRAIL FOR SSCP      */
*        3  VYCNTRD CHAR(12),           /* LIST OF MODULES IN SSCP   */
*                                       /* 1 = ENTERED               */
*           4  NINCCL BIT(1),           /* MODULE = ISTINCCL         */
*           4  NINCIO BIT(1),           /* MODULE = ISTINCIO         */
*           4  NINCDL BIT(1),           /* MODULE = ISTINCDL         */
*           4  NINCMY BIT(1),           /* MODULE = ISTINCMY         */
*           4  NINCMD BIT(1),           /* MODULE = ISTINCMD         */
*           4  NINCVI BIT(1),           /* MODULE = ISTINCVI         */
*           4  NINCVA BIT(1),           /* MODULE = ISTINCVA         */
*           4  NINCLF BIT(1),           /* MODULE = ISTINCLF         */
*           4  NINCR1 BIT(1),           /* MODULE = ISTINCR1         */
*           4  NINCSM BIT(1),           /* MODULE = ISTINCSM         */
*           4  NINCFS BIT(1),           /* MODULE = ISTINCFS         */
*           4  NINCVX BIT(1),           /* MODULE = ISTINCVX         */
*           4  NINCVP BIT(1),           /* MODULE = ISTINCVP         */
*           4  NINCVS BIT(1),           /* MODULE = ISTINCVS         */
*           4  NINCVN BIT(1),           /* MODULE = ISTINCVO         */
*           4  NINCMS BIT(1),           /* MODULE = ISTINCMS         */
*           4  NINCR2 BIT(1),           /* MODULE = ISTINCR2         */
*           4  NINCIP BIT(1),           /* MODULE = ISTINCIP         */
*           4  NINCD1 BIT(1),           /* MODULE = ISTINCD1         */
*           4  NINCD2 BIT(1),           /* MODULE = ISTINCD2         */
*           4  NINCD3 BIT(1),           /* MODULE = ISTINCD3         */
*           4  NINCD4 BIT(1),           /* MODULE = ISTINCD4         */
*           4  NINCD5 BIT(1),           /* MODULE = ISTINCD5         */
*           4  NINCD6 BIT(1),           /* MODULE = ISTINCD6         */
*           4  NINCD7 BIT(1),           /* MODULE = ISTINCD7         */
*           4  NINCD8 BIT(1),           /* MODULE = ISTINCD8         */
*           4  NINCD9 BIT(1),           /* MODULE = ISTINCD9         */
*           4  NINCE0 BIT(1),           /* MODULE = ISTINCE0         */
*           4  NINCE2 BIT(1),           /* MODULE = ISTINCE2         */
*           4  NINCE3 BIT(1),           /* MODULE = ISTINCE3         */
*           4  NINCE4 BIT(1),           /* MODULE = ISTINCE4         */
*           4  NINCFM BIT(1),           /* MODULE = ISTINCFM         */
*           4  NINCF1 BIT(1),           /* MODULE = ISTINCF1         */
*           4  NINCF3 BIT(1),           /* MODULE = ISTINCF3         */
*           4  NINCF4 BIT(1),           /* MODULE = ISTINCF4         */
*           4  NINCL0 BIT(1),           /* MODULE = ISTINCL0         */
*           4  NINCL1 BIT(1),           /* MODULE = ISTINCL1         */
*           4  NINCL2 BIT(1),           /* MODULE = ISTINCL2         */
*           4  NINCL3 BIT(1),           /* MODULE = ISTINCL3         */
*           4  NINCL4 BIT(1),           /* MODULE = ISTINCL4         */
*           4  NINCL5 BIT(1),           /* MODULE = ISTINCL5         */
*           4  NINCL6 BIT(1),           /* MODULE = ISTINCL6         */
*           4  NINCL7 BIT(1),           /* MODULE = ISTINCL7         */
*           4  NINCL8 BIT(1),           /* MODULE = ISTINCL8         */
*           4  NINCS1 BIT(1),           /* MODULE = ISTINCS1         */
*           4  NINCUM BIT(1),           /* MODULE = ISTINCUM         */
*           4  NINCU0 BIT(1),           /* MODULE = ISTINCU0          *
*           4  NINCU1 BIT(1),           /* MODULE = ISTINCU1         */
*           4  NINCU2 BIT(1),           /* MODULE = ISTINCU2         */
*           4  NINCU3 BIT(1),           /* MODULE = ISTINCU3         */
*           4  NINCU4 BIT(1),           /* MODULE = ISTINCU4         */
*           4  NINCU5 BIT(1),           /* MODULE = ISTINCU5         */
*           4  NINCU6 BIT(1),           /* MODULE = ISTINCU6         */
*           4  NINCU7 BIT(1),           /* MODULE = ISTINCU7         */
*           4  NINCU8 BIT(1),           /* MODULE = ISTINCU8         */
*           4  NINCV2 BIT(1),           /* MODULE = ISTINCV2         */
*           4  NINCV3 BIT(1),           /* MODULE = ISTINCV3         */
*           4  NINCV4 BIT(1),           /* MODULE = ISTINCV4         */
*           4  NINCV5 BIT(1),           /* MODULE = ISTINCV5         */
*           4  NINCV6 BIT(1),           /* MODULE = ISTINCV6         */
*           4  NINCV7 BIT(1),           /* MODULE = ISTINCV7         */
*           4  NINCV8 BIT(1),           /* MODULE = ISTINCV8         */
*           4  NINCV9 BIT(1),           /* MODULE = ISTINCV9         */
*           4  NINCW0 BIT(1),           /* MODULE = ISTINCW0         */
*           4  NINCW2 BIT(1),           /* MODULE = ISTINCW2         */
*           4  NINCW4 BIT(1),           /* MODULE = ISTINCW4         */
*           4  NINCW5 BIT(1),           /* MODULE = ISTINCW5         */
*           4  NINCW6 BIT(1),           /* MODULE = ISTINCW6         */
*           4  NINCW7 BIT(1),           /* MODULE = ISTINCW7         */
*           4  NINCW8 BIT(1),           /* MODULE = ISTINCW8         */
*           4  NINCW9 BIT(1),           /* MODULE = ISTINCW9         */
*           4  NINCX0 BIT(1),           /* MODULE = ISTINCX0         */
*           4  NINCX1 BIT(1),           /* MODULE = ISTINCX1         */
*           4  NINCX2 BIT(1),           /* MODULE = ISTINCX2         */
*           4  NINCX3 BIT(1),           /* MODULE = ISTINCX3         */
*           4  NINCX6 BIT(1),           /* MODULE = ISTINCX6         */
*           4  NINCX7 BIT(1),           /* MODULE = ISTINCX7         */
*           4  NINCX8 BIT(1),           /* MODULE = ISTINCX8         */
*           4  NINCX9 BIT(1),           /* MODULE = ISTINCX9         */
*           4  NINCUA BIT(1),           /* MODULE = ISTINCUA         */
*           4  NINCUB BIT(1),           /* MODULE = ISTINCUB         */
*           4  NINCUQ BIT(1),           /* MODULE = ISTINCUQ         */
*           4  NINCE1 BIT(1),           /* MODULE = ISTINCE1         */
*           4  NINCE5 BIT(1),           /* MODULE = ISTINCE5         */
*           4  NINCE6 BIT(1),           /* MODULE = ISTINCE6         */
*           4  NINCE7 BIT(1),           /* MODULE = ISTINCE7         */
*           4  NINCE8 BIT(1),           /* MODULE = ISTINCE8         */
*           4  NINCR3 BIT(1),           /* MODULE = ISTINCR3         */
*           4  NINCR5 BIT(1),           /* MODULE = ISTINCR5         */
*           4  NINCVO BIT(1),           /* MODULE = ISTINCVO         */
*           4  NINCE9 BIT(1),           /* MODULE = ISTINCE9         */
*           4  NINCFE BIT(1),           /* MODULE = ISTINCFE         */
*           4  VYCRSV01 BIT(4),         /* RESERVED                  */
*        3  VYCCRT CHAR(12),            /* LIST OF SSCP MODULES      */
*                                       /* 2 =  RUNNING              */
*           4  CINCCL BIT(1),           /* MODULE = ISTINCCL         */
*           4  CINCIO BIT(1),           /* MODULE = ISTINCIO         */
*           4  CINCDL BIT(1),           /* MODULE = ISTINCDL         */
*           4  CINCMY BIT(1),           /* MODULE = ISTINCMY         */
*           4  CINCMD BIT(1),           /* MODULE = ISTINCMD         */
*           4  CINCVI BIT(1),           /* MODULE = ISTINCVI         */
*           4  CINCVA BIT(1),           /* MODULE = ISTINCVA         */
*           4  CINCLF BIT(1),           /* MODULE = ISTINCLF         */
*           4  CINCR1 BIT(1),           /* MODULE = ISTINCR1         */
*           4  CINCSM BIT(1),           /* MODULE = ISTINCSM         */
*           4  CINCFS BIT(1),           /* MODULE = ISTINCFS         */
*           4  CINCVX BIT(1),           /* MODULE = ISTINCVX         */
*           4  CINCVP BIT(1),           /* MODULE = ISTINCVP         */
*           4  CINCVS BIT(1),           /* MODULE = ISTINCVS         */
*           4  CINCVN BIT(1),           /* MODULE = ISTINCVO         */
*           4  CINCMS BIT(1),           /* MODULE = ISTINCMS         */
*           4  CINCR2 BIT(1),           /* MODULE = ISTINCR2         */
*           4  CINCIP BIT(1),           /* MODULE = ISTINCIP         */
*           4  CINCD1 BIT(1),           /* MODULE = ISTINCD1         */
*           4  CINCD2 BIT(1),           /* MODULE = ISTINCD2         */
*           4  CINCD3 BIT(1),           /* MODULE = ISTINCD3         */
*           4  CINCD4 BIT(1),           /* MODULE = ISTINCD4         */
*           4  CINCD5 BIT(1),           /* MODULE = ISTINCD5         */
*           4  CINCD6 BIT(1),           /* MODULE = ISTINCD6         */
*           4  CINCD7 BIT(1),           /* MODULE = ISTINCD7         */
*           4  CINCD8 BIT(1),           /* MODULE = ISTINCD8         */
*           4  CINCD9 BIT(1),           /* MODULE = ISTINCD9         */
*           4  CINCE0 BIT(1),           /* MODULE = ISTINCE0         */
*           4  CINCE2 BIT(1),           /* MODULE = ISTINCE2         */
*           4  CINCE3 BIT(1),           /* MODULE = ISTINCE3         */
*           4  CINCE4 BIT(1),           /* MODULE = ISTINCE4         */
*           4  CINCFM BIT(1),           /* MODULE = ISTINCFM         */
*           4  CINCF1 BIT(1),           /* MODULE = ISTINCF1         */
*           4  CINCF3 BIT(1),           /* MODULE = ISTINCF3         */
*           4  CINCF4 BIT(1),           /* MODULE = ISTINCF4         */
*           4  CINCL0 BIT(1),           /* MODULE = ISTINCL0         */
*           4  CINCL1 BIT(1),           /* MODULE = ISTINCL1         */
*           4  CINCL2 BIT(1),           /* MODULE = ISTINCL2         */
*           4  CINCL3 BIT(1),           /* MODULE = ISTINCL3         */
*           4  CINCL4 BIT(1),           /* MODULE = ISTINCL4         */
*           4  CINCL5 BIT(1),           /* MODULE = ISTINCL5         */
*           4  CINCL6 BIT(1),           /* MODULE = ISTINCL6         */
*           4  CINCL7 BIT(1),           /* MODULE = ISTINCL7         */
*           4  CINCL8 BIT(1),           /* MODULE = ISTINCL8         */
*           4  CINCS1 BIT(1),           /* MODULE = ISTINCS1         */
*           4  CINCUM BIT(1),           /* MODULE = ISTINCUM         */
*           4  CINCU0 BIT(1),           /* MODULE = ISTINCU0          *
*           4  CINCU1 BIT(1),           /* MODULE = ISTINCU1         */
*           4  CINCU2 BIT(1),           /* MODULE = ISTINCU2         */
*           4  CINCU3 BIT(1),           /* MODULE = ISTINCU3         */
*           4  CINCU4 BIT(1),           /* MODULE = ISTINCU4         */
*           4  CINCU5 BIT(1),           /* MODULE = ISTINCU5         */
*           4  CINCU6 BIT(1),           /* MODULE = ISTINCU6         */
*           4  CINCU7 BIT(1),           /* MODULE = ISTINCU7         */
*           4  CINCU8 BIT(1),           /* MODULE = ISTINCU8         */
*           4  CINCV2 BIT(1),           /* MODULE = ISTINCV2         */
*           4  CINCV3 BIT(1),           /* MODULE = ISTINCV3         */
*           4  CINCV4 BIT(1),           /* MODULE = ISTINCV4         */
*           4  CINCV5 BIT(1),           /* MODULE = ISTINCV5         */
*           4  CINCV6 BIT(1),           /* MODULE = ISTINCV6         */
*           4  CINCV7 BIT(1),           /* MODULE = ISTINCV7         */
*           4  CINCV8 BIT(1),           /* MODULE = ISTINCV8         */
*           4  CINCV9 BIT(1),           /* MODULE = ISTINCV9         */
*           4  CINCW0 BIT(1),           /* MODULE = ISTINCW0         */
*           4  CINCW2 BIT(1),           /* MODULE = ISTINCW2         */
*           4  CINCW4 BIT(1),           /* MODULE = ISTINCW4         */
*           4  CINCW5 BIT(1),           /* MODULE = ISTINCW5         */
*           4  CINCW6 BIT(1),           /* MODULE = ISTINCW6         */
*           4  CINCW7 BIT(1),           /* MODULE = ISTINCW7         */
*           4  CINCW8 BIT(1),           /* MODULE = ISTINCW8         */
*           4  CINCW9 BIT(1),           /* MODULE = ISTINCW9         */
*           4  CINCX0 BIT(1),           /* MODULE = ISTINCX0         */
*           4  CINCX1 BIT(1),           /* MODULE = ISTINCX1         */
*           4  CINCX2 BIT(1),           /* MODULE = ISTINCX2         */
*           4  CINCX3 BIT(1),           /* MODULE = ISTINCX3         */
*           4  CINCX6 BIT(1),           /* MODULE = ISTINCX6         */
*           4  CINCX7 BIT(1),           /* MODULE = ISTINCX7         */
*           4  CINCX8 BIT(1),           /* MODULE = ISTINCX8         */
*           4  CINCX9 BIT(1),           /* MODULE = ISTINCX9         */
*           4  CINCUA BIT(1),           /* MODULE = ISTINCUA         */
*           4  CINCUB BIT(1),           /* MODULE = ISTINCUB         */
*           4  CINCUQ BIT(1),           /* MODULE = ISTINCUQ         */
*           4  CINCE1 BIT(1),           /* MODULE = ISTINCE1         */
*           4  CINCE5 BIT(1),           /* MODULE = ISTINCE5         */
*           4  CINCE6 BIT(1),           /* MODULE = ISTINCE6         */
*           4  CINCE7 BIT(1),           /* MODULE = ISTINCE7         */
*           4  CINCE8 BIT(1),           /* MODULE = ISTINCE8         */
*           4  CINCR3 BIT(1),           /* MODULE = ISTINCR3         */
*           4  CINCR5 BIT(1),           /* MODULE = ISTINCR5         */
*           4  CINCVO BIT(1),           /* MODULE = ISTINCVO         */
*           4  CINCE9 BIT(1),           /* MODULE = ISTINCE9         */
*           4  CINCFE BIT(1),           /* MODULE = ISTINCFE         */
*           4  VYCRSV03 BIT(4),         /* RESERVED                  */
*     2  VYCRRSAV CHAR(72),             /* SAVE AREA USED BY ISTINCIP*/
*                                       /* TO CALL ISTINCW3          */
*     2  VYCRRCW3 CHAR(8),              /* PARAM LIST USED BY        */
*                                       /* ISTINCIP TO CALL ISTINCW3 */
*     2  VYCRSV04 CHAR(2),              /* RESERVED                  */
*     2  VYCRSV02 PTR(31);              /* RESERVED                  */
*DCL TIDINCDL BIT(8) CONSTANT('00'X);   /* THREAD ID FOR ISTINCDL    */
*DCL TIDINCMY BIT(8) CONSTANT('01'X);   /* THREAD ID FOR ISTINCMY    */
*DCL TIDINCCL BIT(8) CONSTANT('02'X);   /* THREAD ID FOR ISTINCCL    */
*DCL TIDINCFE BIT(8) CONSTANT('04'X);   /* THREAD ID FOR ISTINCFE    */
*/* END OF ATBUILD */                                              0140
* /*** SAVE CRR AND FRR POINTERS ***/                              0140
*ADDR(CMZK0002->RPHCRR->CRAPROCR)->PFCCRRO = CMZK0002->RPHCRR->CRACRR;
         L     @12,RPHCRR(,CMZK0002)                               0140
         LA    @06,312                                             0140
         ALR   @06,@12                                             0140
         L     @00,CRACRR(,@12)                                    0140
         ST    @00,PFCCRRO(,@06)                                   0140
*ADDR(CMZK0002->RPHCRR->CRAPROCR)->PFCFRRO = CMZK0002->RPHCRR->CRAFRR;
         L     @00,CRAFRR(,@12)                                    0141
         ST    @00,PFCFRRO(,@06)                                   0141
* /*** SET UP POINTERS TO OUR CRR, FRR ***/                        0142
*CMZK0002->RPHCRR->CRACRR = ADDR(CMZK0002->RPHCRR->CRAPROCR);      0142
         LA    @06,CRAPROCR(,@12)                                  0142
         ST    @06,CRACRR(,@12)                                    0142
*CMZK0002->RPHCRR->CRAFRR = 0;                                     0143
         SLR   @00,@00                                             0143
         ST    @00,CRAFRR(,@12)                                    0143
* /*** SET OUR COMPONENT PROCESS ID IN CRR ***/                    0144
*CMZK0002->RPHCRR->CRACRR->PFCFTA = TIDINCMS;                      0144
         MVI   PFCFTA(@06),X'03'                                   0144
* /*** CLEAR COMPONENT ENTERED INDICATORS ***/                     0145
*CMZK0002->RPHCRR->CRACRR->VYCNTRD = '0'B;                         0145
         XC    VYCNTRD+1(11,@06),VYCNTRD+1(@06)                    0145
         MVI   VYCNTRD(@06),B'00000000'                            0145
* /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                     0146
*CMZK0002->RPHCRR->CRACRR->NINCMS = '1'B;                          0146
         OI    NINCMS(@06),B'00000001'                             0146
* /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                    0147
*CMZK0002->RPHCRR->CRACRR->VYCCRT = '0'B;                          0147
         XC    VYCCRT+1(11,@06),VYCCRT+1(@06)                      0147
         MVI   VYCCRT(@06),B'00000000'                             0147
*CMZK0002->RPHCRR->CRACRR->CINCMS = '1'B;                          0148
         OI    CINCMS(@06),B'00000001'                             0148
* END;                                                             0149
*                                                                  0149
*                                                                  0149
*                                                                  0149
*/*            INPUT/OUTPUT BLOCK                                    */
*/*                                                                  */
*/*  OS/VS2 RELEASE 4, OS/VS1 RELEASE 5, 10/30/75, LEVEL=4           */
*/*                                                                  */
*/*  METHOD OF ACCESS                                                */
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */
*/*             USING ON IOB GIVES ADDRESSABILITY FOR ALL SYMBOLS.   */
*/*      PL/S - DCL (IOBPRPTR,IOBSTPTR) PTR                          */
*/*                                                                  */
*                                                                  0150
* DECLARE                                                          0150
*   1 IOBPREFX BASED(IOBPRPTR) BDY(WORD),                          0150
*                                                                  0150
* /* *************************************************************** */
* /*                                                                 */
* /*                 PREFIX SECTIONS OF THE IOB                      */
* /*                                                                 */
* /* *************************************************************** */
*                                                                  0150
*                        /* **************************************** */
*                        /*    QSAM,BSAM,BPAM PREFIX                 */
*                        /*    CHAINED SCHEDULING *** 16 BYTES       */
*                        /* **************************************** */
*                                                                  0150
*    2 IOBCFLG1 CHAR(1),             /* I/O INDICATORS               */
*     3 IOBRSV01 BIT(1),             /* RESERVED                     */
*     3 IOBRSV02 BIT(1),             /* RESERVED                     */
*     3 IOBRSV03 BIT(1),             /* RESERVED                     */
*     3 IOBRSV04 BIT(1),             /* RESERVED                     */
*     3 IOBPTST  BIT(1),             /* NOTE OR POINT OPERATION IS 0150
*                                       IN PROCESS                   */
*     3 IOBABAPP BIT(1),             /* ERROR HAS BEEN PROCESSED ONCE
*                                       BY ABNORMAL-END APPENDAGE  0150
*                                       ROUTINE                      */
*     3 IOBRSTCH BIT(1),             /* RESTART CHANNEL              */
*     3 IOBPCI   BIT(1),             /* SET WHEN A PROGRAM-CONTROLLED
*                                       INTERRUPTION (PCI) OCCURS    */
*    2 IOBRSV05 CHAR(1),             /* RESERVED                     */
*    2 IOBCINOP CHAR(1),             /* OFFSET OF THE LAST I/O     0150
*                                       COMMAND FOR INPUT OPERATION
*                                       (NOP CCW) FROM THE ORIGIN OF
*                                       THE ICB                      */
*    2 IOBCONOP CHAR(1),             /* OFFSET OF THE LAST I/O     0150
*                                       COMMAND FOR AN OUTPUT      0150
*                                       OPERATION (NOP CCW) FROM   0150
*                                       THE ORIGIN OF THE ICB        */
*    2 IOBCECB  FIXED(31),           /* EVENT CONTROL BLOCK USED BY
*                                       BSAM OR QSAM.  SHOWS THE   0150
*                                       STATUS OF THE I/O OPERATION. */
*    2 IOBCICB  PTR(31),             /* ADDRESS OF THE FIRST       0150
*                                       INTERRUPT CONTROL BLOCK (ICB)
*                                       ON THE ICB QUEUE             */
*    2 IOBCNOPA PTR(31);             /* ADDRESS OF THE NOP COMMAND AT
*                                       THE END OF THE QUEUE         */
*                                                                  0150
*                        /* **************************************** */
*                        /*    QSAM,BSAM,BPAM PREFIX                 */
*                        /*    NORMAL SCHEDULING *** 8 BYTES         */
*                        /* **************************************** */
*                                                                  0151
* DECLARE 1 IOBORG01                                               0151
*       DEF(IOBPREFX) POS(9) BDY(WORD),                            0151
*    2 IOBNIOBA PTR(31),             /* ADDRESS OF THE NEXT IOB    0151
*                                       ASSOCIATED WITH ONE PARTICULAR
*                                       DCB.  THE IOB'S ARE CHAINED
*                                       IN SEQUENTIAL ORDER.         */
*     3 IOBNFLG1 CHAR(1),            /* FLAG BYTE                    */
*      4 IOBPRTOV BIT(1),            /* PRTOV HAS OCCURRED (PRINTER
*                                       DEVICES)  (MDC331)   @Z40FP9A*/
*       5 IOBSEGMT BIT(1),           /* SEGMENTING OF A SPANNED    0151
*                                       RECORD IS IN PROCESS (QSAM 0151
*                                       LOCATE MODE, LOGICAL RECORD
*                                       INTERFACE, UPDATE PROCESSING)
*                                       (DIRECT ACCESS) (OS/VS2)   0151
*                                       (MDC332)             @Z40FP9A*/
*      4 IOBWRITE BIT(1),            /* A WRITE OPERATION IS IN    0151
*                                       PROCESS                      */
*      4 IOBREAD  BIT(1),            /* A READ OPERATION IS IN     0151
*                                       PROCESS                      */
*      4 IOBUPDAT BIT(1),            /* UPDATE FLAG.  SET ON TOGETHER
*                                       WITH BIT 1 OF THIS BYTE TO 0151
*                                       SHOW THAT THE BLOCK IS TO BE
*                                       UPDATED.  CAN ONLY OCCUR IF
*                                       THE OPEN PARAMETER IS UPDAT. */
*      4 IOBBKSPC BIT(1),            /* IOB BEING USED FOR BACKSPACE,
*                                       CONTROL OR NOTE/POINT      0151
*                                       OPERATION                    */
*      4 IOBSPAN  BIT(1),            /* THE RECORD CURRENTLY BEING 0151
*                                       PROCESSED HAS MORE THAN ONE
*                                       SEGMENT (QSAM LOCATE MODE, 0151
*                                       LOGICAL RECORD INTERFACE,  0151
*                                       UPDAT PROCESSING OF SPANNED
*                                       RECORDS)                     */
*      4 IOBUPERR BIT(1),            /* UPDATE CHANNEL PROGRAM HAS 0151
*                                       BEEN SPLIT INTO TWO PARTS  0151
*                                                              MDC036*/
*      4 IOBFIRST BIT(1),            /* THIS IS THE FIRST IOB ON   0151
*                                       CHAIN                        */
*     3 IOBNIOBB PTR(24),            /* SAME AS IOBNIOBA ABOVE       */
*    2 IOBNECB  FIXED(31);           /* EVENT CONTROL BLOCK USED BY
*                                       QSAM TO INDICATE THE STATUS
*                                       OF THE I/O EVENT             */
*                                                                  0151
*                        /* **************************************** */
*                        /*    BDAM PREFIX *** 8 BYTES               */
*                        /* **************************************** */
*                                                                  0152
* DECLARE 1 IOBORG02                                               0152
*       DEF(IOBPREFX) POS(9) BDY(WORD),                            0152
*    2 IOBDQADA PTR(31),             /* ADDRESS OF THE OTHER IOB   0152
*                                       REFERRED TO IN DESCRIPTION 0152
*                                       OF IOBDEQ BELOW              */
*     3 IOBDEQIN CHAR(1),            /* DEQUEUE LOOP INDICATOR       */
*      4 IOBDEQ   BIT(1),            /* THIS IOB IS USING A TRACK  0152
*                                       THAT WAS DEQUEUED BY ANOTHER
*                                       IOB WHICH IS NOW WAITING TO
*                                       DEQUEUE ANOTHER TRACK.  THE
*                                       OTHER IOB ENQUEUED ON TWO OR
*                                       MORE TRACKS TO FIND SPACE IN
*                                       WHICH TO WRITE/ADD A SPANNED
*                                       RECORD.  THE OTHER IOB     0152
*                                       REMAINED ENQUEUED UNTIL IT 0152
*                                       EITHER WROTE THE RECORD OR 0152
*                                       DETERMINED THAT THERE WAS  0152
*                                       ENOUGH CONTIGUOUS FREE SPACE
*                                       ON THE TRACKS TO CONTAIN THE
*                                       RECORD.  AFTER THE OTHER IOB
*                                       DEQUEUED THE CURRENT TRACK,
*                                       THE DEQUEUEING WAS INTERRUPTED
*                                       BY THE NEED OF THIS IOB FOR
*                                       THE CURRENT TRACK.           */
*      4 IOBRSV07 BIT(1),            /* RESERVED                     */
*      4 IOBRSV08 BIT(1),            /* RESERVED                     */
*      4 IOBRSV09 BIT(1),            /* RESERVED                     */
*      4 IOBRSV10 BIT(1),            /* RESERVED                     */
*      4 IOBRSV11 BIT(1),            /* RESERVED                     */
*      4 IOBRSV12 BIT(1),            /* RESERVED                     */
*      4 IOBRSV13 BIT(1),            /* RESERVED                     */
*     3 IOBDQADB PTR(24),            /* SAME AS IOBDQADA ABOVE       */
*    2 IOBSWAP  PTR(31);             /* ADDRESS OF THE SEGMENT WORK
*                                       AREA USED BY THIS IOB TO READ
*                                       OR WRITE A RECORD OF A FORMAT
*                                       VS DATA SET                  */
*                                                                  0152
*                        /* **************************************** */
*                        /*    GAM,QISAM PREFIX *** 4 BYTES          */
*                        /* **************************************** */
*                                                                  0153
* DECLARE 1 IOBORG03                                               0153
*       DEF(IOBPREFX) POS(13) BDY(WORD),                           0153
*    2 IOBGQECB FIXED(31);           /* EVENT CONTROL BLOCK THAT IS
*                                       WITHIN FIRST IOB ONLY (GAM)
*                                       EVENT CONTROL BLOCK USED TO
*                                       INDICATE STATUS OF AN I/O  0153
*                                       EVENT  (QISAM)               */
*                                                                  0153
* /* *************************************************************** */
* /*                                                                 */
* /*                 STANDARD SECTION OF THE IOB                     */
* /*                                                                 */
* /* *************************************************************** */
*                                                                  0154
* DECLARE                                                          0154
*   1 IOBSTDRD BASED(IOBSTPTR) BDY(WORD),                          0154
*    2 IOBFLAG1 CHAR(1),             /* FLAG BYTE 1                  */
*     3 IOBDATCH BIT(1),             /* DATA CHAINING USED IN CHANNEL
*                                       PROGRAM                      */
*     3 IOBCMDCH BIT(1),             /* COMMAND CHAINING USED IN   0154
*                                       CHANNEL PROGRAM              */
*     3 IOBERRTN BIT(1),             /* ERROR ROUTINE IS IN CONTROL  */
*     3 IOBRPSTN BIT(1),             /* DEVICE IS TO BE REPOSITIONED */
*     3 IOBCYCCK BIT(1),             /* CYCLIC REDUNDANCY CHECK (CRC)
*                                       NEEDED  (TAPE)               */
*      4 IOBFCREX BIT(1),            /* FETCH COMMAND RETRY EXIT   0154
*                                       (DIRECT ACCESS)              */
*     3 IOBIOERR BIT(1),             /* EXCEPTIONAL CONDITION.  AFTER
*                                       THE ERROR ROUTINE RETURNS AND
*                                       THIS BIT IS ON, THE ERROR IS
*                                       CONSIDERED PERMANENT.        */
*     3 IOBUNREL BIT(1),             /* IOB UNRELATED FLAG (I.E.,  0154
*                                       NONSEQUENTIAL)               */
*     3 IOBRSTRT BIT(1),             /* IF 1, RESTART ADDRESS IN IOB
*                                       TO BE USED.  IF 0, START.  0154
*                                       (OS/VS1)               MDC034*/
*      4 IOBSPSVC BIT(1),            /* FOR SAM/PAM, SET BY SVC IF 0154
*                                       I/O APPENDAGE SHOULD NOT   0154
*                                       PROCESS INTERRUPT (OS/VS2) 0154
*                                                              MDC035*/
*    2 IOBFLAG2 CHAR(1),             /* FLAG BYTE 2                  */
*     3 IOBHALT  BIT(1),             /* HALT I/O HAS BEEN ISSUED BY
*                                       SVC PURGE ROUTINE            */
*     3 IOBSENSE BIT(1),             /* SENSE WILL NOT BE PERFORMED
*                                       UNTIL THE DEVICE IS FREE     */
*     3 IOBPURGE BIT(1),             /* IOB HAS BEEN PURGED TO ALLOW
*                                       I/O ACTIVITY TO QUIESCE.   0154
*                                       (OS/VS1)              MDC046*/
*      4 IOBRRT3  BIT(1),            /* TYPE 3 RELATED REQUEST     0154
*                                       (OS/VS2)               MDC048*/
*     3 IOBRDHA0 BIT(1),             /* HOME ADDRESS (R0) RECORD IS
*                                       TO BE READ.  SEEK COMMAND NOT
*                                       NEEDED.  (OS/VS1)      MDC047*/
*      4 IOBRRT2  BIT(1),            /* TYPE 2 RELATED REQUEST     0154
*                                       (OS/VS2)               MDC049*/
*     3 IOBALTTR BIT(1),             /* NO TEST FOR OUT-OF-EXTENT. 0154
*                                       AN ALTERNATE TRACK IS IN USE.*/
*     3 IOBSKUPD BIT(1),             /* SEEK ADDRESS IS BEING      0154
*                                       UPDATED.  CYLINDER END OR  0154
*                                       FILE MASK VIOLATION HAS    0154
*                                       OCCURRED.                    */
*     3 IOBSTATO BIT(1),             /* DEVICE END STATUS HAS BEEN 0154
*                                       OR'ED WITH CHANNEL END STATUS
*                                       (GRAPHICS DEVICE)            */
*     3 IOBPNCH  BIT(1),             /* ERROR RECOVERY IN CONTROL FOR
*                                       A 2540 CARD PUNCH WITH THREE
*                                       BUFFERS.  (QSAM)           0154
*                                       RESETPL MACRO INSTRUCTION WAS
*                                       USED.  (BTAM)                */
*    2 IOBSENS0 CHAR(1),             /* FIRST SENSE BYTE             */
*     3 IOBS0B0  BIT(1),             /* BIT 0 (DEVICE DEPENDENT)     */
*     3 IOBS0B1  BIT(1),             /* BIT 1 (DEVICE DEPENDENT)     */
*     3 IOBS0B2  BIT(1),             /* BIT 2 (DEVICE DEPENDENT)     */
*     3 IOBS0B3  BIT(1),             /* BIT 3 (DEVICE DEPENDENT)     */
*     3 IOBS0B4  BIT(1),             /* BIT 4 (DEVICE DEPENDENT)     */
*     3 IOBS0B5  BIT(1),             /* BIT 5 (DEVICE DEPENDENT)     */
*     3 IOBS0B6  BIT(1),             /* BIT 6 (DEVICE DEPENDENT)     */
*     3 IOBS0B7  BIT(1),             /* BIT 7 (DEVICE DEPENDENT)     */
*      4 IOBSNSC9 BIT(1),            /* CHANNEL 9 SENSED IN        0154
*                                       CARRIAGE TAPE                */
*    2 IOBSENS1 CHAR(1),             /* SECOND SENSE BYTE            */
*     3 IOBS1B0  BIT(1),             /* BIT 0 (DEVICE DEPENDENT)     */
*     3 IOBS1B1  BIT(1),             /* BIT 1 (DEVICE DEPENDENT)     */
*     3 IOBS1B2  BIT(1),             /* BIT 2 (DEVICE DEPENDENT)     */
*     3 IOBS1B3  BIT(1),             /* BIT 3 (DEVICE DEPENDENT)     */
*     3 IOBS1B4  BIT(1),             /* BIT 4 (DEVICE DEPENDENT)     */
*     3 IOBS1B5  BIT(1),             /* BIT 5 (DEVICE DEPENDENT)     */
*     3 IOBS1B6  BIT(1),             /* BIT 6 (DEVICE DEPENDENT)     */
*     3 IOBS1B7  BIT(1),             /* BIT 7 (DEVICE DEPENDENT)     */
*    2 IOBECBPT PTR(31),             /* ADDRESS OF ECB TO BE POSTED
*                                       ON I/O COMPLETION            */
*     3 IOBECBCC CHAR(1),            /* COMPLETION CODE FOR AN I/O 0154
*                                       REQUEST.  THIS CODE WILL   0154
*                                       APPEAR IN THE FIRST BYTE OF
*                                       AN ECB.                      */
*     3 IOBECBPB PTR(24),            /* ADDRESS OF THE ECB TO BE   0154
*                                       POSTED UPON THE COMPLETION OF
*                                       AN I/O EVENT.  FOR BSAM/BPAM,
*                                       ECB IS IN THE DECB.  FOR   0154
*                                       QSAM, ECB IS IN THE QSAM   0154
*                                       PREFIX OF THE IOB.           */
*    2 IOBFLAG3 CHAR(1),             /* I/O SUPERVISOR ERROR ROUTINE
*                                       FLAG BYTE (DEVICE DEPENDENT) */
*     3 IOBFL3   BIT(8),             /* FLAG 3 - STATUS ERROR COUNTS
*                                       FOR MAGNETIC DOCUMENT READER
*                                       (3890) OR FLAGS FOR 3800   0154
*                                       (OS/VS1)  (MDC307)   @X50AD9A*/
*      4 IOBCCC   BIT(1),            /* CHANNEL CONTROL CHECK ERROR
*                                       COUNT (3890)           MDC038*/
*      4 IOBICC   BIT(1),            /* INTERFACE CONTROL CHECK ERROR
*                                       COUNT (3890)           MDC039*/
*      4 IOBCDC   BIT(1),            /* CHANNEL DATA CHECK ERROR   0154
*                                       (3890)                 MDC040*/
*      4 IOBACU   BIT(1),            /* ATTENTION/CONTROL UNIT ERROR
*                                       (3890)                 MDC041*/
*      4 IOBCNC   BIT(1),            /* CHAIN CHECK ERROR (3890)   0154
*                                                              MDC042*/
*       5 IOBSDR   BIT(1),           /* STATISTICS ONLY FLAG (3800)
*                                       (MDC306)             @X50AD9A*/
*      4 IOBMSG   BIT(1),            /* MESSAGE FLAG (3890 OR 3800)
*                                       (MDC308)             @X50AD9A*/
*      4 IOBICL   BIT(1),            /* INCORRECT LENGTH ERROR (3890)
*                                                              MDC020*/
*       5 IOBJAM   BIT(1),           /* SET ON WHEN JES SUBSYSTEM HAS
*                                       DETECTED A PAPER JAM SO 3800
*                                       ERP WILL SUPPRESS ITS      0154
*                                       INTERVENTION REQUIRED MESSAGE
*                                       (3800)  (MDC330)     @X50AD9A*/
*      4 IOBLOG   BIT(1),            /* LOG OUT FLAG (3890 OR 3800)
*                                       (MDC309)             @X50AD9A*/
*    2 IOBCSW   CHAR(7) BDY(WORD,2), /* LOW-ORDER SEVEN BYTES OF THE
*                                       LAST CSW THAT REFLECTS THE 0154
*                                       STATUS FOR THIS REQUEST      */
*     3 IOBIOCSW CHAR(5) BDY(WORD,2),/* LOW-ORDER BYTES OF CSW FOR 0154
*                                       MAGNETIC DOCUMENT READER   0154
*                                       (3890) (OS/VS1)        MDC022*/
*      4 IOBCMDA  PTR(24) BDY(WORD,2),/* COMMAND ADDRESS (3890)MDC023*/
*      4 IOBSTBYT BIT(16),           /* STATUS BITS 32-47 (3890)   0154
*                                                              MDC024*/
*       5 IOBUSTAT BIT(8),           /* CSW UNIT STATUS FLAGS (3800)
*                                       (MDC311)             @Z40MP9A*/
*        6 IOBUSB0  BIT(1),          /* ATTENTION  (MDC312)  @Z40MP9A*/
*        6 IOBUSB1  BIT(1),          /* STATUS MODIFIER            0154
*                                       (MDC313)             @Z40MP9A*/
*        6 IOBUSB2  BIT(1),          /* CONTROL UNIT END           0154
*                                       (MDC314)             @Z40MP9A*/
*        6 IOBUSB3  BIT(1),          /* BUSY  (MDC315)       @Z40MP9A*/
*        6 IOBUSB4  BIT(1),          /* CHANNEL END (MDC316) @Z40MP9A*/
*        6 IOBUSB5  BIT(1),          /* DEVICE END  (MDC317) @Z40MP9A*/
*        6 IOBUSB6  BIT(1),          /* UNIT CHECK  (MDC318) @Z40MP9A*/
*        6 IOBUSB7  BIT(1),          /* UNIT EXCEPTION             0154
*                                       (MDC319)             @Z40MP9A*/
*       5 IOBCSTAT BIT(8),           /* CSW CHANNEL STATUS FLAGS   0154
*                                       (3800)  (MDC320)     @Z40MP9A*/
*        6 IOBCSB0  BIT(1),          /* PROGRAM CONTROL INTERRUPT  0154
*                                       (MDC321)             @Z40MP9A*/
*        6 IOBCSB1  BIT(1),          /* INCORRECT LENGTH           0154
*                                       (MDC322)             @Z40MP9A*/
*        6 IOBCSB2  BIT(1),          /* PROGRAM CHECK              0154
*                                       (MDC323)             @Z40MP9A*/
*        6 IOBCSB3  BIT(1),          /* PROTECTION CHECK           0154
*                                       (MDC324)             @Z40MP9A*/
*        6 IOBCSB4  BIT(1),          /* CHANNEL DATA CHECK         0154
*                                       (MDC325)             @Z40MP9A*/
*        6 IOBCSB5  BIT(1),          /* CHANNEL CONTROL CHECK      0154
*                                       (MDC326)             @Z40MP9A*/
*        6 IOBCSB6  BIT(1),          /* INTERFACE CONTROL CHECK    0154
*                                       (MDC327)             @Z40MP9A*/
*        6 IOBCSB7  BIT(1),          /* CHAINING CHECK             0154
*                                       (MDC328)             @Z40MP9A*/
*    2 IOBSTART PTR(31),             /* ADDRESS OF CHANNEL PROGRAM 0154
*                                       TO BE EXECUTED               */
*     3 IOBSIOCC CHAR(1),            /* SIO CODE.  BITS 2 AND 3    0154
*                                       CONTAIN CONDITION CODE     0154
*                                       RETURNED AFTER EXECUTION OF
*                                       SIO INSTRUCTION FOR THIS I/O
*                                       EVENT.                       */
*     3 IOBSTRTB PTR(24),            /* ADDRESS OF CHANNEL PROGRAM 0154
*                                       TO BE EXECUTED               */
*    2 IOBDCBPT PTR(31),             /* ADDRESS OF DCB ASSOCIATED  0154
*                                       WITH THIS IOB                */
*     3 IOBFLAG4 BIT(8),             /* FLAG BYTE              MDC011*/
*      4 IOBGDPOL BIT(1),            /* RE-ENTER SIO APPENDAGE FOR 0154
*                                       OLTEP GUARANTEED DEVICE PATH
*                                                              MDC012*/
*      4 IOBCC3WE BIT(1),            /* USER REQUESTS THAT IOS POST A
*                                       X'6D' FOR A CONDITION CODE 3
*                                       ON ATTEMPTED I/O OPERATIONS
*                                       (OS/VS2)  (MDC310)   @Z309P9A*/
*      4 IOBPMERR BIT(1),            /* VTAM SETS THIS BIT ON TO   0154
*                                       INDICATE TO IOS THAT VTAM  0154
*                                       SHOULD BE POSTED WITH A    0154
*                                       PERMANENT I/O ERROR BECAUSE
*                                       ALL ALTERNATE PATHS TO THE 0154
*                                       3705 HAVE BEEN TRIED       0154
*                                       (OS/VS1)  (MDC329)   @X04BH9A*/
*      4 IOBRSV40 BIT(1),            /* RESERVED                     */
*      4 IOBRSV41 BIT(1),            /* RESERVED                     */
*      4 IOBRSV42 BIT(1),            /* RESERVED                     */
*      4 IOBJES3I BIT(1),            /* JES3 INTERVENTION REQUIRED 0154
*                                       NOTIFICATION.  SETTING THIS
*                                       BIT WILL RESULT IN TURNING ON
*                                       BIT IOSPGDPX IN THE IOSB.  0154
*                                       (OS/VS2)  (MDC305)   @Y02BP9A*/
*      4 IOBRSV44 BIT(1),            /* RESERVED                     */
*     3 IOBDCBPB PTR(24),            /* ADDRESS OF DCB ASSOCIATED  0154
*                                       WITH THIS IOB                */
*    2 IOBRESTR PTR(31),             /* AFTER SVC 16 (PURGE) -     0154
*                                       QUIESCE - ADDRESS OF THE NEXT
*                                       IOB IN THE PURGE CHAIN.    0154
*                                       (LAST IOB IN THE CHAIN, BYTE
*                                       4 IS FF.)                  0154
*                                       DURING I/O SUPERVISOR WRITE-
*                                       TO-OPERATOR ROUTINE CONTROL -
*                                       CCHH PART OF THE ADDRESS OF A
*                                       DEFECTIVE TRACK.           0154
*                                       DURING I/O ERROR CORRECTION
*                                       (MEANINGFUL ONLY IF BIT 3 IN
*                                       THE IOBFLAG1 FIELD IS ON) -
*                                       ADDRESS OF THE CHANNEL     0154
*                                       PROGRAM USED TO CORRECT AN 0154
*                                       ERROR CONDITION.           0154
*                                       AFTER I/O ERROR CORRECTION -
*                                       IF A CHANNEL PROGRAM IS    0154
*                                       RESTARTED THROUGH A CCW OTHER
*                                       THAN THE ONE POINTED TO BY 0154
*                                       THE IOBSTART FIELD, ITS    0154
*                                       ADDRESS IS HERE.             */
*     3 IOBREPOS CHAR(1),            /* DURING I/O ERROR CORRECTION
*                                       (MEANINGFUL ONLY IF BIT 3 IN
*                                       THE IOBFLAG1 FIELD IS ON) FOR
*                                       MAGNETIC TAPE ONLY - THE   0154
*                                       CONTROL COMMAND (BSR, FSR, 0154
*                                       ERG) REQUIRED TO REPOSITION
*                                       OVER A BLOCK.                */
*     3 IOBRSTRB PTR(24),            /* SAME AS IOBRESTR ABOVE       */
*    2 IOBINCAM FIXED(15) BDY(WORD), /* QSAM, BSAM, EXCP ACCESS    0154
*                                       METHOD -- NORMAL SCHEDULING -
*                                       VALUE USED TO INCREMENT BLOCK
*                                       COUNT FIELD IN DCB FOR     0154
*                                       MAGNETIC TAPE.  CHAINED    0154
*                                       SCHEDULING - ZEROS.        0154
*                                       QSAM, BSAM -- OPERATION CODE
*                                       OF WRITE CCW WHEN A USASI  0154
*                                       CONTROL CHARACTER AND NO DATA
*                                       IS TO BE WRITTEN (PRINTER AND
*                                       CARD PUNCH ONLY)             */
*     3 IOBBTAMF CHAR(1),            /* FLAG BYTE FOR BTAM           */
*      4 IOBPRMER BIT(1),            /* SAD OR ENABLE ISSUED BY OPEN
*                                       RESULTED IN A PERMANENT I/O
*                                       ERROR                        */
*      4 IOBINUSE BIT(1),            /* THIS IOB IS CURRENTLY IN USE
*                                       BY AN I/O OPERATION          */
*      4 IOBRSV14 BIT(1),            /* RESERVED                     */
*      4 IOBRSV15 BIT(1),            /* RESERVED                     */
*      4 IOBRSV16 BIT(1),            /* RESERVED                     */
*      4 IOBRSV17 BIT(1),            /* RESERVED                     */
*      4 IOBRFTMG BIT(1),            /* A REQUEST-FOR-TEST MESSAGE 0154
*                                       RECEIVED FROM A REMOTE 3270
*                                       DISPLAY STATION        ICB478*/
*      4 IOBOLTST BIT(1),            /* LINE IS UNDER ON-LINE TEST 0154
*                                       OPERATION                    */
*     3 IOBRSV19 CHAR(1),            /* RESERVED                     */
*    2 IOBERRCT FIXED(15);           /* USED BY I/O SUPERVISOR ERROR
*                                       ROUTINES TO COUNT TEMPORARY
*                                       ERRORS DURING RETRY          */
*                                                                  0154
*                                                                  0154
* DECLARE 1 IOBORG04                                               0155
*       DEF(IOBINCAM) BDY(WORD),                                   0155
*    2 IOBCRDCC CHAR(1),             /* DATA CHECK ERROR COUNT     0155
*                                       (OPTICAL READER)             */
*    2 IOBCRILC CHAR(1);             /* INCORRECT LENGTH ERROR COUNT
*                                       (OPTICAL READER)             */
*                                                                  0155
*                                                                  0155
* DECLARE 1 IOBORG12                                               0156
*       DEF(IOBINCAM) BDY(WORD),                                   0156
*    2 IOBFL4   BIT(8),              /* FLAG 4 - SENSE ERROR COUNTS
*                                       FOR MAGNETIC DOCUMENT READER
*                                       (3890) (OS/VS1)        MDC025*/
*     3 IOBOVR   BIT(1),             /* OVERRUN ERROR          MDC026*/
*     3 IOBREJ   BIT(1),             /* COMMAND REJECT ERROR   MDC027*/
*     3 IOBDCK   BIT(1),             /* DATA CHECK ERROR       MDC028*/
*     3 IOBBUS   BIT(1),             /* BUS-OUT ERROR          MDC029*/
*     3 IOBEQP   BIT(1),             /* EQUIPMENT CHECK ERROR  MDC030*/
*     3 IOBENT   BIT(1),             /* FIRST TIME ENTRY SWITCH    0156
*                                                              MDC045*/
*     3 IOBRSV47 BIT(1),             /* RESERVED FOR 3890      MDC044*/
*     3 IOBRSV46 BIT(1);             /* RESERVED FOR 3890      MDC033*/
*                                                                  0156
*                                                                  0156
* /* *************************************************************** */
* /*                                                                 */
* /*                EXTENSION SECTIONS OF THE IOB                    */
* /*                                                                 */
* /* *************************************************************** */
*                                                                  0157
*                        /* **************************************** */
*                        /*    DIRECT ACCESS EXTENSION *** 8 BYTES   */
*                        /* **************************************** */
*                                                                  0157
* DECLARE                                                          0157
*   1 IOBEXTEN DEF(IOBSTDRD) POS(33) BDY(WORD),                    0157
*    2 IOBSEEK  CHAR(8) BDY(WORD),   /* A SEEK ADDRESS (IN THE FORMAT
*                                       MBBCCHHR) USED WITH A CHANNEL
*                                       PROGRAM                      */
*     3 IOBM     CHAR(1),            /* THE NUMBER OF THE DEB EXTENT
*                                       TO BE USED FOR THIS REQUEST.
*                                       THE FIRST EXTENT IS NUMBER 0157
*                                       ZERO.                        */
*     3 IOBBB    CHAR(2),            /* BIN NUMBER(DATA CELL)        */
*      4 IOBBB1   CHAR(1),                                         0157
*      4 IOBBB2   CHAR(1),                                         0157
*     3 IOBCC    CHAR(2),            /* CYLINDER NUMBER              */
*      4 IOBCC1   CHAR(1),                                         0157
*      4 IOBCC2   CHAR(1),                                         0157
*     3 IOBHH    CHAR(2),            /* TRACK NUMBER                 */
*      4 IOBHH1   CHAR(1),                                         0157
*      4 IOBHH2   CHAR(1),                                         0157
*     3 IOBR     CHAR(1);            /* RECORD NUMBER                */
*                                                                  0157
*                        /* **************************************** */
*                        /*    BTAM EXTENSION *** 40 BYTES +         */
*                        /*                   CHANNEL PROGRAM        */
*                        /* **************************************** */
*                                                                  0158
* DECLARE 1 IOBORG05                                               0158
*       DEF(IOBEXTEN) BDY(WORD),                                   0158
*    2 IOBUCBX  CHAR(1),             /* UCB INDEX.  THE LINE NUMBER
*                                       IS USED AS AN INDEX TO LOCATE
*                                       THE PROPER UCB ADDRESS IN THE
*                                       DEB.                         */
*    2 IOBWORK  CHAR(5),             /* WORK AREA USED BY ERROR    0158
*                                       ROUTINES AND ON-LINE TERMINAL
*                                       TEST ROUTINES                */
*    2 IOBRCVPT CHAR(1),             /* RECEIVED ACK (ACK-0 OR ACK-1)*/
*    2 IOBSNDPT CHAR(1),             /* SENT ACK (ACK-0 OR ACK-1)    */
*    2 IOBERCCW CHAR(8) BDY(WORD),   /* CCW AREA USED BY THE BTAM  0158
*                                       ERROR RECOVERY ROUTINES      */
*    2 IOBERINF CHAR(16) BDY(WORD),  /* ERROR INFORMATION FIELD USED
*                                       BY THE BTAM ERROR RECOVERY 0158
*                                       ROUTINES                     */
*    2 IOBCPA   CHAR(8) BDY(WORD);   /* CHANNEL PROGRAMS AREA.  THE
*                                       LENGTH DEPENDS ON THE      0158
*                                       TERMINAL AND THE OPTIONS.    */
*                                                                  0158
*                        /* **************************************** */
*                        /*    GAM EXTENSION *** 40 BYTES            */
*                        /* **************************************** */
*                                                                  0159
* DECLARE 1 IOBORG06                                               0159
*       DEF(IOBEXTEN) BDY(WORD),                                   0159
*     3 IOBUCBXG CHAR(1),            /* UCB INDEX                    */
*     3 IOBRSV37 CHAR(3),            /* RESERVED                     */
*     3 IOBNXTPT PTR(31),            /* ADDRESS OF NEXT AVAILABLE  0159
*                                       IOB.  SET TO ZERO IF THIS IS
*                                       LAST IOB.                    */
*      4 IOBSTATA CHAR(1),           /* STATUS INDICATORS            */
*       5 IOBAVLFL BIT(1),           /* IF 0, IOB IS AVAILABLE.    0159
*                                       IF 1, IOB IS NOT AVAILABLE   */
*       5 IOBRSV20 BIT(1),           /* RESERVED                     */
*       5 IOBRSV21 BIT(1),           /* RESERVED                     */
*       5 IOBRSV22 BIT(1),           /* RESERVED                     */
*       5 IOBRSV23 BIT(1),           /* RESERVED                     */
*       5 IOBRSV24 BIT(1),           /* RESERVED                     */
*       5 IOBRSV25 BIT(1),           /* RESERVED                     */
*       5 IOBRSV26 BIT(1),           /* RESERVED                     */
*      4 IOBNXTPB PTR(24),           /* SAME AS IOBNXTPT ABOVE       */
*     3 IOBCCW   CHAR(32) BDY(WORD); /* LIST OF CHANNEL COMMAND WORDS
*                                       TO TRANSFER DATA             */
*                                                                  0159
*                        /* **************************************** */
*                        /*    QISAM EXTENSION *** 2 BYTES           */
*                        /* **************************************** */
*                                                                  0160
* DECLARE 1 IOBORG07                                               0160
*       DEF(IOBEXTEN) POS(9) BDY(WORD),                            0160
*    2 W1IEXTEN CHAR(2),             /* APPENDAGE CODES FOR BOTH   0160
*                                       NORMAL AND ABNORMAL CHANNEL
*                                       END CONDITIONS               */
*     3 W1OEXTEN CHAR(2);            /* SAME AS W1IEXTEN ABOVE       */
*                                                                  0160
*                        /* **************************************** */
*                        /*    BISAM EXTENSION *** 16 BYTES          */
*                        /* **************************************** */
*                                                                  0161
* DECLARE 1 IOBORG08                                               0161
*       DEF(IOBEXTEN) POS(9) BDY(WORD),                            0161
*    2 IOBCCWAD PTR(31),             /* FOR FIXED LENGTH RECORDS,  0161
*                                       ADDRESS OF FIRST CCW OF    0161
*                                       CHANNEL PROGRAM.           0161
*                                       FOR VARIABLE LENGTH RECORDS,
*                                       ADDRESS OF BUFFER, IF DYNAMIC
*                                       BUFFERING SPECIFIED, AFTER 0161
*                                       COMPLETION OF READ FOR UPDATE
*                                       (READ KU)                    */
*    2 IOBINDCT CHAR(1),             /* INDICATORS                   */
*     3 IOBDEQCP BIT(1),             /* DEQUEUE CHANNEL PROGRAM FROM
*                                       QUEUE                        */
*     3 IOBUNSCH BIT(1),             /* UNSCHEDULED QUEUE            */
*     3 IOBOVPTR BIT(1),             /* IF 0, DECBAREA + 6 POINTS TO
*                                       OVERFLOW RECORD DATA.      0161
*                                       IF 1, DCBMSWA POINTS TO    0161
*                                       OVERFLOW RECORD KEY FOLLOWED
*                                       BY DATA.                     */
*     3 IOBKEYAD BIT(1),             /* IF 0, DECBKEY POINTS TO    0161
*                                       OVERFLOW RECORD KEY.       0161
*                                       IF 1, DCBMSWA + 8 POINTS TO
*                                       OVERFLOW RECORD KEY.         */
*     3 IOBRSV27 BIT(1),             /* RESERVED                     */
*     3 IOBRSV28 BIT(1),             /* RESERVED                     */
*     3 IOBRSV29 BIT(1),             /* RESERVED                     */
*     3 IOBCHNNL BIT(1),             /* IF 0, NORMAL CHANNEL END HAS
*                                       OCCURRED.                  0161
*                                       IF 1, ABNORMAL CHANNEL END 0161
*                                       HAS OCCURRED.                */
*    2 IOBUNSQR CHAR(1),             /* REASON FOR UNSCHEDULED QUEUE */
*     3 IOBCPBSY BIT(1),             /* CHANNEL PROGRAM CP1 OR CP2 0161
*                                       BUSY                         */
*     3 IOBNTAV1 BIT(1),             /* NO CP4, CP5 OR CP6 AVAILABLE */
*     3 IOBNTAV2 BIT(1),             /* NO CP7 AVAILABLE             */
*     3 IOBKNWR  BIT(1),             /* WRITE KN IS IN EFFECT      0161
*                                       (UNSCHEDULED IOB IS FOR    0161
*                                       WRITE KN)                    */
*     3 IOBKNRWR BIT(1),             /* WRITE KN IS IN EFFECT      0161
*                                       (UNSCHEDULED IOB IS FOR    0161
*                                       READ OR WRITE KN)            */
*     3 IOBRSV30 BIT(1),             /* RESERVED                     */
*     3 IOBRSV31 BIT(1),             /* RESERVED                     */
*     3 IOBRSV32 BIT(1),             /* RESERVED                     */
*    2 IOBAPP   CHAR(1),             /* APPENDAGE CODE               */
*    2 IOBASYN  CHAR(1),             /* ASYNCHRONOUS ROUTINE CODE    */
*    2 IOBFCHAD PTR(31),             /* FORWARD CHAIN ADDRESS        */
*     3 IOBCOUNT CHAR(1),            /* WRITE CHECK COUNTER          */
*     3 IOBFCHNB PTR(24),            /* FORWARD CHAIN ADDRESS        */
*    2 IOBBCHAD PTR(31);             /* BACKWARD CHAIN ADDRESS       */
*                                                                  0161
*                        /* **************************************** */
*                        /*    BDAM EXTENSION *** 40 BYTES +         */
*                        /*                   CHANNEL PROGRAM        */
*                        /* **************************************** */
*                                                                  0162
* DECLARE 1 IOBORG09                                               0162
*       DEF(IOBEXTEN) POS(9) BDY(WORD),                            0162
*    2 IOBDBYTR FIXED(15),           /* NUMBER OF UNUSED BYTES     0162
*                                       REMAINING ON THE TRACK       */
*    2 IOBDIOBS FIXED(15),           /* OVERALL SIZE OF THE IOB      */
*    2 IOBDPLAD PTR(31),             /* ADDRESS OF THE NEXT IOB IN 0162
*                                       THE POOL OF IOB'S            */
*     3 IOBDAYLI CHAR(1),            /* ALL BITS SET TO ZERO INDICATE
*                                       THE AVAILABILITY OF THIS IOB */
*     3 IOBDPLB  PTR(24),            /* ADDRESS OF THE NEXT IOB IN 0162
*                                       THE POOL OF IOB'S            */
*    2 IOBDTYPE CHAR(1),             /* THE TYPE OF REQUEST AND    0162
*                                       SPECIFIED OPTIONS            */
*     3 IOBVERFY BIT(1),             /* VERIFY                       */
*     3 IOBOVFLO BIT(1),             /* OVERFLOW                     */
*     3 IOBEXTSC BIT(1),             /* EXTENDED SEARCH              */
*     3 IOBFDBCK BIT(1),             /* FEEDBACK                     */
*     3 IOBACTAD BIT(1),             /* ACTUAL ADDRESSING            */
*     3 IOBDYNBF BIT(1),             /* DYNAMIC BUFFERING            */
*     3 IOBRDEXC BIT(1),             /* READ EXCLUSIVE               */
*     3 IOBRELBL BIT(1),             /* RELATIVE BLOCK ADDRESSING    */
*    2 IOBDTYP2 CHAR(1),             /* SECOND BYTE OF OPTIONS AND 0162
*                                       REQUESTS                     */
*     3 IOBSKEY  BIT(1),             /* KEY ADDRESS CODED AS 'S'     */
*     3 IOBSBLKL BIT(1),             /* BLOCK LENGTH CODED AS 'S'    */
*     3 IOBSUFFX BIT(2),             /* IF BITS 2 AND 3 ARE ONE, RU
*                                       IS SUFFIXED TO THE TYPE,   0162
*                                       INDICATING THAT THE FEEDBACK
*                                       ADDRESS IN DECNXADR CAN BE 0162
*                                       THE ADDRESS OF EITHER THE  0162
*                                       NEXT DATA RECORD OR THE NEXT
*                                       CAPACITY RECORD, WHICHEVER 0162
*                                       OCCURS FIRST.              0162
*                                       IF BIT 2 IS ZERO AND BIT 3 IS
*                                       ONE, R IS SUFFIXED TO THE  0162
*                                       TYPE, INDICATING THAT THE  0162
*                                       FEEDBACK ADDRESS IN DECNXADR
*                                       IS THE ADDRESS OF THE NEXT 0162
*                                       DATA RECORD.                 */
*     3 IOBRQUST BIT(1),             /* IF 1, READ REQUEST.        0162
*                                       IF 0, WRITE REQUEST.         */
*     3 IOBTYPE  BIT(1),             /* IF 1, KEY TYPE.            0162
*                                       IF 0, ID TYPE.               */
*     3 IOBADDTY BIT(1),             /* ADD TYPE                     */
*     3 IOBRELEX BIT(1),             /* RELEX MACRO ISSUED           */
*    2 IOBDSTAT CHAR(2),             /* STATUS OF THE I/O REQUEST    */
*     3 IOBSTAT1 CHAR(1),            /* FLAG BYTE                    */
*      4 IOBABNRM BIT(1),            /* ABNORMAL COMPLETION          */
*      4 IOBNEWVL BIT(1),            /* ON EXTENDED SEARCH, THE NEXT
*                                       EXTENT IS ON A NEW VOLUME. 0162
*                                       THE ASI ROUTINE MUST ISSUE THE
*                                       EXCP MACRO.  THE END-OF-EXTENT
*                                       APPENDAGE CANNOT.            */
*      4 IOBSYNCH BIT(1),            /* MODULE WAS ENTERED VIA     0162
*                                       SYNCH                  MDC037*/
*      4 IOBPASS2 BIT(1),            /* ON EXTENDED SEARCH, INDICATES
*                                       TO THE RELATIVE BLOCK      0162
*                                       CONVERSION ROUTINE THAT THE
*                                       SECOND PASS OF A TWO-PASS  0162
*                                       CONVERSION ROUTINE HAS     0162
*                                       COMPLETED                    */
*      4 IOBENQUE BIT(1),            /* FOR EXCLUSIVE CONTROL      0162
*                                       REQUEST, INDICATES THAT A  0162
*                                       RECORD HAS BEEN ENQUEUED     */
*      4 IOBBUFF  BIT(1),            /* A BUFFER HAS BEEN ASSIGNED 0162
*                                       TO THIS IOB                  */
*      4 IOBADDVU BIT(1),            /* IOB BEING USED TO ADD A    0162
*                                       VARIABLE (V) OR UNDEFINED (U)
*                                       TYPE RECORD TO THE DATA SET  */
*      4 IOBSIORT BIT(1),            /* INDICATES TO THE DYNAMIC   0162
*                                       BUFFERING ROUTINE THAT IT  0162
*                                       WAS ENTERED FROM, AND IS TO
*                                       RETURN TO, THE START I/O   0162
*                                       APPENDAGE MODULE             */
*     3 IOBSTAT2 CHAR(1),            /* ERROR CODE FOR ABNORMAL    0162
*                                       COMPLETION USED AS POST CODE
*                                       IN ECB                       */
*    2 IOBDCPND PTR(31),             /* ADDRESS OF LOCATION WHERE  0162
*                                       CHANNEL END PROGRAM SHOULD 0162
*                                       END                          */
*    2 IOBDBYTN FIXED(15),           /* NUMBER OF BYTES NEEDED ON A
*                                       TRACK TO WRITE A NEW BLOCK   */
*    2 IOBRSV34 CHAR(2),             /* RESERVED                     */
*    2 IOBDQPTR PTR(31),             /* ADDRESS OF IOB FOR NEXT I/O
*                                       OPERATION TO BE EXECUTED     */
*    2 IOBRSV35 CHAR(8) BDY(WORD),   /* RESERVED                     */
*    2 IOBDNCRF CHAR(8) BDY(WORD),   /* COUNT FIELD FOR NEW BLOCK    */
*    2 IOBCHNPR CHAR(0) BDY(WORD);   /* CHANNEL PROGRAM USED TO    0162
*                                       TRANSFER DATA AS REQUESTED BY
*                                       THE READ OR WRITE MACRO    0162
*                                       INSTRUCTION STARTS HERE      */
*                                                                  0162
*                        /* **************************************** */
*                        /*      VSAM EXTENSION *** 24 BYTES         */
*                        /* **************************************** */
*                                                                  0163
* DECLARE 1 IOBORG10                                               0163
*       DEF(IOBEXTEN) POS(9) BDY(WORD),                            0163
*    2 IOBSEEK2 CHAR(8) BDY(WORD),   /* SEEK FIELD 2           ICB435*/
*     3 IOBSK2M  CHAR(1),            /* EXTENT NUMBER          ICB435*/
*     3 IOBSK2BB CHAR(2),            /* BIN NUMBER             ICB435*/
*     3 IOBSK2CC CHAR(2),            /* CYLINDER NUMBER        ICB435*/
*     3 IOBSK2HH CHAR(2),            /* HEAD NUMBER            ICB435*/
*     3 IOBSK2R  CHAR(1),            /* RECORD NUMBER          ICB435*/
*    2 IOBBUFC  PTR(31),             /* ADDRESS OF ASSOCIATED BUFFER
*                                       CONTROL BLOCK          ICB435*/
*    2 IOBREADA PTR(31),             /* ADDRESS OF FIRST READ CHANNEL
*                                       PROGRAM SEGMENT THAT HAS NOT
*                                       BEEN PROCESSED         ICB435*/
*    2 IOBNEXTA PTR(31),             /* ADDRESS OF NEXT ACTIVE IOB 0163
*                                                              ICB435*/
*    2 IOBRDCHP PTR(31);             /* ADDRESS OF READ CHANNEL    0163
*                                       PROGRAM                ICB435*/
*                                                                  0163
*                        /* **************************************** */
*                        /*    VTAM EXTENSION (OS/VS1 ONLY)          */
*                        /*        *** 24 BYTES                      */
*                        /* **************************************** */
*                                                                  0164
* DECLARE 1 IOBORG11                                               0164
*       DEF(IOBEXTEN) BDY(WORD),                                   0164
*    2 IOBERCT  PTR(31),             /* SAME AS IOBERCTA BELOW MDC001*/
*     3 IOBUCBXV PTR(8),             /* UCB INDEX              MDC050*/
*      4 IOBRTYPE BIT(8),            /* RECORD TYPE FOR OBR    MDC002*/
*     3 IOBERCTA PTR(24),            /* POINTER TO COUNTERS FOR SIO
*                                       AND TEMPORARY ERRORS   MDC003*/
*    2 IOBNAME  PTR(31),             /* SAME AS IOBNAMEA BELOW MDC004*/
*     3 IOBNAMSZ BIT(8),             /* SIZE OF TERMINAL NAME  MDC005*/
*     3 IOBNAMEA PTR(24),            /* POINTER TO TERMINAL NAME   0164
*                                                              MDC006*/
*    2 IOBMDREC PTR(31),             /* POINTER TO RECORD BEING    0164
*                                       PASSED TO MISCELLANEOUS DATA
*                                       RECORDER               MDC007*/
*    2 IOBRCD   PTR(31),             /* POINTER TO QUEUE OF OBR    0164
*                                       RECORDS PASSED FROM 3705   0164
*                                                              MDC008*/
*    2 IOBSENSV BIT(8),              /* SENSE BYTE SAVE AREA   MDC009*/
*    2 IOBCSWSV CHAR(7);             /* SAVE AREA FOR LAST 7 BYTES OF
*                                       CSW                    MDC010*/
*                                                                  0164
*                        /* **************************************** */
*                        /*    3540 EXTENSION *** 4 BYTES    @Z30OP9A*/
*                        /* **************************************** */
*                                                                  0165
* DECLARE 1 IOBORG13                                               0165
*       DEF(IOBEXTEN) BDY(WORD),     /*                      @Z30OP9A*/
*    2 IOBSKADR CHAR(4) BDY(WORD),   /* 3540 SEEK ADDRESS          0165
*                                       (MDC300)             @Z30OP9A*/
*     3 IOBSKRV  PTR(8),             /* RESERVED  (MDC301)   @Z30OP9A*/
*     3 IOBSKTT  PTR(8),             /* TRACK NUMBER               0165
*                                       (MDC302)             @Z30OP9A*/
*     3 IOBSK0   PTR(8),             /* MUST BE ZERO               0165
*                                       (MDC303)             @Z30OP9A*/
*     3 IOBSKSS  PTR(8);             /* SECTOR NUMBER              0165
*                                       (MDC304)             @Z30OP9A*/
*DCL IOBPRPTR PTR(31) REG(3),       /* IOB PREFIX ADDRESS */       0166
*    IOBSTPTR PTR(31) REG(3);       /* IOB STANDARD SECTION ADDRESS */
*/*********SERVICE REQUEST BLOCK*************************************/
* DECLARE                                                          0167
*   1 SRBSECT   BASED(SRBPTR)  BDY(WORD),                          0167
*        2 SRBID CHAR(4),               /*SRB IDENTIFIER            */
*                                                                  0167
*        2 SRBFLNK  PTR(31),            /*FORWARD CHAIN FIELD       */
*                                                                  0167
*        2 SRBASCB  PTR(31),            /*ADDRESS SPACE TO BE      0167
*                                         DISPATCHED                */
*        2 SRBFLC BDY(WORD),            /*SRB AREA MOVED TO LOW CORE*/
*                                                                  0167
*          3   SRBCPAFF  CHAR(2),       /*CPU AFFINITY DESCRIPTOR   */
*                                                                  0167
*          3   SRBPASID  CHAR(2),       /*PURGEDQ ASID              */
*                                                                  0167
*          3   SRBPTCB   PTR(31),       /*PURGEDQ TCB ADDRESS       */
*                                                                  0167
*        2 SRBEP  PTR(31),              /* ENTRY POINT              */
*                                                                  0167
*        2 SRBRMTR  PTR(31),            /* RESOURCE MGR ROUTINE     */
*                                                                  0167
*        2 SRBPARM  PTR(31),            /* USER PARAMETER           */
*                                                                  0167
*        2 SRBSAVE  PTR(31),            /* SAVE AREA POINTER        */
*                                                                  0167
*        2 SRBPKF   CHAR(1),            /* PROTECT KEY              */
*                                                                  0167
*        2 SRBPRIOR CHAR(1),            /* PRIORITY LEVEL           */
*                                                                  0167
*        2 *   CHAR(2),                 /* RESERVED                 */
*                                                                  0167
*        2     *  PTR(31);     /*RESERVED          */              0167
*  DCL SRB CHAR(LENGTH(SRBSECT)) DEFINED(SRBSECT);                 0168
*                                      /* SRB LABEL                 */
*                                                                  0169
*                                                                  0169
*/* **************************************************************** */
*/*                                                                  */
*/*            PREFIXED SAVE AREA                                    */
*/*                                                                  */
*/*  OS/VS2 RELEASE 4, 07/24/75, LEVEL=3                             */
*/*                                                                  */
*/*  METHOD OF ACCESS                                                */
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */
*/*             USING ON PSA GIVES ADDRESSABILITY FOR ALL SYMBOLS.   */
*/*      PL/S - PSA WILL BE BASED(0) FOR PL/S I OR LOCATION(0) FOR   */
*/*             PL/S II UNLESS %PSABASE IS SET TO SOME OTHER VALUE   */
*/*             BEFORE INCLUDE FOR MACRO.                            */
*/*                                                                  */
*/*  NOTE                                                            */
*/*      THE LABELS BEGINNING WITH PSA OR FLC ARE THE PROPER LABELS  */
*/*      TO USE.  THE OTHER LABELS ARE GIVEN AS ALIAS NAMES FOR      */
*/*      COMPATIBILITY WITH LABELS USED FOR SYSTEM 360 LOW CORE.     */
*/*                                                                  */
*/* **************************************************************** */
*                                                                  0169
*                                                                  0169
*DECLARE                                                           0169
*  1 PSA      LOCATION(0) BDY(DWORD),                              0169
*   2 FLCRNPSW    CHAR(8) BDY(DWORD),    /* RESTART NEW PSW (AFTER 0169
*                                           IPL)                     */
*    3 FLCIPPSW    CHAR(8) BDY(DWORD),   /* IPL PSW                  */
*   2 FLCROPSW    CHAR(8) BDY(DWORD),    /* RESTART OLD PSW (AFTER 0169
*                                           IPL)                     */
*    3 FLCICCW1    CHAR(8) BDY(DWORD),   /* IPL CCW1                 */
*   2 FLCICCW2    CHAR(8) BDY(DWORD),    /* IPL CCW2                 */
*    3 FLCCVT      PTR(31),              /* ADDRESS OF CVT (AFTER  0169
*                                           IPL)                     */
*    3 *           CHAR(4),              /* RESERVED (AFTER IPL)     */
*   2 FLCEOPSW    CHAR(8) BDY(DWORD),    /* EXTERNAL OLD PSW         */
*   2 FLCSOPSW    CHAR(8) BDY(DWORD),    /* SVC OLD PSW              */
*   2 FLCPOPSW    CHAR(8) BDY(DWORD),    /* PROGRAM CHECK OLD PSW    */
*   2 FLCMOPSW    CHAR(8) BDY(DWORD),    /* MACHINE CHECK OLD PSW    */
*   2 FLCIOPSW    CHAR(8) BDY(DWORD),    /* INPUT/OUTPUT OLD PSW     */
*   2 FLCCSW      CHAR(8) BDY(DWORD),    /* CHANNEL STATUS WORD      */
*   2 FLCCAW      CHAR(4) BDY(WORD),     /* CHANNEL ADDRESS WORD     */
*   2 FLCCVT2     PTR(31),               /* ADDRESS OF CVT - USED BY
*                                           DUMP ROUTINES      ICB319*/
*   2 FLCTIMER    CHAR(4),               /* TIMER                    */
*   2 FLCTRACE    PTR(31),               /* ADDRESS OF TRACE TABLE 0169
*                                           HEADER                   */
*   2 FLCENPSW    CHAR(8) BDY(DWORD),    /* EXTERNAL NEW PSW         */
*   2 FLCSNPSW    CHAR(8) BDY(DWORD),    /* SVC NEW PSW              */
*   2 FLCPNPSW    CHAR(8) BDY(DWORD),    /* PROGRAM CHECK NEW PSW    */
*   2 FLCMNPSW    CHAR(8) BDY(DWORD),    /* MACHINE CHECK NEW PSW    */
*   2 FLCINPSW    CHAR(8) BDY(DWORD),    /* INPUT/OUTPUT NEW PSW     */
*   2 *           CHAR(4),               /* RESERVED                 */
*   2 PSAEEPSW    CHAR(4) BDY(WORD),     /* EXTENDED PSW DATA STORED
*                                           ON EXTERNAL INTERRUPT  0169
*                                                              MDC084*/
*    3 PSASPAD     FIXED(15),            /* ISSUING PROCESSOR'S    0169
*                                           PHYSICAL ADDRESS ON EMS
*                                           OR EXTERNAL CALL       0169
*                                           INTERRUPT          MDC046*/
*    3 FLCEICOD    FIXED(15),            /* EXTERNAL INTERRUPTION  0169
*                                           CODE                     */
*   2 PSAESPSW    CHAR(4) BDY(WORD),     /* EXTENDED PSW DATA STORED
*                                           ON SVC INTERRUPT   MDC085*/
*    3 *           CHAR(1),              /* RESERVED - SET TO ZERO   */
*    3 FLCSVILC    PTR(8),               /* SVC INSTRUCTION LENGTH 0169
*                                           COUNTER - NUMBER OF BYTES
*                                                              MDC079*/
*     4 *        BIT(5),                 /* ALWAYS ZERO              */
*     4 FLCSILCB BIT(3),                 /* SIGNIFICANT BITS IN ILC
*                                           FIELD - LAST BIT IS    0169
*                                           ALWAYS ZERO        MDC080*/
*    3 FLCSVCN     FIXED(15),            /* SVC INTERRUPTION CODE -
*                                           SVC NUMBER         MDC081*/
*   2 PSAEPPSW    CHAR(8) BDY(WORD),     /* EXTENDED PSW FOR PROGRAM
*                                           INTERRUPT          MDC086*/
*    3 *           CHAR(1),              /* RESERVED - SET TO ZERO   */
*    3 FLCPIILC    PTR(8),               /* PROGRAM INSTRUCTION    0169
*                                           LENGTH COUNTER - NUMBER
*                                           OF BYTES IN INSTRUCTION
*                                           CAUSING PROGRAM        0169
*                                           INTERRUPTION       MDC082*/
*     4 *        BIT(5),                 /* ALWAYS ZERO              */
*     4 FLCPILCB BIT(3),                 /* SIGNIFICANT BITS IN ILC
*                                           FIELD - LAST BIT IS    0169
*                                           ALWAYS ZERO        MDC083*/
*    3 FLCPICOD    FIXED(15),            /* PROGRAM INTERRUPTION   0169
*                                           CODE                     */
*     4 PSARV049    CHAR(1),             /* RESERVED FOR IMPRECISE 0169
*                                           INTERRUPTS         MDC087*/
*     4 PSAPICOD    PTR(8),              /* 8-BIT INTERRUPT CODE   0169
*                                                              MDC088*/
*      5 PSAPIPER BIT(1),                /* PER INTERRUPT OCCURRED 0169
*                                                              MDC089*/
*      5 PSAPIMC  BIT(1),                /* MONITOR CALL INTERRUPT 0169
*                                           OCCURRED           MDC090*/
*      5 PSAPIPC  BIT(6),                /* AN UNSOLICITED PROGRAM 0169
*                                           CHECK HAS OCCURRED IF ANY
*                                           OF THESE 6 BITS ARE ON 0169
*                                                              MDC091*/
*    3 FLCTEA      PTR(31),              /* TRANSLATION EXCEPTION  0169
*                                           ADDRESS                  */
*     4 *           CHAR(1),             /* RESERVED - SET TO ZERO   */
*     4 FLCTEAA     PTR(24),             /* TRANSLATION EXCEPTION  0169
*                                           ADDRESS                  */
*   2 *           CHAR(1),               /* RESERVED - SET TO ZERO   */
*   2 FLCMCNUM    PTR(8),                /* MONITOR CLASS NUMBER     */
*   2 FLCPERCD    CHAR(1),               /* PROGRAM EVENT RECORDING
*                                           CODE                     */
*   2 *           CHAR(1),               /* RESERVED - SET TO ZERO   */
*   2 FLCPER      PTR(31),               /* PER ADDRESS              */
*    3 *           CHAR(1),              /* RESERVED - SET TO ZERO   */
*    3 FLCPERA     PTR(24),              /* PER ADDRESS              */
*   2 *           CHAR(1),               /* RESERVED - SET TO ZERO   */
*   2 FLCMTRCD    CHAR(3),               /* MONITOR CODE             */
*   2 *           CHAR(8),               /* RESERVED                 */
*   2 FLCMCLA     CHAR(344) BDY(DWORD),  /* MACHINE CHECK LOGOUT   0169
*                                           AREA                     */
*    3 FLCCHNID    CHAR(4),              /* CHANNEL ID               */
*    3 FLCIOEL     PTR(31),              /* SAME AS FLCIOELA BELOW   */
*     4 *           CHAR(1),             /* RESERVED                 */
*     4 FLCIOELA    PTR(24),             /* I/O EXTENDED LOGOUT    0169
*                                           (IOEL) POINTER           */
*    3 FLCLCL      CHAR(4),              /* LIMITED CHANNEL LOGOUT 0169
*                                           (ECSW)                   */
*    3 *           CHAR(2),              /* RESERVED                 */
*    3 *           CHAR(1),              /* RESERVED           MDC051*/
*    3 *           CHAR(1),              /* RESERVED           MDC052*/
*    3 FLCIOA      PTR(31),              /* I/O ADDRESS              */
*     4 *           CHAR(1),             /* RESERVED                 */
*     4 FLCIOAA     PTR(24),             /* I/O ADDRESS              */
*    3 *           CHAR(44),             /* RESERVED                 */
*    3 FLCMCIC     CHAR(8),              /* MACHINE-CHECK          0169
*                                           INTERRUPTION CODE        */
*    3 *           CHAR(8),              /* RESERVED                 */
*    3 FLCFSA      PTR(31),              /* FAILING STORAGE ADDRESS  */
*     4 *           CHAR(1),             /* ZEROES                   */
*     4 FLCFSAA     PTR(24),             /* FAILING STORAGE ADDRESS  */
*    3 FLCRGNCD    CHAR(4),              /* REGION CODE              */
*    3 FLCFLA      CHAR(96) BDY(WORD),   /* FIXED LOGOUT AREA        */
*    3 FLCFPSAV    CHAR(32) BDY(DWORD),  /* FLOATING POINT REGISTER
*                                           SAVE AREA                */
*    3 FLCGRSAV (16) FIXED(31),          /* GENERAL REGISTER SAVE  0169
*                                           AREA                     */
*    3 FLCCRSAV (16) FIXED(31),          /* CONTROL REGISTER SAVE  0169
*                                           AREA                     */
*   2 FLCHDEND    CHAR(0) BDY(DWORD),    /* END OF HARDWARE        0169
*                                           ASSIGNMENTS              */
*   2 PSAPSA      CHAR(4) BDY(WORD),     /* CONTROL BLOCK ACRONYM IN
*                                           EBCDIC                   */
*   2 PSACPUPA    PTR(15),               /* PHYSICAL CPU ADDRESS   0169
*                                           (CHANGED DURING ACR)   0169
*                                           (MDC130)           YM3489*/
*   2 PSACPULA    PTR(15),               /* LOGICAL CPU ADDRESS      */
*   2 PSAPCCAV    PTR(31),               /* VIRTUAL ADDRESS OF PCCA  */
*   2 PSAPCCAR    PTR(31),               /* REAL ADDRESS OF PCCA     */
*   2 PSALCCAV    PTR(31),               /* VIRTUAL ADDRESS OF LCCA  */
*   2 PSALCCAR    PTR(31),               /* REAL ADDRESS OF LCCA     */
*   2 PSATNEW     PTR(31),               /* TCB NEW POINTER          */
*   2 PSATOLD     PTR(31),               /* TCB OLD POINTER          */
*   2 PSAANEW     PTR(31),               /* ASCB NEW POINTER         */
*   2 PSAAOLD     PTR(31),               /* ASCB OLD POINTER         */
*   2 PSASUPER    CHAR(4) BDY(WORD),     /* SUPERVISOR CONTROL WORD  */
*    3 PSASUP1     BIT(8),               /* FIRST BYTE OF PSASUPER   */
*     4 PSAIO    BIT(1),                 /* I/O FLIH                 */
*     4 PSASVC   BIT(1),                 /* SVC FLIH                 */
*     4 PSAEXT   BIT(1),                 /* EXTERNAL FLIH            */
*     4 PSAPI    BIT(1),                 /* PROGRAM CHECK FLIH       */
*     4 PSALOCK  BIT(1),                 /* LOCK ROUTINE             */
*     4 PSADISP  BIT(1),                 /* DISPATCHER               */
*     4 PSATCTL  BIT(1),                 /* TCTL RECOVERY FLAG     0169
*                                           (MDC310)         @Z40FP9A*/
*     4 PSARV063 BIT(1),                 /* RESERVED               0169
*                                           (MDC309)         @Z40FP9A*/
*    3 PSASUP2     BIT(8),               /* SECOND BYTE OF PSASUPER  */
*     4 PSAIPCRI BIT(1),                 /* SIGP - REMOTE IMMEDIATE  */
*     4 PSAGTF   BIT(1),                 /* GTF GIVEN CONTROL FROM 0169
*                                           FLIH                     */
*     4 PSAIPCEC BIT(1),                 /* EXTERNAL CALL SLIH IS  0169
*                                           ACTIVE             MDC047*/
*     4 PSAIPCES BIT(1),                 /* EMERGENCY SIGNAL SLIH IS
*                                           ACTIVE             MDC048*/
*     4 PSAIPCE2 BIT(1),                 /* EMERGENCY SIGNAL (EMS) 0169
*                                           SLIH RECURSIVE ENTRY   0169
*                                           FLAG               MDC110*/
*     4 PSAACR   BIT(1),                 /* AUTOMATIC CPU          0169
*                                           RECONFIGURATION (ACR) IN
*                                           CONTROL            MDC119*/
*     4 PSARTM   BIT(1),                 /* RECOVERY TERMINATION   0169
*                                           MONITOR (RTM) IN CONTROL
*                                                              MDC120*/
*     4 PSALCR   BIT(1),                 /* LOW CORE REFRESH ROUTINE
*                                           IS ACTIVE          MDC126*/
*    3 PSASUP3     BIT(8),               /* THIRD BYTE OF PSASUPER   */
*     4 PSAIOSUP BIT(1),                 /* IF ON, A MAINLINE IOS  0169
*                                           COMPONENT SUCH AS CHANNEL
*                                           SCHEDULER HAS ENTERED A
*                                           PHYSICALLY DISABLED STATE
*                                           WITHOUT REGARD TO LOCKING
*                                           REQUIREMENTS       MDC127*/
*     4 PSAPI2   BIT(1),                 /* PROGRAM CHECK FLIH     0169
*                                           RECURSION  (MDC301)    0169
*                                                            @ZM08516*/
*     4 PSAPSREG BIT(1),                 /* PSA RECOVERY RECURSION 0169
*                                           (MDC302)         @ZM08516*/
*     4 PSASPR   BIT(1),                 /* SUPER FRR IS ACTIVE    0169
*                                           (MDC305)         @ZA02995*/
*     4 PSARV011 BIT(1),                 /* RESERVED                 */
*     4 PSARV012 BIT(1),                 /* RESERVED                 */
*     4 PSARV013 BIT(1),                 /* RESERVED                 */
*     4 PSARV014 BIT(1),                 /* RESERVED                 */
*    3 PSASUP4     BIT(8),               /* FOURTH BYTE OF PSASUPER  */
*     4 PSARV015 BIT(1),                 /* RESERVED                 */
*     4 PSARV016 BIT(1),                 /* RESERVED                 */
*     4 PSARV017 BIT(1),                 /* RESERVED                 */
*     4 PSARV018 BIT(1),                 /* RESERVED                 */
*     4 PSARV019 BIT(1),                 /* RESERVED                 */
*     4 PSARV020 BIT(1),                 /* RESERVED                 */
*     4 PSARV021 BIT(1),                 /* RESERVED                 */
*     4 PSARV022 BIT(1),                 /* RESERVED                 */
*   2 PSAGPREG  (3) FIXED(31),           /* REGISTER SAVE AREA FOR 0169
*                                           I/O FLIH, SVC FLIH,    0169
*                                           EXTERNAL FLIH AND SYSTEM
*                                           TRACE                    */
*   2 PSARSREG    FIXED(31),             /* RESTART FLIH REGISTER  0169
*                                           SAVE                     */
*   2 PSAPIREG    FIXED(31),             /* PROGRAM CHECK FLIH     0169
*                                           REGISTER SAVE            */
*   2 PSAEXPS1    CHAR(8) BDY(DWORD),    /* EXTERNAL FLIH PSW SAVE 0169
*                                           AREA 1                   */
*   2 PSAEXPS2    CHAR(8) BDY(DWORD),    /* EXTERNAL FLIH PSW SAVE 0169
*                                           AREA 2                   */
*   2 PSAMPSW     CHAR(8) BDY(DWORD),    /* SETLOCK MODEL PSW        */
*   2 PSAMCHEX    CHAR(8) BDY(DWORD),    /* MCH EXIT PSW             */
*   2 PSAIPCR     CHAR(4) BDY(WORD),     /* IPC INSTRUCTION TO BE  0169
*                                           EXECUTED                 */
*   2 PSAIPCRM    CHAR(1),               /* BYTE USED BY ABOVE IPC 0169
*                                           INSTRUCTION              */
*   2 *           CHAR(3),               /* RESERVED                 */
*   2 PSAIPCD     CHAR(4) BDY(WORD),     /* IPC INSTRUCTION TO BE  0169
*                                           EXECUTED                 */
*   2 PSAIPCDM    CHAR(1),               /* BYTE USED BY ABOVE IPC 0169
*                                           INSTRUCTION              */
*   2 *           CHAR(3),               /* RESERVED                 */
*   2 PSAIPCSA    FIXED(31),             /* IPC REGISTER SAVE AREA 0169
*                                                              MDC049*/
*   2 PSAHLHIS    FIXED(31),             /* SAVE AREA FOR PSAHLHI  0169
*                                                              MDC050*/
*   2 PSARECUR    CHAR(1),               /* RESTART FLIH RECURSION 0169
*                                           INDICATOR.  IF X'00',  0169
*                                           FLIH NOT IN CONTROL.  IF
*                                           X'FF', FLIH IN CONTROL,
*                                           ENTRY IS RECURSIVE MDC093*/
*   2 PSADSSGO    PTR(8),                /* INITIALIZE DSS FLAG, SET
*                                           BY OPERATOR.  IF X'00',
*                                           DSS NOT TO BE ACTIVATED.
*                                           IF NOT X'00', NEXT     0169
*                                           RESTART INTERRUPT FROM 0169
*                                           CONSOLE SHOULD INITIALIZE
*                                           DSS.               MDC094*/
*   2 PSARV050    FIXED(15),             /* RESERVED                 */
*   2 PSASRSA     PTR(31),               /* REAL ADDRESS OF SAVE AREA
*                                           USED DURING STOP AND   0169
*                                           RESTART SUBROUTINE MDC095*/
*   2 PSACLHT     CHAR(56) BDY(WORD),    /* CPU LOCKS HELD TABLE.  0169
*                                           INITIALIZED TO ZERO.   0169
*                                           IF LOCK IS HELD, WORD  0169
*                                           REPRESENTING LOCK HAS  0169
*                                           ITS ADDRESS.             */
*    3 PSADISPL    PTR(31),              /* GLOBAL DISPATCHER LOCK   */
*    3 PSAASML     PTR(31),              /* AUXILIARY STORAGE      0169
*                                           MANAGEMENT (ASM) LOCK  0169
*                                                              MDC002*/
*    3 PSASALCL    PTR(31),              /* SPACE ALLOCATION LOCK  0169
*                                                              MDC003*/
*    3 PSAIOSSL    PTR(31),              /* IOS SYNCHRONIZATION LOCK
*                                                              MDC010*/
*    3 PSAIOSCL    PTR(31),              /* IOS CHANNEL AVAILABLE  0169
*                                           TABLE LOCK         MDC004*/
*    3 PSAIOSUL    PTR(31),              /* IOS UNIT CONTROL BLOCK 0169
*                                           LOCK               MDC005*/
*    3 PSAIOSLL    PTR(31),              /* IOS LOGICAL CHANNEL QUEUE
*                                           LOCK               MDC006*/
*    3 PSATPNCL    PTR(31),              /* TCAM'S TPNCP LOCK  MDC007*/
*    3 PSATPDNL    PTR(31),              /* TCAM'S TPDNCB LOCK MDC008*/
*    3 PSATPACL    PTR(31),              /* TCAM'S TPACBDEB LOCK   0169
*                                                              MDC009*/
*    3 PSAOPTL     PTR(31),              /* OPTIMIZER LOCK           */
*    3 PSACMSL     PTR(31),              /* CROSS MEMORY SERVICES  0169
*                                           LOCK                     */
*    3 PSALOCAL    PTR(31),              /* LOCAL LOCK               */
*    3 PSARV023    PTR(31),              /* RESERVED LOCK            */
*   2 PSALKSA     CHAR(64) BDY(WORD),    /* SETLOCK REGISTER SAVE  0169
*                                           AREA                     */
*    3 PSALKR0     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 0               */
*    3 PSALKR1     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 1               */
*    3 PSALKR2     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 2               */
*    3 PSALKR3     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 3               */
*    3 PSALKR4     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 4               */
*    3 PSALKR5     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 5               */
*    3 PSALKR6     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 6               */
*    3 PSALKR7     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 7               */
*    3 PSALKR8     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 8               */
*    3 PSALKR9     FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 9               */
*    3 PSALKR10    FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 10              */
*    3 PSALKR11    FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 11              */
*    3 PSALKR12    FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 12              */
*    3 PSALKR13    FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 13              */
*    3 PSALKR14    FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 14              */
*    3 PSALKR15    FIXED(31),            /* SETLOCK'S CALLER'S     0169
*                                           REGISTER 15              */
*   2 PSAHLHI     CHAR(4) BDY(WORD),     /* HIGHEST LOCK HELD      0169
*                                           INDICATOR                */
*    3 PSACLHS     BIT(32) BDY(WORD),    /* CPU LOCKS HELD STRING  0169
*                                                              MDC122*/
*   2 PSALITA     PTR(31),               /* ADDRESS OF LOCK INTERFACE
*                                           TABLE                    */
*   2 PSAPSWSV    CHAR(8) BDY(DWORD),    /* PSW SAVE AREA FOR      0169
*                                           DISPATCHER AND ACR       */
*   2 PSACR0      FIXED(31),             /* SAVE AREA FOR CONTROL  0169
*                                           REGISTER 0               */
*   2 PSAMCHFL    BIT(8),                /* MCH RECURSION FLAGS      */
*   2 PSASYMSK    CHAR(1),               /* THIS FIELD WILL BE USED
*                                           IN CONJUNCTION WITH THE
*                                           STNSM INSTRUCTION TO   0169
*                                           PLACE IOS CHANNEL      0169
*                                           SCHEDULER INTO A DISABLED
*                                           STATE AND SIMULTANEOUSLY
*                                           SAVE THE SYSTEM MASK OF
*                                           THE CALLER         MDC022*/
*   2 PSARV061    CHAR(1),               /* RESERVED  (MDC060) YM4244*/
*   2 PSAMCHIC    CHAR(1),               /* MCH INITIALIZATION     0169
*                                           COMPLETE FLAGS     MDC098*/
*   2 PSAWKRAP    PTR(31),               /* REAL ADDRESS OF VARY CPU
*                                           PARAMETER LIST     MDC106*/
*   2 PSAWKVAP    PTR(31),               /* VIRTUAL ADDRESS OF VARY
*                                           CPU PARAMETER LIST MDC107*/
*   2 PSAVSTAP    FIXED(15),             /* WORK AREA FOR VARY CPU 0169
*                                                              MDC108*/
*   2 PSACPUSA    PTR(15),               /* PHYSICAL CPU ADDRESS   0169
*                                           (STATIC)  (MDC131) YM3489*/
*   2 PSASTOR     FIXED(31),             /* MASTER MEMORY'S SEGMENT
*                                           TABLE ORIGIN REGISTER  0169
*                                           (STOR) VALUE             */
*   2 PSADSSRS    FIXED(31),             /* REGISTER SAVE FOR DSS  0169
*                                           PROGRAM AND SVC INTERRUPT
*                                           HANDLERS           MDC053*/
*   2 PSADSSR2    FIXED(31),             /* REGISTER SAVE AREA FOR 0169
*                                           DSS I/O AND EXTERNAL   0169
*                                           INTERRUPT HANDLERS MDC054*/
*   2 PSADSSR3    FIXED(31),             /* REGISTER SAVE AREA FOR 0169
*                                           DSS ERROR RECOVERY     0169
*                                           ROUTINE            MDC055*/
*   2 PSADSSWK    FIXED(31),             /* WORK AREA FOR DSS      0169
*                                           INTERRUPT HANDLERS MDC056*/
*   2 PSADSSTS  (5) FIXED(31),           /* REGISTER SAVE FOR DSS  0169
*                                           MODULES MAKING CALLS TO
*                                           IQATSS             MDC023*/
*   2 PSADSSFL    CHAR(4) BDY(WORD),     /* DSS FLAG BYTES     MDC024*/
*    3 PSADSSF1    BIT(8),               /* DSS STATUS BYTE    MDC029*/
*     4 PSADSSMV BIT(1),                 /* DSS MONITORING, VS2    0169
*                                           RUNNING            MDC030*/
*     4 PSADSSDM BIT(1),                 /* DSS IN VS2-2 VM    MDC031*/
*     4 PSADSSDD BIT(1),                 /* DSS IN DSS VM      MDC032*/
*     4 PSADSSDW BIT(1),                 /* DSS IN DSS WAIT    MDC033*/
*     4 PSADSSTP BIT(1),                 /* DSS PROCESSING SIGP    0169
*                                                              MDC034*/
*     4 PSADSSSP BIT(1),                 /* DSS SIGP PENDING   MDC035*/
*     4 PSADSSOI BIT(1),                 /* DSS EXECUTING OVERLAID 0169
*                                           INSTRUCTION        MDC036*/
*     4 PSADSSPI BIT(1),                 /* DSS EXECUTING PRIVILEGED
*                                           INSTRUCTION        MDC037*/
*    3 PSADSSF2    CHAR(1),              /* SYSTEM STATUS BYTE MDC038*/
*    3 PSADSSF3    BIT(8),               /* DSS FLAG BYTE      MDC099*/
*     4 PSADSSGP BIT(1),                 /* DSS SIGP INDICATOR MDC100*/
*     4 PSADSSES BIT(1),                 /* ERROR SHORT SAVE       0169
*                                           INDICATOR          MDC113*/
*     4 PSADSSNM BIT(1),                 /* NON-MONITORABLE CODE   0169
*                                           INDICATOR          MDC114*/
*     4 PSADSSRW BIT(1),                 /* DSS OWNS CVTRSTWD  MDC117*/
*     4 PSADSSMC BIT(1),                 /* MACHINE CHECK RUNNING  0169
*                                           (MDC132)           YM6287*/
*     4 PSARV055 BIT(1),                 /* RESERVED FOR DSS   MDC100*/
*     4 PSARV056 BIT(1),                 /* RESERVED FOR DSS   MDC100*/
*     4 PSARV057 BIT(1),                 /* RESERVED FOR DSS   MDC100*/
*    3 PSADSSF4    BIT(8),               /* DSS RECURSION FLAGS    0169
*                                                              MDC101*/
*     4 PSADSSRC BIT(1),                 /* PROGRAM-SVC RECURSION  0169
*                                           FLAG               MDC057*/
*     4 PSADSS12 BIT(1),                 /* PROGRAM INTERRUPT 12   0169
*                                           RECURSION FLAG     MDC058*/
*     4 PSADSSIE BIT(1),                 /* I/O-EXTERNAL RECURSION 0169
*                                           FLAG               MDC059*/
*     4 PSADSSC0 BIT(1),                 /* CONTROL REGISTER 0     0169
*                                           INVALID FLAG       MDC092*/
*     4 PSADSSDE BIT(1),                 /* DAT ERROR WHILE DSS    0169
*                                           RUNNING IN VS2 VM  MDC102*/
*     4 PSADSSVE BIT(1),                 /* DAT ERROR WHILE DSS    0169
*                                           RUNNING IN DSS VM  MDC103*/
*     4 PSADSS10 BIT(1),                 /* SEGMENT EXCEPTION      0169
*                                           RECURSION FLAG     MDC104*/
*     4 PSADSS05 BIT(1),                 /* ADDRESSING EXCEPTION   0169
*                                           RECURSION FLAG     MDC105*/
*   2 PSADSSRP    CHAR(8) BDY(DWORD),    /* DSS TO VS2-2 RESUME PSW
*                                                              MDC025*/
*   2 PSADSSPP    CHAR(8) BDY(DWORD),    /* DSS PSW FOR RETURNING  0169
*                                           CONTROL FROM PRIVILEGED
*                                           INSTRUCTION STREAM TO  0169
*                                           VS2                MDC026*/
*   2 PSADSS14    FIXED(31),             /* RESTART SECOND LEVEL   0169
*                                           INTERRUPT HANDLER CONTROL
*                                           REGISTER 14 SAVE AREA  0169
*                                                              MDC115*/
*   2 PSADSSFW    FIXED(31),             /* FULL-WORD DSS WORK AREA
*                                                              MDC116*/
*   2 PSADSSPR    FIXED(31),             /* DSS REGISTER SAVE FOR  0169
*                                           PRIVILEGED INSTRUCTION 0169
*                                           STREAM             MDC028*/
*   2 PSADSSED    CHAR(0) BDY(WORD),     /* END OF DSS FIELDS  MDC045*/
*   2 PSARV025    FIXED(31),             /* RESERVED FOR DSS         */
*   2 PSARV040    PTR(31),               /* RESERVED FOR DSS         */
*   2 PSARV041    PTR(31),               /* RESERVED FOR DSS         */
*   2 PSARV042    PTR(31),               /* RESERVED FOR DSS         */
*   2 PSARV043    PTR(31),               /* RESERVED FOR DSS         */
*   2 PSARV044    PTR(31),               /* RESERVED FOR DSS         */
*   2 PSARV045    PTR(31),               /* RESERVED FOR DSS         */
*   2 PSARSVT  (16) PTR(31),             /* RECOVERY STACK VECTOR  0169
*                                           TABLE (EACH ELEMENT    0169
*                                           MAPPED BELOW)      MDC064*/
*   2 PSASRPSW    CHAR(8) BDY(DWORD),    /* RESUME PSW FOR STOP AND
*                                           RESTART SUBROUTINE MDC096*/
*   2 PSARSPSW    CHAR(8) BDY(DWORD),    /* RESUME PSW FIELD FOR   0169
*                                           RESTART INTERRUPT HANDLER
*                                                              MDC097*/
*   2 PSASTART    CHAR(16) BDY(DWORD),   /* START FATHOM RECORDING 0169
*                                                              MDC111*/
*   2 PSASTOP     CHAR(16) BDY(DWORD),   /* STOP FATHOM RECORDING  0169
*                                                              MDC112*/
*   2 PSASFACC    CHAR(4) BDY(WORD),     /* SETFRR ABEND COMPLETION
*                                           CODE USED WHEN A SETFRR
*                                           ADD IS ISSUED AGAINST A
*                                           FULL FRR STACK     MDC123*/
*   2 PSALSFCC    CHAR(4) BDY(WORD),     /* A LOAD INSTRUCTION TO  0169
*                                           PRIME REGISTER 1 WITH THE
*                                           SETFRR ABEND COMPLETION
*                                           CODE IN PSASFACC   MDC124*/
*   2 PSASVC13    CHAR(2),               /* AN SVC 13 INSTRUCTION  0169
*                                                              MDC125*/
*   2 PSARV059    FIXED(15),             /* RESERVED                 */
*   2 PSAPIR2     FIXED(31),             /* PROGRAM CHECK FLIH     0169
*                                           REGISTER SAVE          0169
*                                           (MDC303)         @ZM08516*/
*   2 PSAPCPSW    CHAR(8) BDY(DWORD),    /* TEMPORARY OLD PSW STORAGE
*                                           FOR PROGRAM FLIH       0169
*                                           (MDC129)           YM0943*/
*   2 PSAATCVT    PTR(31),               /* ADDRESS OF VTAM ATCVT. 0169
*                                           INITIALIZED BY VTAM.   0169
*                                           (MDC300)         @Z30AP9A*/
*   2 PSAWTCOD    PTR(31),               /* CALLER-SUPPLIED WAIT   0169
*                                           STATE INFORMATION FOR  0169
*                                           STOP/RESTART           0169
*                                           (MDC306)         @ZA00904*/
*   2 PSACDAL     PTR(31),               /* ADDRESS OF COMMON      0169
*                                           DISPATCHER ELEMENT FOR 0169
*                                           THIS CPU               0169
*                                           (MDC307)         @Z40FP9A*/
*   2 PSARV062    FIXED(31),             /* RESERVED         @Z40AQ9A*/
*   2 PSAUSEND    CHAR(0) BDY(DWORD),    /* END OF ASSIGNED FIELDS 0169
*                                                              MDC109*/
*   2 *           CHAR(2024) BDY(DWORD), /* RESERVED         @Z40AQ9A*/
*   2 PSASTAK     CHAR(596) BDY(DWORD),  /* NORMAL FRR STACK       0169
*                                           (MDC304)         @ZM32352*/
*   2 *           CHAR(428);             /* RESERVED FOR EXPANSION OF
*                                           PSASTAK (MDC304) @ZM32352*/
*                                                                  0169
*                                                                  0169
*DECLARE FLC DEF(PSA) CHAR(LENGTH(PSA)) BDY(DWORD);                0170
*                                                                  0170
*                                                                  0170
*DECLARE                                                           0171
*  1 PSARSVTE CHAR(64) DEF(PSARSVT) BDY(WORD),                     0171
*                                        /* RECOVERY STACK VECTOR  0171
*                                           TABLE              MDC065*/
*   2 PSACSTK     PTR(31),               /* ADDRESS OF CURRENTLY USED
*                                           FUNCTIONAL RECOVERY    0171
*                                           ROUTINE (FRR) STACK    0171
*                                                              MDC061*/
*   2 PSANSTK     PTR(31),               /* ADDRESS OF NORMAL FRR  0171
*                                           STACK              MDC062*/
*   2 PSASSTK     PTR(31),               /* ADDRESS OF SVC-I/O-    0171
*                                           DISPATCHER FRR STACK   0171
*                                                              MDC063*/
*   2 PSASSAV     PTR(31),               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY SVC-I/O-
*                                           DISPATCHER         MDC066*/
*   2 PSAMSTK     PTR(31),               /* ADDRESS OF MCH FRR STACK
*                                                              MDC067*/
*   2 PSAMSAV     PTR(31),               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY MCH MDC068*/
*   2 PSAPSTK     PTR(31),               /* ADDRESS OF PROGRAM CHECK
*                                           FLIH FRR STACK     MDC069*/
*   2 PSAPSAV     PTR(31),               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY PROGRAM 0171
*                                           CHECK FLIH         MDC070*/
*   2 PSAESTK1    PTR(31),               /* ADDRESS OF EXTERNAL FLIH
*                                           FRR STACK FOR NON-     0171
*                                           RECURSIVE ENTRIES  MDC071*/
*   2 PSAESAV1    PTR(31),               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY NON-    0171
*                                           RECURSIVE ENTRIES  MDC072*/
*   2 PSAESTK2    PTR(31),               /* ADDRESS OF EXTERNAL FLIH
*                                           FRR STACK FOR FIRST LEVEL
*                                           RECURSIONS         MDC073*/
*   2 PSAESAV2    PTR(31),               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY EXTERNAL
*                                           FLIH FOR FIRST LEVEL   0171
*                                           RECURSIONS         MDC074*/
*   2 PSAESTK3    PTR(31),               /* ADDRESS OF EXTERNAL FLIH
*                                           FRR STACK FOR SECOND   0171
*                                           LEVEL RECURSIONS AND   0171
*                                           ACR                MDC075*/
*   2 PSAESAV3    PTR(31),               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY EXTERNAL
*                                           FLIH (ACR) FOR SECOND  0171
*                                           LEVEL RECURSIONS   MDC076*/
*   2 PSARSTK     PTR(31),               /* ADDRESS OF RESTART FLIH
*                                           FRR STACK          MDC077*/
*   2 PSARSAV     PTR(31);               /* ADDRESS OF INTERRUPTED 0171
*                                           STACK SAVED BY RESTART 0171
*                                           FLIH               MDC078*/
*                                                                  0171
*/*************************************************************/   0172
*/*                                                           */   0172
*/*  THIS STRUCTURE DESCRIBES THE CONTROL BLOCK PASSED TO THE */   0172
*/*  I/O SUPERVISOR  AS A  PARAMETER OF THE SRB.  THE CONTROL */   0172
*/*  BLOCK CONTAINS ALL INFORMATION NECESSARY TO INITIATE AND */   0172
*/*  TERMINATE AN I/O OPERATION.  FIELDS OF THE IOSB ARE USED */   0172
*/*  FOR COMMUNICATION BETWEEN THE:                           */   0172
*/*                                                           */   0172
*/*      1. I/O SUPERVISOR AND I/O REQUESTOR                  */   0172
*/*      2. I/O SUPERVISOR AND ERROR RECOVERY PROCEDURES      */   0172
*/*      3. COMPONENTS OF THE I/O SUPERVISOR                  */   0172
*/*      4. SUCCESSIVE ENTRANCES TO THE ERP'S                 */   0172
*/*      5. ERP AND COMMON WTO AND STATISTICS UPDATE MODULES  */   0172
*/*                                                           */   0172
*/*************************************************************/   0172
*/*                                                           */   0172
*/*      05/30/72   LEVEL=00                                  */   0172
*/*                                                           */   0172
*/*************************************************************/   0172
*                                                                  0172
*   DCL 1 IOSB  BDY(WORD)  BASED(IOSBPTR),                         0172
*       2 IOSFLA    CHAR(1),       /* FLAG BYTE A             */   0172
*         3 IOSACHN BIT(2),        /* COMMAND & DATA CHAINING */   0172
*           4 IOSDCHN BIT(1),      /* DATA CHAINING           */   0172
*           4 IOSCCHN BIT(1),      /* COMMAND CHAINING        */   0172
*         3 IOSERR  BIT(1),        /* ERROR ROUTINE IN CONTROL     0172
*                                     MUST BE ZEROED BY DRIVER     0172
*                                     IF ERP RETURNS WITH THIS     0172
*                                     BIT ON, A RETRY IS           0172
*                                     ASSUMED. IF THE ERP RE-      0172
*                                     TURNS WITH THIS BIT OFF,     0172
*                                     THE ERROR IS CONSIDERED      0172
*                                     PERMANENT OR CORRECTED       0172
*                                     DEPENDING ON THE SETTING     0172
*                                     OF IOSEX.               */   0172
*         3 IOSSMDA BIT(1),        /* ERP STATUS MODFR BIT .       0172
*                                     MUST BE ZEROED BY DRIVER     0172
*                                      TAPE - REPOSITION DEVCE     0172
*                                      1052 - IMMEDIATE OPERA-     0172
*                                        TION, CCW OP CODE IN      0172
*                                        IOSMDB.              */   0172
*         3 IOSSMDB BIT(1),        /* ERP STATUS MODFR BIT B       0172
*                                     MUST BE ZEROED BY DRIVER     0172
*                                     SET BY FETCH IN APPEN-       0172
*                                     DAGE FOR POSTING.            0172
*                                      TAPE - CRC NEEDED           0172
*                                      DASD - PCI FETCH STOP       0172
*                                           FLAG              */   0172
*         3 IOSEX   BIT(1),        /* EXCEPTIONAL CONDITION.       0172
*                                     UPON RETURN FROM NORMAL      0172
*                                     OR ABNORMAL EXIT WITH        0172
*                                     THIS BIT ON, ERP PROCES-     0172
*                                     SING IS INITIATED IF IN-     0172
*                                     ITIAL ERROR CONDITION.       0172
*                                     IF BIT IS OFF, IT IS AS-     0172
*                                     SUMED THAT THE EXIT COR-     0172
*                                     RECTED THE CONDITION OR      0172
*                                     DID NOT CONSIDER IT AN       0172
*                                     ERROR. WHEN THE ERP RE-      0172
*                                     TURNS WITH THIS BIT ON,      0172
*                                     AND IOSERR OFF,THE ERROR     0172
*                                     IS CONSIDERED PERMANENT.     0172
*                                     WHEN THE ERP RETRNS WITH     0172
*                                     THIS BIT OFF, THE ERROR      0172
*                                     HAS BEEN CORRECTED.     */   0172
*         3 IOSDOM  BIT(1),        /* DOM MACRO REQUIRED     @YM06828*/
*         3 IOSIOSB BIT(1),        /* IOSB CREATED BY IOS.         0172
*                                     MUST BE ZEROED BY DRIVER*/   0172
*                                                                  0172
*       2 IOSFLB    CHAR(1),       /* FLAG BYTE B             */   0172
*         3 IOSDIESE BIT(1),       /* SECOND ENTRY TO DIE     */   0172
*         3 IOSSDR   BIT(1),       /* ERP DOESNT WANT OBR    @Z40MPLG*/
*         3 IOSFLB2  BIT(1),       /* RESERVED                */   0172
*         3 IOSFLB3  BIT(1),       /* RESERVED                */   0172
*         3 IOSFLB4  BIT(1),       /* RESERVED                */   0172
*         3 IOSMSG   BIT(1),       /* MESSAGE INDICATOR            0172
*                                     0 = INTRVNTN REQURD MSG      0172
*                                     1 = I/O ERROR MESSAGE   */   0172
*         3 IOSBDCST BIT(1),       /* BROADCAST BIT           */   0172
*         3 IOSLOG   BIT(1),       /* CREATE AN OBR RECORD    */   0172
*                                                                  0172
*       2 IOSFLC    CHAR(1),       /* DEVICE DEP ERP FLAGS    */   0172
*         3 IOSDVMNT BIT(1),       /* DAVV ISSUED MOUNT       */   0172
*         3 IOSDVALT BIT(1),       /* ALTERNATE TRACK PROCES-      0172
*                                     SING BY DAVV            */   0172
*          4 IOSVERIF BIT(1),      /* UNSOLICITED DEVICE END       0172
*                                     VERIFICATION NEEDED          0172
*                                     (NON-DA)                */   0172
*         3 IOSCC3WE BIT(1),       /* GDP REQ'RS CC3 POST X6D@DCRR054*/
*         3 IOSTP    BIT(1),       /* NO SPECIAL CC3 HANDLINGTOBEFLGD*/
*         3 IOSRWAIT BIT(2),       /* RESTARTABLE WAIT REASON@ZA00904*/
*         3 IOSFLC6  BIT(1),       /* RESERVED                */   0172
*         3 IOSFLC7  BIT(1),       /* RESERVED                */   0172
*                                                                  0172
*       2 IOSPROC   CHAR(1),       /* THIS BYTE INDICATES WHAT     0172
*                                     TYPE OF SPECIAL PROCES-      0172
*                                     SING IS TO BE PERFORMED      0172
*                                     BY IOS COMPONENTS OPER-      0172
*                                     ATING ASYNCHRONOUS TO        0172
*                                     MAINLINE                     0172
*                                     MUST BE ZEROED BY DRIVER     0172
*                                     DCLS ARE AT END OF IOSB */   0172
*                                                                  0172
*       2 IOSDVRID  CHAR(1),       /* DRIVER ID VALUE              0172
*                                     VALUES AT END OF IOSB   */   0172
*                                                                  0172
*       2 IOSPRLVL  CHAR(1),       /* PRIORITY LEVEL AT WHICH      0172
*                                     THE ADDRESS SPACE IS TO BE   0172
*                                     SCHEDULED, 0 OR 1       */   0172
*       2 IOSASID   CHAR(2),       /* ADDR SPACE ID OF MEMORY      0172
*                                     TO BE SCHEDULED AT TERM      0172
*                                     OF I/O REQUEST          */   0172
*       2 IOSPGAD   PTR(31),       /* PGM ADDR TO BE DISPTCHD */   0172
*       2 IOSPKEY BIT(8),          /* PROTECT KEY OF IOSPGAD  */   0172
*        3 *       BIT(4),         /* PROTECT KEY             */   0172
*        3 IOSLCL  BIT(1),         /* ASID SCHDLD AT LOCAL LVL*/   0172
*        3 IOSIDR  BIT(1),         /* ASYNCHRONOUS SCHEDULING      0172
*                                     SHOULD BE USED FOR THIS      0172
*                                     REQUEST (INDIRECT RE-        0172
*                                     CORDING FOR PAGING I/O  */   0172
*        3 IOSPGDPX BIT(1),        /* THIS REQUEST HAS A BACK      0172
*                                     UP COPY (DUPLEXED PAGE) */   0172
*        3 IOSPKY7  BIT(1),        /* RESERVED                */   0172
*       2 IOSCOD    CHAR(1),       /* I/O COMPLETION CODE          0172
*                                     USED AS TEMP SAVE FOR        0172
*                                     SYSTEM MASK BY CHAN SCHD     0172
*                                     VALUES AT END OF IOSB   */   0172
*                                                                  0172
*       2 IOSOPT    CHAR(1),       /* OPTIONS BYTE            */   0172
*         3 IOSBYP  BIT(1),        /* BYPSS IOS CHAN PGM PRFX */   0172
*         3 IOSDEP  BIT(1),        /* DEVICE END POST REQUSTD */   0172
*         3 IOSQISCE BIT(1),       /* THIS REQUEST INITIATED       0172
*                                     BY FUNCTION WHICH HAS        0172
*                                     QUIESCED THE DEVICE     */   0172
*         3 IOSPSLL BIT(1),        /* ON=LOCAL LOCK NOT WANTED     0172
*                                     FOR POST STATUS PROCSS       0172
*                                     OFF=LOCAL LOCK WANTED   */   0172
*         3 IOSNERP BIT(1),        /* IBM ERPS NOT TO BE USED */   0172
*         3 IOSTSLL BIT(1),        /* ON = LOCAL LOCK NOT          0172
*                                     WANTED BY TERMINATION        0172
*                                     ROUTINE                      0172
*                                     OFF = LOCAL LOCK WANTED      0172
*                                     BY TERMINATION ROUTINE       0172
*                                     IF IOSPSLL ALSO ON      */   0172
*         3 IOSAPR  BIT(1),        /* ALT PATH RETRY ACTIVE.       0172
*                                     MUST BE ZEROED BY DRIVER*/   0172
*         3 IOSRELSE BIT(1),       /* STAND-ALONE RELEASE CCW      0172
*                                     ISSUED BY IOS           */   0172
*                                                                  0172
*       2 IOSOPT2  CHAR(1),        /* OPTION BYTE 2           */   0172
*         3 IOSHTP  BIT(1),        /* ELIGIBLE FOR SHOULDR TAP*/   0172
*         3 IOSOPT2X BIT(7),       /* RESERVED BITS (UNUSED)  */   0172
*       2 IOSUCB    PTR(31),       /* UNIT CONTROL BLOCK ADDR */   0172
*       2 *         CHAR(8),                                       0172
*         3 IOSCC     BIT(8),      /* SIO CONDITION CODE      */   0172
*         3 IOSCSW    CHAR(7),     /* LOW ORDR 7 BYTES OF CSW */   0172
*          4 IOSCSWCA  PTR(24) BDY(BYTE), /*                       0172
*                                     LAST COMMAND ADDRESS    */   0172
*          4 IOSTATUS  CHAR(2),    /* CSW STATUS              */   0172
*            5 IOSTSA  BIT(8),     /* DEVICE STATUS           */   0172
*            5 IOSTSB  BIT(8),     /* CHANNEL STATUS          */   0172
*          4 IOSCSWRC PTR(16) BDY(BYTE), /*                        0172
*                                     RISIDUAL COUNT          */   0172
*                                                                  0172
*       2 IOSSRB    PTR(31),       /* POINTER BACK TO SRB     */   0172
*       2 IOSUSE    PTR(31),       /* USER FIELD              */   0172
*       2 IOSRES4A  PTR(31),       /* RESERVED                */   0172
*       2 IOSAPMSK  CHAR(2),       /* EXCLUSIVE PATH MASK FOR      0172
*                                     APR                          0172
*                                     MUST BE ZEROED BY DRIVER*/   0172
*       2 IOSSNS    BIT(16),       /* SENSE DATA              */   0172
*                                                                  0172
*  /***********************************************************/   0172
*  /*  END OF COMMON SECTION AND START OF PROCESSING  DEPEN-  */   0172
*  /*  DENT SECTIONS WHICH ARE: NORMAL I/O REQUEST, WTO, AND  */   0172
*  /*  PCI SCHEDULING.                                        */   0172
*  /***********************************************************/   0172
*                                                                  0172
*       2 IOSIPIB   PTR(31),       /* IOS/PURGE INTERFACE          0172
*                                     BLOCK ADDRESS                0172
*                                     MUST BE ZEROED BY DRIVER.    0172
*                                     OR CHAIN PTR FOR PCI         0172
*                                     SRB/IOSBS               */   0172
*       2 IOSPCHN   PTR(31),       /* PTR TO ENDING STATUS IOSB    0172
*                                     FOR PCI SRB/IOSBS.           0172
*                                     PTR TO FIRST PCI SRB/IOSB    0172
*                                     FOR ENDING STATUS IOSB. */   0172
*       2 IOSERP    PTR(31),       /* ERP DYNAMIC W.A. ADDR.       0172
*                                     MUST BE ZEROED BY DRIVER*/   0172
*       2 IOSPCI    PTR(31),       /* PCI EXIT ADDRESS        */   0172
*       2 IOSNRM    PTR(31),       /* NORMAL EXIT ADDRESS     */   0172
*       2 IOSABN    PTR(31),       /* ABNORMAL EXIT ADDRESS   */   0172
*       2 IOSDIE    PTR(31),       /* DISABLED INT. EXIT ADDR */   0172
*       2 IOSRST    PTR(31),       /* REAL ADDRESS OF REAL         0172
*                                     CHANNEL PROGRAM         */   0172
*       2 IOSVST    PTR(31),       /* VIRTUAL ADDRESS OF REAL      0172
*                                     CHANNEL PROGRAM         */   0172
*       2 IOSDSID   PTR(31),       /* DATA SET ID FOR PURGE   */   0172
*                                                                  0172
*       2 IOSRSS1B  CHAR(1),       /* RESERVED                */   0172
*       2 IOSAFF    BIT(8),        /* CPU AFFINITY INDICATOR       0172
*                                     FOR GUARANTEED DEVCE PTH*/   0172
*       2 IOSPATH   CHAR(2),       /* PATH SPECIFICATION FOR       0172
*                                     GUARANTEED DEVICE PATH       0172
*                                     OR SPECIFIC EXPOSURE         0172
*                                     REQUESTS                */   0172
*         3 IOSCHN  CHAR(1),                                       0172
*           4 IOSGDP    BIT(1),    /* GUARANTEED DEVICE PATH  */   0172
*           4 IOSEXP    BIT(1),    /* SPECIFIC EXPOSURE REQST */   0172
*           4 IOSPATH2  BIT(1),    /* RESERVED                */   0172
*           4 IOSPATH3  BIT(1),    /* RESERVED                */   0172
*           4 *         BIT(4),    /* CHANNEL NUMBER          */   0172
*                                                                  0172
*         3 IOSCUDEV CHAR(1),      /* CONTRL UNIT/DEVICE ADDR */   0172
*                                                                  0172
*       2 IOSFMSK   CHAR(1),       /* MODE SET/FILE MASK      */   0172
*       2 IOSCKEY   BIT(8),        /* PROT. KEY OF CHAN PGM   */   0172
*         3 *        BIT(4),       /* PROTECT KEY             */   0172
*         3 IOSCKEY4 BIT(1),       /* RESERVED                */   0172
*         3 IOSCKEY5 BIT(1),       /* RESERVED                */   0172
*         3 IOSCKEY6 BIT(1),       /* RESERVED                */   0172
*         3 IOSCKEY7 BIT(1),       /* RESERVED                */   0172
*       2 IOSMDB    CHAR(1),       /* ERP IMMED. CCW OP CODE  */   0172
*       2 IOSMDM    CHAR(1),       /* ERP MODIFIER MASK       */   0172
*       2 IOSEEK    CHAR(8),       /* STATIC SEEK ADDRESS     */   0172
*       2 IOSEEKA   CHAR(8),       /* DYNAMIC SEEK ADDRESS    */   0172
*         3 IOSSKM  PTR(8),             /*   M                */   0172
*         3 IOSSKBB PTR(16) BDY(BYTE),  /*   BB               */   0172
*         3 IOSCCHH CHAR(4),            /*   CCHH             */   0172
*          4 IOSSKCC PTR(16) BDY(BYTE), /*   CC               */   0172
*          4 IOSSKHH PTR(16) BDY(BYTE), /*   HH               */   0172
*             5 IOSSKH1 PTR(8),         /*   H                */   0172
*             5 IOSSKH2  PTR(8),        /*   H                */   0172
*         3 IOSSKR  PTR(8),             /*   R                */   0172
*       2 IOSEND    CHAR(0);       /* END OF IOSB             */   0172
*                                                                  0172
*  /*  ATTENTION PROCESSING SECTION                           */   0173
*   DCL 1 IOSATTSC  CHAR(64) DEF(IOSIPIB),                         0173
*         2 IOSATTSN CHAR(24),     /* ADDITIONAL SENSE IF ANY */   0173
*         2 *        CHAR(16),     /* ATTN RTN RSVD AREA      */   0173
*         2 IOSATTWA CHAR(24);     /* ATTN RTN WORK AREA      */   0173
*                                                                  0173
*  /*  WTO PROCESSING SECTION                                 */   0174
*   DCL 1 IOSWTOWA  CHAR(64) DEF(IOSIPIB),                         0174
*         2 IOSWTOCH CHAR(2),      /* ADDR CC=3 OCCURRED ON   */   0174
*         2 IOSWTOCP CHAR(1),      /* CPU CC=3 OCCURRED ON    */   0174
*         2 IOSWTOPT CHAR(1),      /* PATH IND. FOR CC=3      */   0174
*         2 IOSWRNDR CHAR(60);     /* REMAINDER OF WTO W.A.   */   0174
*                                                                  0174
*  /*  PCI SCHEDULING SECTION                                 */   0175
*   DCL 1 IOSPCISC  CHAR(64)  DEF(IOSIPIB) BDY(WORD),              0175
*         2 *       PTR(31),       /* SAME AS IOSIPIB. MUST        0175
*                                     NOT BE USED             */   0175
*         2 *       PTR(31),       /* SAME AS IOSPCHN. MUST        0175
*                                     NOT BE USED             */   0175
*         2 IOSPCIRS CHAR(36),     /* PCI RSVD SECTION        */   0175
*         2 IOSPCIWA CHAR(20);     /* PCI WORK AREA           */   0175
*                                                                  0175
* /************************************************************/   0176
* /*                                                          */   0176
* /*     FOLLOWING ARE THE PLS DECLARES WHICH REPLACE  THE    */   0176
* /*     PREVIOUSLY DEFINED %DCLARES.  THE FIELDS TO WHICH    */   0176
* /*     THE VALUES APPLY ARE REPRODUCED AS A COMMENT. THIS   */   0176
* /*     CHANGE ALLOWS A CROSS REFERENCE OF THE NAMES  USED   */   0176
* /*     AS FIELD VALUES.                                     */   0176
* /*                                                          */   0176
* /************************************************************/   0176
*                                                                  0176
*   /*  2 IOSPROC  CHAR(1),           SEE DCL FOR DESCRIPTION */   0176
*                                                                  0176
*   DCL IOSAPCI BIT(8) CONSTANT('04'X);     /* PCI            */   0176
*   DCL IOSATTN BIT(8) CONSTANT('08'X);     /* ATTENTION      */   0177
*   DCL IOSAPURG BIT(8) CONSTANT('0C'X);    /* PURGE          */   0178
*   DCL IOSADAVV BIT(8) CONSTANT('10'X);    /* DAVV           */   0179
*   DCL IOSAWTO BIT(8) CONSTANT('14'X);     /* WTO            */   0180
*   DCL IOSADDR BIT(8) CONSTANT('18'X);     /* DDR            */   0181
*   DCL IOSACRH BIT(8) CONSTANT('1C'X);     /* CRH            Y30CQLG*/
*                                                                  0182
*   /*  2 IOSDVRID CHAR(1),           SEE DCL FOR DESCRIPTION */   0183
*                                                                  0183
*   DCL IOSIOSID BIT(8) CONSTANT('00'X); /*                        0183
*                                     RESERVED FOR IOS        */   0183
*   DCL IOSMISID BIT(8) CONSTANT('01'X); /*                        0184
*                                     MISCELLANEOUS ID FOR I/O     0184
*                                     REQUESTS THAT CANNOT BE      0184
*                                     PURGED, ASSOCIATED WITH      0184
*                                     A TASK, OR VIOLATE XTNTS*/   0184
*   DCL IOSXCPID BIT(8) CONSTANT('02'X);    /* EXCP           */   0185
*   DCL IOSVSAID BIT(8) CONSTANT('03'X);    /* VSAM           */   0186
*   DCL IOSATMID BIT(8) CONSTANT('04'X);    /* VTAM           */   0187
*   DCL IOSTCMID BIT(8) CONSTANT('05'X);    /* TCAM           */   0188
*   DCL IOSOLTID BIT(8) CONSTANT('06'X);    /* OLTEP          */   0189
*   DCL IOSFCHID BIT(8) CONSTANT('07'X);    /* PROGRAM FETCH  */   0190
*   DCL IOSJESID BIT(8) CONSTANT('08'X);    /* JES3           */   0191
*   DCL IOSSS1ID BIT(8) CONSTANT('09'X);    /* SS1/DSM        */   0192
*   DCL IOSPRGID BIT(8) CONSTANT('0A'X);   /* IECVIOPM PURGE @ZA04107*/
*                                                                  0193
*   /*  2 IOSCOD CHAR(1),             SEE DCL FOR DESCRIPTION */   0194
*                                                                  0194
* /************************************************************/   0194
* /*  COMPLETION CODES 41 - 5F ARE RESERVED FOR PERMANENT     */   0194
* /*  ERROR CONDITIONS. THESE CODES WILL ALWAYS BE LAST ENTRY */   0194
* /*  CODES TO ABNORMAL EXITS.                                */   0194
* /*  COMPLETION CODES 60 - 73 ARE RESERVED FOR IOS USE.      */   0194
* /*  COMPLETION CODES 74 - 7E DENOTE ABNORMAL CONDITIONS FOR */   0194
* /*  WHICH CORRECTION MAY BE POSSIBLE. THESE CODES DENOTE    */   0194
* /*  FIRST ENTRY TO ABNORMAL EXITS.                          */   0194
* /************************************************************/   0194
*                                                                  0194
*   DCL IOSFTCHC BIT(8) CONSTANT('71'X); /*                        0194
*                                     HARDWARE CORRECTED DATA      0194
*                                     CHECK FOR FETCH         */   0194
*   DCL IOSMIHC BIT(8) CONSTANT('74'X); /*                         0195
*                                     THE I/O REQUEST HAS BEEN     0195
*                                     ROUTED TO I/O RESTART BY     0195
*                                     CCH, ALTERNATE CPU RECOV-    0195
*                                     ERY, MISSING INTERRUPT       0195
*                                     HANDLER.                */   0195
*   DCL IOSFINTC BIT(8) CONSTANT('7E'X); /*                        0196
*                                     INTERCEPT CONDITION BE-      0196
*                                     FORE ENTRANCE TO ERP    */   0196
*   DCL IOSNRMC BIT(8) CONSTANT('7F'X); /*                         0197
*                                     NORMAL COMPLETION       */   0197
*   DCL IOSGDPWE BIT(8) CONSTANT('6D'X); /* IECVPST GOTO ABE & ERP 0198
*                                                            @DCRR054*/
*   DCL IOSERRC BIT(8) CONSTANT('41'X); /*                         0199
*                                     PERMANENT I/O ERROR     */   0199
*   DCL IOSEXTC BIT(8) CONSTANT('42'X); /*                         0200
*                                     EXTENT ERROR            */   0200
*   DCL IOSDPXC BIT(8) CONSTANT('43'X); /*                         0201
*                                     DUPLEXED I/O REQUEST WAS     0201
*                                     NOT STARTED BECAUSE OF       0201
*                                     A QUIESCED OR NOT READY      0201
*                                     DEVICE.                 */   0201
*   DCL IOSINTC BIT(8) CONSTANT('44'X); /*                         0202
*                                     REQUEST INTERCEPTED BE-      0202
*                                     CAUSE A PERMANENT ERROR      0202
*                                     OCCURRED THE LAST TIME       0202
*                                     THE DEVICE WAS USED.    */   0202
*   DCL IOSABNC BIT(8) CONSTANT('45'X); /*                         0203
*                                     I/O REQUEST ABNORMALLY       0203
*                                     TERMINATED BECAUSE OF PRO-   0203
*                                     GRAM CHECK, MACHINE CHECK,   0203
*                                     ETC. IN IOS OR AN APPEN-     0203
*                                     DAGE.                   */   0203
*   DCL IOSCD46 BIT(8) CONSTANT('46'X);     /* RESERVED       */   0204
*   DCL IOSCD47 BIT(8) CONSTANT('47'X);     /* RESERVED       */   0205
*   DCL IOSPRGC BIT(8) CONSTANT('48'X);     /* REQUEST PURGED */   0206
*   DCL IOSCD49 BIT(8) CONSTANT('49'X);     /* RESERVED       */   0207
*   DCL IOSTAPEC BIT(8) CONSTANT('4B'X);    /*                     0208
*                                     ERR IN TAPE REPOSITIONNG*/   0208
*   DCL IOSIVEXP BIT(8) CONSTANT('4C'X);    /*                     0209
*                                     INVALID EXPOSURE NUMBER */   0209
*   DCL IOSGDPCC BIT(8) CONSTANT('4D'X);    /*                     0210
*                                     CC=3 - GDP OR WHILE NIP      0210
*                                     IN CONTROL              */   0210
*   DCL IOSGDPRD BIT(8) CONSTANT('4E'X);    /*                     0211
*                                     GDP - RESERVED DEVICE        0211
*                                     OR IN CONJUNCTION WITH       0211
*                                     IOSRELSE,DEVICE CANNOT       0211
*                                     BE RELEASED.            */   0211
*   DCL IOSGDPCO BIT(8) CONSTANT('4F'X);    /*                     0212
*                                     GDP - CPU OFFLINE       */   0212
*   DCL IOSCD50 BIT(8) CONSTANT('50'X);     /* RESERVED       */   0213
*   DCL IOSMIHCA BIT(8) CONSTANT('51'X);    /*                     0214
*                                     THE REQUEST HAS BEEN DE-     0214
*                                     CLARED IN PERMANENT ERROR    0214
*                                     AFTER ERP AND I/O RESTART    0214
*                                     PROCESSING.             */   0214
*                                                                  0214
*   /*  3 IOSCUDEV CHAR(1),           SEE DCL FOR DESCRIPTION */   0215
*                                                                  0215
*   DCL IOSCU BIT(8) CONSTANT('F0'X);  /* CONTROL UNIT        */   0215
*   DCL IOSDEV BIT(8) CONSTANT('0F'X); /* DEVICE              */   0216
*   DCL IOSSNSBD BIT(16) CONSTANT('10FE'X); /*                     0217
*                                     VALUE SUPPLIED FOR           0217
*                                     UNSUCCESSFUL SENSE      */   0217
*                                                                  0217
*   /*  3 IOSCC BIT(8),               SEE DCL FOR DESCRIPTION */   0218
*                                                                  0218
*   DCL IOSCC3 BIT(8) CONSTANT('30'X); /* CONDITION CODE 3    */   0218
*   DCL IOSCC2 BIT(8) CONSTANT('20'X); /* CONDITION CODE 2    */   0219
*   DCL IOSCC1 BIT(8) CONSTANT('10'X); /* CONDITION CODE 1    */   0220
*   DCL IOSCC0 BIT(8) CONSTANT('00'X); /* CONDITION CODE 0    */   0221
*                                                                  0221
*   /* 3 IOSRWAIT BIT(2),            RESTARTABLE WAIT REASON @ZA00904*/
*                                                                  0222
*   DCL IOSRWVID BIT(8) CONSTANT('00'X); /* 00--WRONG VOL ID @ZA00904*/
*   DCL IOSRWIR  BIT(8) CONSTANT('04'X); /* 01--INTERVENTION @ZA00904*/
*                                        /*     REQUIRED     @ZA00904*/
*   DCL IOSRWCC3 BIT(8) CONSTANT('08'X); /* 10--CONDITION    @ZA00904*/
*                                        /*     CODE 3       @ZA00904*/
*   DCL IOSRWERR BIT(8) CONSTANT('0C'X); /* 11--READ ERROR   @ZA00904*/
*                                        /*     FOR LABEL    @ZA00904*/
*                                                                  0226
*/* ATBUILD (ISTTIE,ISTIFTPL,ISTATCVT,ISTLDNCB,ISTRDT) NOSEG */    0226
*/* TOLTEP INTERFACE ELEMENT */                                    0226
*/*  INITIAL LEVEL                                       001 052274  */
*DCL  1  ISTTIE BASED BDY(WORD),                                   0226
*        2  TIETYPE CHAR(1),           /* CONTROL BLOCK TYPE CODE    */
*        2  TIELNGTH PTR(8),           /* LENGTH IN BYTES            */
*        2  TIERETCD BIT(8),           /* RETURN CODE FROM TOLTEP    */
*        2  TIEREQ  PTR(8),            /* TIE USAGE CODE             */
*        2  TIETIEA PTR(31),           /* ADDRESS OF NEXT TIE        */
*           3  TIEGATE BIT(1),         /* GATING FLAG                */
*        2  TIESNA PTR(31),            /* ADDRESS OF SYMBOLIC NAME   */
*           3 TIEPTR1  PTR(31),        /* FIRST POINTER              */
*        2  TIERPHA PTR(31),           /* ADDRESS OF RPL HEADER      */
*           3 TIEPTR2  PTR(31);        /* SECOND POINTER             */
*DCL  TITYPE BIT(8) CONSTANT('18'X),   /* TYPE CODE FOR TIE          */
*/*  TIE USAGE CODES                                                 */
*     TIEREQ0  FIXED(8) CONSTANT(0),   /* RFT REQ PASSED TO TOLTEP   */
*     TIEREQ1  FIXED(8) CONSTANT(1),   /* VARY PASSED FSB TO TOLTEP  */
*     TIEREQ2  FIXED(8) CONSTANT(2),   /* VARY PASSED NCSPL TO TOLTEP*/
*     TIEREQ3  FIXED(8) CONSTANT(3),   /* REQ. FOR AN END-CTL TO VARY*/
*     TIEREQ4  FIXED(8) CONSTANT(4),   /* REQ. FOR FREEING BUFFERS   */
*     TIEREQ5  FIXED(8) CONSTANT(5),   /* TOLTEP REQ INFO FROM SSCP  */
*     TIEREQ6  FIXED(8) CONSTANT(6),   /* TOLTEP PASS LCPB TO VARY   */
*     TIEBASIC FIXED(8) CONSTANT(0),   /* BASIC SUPPORT FOR DEVICE   */
*                                      /* RFT RECEIVED FOR           */
*     TIERCRD  FIXED(8) CONSTANT(4);   /* RECORD SUPPORT FOR DEVICE  */
*                                      /* RFT RECEIVED FOR           */
*/*  INTERFACE FOR TOLTEP      PARM LIST                             */
*/*  INITIAL LEVEL                                       001 052274  */
*DCL  1  ISTIFTPL BASED BDY(WORD),                                 0228
*        2 IFTFB0   CHAR(1),       /* FUNCTION BYTE0                 */
*          3 IFTTBON  BIT(1),      /* TURN ON TEST BIT-RDT           */
*          3 IFTTBOFF BIT(1),      /* TURN OFF TEST BIT-RDT          */
*          3 IFTSTDAF BIT(1),      /* STORE DAF OF TEST DEV          */
*          3 IFTFLNNM BIT(1),      /* RETURN LINE NAME               */
*          3 IFTTBIO  BIT(1),      /* TURN ON BLK IO BIT-LDNCB       */
*          3 IFTTBIOF BIT(1),      /* TURN OFF BLK IO BIT-LDNCB      */
*          3 IFTFLDNP BIT(1),      /* RETURN PTR TO LDNCB            */
*          3 IFTFPABP BIT(1),      /* STORE VARY-PAB OF TEST DEV     */
*        2 IFTFB1   CHAR(1),       /* RESERVED FUNCTION BYTE1        */
*        2 IFTSB0   CHAR(1),       /* SWITCH BYTE 0                  */
*          3 IFTTPPST BIT(1),      /* 1=VPOST ECB 0=TPPOST RPH       */
*          3 IFTVOCLK BIT(1),      /* VOC LOCK OBTAINED              */
*          3 IFTRDTLK BIT(1),      /* RDT LOCK OBTAINED              */
*          3 IFTDEVOF BIT(1),      /* RESET DEVICE OFFLINE BIT       */
*          3 *        BIT(4),      /* RESERVED                       */
*        2 *        CHAR(1),       /* RESERVED                       */
*        2 IFTECBPR PTR(31),       /* ECB OR RPH PTR---SEE IFTSB0    */
*        2 IFTSYMDV CHAR(8),       /* SYN NAME OF TST DEV            */
*        2 IFTSYMRT CHAR(8),       /* SYM NAME RETURNED-LINE         */
*        2 IFTPABPR PTR(31),       /* PTR TO AREA FOR PAB AND DAF    */
*        2 IFTLDNPR PTR(31),       /* AREA WHERE LDNCB PR RTND       */
*        2 IFTRETCD FIXED(8),      /* ROUTINE RETURN CODE            */
*        2 *        CHAR(3),       /* RESERVED                       */
*        2 *        CHAR(8);       /* RESERVED                       */
*/*  POSSIBLE RETURN CODES                                           */
*DCL IFTRTN00 FIXED(8) CONSTANT(0),   /* SUCCESSFUL                  */
*    IFTRTN04 FIXED(8) CONSTANT(4),   /* UNABLE TO GET VOC LOCK      */
*    IFTRTN08 FIXED(8) CONSTANT(8),   /* UNABLE TO GET RDT LOCK      */
*    IFTRTN0C FIXED(8) CONSTANT(12),  /* SRTFIND FAILED FOR SYM NAME */
*    IFTRTN10 FIXED(8) CONSTANT(16),  /* RESERVED                    */
*    IFTRTN14 FIXED(8) CONSTANT(20),  /* RESERVED                    */
*    IFTRTN18 FIXED(8) CONSTANT(24),  /* UNEXPTD RDT STRUCTURE       */
*    IFTRTN1C FIXED(8) CONSTANT(28),  /* LOCAL 3270 NOT OPND VTAM    */
*    IFTRTN20 FIXED(8) CONSTANT(32),  /* CIOFIND FOR LDNCB FAILED    */
*    IFTRTN24 FIXED(8) CONSTANT(36);  /* CIDCTL TO RESET FMCDEVOF    */
*                                     /* FAILED                      */
*/* PROCESS ANCHOR BLOCK                                              *
*/*  REVISIONS                                         002 11/16/75  */
*/*       APAR      OZ19540    DCL PABSSN ABNORMAL           @ZA19540*/
*DCL  1  ISTPAB BDY(DWORD) BASED,                                  0230
*       2  PABWQCHN CHAR(8) BDY(DWORD), /* CPS SWAP FIELD FOR NEQ&CHN *
*        3  PABWEQA PTR(31) BDY(WORD), /* WORK ELEMENT QUEUE ADDRESS  *
*           4  PABWEQG BIT(1),         /* GATING BIT                  *
*           4  PABRSV01 BIT(7),        /* RESERVED                    *
*           4  PABWEQP PTR(24),        /* WKEL PTR                    *
*        3  PABCHAIN PTR(31) BDY(WORD), /* APS CHAIN                  *
*           4  PABCHNG BIT(1),         /* GATING BIT                  *
*           4  PABRESCH BIT(1),        /* RESCHEDULE PAB AT        0230
*                                         TPEXIT                      *
*           4  PABCDP BIT(1),          /* CLOSE DST/CHANGE IN PROGRESS*
*           4  PABUNCON BIT(1),        /* UNCONDITIONALLY RESCHEDULE
*                                         PAB AT TPEXIT               *
*           4  PABRESET BIT(1),        /* RESET ISSUED ON THIS PAB    *
*           4  PABRUNNG BIT(1),        /* PAB RUNNING                 *
*           4  PABDELAY BIT(1),        /* DELAY OPTION USED           *
*           4  PABRSV02 BIT(1),        /* RESERVED                    *
*           4  PABCHNGP PTR(24),       /* PSS CHAIN PTR               *
*        2  PABOFFST PTR(8),           /* OFFSET FROM CONTROL BLOCK   *
*        2  PABDVTA PTR(24),           /* DVT ADDRESS                 *
*        2  PABRPHFG PTR(31),          /* SCHED FLAGS AND RPH         *
*           3  PABFLAGS BIT(8),        /* SCHEDULING FLAGS            *
*              4  PABAPYP BIT(1),      /* APPLICATION IS A USER EXIT  *
*              4  PABPRIOR BIT(1),     /* IMMEDIATE PRIORITY          *
*              4  PABNORPR BIT(1),     /* NORMAL PRIORITY -           *
*                                      /* RESCHEDUALABLE              *
*              4  PABDYNAM BIT(1),     /* DYNAMIC                     *
*              4  PABSSN BIT(1) ABNL,  /* SYSTEM SERVICES    @ZA19540 *
*              4  PABERLCK BIT(1),     /* PAB ERROR LOCK FLAG         *
*                 5  PABERRLK BIT(1),  /* ERROR LOCK                  *
*                    6  PABERLOK BIT(1), /* ERROR LOCK                *
*/*    ABNORMAL TO ALLOW VARY COMPARE AND SWAP                        *
*              4  PABINHBT BIT(1) ABNL,/* 1=INHIBIT TRAFFIC,0=NO      *
*              4  PABNODQ BIT(1),      /* DO NOT DEQ WORK ELEMENT     *
*           3  PABRPHA PTR(24);        /* RPL HEADER ADDRESS          *
*DCL PABWEQG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABWEQG OFF     *
*    PABWEQG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABWEQG ON      *
*    PABCHNG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABCHNG OFF     *
*    PABCHNG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABCHNG ON      *
*    PABRESC0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PABRESCH OFF    *
*    PABRESC1 BIT(32) CONSTANT('40000000'X),  /* TURN PABRESCH ON     *
*    PABCDP0  BIT(32) CONSTANT ('DFFFFFFF'X), /* TURN PABCDP OFF      *
*    PABCDP1  BIT(32) CONSTANT ('20000000'X), /* TURN PABCDP ON       *
*    PABERLK0 BIT(32) CONSTANT('FBFFFFFF'X),  /* TURN PABERRLK ON     *
*    PABERLK1 BIT(32) CONSTANT('04000000'X),  /* TURN PABERRLK OFF    *
*    PABUNCO0 BIT(32) CONSTANT('EFFFFFFF'X),  /* TURN PABUNCON OFF    *
*    PABUNCO1 BIT(32) CONSTANT('10000000'X),  /* TURN PABUNCON ON     *
*    PABPRIR0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PAB PRIOR OFF   *
*    PABPRIR1 BIT(32) CONSTANT('40000000'X),  /* TURN PAB PRIOR ON    *
*    PABRST0  BIT(32) CONSTANT('F7FFFFFF'X),  /* TURN PABRESET OFF    *
*    PABRST1  BIT(32) CONSTANT('08000000'X),  /* TURN PABRESET ON     *
*    PABDLAY0 BIT(32) CONSTANT('FDFFFFFF'X),  /* TURN PAB DELAY OFF   *
*    PABDLAY1 BIT(32) CONSTANT('02000000'X);  /* TURN PAB DELAY ON    *
*/* LOCKWORD FORMAT DSECT                                            */
*/*  INITIAL LEVEL                                     001 05/24/74  */
*DCL 1 ISTLOK BDY(WORD) BASED,                                     0232
*     2  LOKCT CHAR(1) BDY(WORD),       /* COUNT OF LOCK OWNERS      */
*     2  LOKCHN PTR(24),                /* ADDR OF NEXT RPH WAITING
*                                          ON LOCK                   */
*        3  LOKCHNG CHAR(3),            /* CHAIN/FLAGS               */
*           4 *        CHAR(2),                                    0232
*           4 *        BIT(8),                                     0232
*             5 *        BIT(6),                                   0232
*             5  LOKPRY BIT(1),         /* PRIORITY FLAG, 1 = ON     */
*             5  LOKXCL BIT(1);         /* EXCLUSIVE FLAG, 1 = ON    */
*DCL LOKXCL1  BIT(32) CONSTANT('00000001'X); /* CONSTANT TO TURN LOKXCL
*                                          ON                        */
*DCL LOKPRY1  BIT(32) CONSTANT('00000002'X); /* CONSTANT TO TURN LOKPRY
*                                          ON                        */
*DCL LOKCHN1  BIT(32) CONSTANT('00FFFFFC'X); /* CONSTANT TO TURN LOKXCL
*                                          AND LOKPRY OFF            */
*DCL LOKCT1   BIT(32) CONSTANT('01000000'X); /* CONSTANT TO MAKE LOKCT
*                                          = 1                       */
*DCL LOKCT255 BIT(32) CONSTANT('FF000000'X); /* CONSTANT TO CHECK FOR
*                                          MAX LOKCT (255)           */
*              /* DYNAMIC PAB 1K633 */                             0238
* /* 1K0997 JAN 20, 1973  MB   */                                  0238
* /* 1K1142 MAR 03, 1973  MB   */                                  0238
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE 1K633 */     0238
*       2  DYPTYPE CHAR(1), /* CONTROL BLOCK TYPE CODE 1K633 */    0238
*       2  DYPLNGTH PTR(8), /* CONTROL BLOCK LENGTH (BYTES)  1K633 */
*       2 DYPFLGS CHAR(2),     /* FLAGS 1K633 */                   0238
*       2 DYPCHAIN PTR(31),    /* CHAIN POINTER 1K633 */           0238
*       2 DYPTSKID PTR(31),    /* TASKID OR PTR TO PSS TABLES 1K633 */
*       2  DYPRSV01 PTR(31),   /* RESERVED TO PRESERVE ALIGNMENT   0238
*                                                             1K0997 */
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF 1K0997
*                                                    PAB         */
*DCL DYTYP   BIT(8) CONSTANT ('11'X);   /* TYPE           1K1142 */
*/*  REVISIONS                                             03/04/77   *
*/*         APAR  OZ30832                                     @ZA30832*
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            *
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0241
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   *
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     *
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         *
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           *
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             *
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          *
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            *
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD *
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    *
*                 5  ATCMDHLT BIT(1),  /* VTAM CMD PROC HALTED        *
*                 5 * BIT(1),          /* RESERVED                    *
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    *
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       *
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            *
*                                      /* INTERFACE FLAGS             *
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   *
*                                      /* RECEIVE UNSOLICITED MESSAGES*
*                                      /* 1 = YES                     *
*                 5 *        BIT(7),   /* RESERVED                    *
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         *
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0241
*                                         0 = NOT ACTIVE              *
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   *
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0241
*                                         PROCESS                     *
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    *
*                 5  ATCVTTRC BIT(1),  /* VTAM TRACE, 1=ACTIVE        *
*                 5  ATCRSV04 BIT(3),  /* RESERVED                    *
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         *
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL
*                                         LAYER,INITIALIZED BY OPENDST*
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        *
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    *
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     *
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.*
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    *
*                                      /* FOR MODIFY COMMAND          *
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        *
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     *
*                                      /* FOR HALT COMMAND            *
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  *
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     *
*                                      /* FOR VARY COMMAND            *
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     *
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    *
*                                      /* FOR DISPLAY COMMAND         *
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       *
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    *
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. *
*                                      /* REQUEST NOTIFICATION        *
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     *
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     *
*                                      /* CONTROL PROCESSING COMPLETE *
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         *
*                                      /* CONFIGURATION REQUEST       *
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    *
*                                      /* ECB PARAMETERS              *
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     *
*                                      /* OR HALT RETURN MESSAGE      *
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      *
*                                      /* BLOCK                       *
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         *
*                                      /* ROUTINE SCHEDULER           *
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         *
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     *
*                                      /* ACCOUNTING ROUTINE          *
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     *
*                                      /* AUTHORISATION ROUTINE       *
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      *
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             *
*                                      /* CONFIGURATION TABLE         *
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    *
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    *
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        *
*                                      /* TYPE=VTAM TRACING           *
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY*
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    *
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE *
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       *
*                                      /* PROCEDURE                   *
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    *
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)*
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         *
*                                      /* PROCEDURE                   *
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   *
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        *
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       *
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE *
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     *
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    *
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   *
*                                      /* ROUTINE                     *
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         *
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     *
*                                      /* ROUTINE                     *
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE
*                                         - DOS ONLY                  *
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     *
*                                      /* ROUTINE                     *
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     *
*                                      /* ROUTINE  - DOS ONLY         *
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   *
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION *
*                                      /* RPH                         *
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       *
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        *
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER
*                                         MOVE TO USER AREA           *
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER
*                                         MOVE FIXED TO PAGABLE       *
*/*  BEGIN 'ANY' DVT                                                  *
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST*
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  *
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   *
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN *
*/*  END 'ANY' DVT                                                    *
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    *
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         *
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     *
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  *
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             *
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   *
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL*
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY
*                                         PURGE                       *
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    *
*           3 ATCCIDM BIT(16),        /* CID MASK                     *
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     *
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =
*                                 NUMBER OF ENTRIES IN THE MNT        *
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            *
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0241
*                                ISTSDCCI (CINDEXY)                   *
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0241
*                                 REF. BY CIDCTL MACRO                *
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0241
*                                 REF. BY CIDCTL MACRO                *
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0241
*                                 REF. BY CIDCTL MACRO                *
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         *
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         *
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     *
*                                   /*  MASTER ROUTINE                *
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0241
*                                      MASTER ROUTINE                 *
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      *
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           *
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       *
*                                   /*  TO BE LOADED                  *
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                *
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   *
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0241
*                                       PORTION   OF CID              *
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         *
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     *
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0241
*                                      ISTSDCAL                       *
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                *
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     *
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  *
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  *
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     *
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0241
*                                      CSECT                          *
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    *
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         *
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       *
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            *
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     *
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       *
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     *
*         2 ATCHPGM,                /* BUFFER INFORMATION            */
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0241
*                                      TO BY 3RD WORD OF PAB         */
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */
*         2 ATCAPCR5 PTR(31),       /* POINTER TO ISTINCR5           */
*         2 ATCRSV69 PTR(31),       /* RESERVED TO SYNCH WITH DOS    */
*         2 ATCNODEL CHAR(8),       /* VSAM DATA SET NAME            */
*         2 ATCNODDS PTR(31),       /* POINTER TO RPL                */
*         2 ATCONFIG CHAR(8),       /* START VTAM CONFIG = PARAMETER */
*         2 ATCRSV99 CHAR(4),       /* RESERVED FOR LATER POINTERS   */
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY
*                                           UNDER PSS CONTROL        */
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR
*                                      PURGE                         */
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &
*                                           RESTART PAB              */
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT
*                                      (ISTINCDL)                    */
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0241
*                                           FOR ISTOLTP              */
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0241
*                                           FOR TOLTEP CLIP          */
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0241
*                                           FOR TOLTEP-VTAM INTERFACE*/
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/
*         2 ATCRNO,                                                0241
*           3 *        CHAR(1),                                    0241
*           3 ATCPOIA  PTR(24),        /* PTR TO PROGRAM OPERATOR    */
*                                      /* INTERFACE AREA             */
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */
*           3 ATCSEC10 PTR(31),        /* DVT                        */
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */
*           3 ATCSEC40 PTR(31),        /* DVT                        */
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */
*         2 ATCSTAT2 BIT(8),           /* TRACE FLAGS                */
*           3 ATCTRAPI BIT(1),         /* API                        */
*           3 ATCTRESC BIT(1),         /* ESC                        */
*           3 ATCTRPSS BIT(1),         /* PSS                        */
*           3 ATCTRLOK BIT(1),         /* LOCKS                      */
*           3 ATCTRSMS BIT(1),         /* SMS                        */
*           3 *        BIT(3),         /* RESERVED                   */
*         2 *        BIT(8),           /* RESERVED                   */
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */
*                                      /* RTN ADDRESS (ISTINCSH)     */
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */
*                                      /* TABLE ADDRESS (ISTINCDT)   */
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */
*                                      /* TABLE ADDRESS (ISTINCLM)   */
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */
*                                      /* POINTED TO BY IOBECBPT     */
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0241
*                                    /* SSCP COMMAND PROCESSING PAB  */
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0241
*                                    /* SSCP FRONT END PAB           */
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */
*/* END OF COMMON AREA                                               */
*/* VS1/VS2 COMMON CODE.                                             */
*        2  ATCVTBAM CHAR(4),                                      0241
*           3  *     CHAR(3),          /* RESERVED                    *
*           3  *     CHAR(1),          /* FLAGS                       *
*              4 ATCVTMAB BIT(1) ABNL, /* ABEND IN VTAM JOBSTEP       *
*              4 *        BIT(7),      /* RESERVED                    *
*        2  ATCAOSM BDY(DWORD),                                    0241
*/*                                                                   *
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    *
*                                      /* SRB CONTROL                 *
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S*
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       *
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        *
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     *
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  *
*                                      /* TCB                         *
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             *
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             *
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             *
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             *
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             *
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             *
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             *
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             *
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             *
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             *
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             *
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             *
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             *
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB*
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL*
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         *
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  *
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR*
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  *
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)*
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  *
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0241
*                                         (DUMMY EOA APP.)           */
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0241
*                                         APPENDAGE                  */
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0241
*                                         APPENDAGE                  */
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE
*                                         VECTOR                     */
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0241
*                                         (DUMP EOE)                 */
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0241
*                                         (DUMMY SIOA)               */
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0241
*                                         APPENDAGE                  */
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0241
*                                         APPENDAGE                  */
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0241
*                                         VECTOR TABLE FOR LOAD/DVMMY*/
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0241
*                                         OF EXTENT APPENDAGE        */
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0241
*                                         OF SIO APPENDAGE           */
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0241
*                                         APPENDAGE                  */
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0241
*                                         APPENDAGE                  */
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0241
*                                         END APPENDAGE              */
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0241
*                                         (PHASE 1)                   *
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0241
*                                         FEEDBACK ROUTER            */
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0241
*                                         DEACTIVATE ROUTINE         */
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0241
*                                         SERVICES VECTOR TABLE      */
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR
*                                         TEST AND CTL FEEDBACK ROUTER*
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0241
*                                         STATUS AND FEEDBACK ROUTER
*                                         DYNAMIC PAB                */
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */
*           3  ATCDMAPP PTR(31),       /* DUMMY APPENDAGE ROUTINE    */
*                                      /* FOR ABEND                  */
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */
*        3  ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA             *
*           4 ATCCRAQ  PTR(31),          /* QUEUE OF AVAILABLE CRAS   *
*           4 ATCCRACN FIXED(31),        /* COUNTS                    *
*             5 ATCCRARC FIXED(16),      /* ENQUEUE COUNT TO ALLOW    *
*                                        /* MULTIPLE SIMUALTANIOUS    *
*                                        /* ENQUEUES AND DEQUEUES     *
*             5 ATCCRAAC FIXED(16),      /* COUNT OF CRAS ON AVAIL Q  *
*        3  ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS            *
*             4 ATCSRBQ  PTR(31),        /* QUE OF AVAILABLE SRBS     *
*             4 ATCSRBCN FIXED(31),      /* COUNTS                    *
*               5 ATCSRBRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    *
*                                        /* MULTIPLE SIMUALTANIOUS    *
*                                        /* ENQUEUES AND DEQUEUES     *
*               5 ATCSRBAC FIXED(16),    /* COUNT OF SRBS ON AVAIL Q  *
*        3  ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS           *
*             4 ATCCRPLQ PTR(31),        /* QUE OF AVAILABLE CRPLS    *
*             4 ATCRPLCN FIXED(31),      /* COUNTS                    *
*               5 ATCRPLRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    *
*                                        /* MULTIPLE SIMUALTANIOUS    *
*                                        /* ENQUEUES AND DEQUEUES     *
*               5 ATCRPLAC FIXED(16),    /* COUNT OF CRPLS ON AVAIL Q *
*           3  ATCSQAFR BDY(DWORD),    /* DOUBLE WORD FOR CDS      0241
*                                          SQA RELEASE       @VSRIUBL*/
*             4 ATCORTBF PTR(31),      /* ANCHOR FOR TO-BE-        0241
*                                          FREED STG Q       @VSRIUBL*/
*             4 ATCORTBC PTR(31),      /* PTR TO TCB OF TASK       0241
*                                          OWNING STG Q      @VSRIUBL*/
*               5 ATCORSRB PTR(31),    /* PTR TO SMS SRB     @VSRIUBL*/
*                 6 ATCORQG  BIT(1)ABNL, /* SRB GATE FOR SMS @VSRIUBL*/
*           3  ATCOROBT PTR(31),      /* ANCHOR FOR OBTAINED       0241
*                                         STAGE              @VSRIUBL*/
*           3  ATCORFRL PTR(31),      /* ADDR OF ISTORFRL    @VSRIUBL*/
*           3  ATCORFMG PTR(31),      /* ADDR OF ISTORFMG    @VSRIUBL*/
*           3  ATCINFDD PTR(31),      /* ADDR OF ISTINFDD    @VSRIUBL*/
*           3  ATCAIWT  PTR(31),      /* ADDRESS OF BYTE           0241
*                                         FOLLOWING WAIT IN        0241
*                                         ISTAICCK           @VSRIUBL*/
*           3  *        BIT(8),       /* RESERVED            @VSRIUBL*/
*             4 ATCABEN BIT(1)ABNL,   /* VTAM IS ABNORMALLY        0241
*                                         ENDING             @VSRIUBL*/
*             4 ATCOPKL BIT(1)ABNL,   /* OPERATOR IS ENDING        0241
*                                         VTAM               @VSRIUBL*/
*             4 ATCSNUF BIT(1)ABNL,   /* RECURSIVE VTAM ABEND      0241
*                                         DURING RSCE MGR          0241
*                                         OPERATION          @VSRIUBL*/
*             4 *       BIT(5),       /* RESERVED            @VSRIUBL*/
*           3  *        BIT(24),      /* RESERVED            @VSRIUBL*/
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */
*           3  ATCOCWOB PTR(31),       /* PTR TO OCCOB WAIT  @ZA30832*/
*           3  ATCOCWCB PTR(31),       /* PTR TO OCCCB WAIT  @ZA30832*/
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */
*/* END OF VS1/VS2 COMMON CODE.                                      */
*/* START OF VS2 UNIQUE CODE.                                        */
*           3  ATCVTFLG BIT(32),                                   0241
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */
*              4 *        BIT(31),     /* RESERVED                   */
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */
*           3  ATCAPBE  PTR(31),       /* POINTER TO ISTAICBE        */
*           3  ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0241
*                                      /* PAB FOR VTAM TERM TASK     */
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0241
*                                      /* PAB FOR TPIOS              */
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */
*           3  ATCRSV88 PTR(31),       /* RESERVED                   */
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB
*                                                         FOR VS2    */
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER
*                                          FOR SRB MODE ROUTINES     */
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */
*           3  ATCPOPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0241
*                   /* POPAB FOR REPLY PROCESSING, POI TERMINATION,  */
*                   /* AND VTAM MESSAGE PROCESSOR                    */
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */
*/*   DEVICE CHARACTERISTICS TABLE - ORIGINATES IN RDT USED TO DEFINE
*    DEVICE CHARACTERISTICS IN DNCB,FMCB AND NIB  */               0242
*/*  INITIAL LEVEL                                     001 08/07/74  */
*DCL  1  ISTDEVCH  BDY(WORD)BASED,                                 0242
*        2  DEVSHCH BIT(8),            /* DEV SCHED CHARACTERISTICS  */
*           3  DEVCHAR  BIT(8),        /* COMPATIBILITY EXISTING CODE*/
*              4  DEVINPUT  BIT(1),    /* DEVICE IS FOR INPUT        */
*              4  DEVOTPUT  BIT(1),    /* DEVICE IS FOR OUTPUT       */
*              4  DEVCONVR  BIT(1),    /* DEVICE IS CONVERSATION     */
*                                      /* RN DEFINITION              */
*              4  DEVSUBND  BIT(1),    /* DEVICE HAS SCHEDULABLE     */
*                                      /*   SUB-NODES                */
*              4  DEVSPS BIT(1),       /* DEV IS START PRINT SENSITIVE*
*              4  DEVNNSPT BIT(1),     /* NODE HAS NETWRK MNGMNT SPRT*/
*              4  DEVCCTL BIT(1),      /* NODE HAS CONN CNTRL DEPENDCS*
*              4  DEVRSV01  BIT(1),    /* RESERVED                   */
*        2  DEVTCODE BIT(8),           /* DEVICE TYPE CODES          */
*           3  DEVCHAR2  BIT(8),       /* COMPATIBILITY EXISTING CODE*/
*        2  DEVMCODE BIT(8),           /* DEVICE MODEL CODE           *
*        2  DEVFLAGS BIT(8),           /*USE DEPENDS ON DEVSHCH VALUES*
*           3  DEVFCCTL BIT(4),        /* USED IF DEVICE REQ CONN CTRL*
*              4  DEVCBSC BIT(1),      /* RESET ORDERLY, BI-SYNCH  0242
*                                         TERMINALS EXCEPT 3270'S    */
*              4  DEVCSSL BIT(1),      /*RESET AT END OF COMMAND. 3270'
*                                         AND START/STOP EXCEPT TERMS
*                                         WITH REVERSE BREAK FEATURE */
*                                                                  0242
*              4  DEVCRVB BIT(1),      /* RESET IMMEDIATE. START/STOP
*                                         TERMS WITH REVERSE BREAK 0242
*                                         FEATURE                    */
*              4  DEVCSWL BIT(1),      /* 1=HIGHER NODE IS SWITCH CON-
*                                         NECTION, 0=LEASED CONNECTION*
*           3  DEVCHAR3 BIT(4),        /* COMPATIBILITY EXISTING CODE*/
*              4  DEVCATTN BIT(1),     /* TERMINAL CAN INTERRUPT WITH
*                                         ATTENTION                  */
*              4  DEVCCHEK BIT(1),     /* TERMINAL HAS CHECKING      */
*              4  DEVCSTCL BIT(1),     /* TERMINAL HAS STATION     0242
*                                         CONTROL                    */
*              4  DEVCSLPN BIT(1),     /* TERMINAL HAS SELECTOR PEN  */
*        2  DEVPHYSA CHAR(1),          /* PHYSICAL DEVICE ADDRESS    */
*        2  DEVRSV03 CHAR(3);          /* RESERVED                   */
*/* DEVICE TYPE CODES */                                           0243
*DCL DEV2740 BIT(8) CONSTANT ('01'X);  /* DEVICE IS A 2740           */
*DCL DEV2741 BIT(8) CONSTANT ('02'X);  /* DEVICE IS A 2741           */
*DCL DEV1050 BIT(8) CONSTANT ('03'X);  /* DEVICE IS A 1050           */
*DCL DEVTWX  BIT(8) CONSTANT ('04'X);  /* DEVICE IS A TWX            */
*DCL DEVWTTY BIT(8) CONSTANT ('05'X);  /* DEVICE IS A WTTY           */
*DCL DEV115A BIT(8) CONSTANT ('06'X);  /* DEVICE IS A 115A           */
*DCL DEV83B3 BIT(8) CONSTANT ('07'X);  /* DEVICE IS AN 83B3          */
*DCL DEV2715 BIT(8) CONSTANT ('08'X);  /* DEVICE IS A 2715           */
*DCL DEV2770 BIT(8) CONSTANT ('09'X);  /* DEVICE IS A 2770           */
*DCL DEV2780 BIT(8) CONSTANT ('0A'X);  /* DEVICE IS A 2780           */
*DCL DEV3735 BIT(8) CONSTANT ('0B'X);  /* DEVICE IS A 3735           */
*DCL DEV3780 BIT(8) CONSTANT ('0C'X);  /* DEVICE IS A 3780           */
*DCL DEV1130 BIT(8) CONSTANT ('0D'X);  /* DEVICE IS AN 1130          */
*DCL DEV1800 BIT(8) CONSTANT ('0E'X);  /* DEVICE IS AN 1800          */
*DCL DEV3125 BIT(8) CONSTANT ('11'X);  /* DEVICE IS A 3125           */
*DCL DEV3135 BIT(8) CONSTANT ('12'X);  /* DEVICE IS A 3135           */
*DCL DEVSYS3 BIT(8) CONSTANT ('13'X);  /* DEVICE IS SYS 3            */
*DCL DEV2701 BIT(8) CONSTANT ('14'X);  /* DEVICE IS A 2701 OZ05270   */
*DCL DEV2703 BIT(8) CONSTANT ('15'X);  /* DEVICE IS A 2703 OZ05270   */
*DCL DEV3704 BIT(8) CONSTANT ('16'X);  /* DEVICE IS A 3704           */
*DCL DEV3705 BIT(8) CONSTANT ('17'X);  /* DEVICE IS A 3705           */
*DCL DEV2980 BIT(8) CONSTANT ('18'X);  /* DEVICE IS A 2980           */
*DCL DEV3277 BIT(8) CONSTANT ('19'X);  /* DEVICE IS A 3277           */
*DCL DEV3284 BIT(8) CONSTANT ('1A'X);  /* DEVICE IS A 3284           */
*DCL DEV3286 BIT(8) CONSTANT ('1B'X);  /* DEVICE IS A 3286           */
*DCL DEV3275 BIT(8) CONSTANT ('1C'X);  /* DEVICE IS A 3275           */
*DCL DEV3741 BIT(8) CONSTANT ('1D'X);  /* DEVICE IS A 3741           */
*DCL DEV3747 BIT(8) CONSTANT ('1E'X);  /* DEVICE IS A 3747           */
*DCL DEVMTA  BIT(8) CONSTANT ('28'X);  /* DEVICE IS AN MTA           */
*DCL DEV2972 BIT(8) CONSTANT ('33'X);  /* DEVICE IS A 2972           */
*DCL DEV3271 BIT(8) CONSTANT ('34'X);  /* DEVICE IS A 3271           */
*DCL DEV3272 BIT(8) CONSTANT ('36'X);  /* DEVICE IS A 3272           */
*DCL DEVCC   BIT(8) CONSTANT ('35'X);  /* DEVICE IS A PHYSICAL UNIT  */
*DCL DEV1052 BIT(8) CONSTANT ('64'X);  /* DEVICE IS A 1052           */
*DCL DEV1053 BIT(8) CONSTANT ('65'X);  /* DEVICE IS A 1053           */
*DCL DEV1054 BIT(8) CONSTANT ('66'X);  /* DEVICE IS A 1054           */
*DCL DEV1055 BIT(8) CONSTANT ('67'X);  /* DEVICE IS A 1055           */
*DCL DEV1056 BIT(8) CONSTANT ('68'X);  /* DEVICE IS A 1056           */
*DCL DEV1057 BIT(8) CONSTANT ('69'X);  /* DEVICE IS A 1057           */
*DCL DEV1058 BIT(8) CONSTANT ('6A'X);  /* DEVICE IS A 1058           */
*DCL DEV1092 BIT(8) CONSTANT ('6B'X);  /* DEVICE IS A 1092           */
*DCL DEV1093 BIT(8) CONSTANT ('6C'X);  /* DEVICE IS A 1093           */
*DCL DEVLU   BIT(8) CONSTANT ('6D'X);  /* DEVICE IS A LOGICAL UNIT   */
*DCL DEV545  BIT(8) CONSTANT ('78'X);  /* DEVICE IS A 545            */
*DCL DEV1017 BIT(8) CONSTANT ('79'X);  /* DEVICE IS A 1017           */
*DCL DEV1018 BIT(8) CONSTANT ('7A'X);  /* DEVICE IS A 1018           */
*DCL DEV2203 BIT(8) CONSTANT ('7B'X);  /* DEVICE IS A 2203           */
*DCL DEV2213 BIT(8) CONSTANT ('7C'X);  /* DEVICE IS A 2213           */
*DCL DEV2265 BIT(8) CONSTANT ('7D'X);  /* DEVICE IS A 2265           */
*DCL DEV2502 BIT(8) CONSTANT ('7E'X);  /* DEVICE IS A 2502           */
*DCL DEV50   BIT(8) CONSTANT ('7F'X);  /* DEVICE IS A 50             */
*DCL DEV1255 BIT(8) CONSTANT ('80'X);  /* DEVICE IS A 1255           */
*DCL DEV5496 BIT(8) CONSTANT ('81'X);  /* DEVICE IS A 5496           */
*/* MODEL CODES */                                                 0296
*DCL DEVMOD1 BIT(8) CONSTANT ('00'X);  /* MODEL 1                    */
*DCL DEVMOD2 BIT(8) CONSTANT ('01'X);  /* MODEL 2                    */
*/* NODE CONTROL BLOCK */                                          0298
*/*  REVISIONS                                         005 07/01/75  */
*DCL  1  ISTNCB BDY(WORD) BASED,                                   0298
*        2  NCBTYPE CHAR(1),       /* CONTROL BLOCK TYPE CODE         *
*        2  NCBLNGTH PTR(8),       /* LENGTH IN BYTES                 *
*        2  NCBDAF CHAR(2),        /* ID OF DESTINATION               *
*        2  NCBRDTE PTR(31),       /* ADDR OF RDT ENTRY               *
*        2  NCBTSKID PTR(31),      /* TASK ID                         *
*        2  NCBNSNA PTR(31),       /* ADDR OF NEXT SCHEDULABLE NODE   *
*        2  NCBFMCBA PTR(31),      /* ADDR OF FIRST FMCB              *
*        2  NCBNCBA PTR(16),       /* CID OF NEXT SAME/LOWER LEVEL NODE
*                                                            @XL03HDM *
*        2  NCBNCSL PTR(16),       /* CID OF NEXT SAME-LEVEL NODE  0298
*                                                            @XL03HDM *
*        2  NCBFLAGS CHAR(4),      /* COMMON NCB FLAGS                *
*           3  NCBCSTAT BIT(8),    /* CONNECTION STATUS FLAG          *
*           3  NCBFRAS BIT(8),     /* RAS FLAG                        *
*              4  NCBFTRIO FIXED(8), /* I-O TRACE ACTIVE THIS NODE    *
*                 5  NCBFLTIO FIXED(8), /* I-O TRACE ACTIVE THIS NODE *
*           3  NCBFLAG1 CHAR(1),   /* NCB FLAGS                       *
*              4  NCBSNAI  BIT(1), /* OLD NODE                        *
*              4  NCBCONF  BIT(1), /* NODE SICK FLAG                  *
*              4  NCBRSTRT BIT(1), /* RECOVERY IN PROGRESS            *
*              4  NCBRSYNC BIT(1), /* C/R RESYNCH ON FIRST I/O        *
*                                  /* REQUIRED, 1=YES                 *
*              4  NCBTTF   BIT(1), /* C/R IGNORE TRICKLE TRAFFIC,     *
*                                  /* 1=YES                           *
*              4  NCBFORCE BIT(1), /* FORCED DEACT IN PROGRESS        *
*              4  *        BIT(2), /* RESERVED                        *
*           3  NCBNMLLN FIXED(8),  /* NUMBER OF LOWER LEVEL NODES     *
*        2  NCBRVPT1 CHAR(2),      /* COUNT OF LAST TRACE RECORDS     *
*        2  NCBLTRC  FIXED(15),    /* LOST TRACE RECORD COUNT         *
*        2  NCBFMCBP PTR(31),          /* ADDR OF PORT SOLICITOR FMCB *
*        2  NCBDEVCH CHAR(LENGTH(ISTDEVCH)), /* NODE DEV CHAR         *
*        2  NCBSWDAF CHAR(2),         /* REAL NETWORK ADDRESS OF */
*                                     /* TERM IN SW. SUBAREA     */
*        2  NCBRSV01 CHAR(2);         /* RESERVED                */
* DCL  LDTYPE BIT(8) CONSTANT('07'X); /* TYPE CODE FOR LDNCB     */
* DCL  ICTYPE BIT(8) CONSTANT('06'X); /* TYPE CODE FOR ICNCB     */
* DCL  DNTYPE BIT(8) CONSTANT('05'X); /* TYPE CODE FOR DNCB      */
* DCL  HCTYPE BIT(8) CONSTANT('14'X); /* HCNCB TYPE              */
* DCL  CCTYPE BIT(8) CONSTANT('15'X); /* CCNCB TYPE CODE         */
* DCL  LUTYPE BIT(8) CONSTANT('25'X); /* LUNCB TYPE CODE         */
* DCL  NCNOTRC  FIXED(8) CONSTANT(0); /* NO TRACE REQUIRED       */
*/* LOCAL DEVICE NODE CONTROL BLOCK */                             0306
*/*  REVISIONS                                         002 12/16/74  */
*DCL  1  ISTLDNCB BDY(DWORD) BASED(LDNCBPTR),                      0306
*        2  LDNCB CHAR(LENGTH(ISTNCB)),     /* COMMON NCB HEADER      *
*        2  LDNCUUA PTR(31),           /* UCB/PUB CUA - CUA FROM DRTE *
*        2  LDNTSAF CHAR(2),           /* TEST FMCB SAF               *
*        2  LDNCFLAG CHAR(1),          /* FLAGS                       *
*           3 LDNIBI   BIT(1),         /* IN BRACKET INDICATOR        *
*           3 LDNRMF   BIT(1),         /* RECORD MODE INDICATOR       *
*           3 *        BIT(6),         /* RESERVED                    *
*        2  LDNRESRV CHAR(1),          /* RESERVED/ DWORD PADDING     *
*/*  VS1/VS2 COMMON CODE.                                             *
*        2  LDNCHFLD PTR(31),           /* ADDR OF NEXT LDNCB         *
*        2  LDNCSWSV CHAR(8),           /* SAVE AREA FOR CSW FROM HDV *
*        2  LDNZC002 CHAR(8),           /* SAVE AREA FOR TOLTEP DEVICE
*                                          END                        *
*        2  LDNZACSW CHAR(8),           /* SAVE AREA FOR TOLTEP    0306
*                                          ATTENTION CSW              *
*        2  LDNZV001 PTR(31),           /* ADDRESS OF RESET LCPB      *
*        2  LDNZH002 FIXED(16),         /* START I/O COUNTER          *
*        2  LDNZX001 FIXED(8),          /* TEMPORARY ERROR COUNTER    *
*        2  LDNZX002 FIXED(8),          /* INTENSIVE RECORDING MODE   *
*        2  LDNSIOQ  PTR(31),          /* QUEUE OF PENDING CHANNEL    *
*                                       /* PROGRAMS                   *
*        2  LDNCPQ  PTR(31),           /* ADDRESS OF CHANNEL PGM QUEUE*
*        2  LDNZRB FIXED(16),           /* MAXIMUM TEXT FOR READ BUFF *
*        2  LDNZRM FIXED(16),           /* MAX TEXT FOR READ MODIFIED *
*        2  LDNZARM FIXED(16),          /* ATTN READ MODIFIED TXT SZE *
*        2  LDNZHDCC CHAR(1),           /* HALT DEVICE CONDITION CODE *
*        2  LDNFLAGS BIT(24),           /* FLAGS FOR 3270 SUPPORT     *
*           3  LDNZF002 BIT(1) ABNORMAL,/*CONTACT OUTSTANDING         *
*           3  LDNZF003 BIT(1) ABNORMAL,/* RESET AT EOF COMMAND       *
*           3  LDNZF004 BIT(1) ABNORMAL,/* TOLTEP DELAYED DEVICE END  *
*           3  LDNZF005 BIT(1) ABNORMAL,/* TOLTEP DELAYED ATTENTION   *
*           3  LDNZF006 BIT(1) ABNORMAL,/* DEVICE IN TEST MODE FLAG   *
*           3  LDNZF007 BIT(1) ABNORMAL,/* ATTENTION RECEIVED FLAG    *
*           3  LDNZF008 BIT(1) ABNORMAL,/* HDV ISSUED                 *
*           3  LDNZF009 BIT(1) ABNORMAL,/* NO RESET OF I/O BUSY       *
*           3  LDNZF00A BIT(1) ABNORMAL,/* INVITE OUTSTANDING         *
*           3  LDNZIOBY BIT(1) ABNORMAL,/* IOB OR IOSB BUSY FLAG      *
*           3  LDNZATTP BIT(1) ABNORMAL,/* ATTENTION IN PROGRESS FLAG *
*           3  LDNZCHNE BIT(1) ABNORMAL,/* CHANNEL ERROR FLAG         *
*           3  LDNZATLK BIT(1) ABNORMAL,/* ATTN WITH ERR LOCK ON FLAG *
*           3  LDNZCTXT BIT(1) ABNORMAL,/* CRITICAL TEXT FLAG         *
*           3  LDNZREC  BIT(1) ABNORMAL,/* OBR RECORDING REQUIRED     *
*           3  LDNZICCW BIT(1) ABNORMAL,/* INVALID CCW FLAG           *
*           3  LDNZENTR BIT(1) ABNORMAL,/* ERP FIRST ENTRY FLAG       *
*           3  LDNCLOSD BIT(1) ABNORMAL,/* CLOSEDOWN IN PROGRESS      *
*           3  LDNZFF00 BIT(1) ABNORMAL,/* DEACTIVATE REQ'D FLAG      *
*           3  LDNZFF01 BIT(1) ABNORMAL,/* DELAYED READ REQ'D FLAG    *
*           3  LDNZFF02 BIT(1) ABNORMAL,/* BUFFER ALLOCATE  REQ'D FLAG*
*           3  LDNZFF03 BIT(1) ABNORMAL,/* DE NOTIFICATION REQ'D FLAG *
*           3  LDNTPBIO BIT(1) ABNORMAL,/* IF 1, I/O BLKD FOR TOLTEP */
*           3  LDNZFF69 BIT(1) ABNORMAL,/* VARY DEACTIVATE FLAG       *
*        2  LDNFLAG2 BIT(16),           /* ADDITIONAL FLAGS           *
*           3 LDNZFF04 BIT(1) ABNORMAL, /* VS/2 I/O PURGE REQUIRED    *
*           3 LDNRSV02 BIT(15) ABNORMAL,/* RESERVED                   *
*        2  LDNZLAST PTR(31),           /* ADDR OF LAST BUFF ON SIOQ  *
*        2  LDNZFBUF PTR(31),           /* ADDRESS OF FIRST BUFFER 0306
*                                          ON FAILING CCW SET         *
*        2  LDNZLOCK BIT(32),           /* TPNCB LOCKWORD             *
*        2  LDNZS1BC PTR(31),           /* SAVE AREA BACK CHAIN       *
*        2  LDNZS1FC PTR(31),           /* SAVE AREA FORWARD CHAIN    *
*        2  LDNZS1RR PTR(31),           /* SAVE AREA RETURN REG SAVE
*                                          WORD                       *
*        2  LDNZS1VR CHAR(24),          /* TPIOS VARIABLE REG SAVE 0306
*                                          AREA                       *
*        2  LDNZV005 PTR(31),           /* ADDRESS OF TEST FSB BUFFER *
*        2  LDNZPAB1 CHAR(LENGTH(ISTPAB)) BDY(DWORD), /* DEVICE END
*                                          NOTIFICATION PAB           *
*        2  LDNZIOLK BIT(8),            /* SIOQ LOCK BYTE             *
*           3  LDNZDSIC BIT(1) ABNORMAL,/* DEVICE SICK FLAG           *
*           3  LDNZERLK BIT(1) ABNORMAL,/* DEVICE ERROR LOCK FLAG     *
*           3  LDNZATBF BIT(1) ABNORMAL,/* ATTN PENDG BUFF ALLOC FLAG *
*           3  LDNRSV04 BIT(5),         /* RESERVED                   *
*        2  LDNZERPF BIT(8),            /* ERP FLAGS                  *
*           3  LDNZCPAN BIT(3) ABNORMAL,/* ERP CHNNEL PGM ANALYSIS FLG*
*           4  LDNZNARD BIT(1) ABNORMAL,/* CHANNEL PGM NOT ALL READS  *
*           4  LDNZFRD  BIT(1) ABNORMAL,/* READ FOUND FOLLOWING LAST E/
*                                          OR W/SBA BEFORE FAILING CCW*
*           4  LDNZFRDW BIT(1) ABNORMAL,/* READ AND WRITE FOUND FOLLOW-
*                                          ING LAST E/W OR W/SBA BEFORE
*                                          FAILING CCW                *
*           3  LDNZEPIN BIT(2) ABNORMAL,/* ERP - CEA INTERFACE FLAGS  *
*           4  LDNZF001 BIT(1) ABNORMAL,/* CLOSEDOWN RECORDING FLAG   *
*           4  LDNZCTOV BIT(1) ABNORMAL,/* SIO COUNT OVERFLOW FLAG    *
*           3  LDNRSV05 BIT(3),         /* RESERVED                   *
*        2  LDNZLPC BIT(8),             /* LOCAL PROCESSING CNTRL FLAG*
*           3  LDNZLPC0 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC1 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC2 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC3 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC4 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC5 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC6 BIT(1) ABNORMAL,                           0306
*           3  LDNZLPC7 BIT(1) ABNORMAL,                           0306
*        2  LDNZCHNC FIXED(8),             /* CHANNEL ERROR COUNTER   *
*        2  LDNZTCP  PTR(31),              /* SAVEAREA FOR ADDR TOLTEP*
*        2  LDNRPH CHAR(LENGTH(ISTRPH)),   /* RPH FOR USE WITH PSS AND
*                                             BUFFER MANAGEMENT       *
*        2  LDNZRIND CHAR(4),            /* IOS RIND SAVE AREA        *
*        2  LDNDCDEB CHAR(16) BDY(WORD),  /* PS. DCB/DEB              *
*           3  LDNDEBID BIT(8),          /* DEB ID                    *
*           3  LDNDCBAD PTR(24),         /* DCB ADDRESS               *
*           3  LDNEXSCL BIT(8),          /* BDEB EXCL                 *
*           3  LDNAPPAD PTR(24),         /* APP ADDRESS               *
*           3  LDNUCBAD PTR(31),         /* UCB ADDRESS               *
*           3  LDNDEAD  PTR(31),         /* DEB ADDRESS               *
*/* ***** FIVE RESERVED WORDS FOR USE LATER ***** */               0306
*        2  LDNRSV07 PTR(31),           /* RESERVED                   *
*        2  LDNRSV08 PTR(31),           /* RESERVED                   *
*        2  LDNRSV09 PTR(31),           /* RESERVED                   *
*        2  LDNRSV0A PTR(31),           /* RESERVED                   *
*        2  LDNRSV0B PTR(31),           /* RESERVED                   *
*/*  END OF VS1/VS2 COMMON EXCEPT CONSTANTS.                          *
*/*  START OF VS2 CODE.                                               *
*        2  LDNZ1RR PTR(31),           /* REG 14 SAVE LEVEL 1 CALL    *
*        2  LDNZ2RR PTR(31),           /* REG 14 SAVE LEVEL 2 CALL    *
*        2  LDNZ3RR PTR(31),           /* REG 14 SAVE LEVEL 3 CALL    *
*        2  LDNZSAV1 CHAR(16),         /* CEA-IOS REG SAVE (2 - 5)    *
*        2  LDNZSAV2 CHAR(8),          /* CEA-IOS REG SAVE  (13, 14)  *
*        2  LDNZSAV3 CHAR(36) BDY(WORD), /* MULTY PURPOSE SAVE AREA   *
*           3  LDNZSAVE CHAR(8),       /* CHAIN FIELD                 *
*           3  LDNZSAV4 CHAR(20) BDY(WORD),                        0306
*              4  LDNZSAV5 CHAR(12),   /* CEA SAVE 1-3 - IOS LINK     *
*              4  LDNZSAV6 PTR(31),    /* CEA SAVE 12 - IOS LINK      *
*              4  LDNRSV06 CHAR(4),    /* RESERVED                    *
*           3  *    CHAR(8),                                       0306
*        2  LDNIOSB CHAR(LENGTH(IOSB)) BDY(WORD), /* VS2 IOSB-IECDIOSB*
*        2  LDNSRB CHAR(LENGTH(SRBSECT)) BDY(WORD), /* VS2 SRB(IHASRB)*
*        2  LDNZV006 PTR(31),          /* ORIGINAL FAILING CCW POINTER*
*        2  LDNZX005 CHAR(1),          /* ORIGINAL FAILING OP-CODE    *
*        2  LDNZC001 CHAR(7),          /* ORIGINAL FAILING CSW        *
*        2  LDNZX006 CHAR(1),          /* ORIGINAL FAILING SENSE      *
*        2  LDNZH003 BIT(16),           /* STATISTICS BIT            */
*           3  LDNZS000 BIT(1),         /* RESERVED                  */
*           3  LDNZS001 BIT(1),         /* INTERVENTION REQUIRED     */
*           3  LDNZS002 BIT(1),         /* BUS-OUT CHECK             */
*           3  LDNZS003 BIT(1),         /* EQUIPMENT CHECK           */
*           3  LDNZS004 BIT(1),         /* DATA CHECK                */
*           3  LDNZS005 BIT(1),         /* RESERVED                  */
*           3  LDNZS006 BIT(1),         /* CONTROL CHECK             */
*           3  LDNZS007 BIT(4),         /* RESERVED                  */
*           3  LDNZS00B BIT(1),         /* DATA CHECK, UNIT SPECIFY  */
*           3  LDNZS00C BIT(1),         /* INTER REQUIRED, UNIT SPEC */
*           3  LDNZS00D BIT(1),         /* IR, EC, US                */
*           3  LDNZS00E BIT(1),         /* EQUIP CHECH, UNIT SPECIFY */
*           3  LDNZS00F BIT(1);         /* CHANNEL DATA CHECK        */
*/*  VS1/VS2 COMMON CONSTANTS.                                        *
*DCL LDNZIOCT BIT(16) CONSTANT('FFFF'X); /* SIO COUNT OVERFLOW VALUE  *
*DCL LDNZERCT BIT(8) CONSTANT('FF'X);    /* MAX COUNT FOR PEMP ERRORS *
*DCL LDNZOBR  BIT(16) CONSTANT('0100'X); /* OBR MODULE ID             *
*DCL LDNZSTUP BIT(16) CONSTANT('00FE'X); /* START UPDATE MODULE ID    *
*DCL LDNZMSGW BIT(16) CONSTANT('00FD'X); /* MSG WRITER MODULE ID      *
*DCL LDNZCLR  BIT(8) CONSTANT('20'X);    /* CLOSEDOWN RECORD TYPE     *
*DCL LDNZCTR  BIT(8) CONSTANT('40'X);    /* COUNTER OVERFLOW RECD TYPE*
*DCL LDNZERP2 BIT(16) CONSTANT('0452'X); /* ID FOR 2ND LOAD OF ERP    *
*DCL LDNZERP3 BIT(16) CONSTANT('083A'X); /* ID FOR 3RD LOAD OF ERP    *
*DCL LDNZRMAX FIXED(8) CONSTANT(3);      /* MAXIMUM RETRY COUNT       *
*DCL LDNZCMAX FIXED(8) CONSTANT(5);      /*MAXIMUM CHANNEL ERROR COUNT*
*DCL LDNZINTR BIT(8) CONSTANT('7E'X);    /* I/O INTERCEPT COMP CODE   *
*DCL LDNZNORM BIT(8) CONSTANT('7F'X);    /* NORMAL I/O COMPLETION CODE*
*DCL LDNZISNS BIT(8) CONSTANT('FE'X);    /* INVALID SENSE             *
*DCL LDNZLPIB BIT(8) CONSTANT('FF'X);    /* LAST ERPIB INDICATOR      *
*DCL LDNZEQCK BIT(8) CONSTANT('10'X);    /* EQUIPMENT CHECK           *
*DCL LDNZDCUS BIT(8) CONSTANT('0C'X);    /* DATA CHECK, UNIT SPECIFY  *
*DCL LDNZBOC  BIT(8) CONSTANT('20'X);    /* BUS - OUT CHECK           *
*DCL LDNZCR   BIT(8) CONSTANT('80'X);    /* COMMAND REJECT            *
*DCL LDNZIR   BIT(8) CONSTANT('40'X);    /* INTERVENTION REQUIRED     *
*DCL LDNZDC   BIT(8) CONSTANT('08'X);    /* DATA CHECK                *
*DCL LDNZCC   BIT(8) CONSTANT('02'X);    /* CONTROL CHECK             *
*DCL LDNZOC   BIT(8) CONSTANT('01'X);    /* OPERATION CHECK           *
*DCL LDNZIEUS BIT(8) CONSTANT('54'X);    /* INTERVENTION REQUIRED,EQUIP
*                                           MENT CHECK, UNIT SPECIFY  *
*DCL LDNZECUS BIT(8) CONSTANT('14'X);    /* EQUIPMENT CK, UNIT SPECIFY*
*/*              RESOURCE DEFINITION TABLE                           */
*/*  REVISIONS                                         013 07/01/75  */
*DCL                                                               0332
*1  ISTRPRE BDY(WORD) BASED,     /* COMMON PREFIX                    */
*   2  RPRNAME  CHAR(8),         /* RESOURCE NAME                    */
*   2  RPRCOMID FIXED(31),       /* COMMUNICATION ID                 */
*      3  RPRSAF BIT(16),        /* SOURCE ADDRESS FIELD             */
*      3  RPRDAF BIT(16),        /* DESTINATION ADDRESS FIELD-       */
*                             /* CONTAINS DAF OF CTERM IN PORT ENTRY */
*   2  RPRRLOCK CHAR(LENGTH(ISTLOK)),  /* RESOURCE LOCK              */
*   2  RPRELEN  FIXED(15),       /* CURRENT ENTRY LENGTH             */
*   2  RPRPELEN FIXED(15),       /* PREVIOUS ENTRY LENGTH            */
*   2  RPRENTRY BIT(8),          /* FLAG FIELD 1 (ENTRY TYPE)        */
*   2  RPRFLAGA BIT(8),                                            0332
*      3  RPRACT BIT(1),         /* ACTIVE                           */
*      3  RPRINV BIT(1),         /* INVALID                          */
*      3  RPRTIED BIT(1),        /* TIED                             */
*      3  RPRENTBF BIT(1),       /* BUFFER TRACE THIS NODE           */
*      3  RPRENTIO BIT(1),       /* RESERVED                         */
*      3  RPRENTED BIT(1),       /* LAST ENTRY IN RDT SEGMENT        */
*      3  RPRVRYPD BIT(1),       /* VARY PENDING ON ENTRY            */
*      3  RPRLIVE  BIT(1),       /* RESOURCE IS LIVE                 */
*   2  RPRFLAGB BIT(8),          /* FLAG FIELD                       */
*      3  RPRENTVH BIT(1),       /* WHEN 1, ENTRY IS A VTAM HEADER   */
*      3  RPRENTVT BIT(1),       /* WHEN 1, ENTRY IS VTAM            */
*      3  RPRAOPN BIT(1),        /* NODE OPENABLE BY APPLICATION     */
*      3  RPRVIODN BIT(1),       /* VARY I/O HAS BEEN DONE           */
*      3  RPRONLIN BIT(1),       /* NODE VARIED ONLINE               */
*      3  RPRHLVPD BIT(1),       /* VARY PENDING IN HIGHEST        0332
*                                   LEVEL NODE                       */
*      3  RPRVYIMM BIT(1),       /* VARY IMMEDAITE ISSUED FOR NODE   */
*      3  RPRINTST BIT(1),       /* DEVICE IN TEST MODE              */
*   2  RPRCAUSE BIT(8),          /* FLAGS INDICATING CAUSE OF ENTRY
*                                                      INVALIDATION  */
*      3  RPRNOSRT BIT(1),       /* RPRINV SET BECAUSE NO SRTE BUILT */
*      3  RPRCRCPT BIT(1),       /* C/R CHECKPOINT ACTIVE 1=ACTIVE   */
*      3  RPRRSYNC BIT(1),       /* C/R RE-SYNC ON FIRST I/O         */
*                                /* REQUIRED: 1=YES                  */
*      3  RPRRSV03 BIT(5),       /* RESERVED                         */
*   2  RPRPEPCT FIXED(15),       /* VARY PENDING COUNTER             */
*   2  RPRTIOCT FIXED(8),        /* I/O TRACE COUNT                  */
*   2  RPRHDTYP BIT(8),          /* HEADER TYPE                      */
*   2  RPRLGONF PTR(31),         /* SIM. LOGON CHAIN FORWARD PTR     */
*   2  RPRLGONB PTR(31),         /* SIM. LOGON CHAIN BACKWARD PTR    */
*   2  RPRNSNEA PTR(31),         /* NEXT SCHEDULABLE NODE ENTRY ADDR */
*   2  RPRNCBA PTR(31),          /* ADDR OF ASSOCIATED NCB FOR     0332
*                                    OPENED NODES                    */
*   2  RPRDEVCH CHAR(LENGTH(ISTDEVCH)),  /* DEVICE CHARACTERISTICS   */
*   2  RPRRVPT1 PTR(31),         /* RESERVED                         */
*   2  RPRSTPCT FIXED(15),       /* COUNT OF SHOULDER TAPS           */
*   2  RPRSWDAF BIT(16),         /* SWITCHED DAF                     */
*   2  RPRPTHCT FIXED(8),        /* COUNT OF AVAILABLE PATHS       0332
*                                   TO THIS DEVICE                   */
*   2  RPRFLAGD CHAR(1),         /* FLAG BYTE                        */
*      3 RPRLTASN BIT(1),        /* LINE TRACE ACTIVE = 1            */
*      3 RPRCONCT BIT(1),        /* PHYSICAL CONNECTION EXISTS       */
*      3 RPRRSON  BIT(1),        /* RESET ONLINE                     */
*      3 RPRACTP  BIT(1),        /* ACTIVATE IN PROGRESS             */
*      3 RPRCONP  BIT(1),        /* CONTACT IN PROGRESS              */
*      3 RPRRSV05 BIT(2),        /* RESERVED                         */
*      3 RPRINIMM BIT(1),        /* ON=INACTIVATE IMMED. IN PROGRESS */
*   2  RPRFLAGC BIT(8),          /* FLAG FIELD                       */
*      3  RPRCLVPD BIT(1),       /* THIS ENTRY HAS BEEN CLOSED       */
*   2  RPRCONID CHAR(9);         /* CONTROL BLOCK ID                 */
*                                                                  0332
*                                                                  0332
*/* RPRENTRY - FOLLOWING EQUATES ARE FOR THE VARIOUS ENTRY TYPES     */
*DCL RPRENTCM BIT(8) CONSTANT('90'X);  /* ENTRY IS A COMPONENT       */
*DCL RPRENTIN BIT(8) CONSTANT('82'X);  /* ENTRY IS INTERMEDIATE NODE */
*DCL RPRENTTR BIT(8) CONSTANT('80'X);  /* ENTRY IS A TERMINAL        */
*DCL RPRENTUT BIT(8) CONSTANT('75'X);  /* ENTRY IS UTERM             */
*DCL RPRENTCL BIT(8) CONSTANT('70'X);  /* ENTRY IS A CLUSTER         */
*DCL RPRENTLN BIT(8) CONSTANT('50'X);  /* ENTRY IS A LINE            */
*DCL RPRENTLH BIT(8) CONSTANT('03'X);  /* ENTRY IS A LOCAL HEADER    */
*DCL RPRENTGP BIT(8) CONSTANT('30'X);  /* ENTRY IS A GROUP           */
*DCL RPRENTLC BIT(8) CONSTANT('45'X);  /* ENTRY IS A LOCAL DEVICE    */
*DCL RPRENTAH BIT(8) CONSTANT('02'X);  /* ENTRY IS APPLICATION HEADER*/
*DCL RPRENTAP BIT(8) CONSTANT('55'X);  /* ENTRY IS APPLICATION       */
*DCL RPRENTDS BIT(8) CONSTANT('20'X);  /* ENTRY IS LCDO            0344
*                                         (DIALSET)                  */
*DCL RPRENTRN BIT(8) CONSTANT('01'X);  /* ENTRY IS THE RN            */
*DCL RPRENTCC BIT(8) CONSTANT('71'X);  /* ENTRY IS A PU              */
*DCL RPRENTLU BIT(8) CONSTANT('81'X);  /* ENTRY IS LOGICAL UNIT      */
*DCL RPRENTSW BIT(8) CONSTANT('04'X);  /* ENTRY IS SWITCHED          */
*                                      /* SUBAREA HEADER             */
*DCL RPRENTLS BIT(8) CONSTANT('05'X);  /* ENTRY IS LOCAL             */
*                                      /* SUBAREA HEADER             */
*DCL RPRENTPX BIT(8) CONSTANT('72'X);  /* ENTRY IS A PUX             */
*DCL RPRENTLX BIT(8) CONSTANT('10'X);  /* ENTRY IS A LUX             */
*DCL RPRENTDA BIT(8) CONSTANT('51'X);  /* ENTRY IS A DAN             */
*                                                                  0352
*                                                                  0352
*/* THE FOLLOWING IS A PREFIX FOR ALOCATION ENTRIES                  */
*/*   ISTRCL-CLUSTER,ISTRTR-TERMINAL,ISTRCM-COMPONENT                */
*                                                                  0353
*DCL                                                               0353
*1  ISTRCPRE BDY(WORD) BASED,    /* LEVEL 1 DECLARE                  */
*   2  RCPPRE  CHAR(LENGTH(ISTRPRE)),      /* COMMON PREFIX          */
*   2  RCPICELN PTR(31),         /* PTR LOGON ICE QUEUE              */
*   2  RCPLNAPA PTR(31),         /* PTR APLICATION ENTRY FOR SIMLOGON*/
*   2  RCPICEAQ PTR(31),         /* PTR ACQUIRE ICE QUEUE            */
*   2  RCPACETR PTR(31),         /* PTR ACE QUEUE                    */
*   2  RCPBHSI1 CHAR(1),         /* GEN'D BHSET ID                   */
*   2  RCPBHSI2 CHAR(1),         /* OVERRIDING BHSET ID SPECIFIED  0353
*                                   BY USER                          */
*   2  RCPBFLIM PTR(8),          /* BUFFER LIMIT                     */
*   2  RCPPMODE CHAR(1),         /* PERMISSABLE MODES                */
*      3 RCPRBASC BIT(1),        /* 1= BASIC OK                      */
*      3 RCPRRECD BIT(1),        /* 1= RECORD OK                     */
*      3 *        BIT(6),        /* RESERVED                         */
*   2  RCPLGNIN CHAR(20) BDY(WORD), /* INIT LOGON DATA               */
*      3 RCPLGNAP CHAR(8),       /* APPL FOR VTAM SIMLOGON           */
*      3 RCPLGNCT CHAR(8),       /* NAME OF LOGON CHAR TABLE         */
*      3 RCPINTA  PTR(31),       /* ADDR OF INTERPRET TABLE          */
*   2  RCPRSV03 PTR(31),         /* RESERVED FOR C/R                 */
*   2  RCPRSV04 PTR(31),         /* RESERVED FOR C/R                 */
*   2  RCPRSV05 PTR(31);         /* RESERVED FOR C/R                 */
*                                                                  0353
*                                                                  0353
*DCL                                                               0354
*1  ISTRDT BDY(WORD) BASED,      /* LEVEL 1 DECLARE                  */
*   2  RDTPRE CHAR(LENGTH(ISTRPRE)), /* ENTRY PREFIX                 */
*   2  RDTPLEN CHAR(4)BDY(WORD), /* PRIORITY AND LENGTH FIELD        */
*      3  RDTPRIOR,              /* DETERMINES SEGMENT TYPE          */
*         4  * BIT(3),           /*    NOT USED                      */
*         4  RDTPRIAP BIT(1),    /*    APPLICATION SEGMENT           */
*         4  RDTPRILC BIT(1),    /*    LOCAL SEGMENT                 */
*         4  RDTPRIRN BIT(1),    /*    RN SEGMENT                    */
*         4  RDTPRISW BIT(1),    /*    SWITCHED SEGMENT              */
*         4  RDTPRILS BIT(1),    /*    LOCAL SUBAREA SEGMENT         */
*      3  RDTLEN FIXED(24),      /* LENGTH OF RDT                    */
*   2  RDTFORW PTR(31),          /* FOREWARD POINTER                 */
*   2  RDTBACK PTR(31),          /* BACKWARD POINTER                 */
*   2  RDTFLAGS BIT(16),         /* SEGMENT FLAGS,UNUSED/REUSED      */
*   2  RDTCTSNT FIXED(15),       /* COUNT OF SNT ENTRIES FOR       0354
*                                   SEGMENT                          */
*   2  RDTMAXID PTR(8),          /* MAXIMUM NODE ID FOR            0354
*                                   NETWORK                          */
*   2  RDTNODID PTR(8),          /* NODE ID FOR THIS SEGMENT         */
*   2  RDTLGCT  PTR(8),          /* COUNT OF LOGONS OUTSTANDING      */
*   2  RDTFLAGB BIT(8),          /* FLAG BYTE                        */
*      3 RDTOUERP BIT(1),        /* 1 = REPEAT ERP                   */
*      3 RDTPRGDN BIT(1),        /* 1 = PURGE ISSUED                 */
*      3 RDTCTPGD BIT(1),        /* 1 = CONTACT PURGED               */
*      3 RDTCTCFL BIT(1),        /* HIGHER FAILURE-CONTACT FLUSHED   */
*      3 RDTBHSET BIT(1),        /* BHSET REQUIRED                   */
*      3 RDTRSV01 BIT(3),        /* RESERVED                         */
*   2  RDTVPAB  PTR(31),         /* ADDR OF VARY PAB                 */
*   2  RDTEPAB  PTR(31),         /* ADDR OF ERP PAB                  */
*   2  RDTDPAB  PTR(31),         /* ADDR OF DUMP/LOAD/RESTART PAB    */
*   2  RDTTPAB  PTR(31),         /* TOLTEP SSCP PAB                  */
*   2  RDTVYRPH PTR(31),         /* @ OF VARY RPH WAITING            */
*                                /* FOR RESTART COMPLETION           */
*      3 RRNVYRPH PTR(31),       /* DELETE ALIAS IN NEXT             */
*                                /* FIRST SNA/2 BUILD                */
*   2  RDTSTCNT PTR(8),          /* ACTIVE SUBNODE COUNT             */
*      3 RRNSTCNT PTR(8),        /* DELETE ALIAS IN NEXT             */
*                                /* FIRST SNA/2 BUILD                */
*   2  *        CHAR(3),         /* RESERVED                         */
*   2  RDTCRSDS CHAR(8),         /* C/R DATA SET IDENTIFIER          */
*                                /* BLANK IMPLIES NOT SPECIFIED      */
*   2  RDTCRSPW CHAR(8),         /* C/R DATASET PASSWORD             */
*                                /* BLANK IMPLIES NOT SPECIFIED      */
*   2  RDTVSRPL PTR(31);         /* C/R PTR TO VSAM RPL              */
*                                                                  0354
*                                                                  0354
*DCL                                                               0355
*1  ISTRAP BDY(WORD) BASED,      /* APPLICATION ENTRY                */
*   2  RAPPRE CHAR(LENGTH(ISTRPRE)), /*  USE ISTRPRE DSECT           */
*   2  RAPACBA PTR(31),          /*   POINTER TO ACB                 */
*   2  RAPACDEB PTR(31),         /*  POINTER TO ACBDEB               */
*   2  RAPAPPWD CHAR(8),         /* APPLICATION PASSWORD             */
*   2  RAPICELG PTR(31),         /* ANCHOR FOR LOGON ICE TO APLICATION*
*   2  RAPICEAC PTR(31),         /* ANCHOR ACEPT ICE FOR APPLICATION */
*   2  RAPICEAQ PTR(31),         /*  ANCHOR ACQUIRE ICE BY APPLI     */
*   2  RAPACEAP PTR(31),         /* ANCHOR FOR APPLICATION ACES      */
*   2  RAPTRPRE FIXED(15),       /* COUNT OF PREMPTED TERMINALS      */
*   2  RAPACEQD FIXED(15),       /* COUNT OF ACES QUEUED             */
*   2  RAPFLG BIT(8),            /*  FLAG FIELD                      */
*      3 RAPABLGN BIT(1),        /*  PERMANENTLY BLOCK LOGONS BIT    */
*      3 RAPAQUI BIT(1),         /* QUIESCE IN PROCESS               */
*      3 RAPASLGI BIT(1),        /*  APPLICATION FIRST TIME LOGON  0355
*                                    ISSUED FLAG                     */
*      3 RAPATLGN BIT(1),        /*  TEMPORARILY BLOCK LOGONS BIT    */
*      3 RAPRSV03 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV04 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV05 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV06 BIT(1),        /*  RESERVED                        */
*   2  RAPFLGB BIT(8),           /* AUTHORIZATION FLAGS              */
*      3 RAPALLF BIT(1),         /* ALL FUNCTIONS AUTH.              */
*      3 RAPABLCK BIT(1),        /* BLOCK I/O AUTH.                  */
*      3 RAPAPASS BIT(1),        /* PASS AUTH.                       */
*      3 RAPAPRMT BIT(1),        /* PREEMPT AUTH.                    */
*      3 RAPAACQ BIT(1),         /* ACQUIRE AUTH.                    */
*      3 RAPAPPO  BIT(1),        /* RNO PPO (PRIMARY PROGRAM AUTH    */
*      3 RAPASPO  BIT(1),        /* RNO SPO (SECONDARY PROGRAM AUTH  */
*      3 RAPANVPC BIT(1),        /* NO VSPACE AUTHORIZED             */
*   2  RAPFLGC BIT(8),           /* AUTHORIZATION FLAGS RESERVED     */
*      3 RAPRSV10 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV11 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV12 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV13 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV14 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV15 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV16 BIT(1),        /*  RESERVED                        */
*      3 RAPRSV17 BIT(1),        /*  RESERVED                        */
*   2  RAPBFACT PTR(8),          /* BUFFER LIMIT FACTOR              */
*   2  RAPRVPT1 PTR(31),         /*  RESERVED                        */
*   2  RAPRVPT2 PTR(31);         /*  RESERVED                        */
*                                                                  0355
*                                                                  0355
*DCL                                                               0356
*1  ISTRLC BDY(WORD) BASED,      /* LOCAL ENTRY                      */
*   2  RLCPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX               */
*   2  RLCADR PTR(31),                                             0356
*      3  RLCFLAG BIT(8),        /* FLAG BYTE                        */
*         4  RLCRSV22 BIT(1),    /* RESERVED                         */
*         4  RLCRBISA BIT(1),    /* INITIAL STATUS - 1 = ACTIVE      */
*         4  RLCRSV14 BIT(3),    /* UNUSED/RESERVED                  */
*         4  RLCACNT BIT(1),     /* MESSAGE BLOCK ACCEPTED           */
*         4  RLCRSVDE BIT(2),    /* RESERVED                         */
*      3  RLCUCBAD PTR(24),      /* UCB /PUB ADDRESS                 */
*   2 RLCLCCUA CHAR(3),          /* DEVICE CHANNEL UNIT ADDR         */
*   2 RLCRVPT1 CHAR(1),          /* RESERVED                         */
*   2 RLCRVPT2 PTR(31);          /* RESERVED                         */
*                                                                  0356
*                                                                  0356
*DCL                                                               0357
*1  ISTRRN BDY(WORD) BASED,      /* RN ENTRY                         */
*   2  RRNPRE CHAR(LENGTH(ISTRDT)),  /*  USE ISTRDT DSECT            */
*   2  RRNADR PTR(31),                                             0357
*      3  RRNFLAG BIT(8),                                          0357
*         4  RRNRSV89 BIT(1),    /* RESERVED                         */
*         4  RRNRBISA BIT(1),    /* INITIAL STATUS 1 = ACTIVE        */
*         4  RRNLCSIP BIT(1),    /* NODE BEING ACTIVATED             */
*         4  RRNLCDIE BIT(1),    /* HIGHER NODE NOT SUCCESFULLY      */
*                                /*             ACTIVATED            */
*         4  RRNLCDIP BIT(1),    /* NODE BEING DEACTIVATED           */
*         4  RRNERPIP BIT(1),    /* ERP IN PROCESS                   */
*         4  RRNDSTCT BIT(1),    /* DEACT TO DECREMENT STCNT         */
*         4  RRNRSV11 BIT(1),    /* UNUSED/RESERVED                  */
*      3  RRNUCBAD PTR(24),      /* UCB/PUB ADDR                     */
*         4 RRNCHQI  BIT(8),     /* CHANNEL QUEUE INDEX              */
*         4 RRNLUBA  PTR(16),    /* DESCRIBE ENTRY IN PUB            */
*                                /* OWNERSHIP TABLE                  */
*   2  RRNGRPA PTR(31),          /* POINTER TO FIRST GROUP ENTRY     */
*   2  RRNRNCUA CHAR(3),         /* CHANNEL UNIT ADDR                */
*   2  RRNRLDIP FIXED(8),        /* REMOTE LOAD/DUMP IN PROG. COUNT  */
*   2  RRNTRENT PTR(31),         /* ADDR TERM ENTRY IN LOCAL         */
*   2  RRNBHSET PTR(31),         /* POINTER TO TABLE OF BHSET NAMES  */
*   2  RRNCTBHS FIXED(15),       /* COUNT OF BHSET NAMES IN RRNBHSET */
*   2  RRNCTEGP FIXED(15),       /* COUNT OF GROUP ENTRIES FOR RN    */
*   2  RRNCTELI FIXED(15),       /* COUNT OF LINE ENTRIES FOR RN     */
*   2  RRNCTECL FIXED(15),       /* COUNT OF CLUSTER ENTRIES FOR RN  */
*   2  RRNCTETR FIXED(15),       /* COUNT OF TERMINAL ENTRIES FOR RN */
*   2  RRNCTEIN FIXED(15),       /* COUNT OF INT. NODE ENTRIES FOR RN*/
*   2  RRNCTECM FIXED(15),       /* CNT OF COMPONENT ENTRIES FOR RN  */
*   2  RRNCTENT FIXED(15),       /* # ALL ENTRIES IN 370X RDT SEGMENT*/
*   2  RRNRDF CHAR(4),           /*  RESOURCE DEFINITION FLAG        */
*      3  RRNRDFA  BIT(8),       /* FLAGS (WORD 1 BYTE 1)            */
*         4  RRNRASHT BIT(1),    /* AUTO NETWORK SHUTDOWN            */
*         4  RRNRAIPL BIT(1),    /* AUTO IPL ON RN FAILURE           */
*         4  RRNRADMP BIT(1),    /* AUTO DUMP ON RN FAILURE          */
*         4  RRNRASYN BIT(1),    /* C/R AUTOMATICALLY RESYNCHRONIZED */
*                                /* IF ALREADY LOADED NCP            */
*                                /* 0=NO, 1=YES                      */
*         4  RRNRAOLT BIT(1),    /* ON-LINE TERMINAL TEST            */
*         4  RRNRBREM  BIT(1),   /* REMOTE RN FLAG                   */
*         4  RRNRANCP BIT(1),    /* GENERATION TYPE NCP              */
*         4  RRNRAPEP BIT(1),    /* GENERATION TYPE PEP              */
*      3  RRNRDFB BIT(16),       /* FLAG FIELD B (RDF)               */
*         4  RRNRBMDL BIT(1),    /* (=1 IF 3705) ELSE 3704           */
*         4  RRNRSV02 BIT(1),    /* RESERVED                         */
*         4  RRNRBCCL BIT(1),    /* LOOSELY COUPLED CHANNEL          */
*         4  RRNRBCCT BIT(1),    /* TIGHTLY COUPLED CHANNEL          */
*         4  RRNRBSEC BIT(1),    /* SECONDARY CHANNEL EXIST          */
*         4  RRNRBCT1 BIT(1),    /* PRIM CHAN TYPE (0=TYPE1,1=TYPE2) */
*         4  RRNRBCT2 BIT(1),    /* SEC CHAN TYPE (0=TYPE1,1=TYPE2)  */
*         4  RRNRSV03 BIT(1),    /* RESERVED                         */
*         4  RRNRBBUP BIT(1),    /* BRINGUP IS TO BE EXERCISED     0357
*                                         FOR THIS RN DURING IPL     */
*         4  RRNVYDON BIT(1),    /* RDT SEG IS BEING FREED           */
*         4  RRNRSV01 BIT(5),    /* RESERVED                         */
*         4  RRNPTASL BIT(1),    /* SOME PORT SOLICITOR IS WAITING 0357
*                                   TO BE REDRIVEN BY CLSDST         */
*      3  RRNRSV55 CHAR(1),      /*  RESERVED                        */
*   2  RRNCMF CHAR(4),           /*  FLAG FIELDS FOR COMMANDS        */
*      3  RRNCMFA  BIT(8),       /* FLAG FIELD A -COMMANDS           */
*         4  RRNCAALL BIT(1),    /* PHYSICAL DISCONNECT              */
*         4  RRNCAATD BIT(1),    /* ACTIVATE DEVICE                  */
*         4  RRNCAATG BIT(1),    /* ACTIVATE GROUP                   */
*         4  RRNCAATI BIT(1),    /* ACTIVATE INVITES                 */
*         4  RRNCAMBH BIT(1),    /* MODIFY BLOCK HANDLER SET         */
*         4  RRNCACDT BIT(1),    /* CHANGE DATE AND TIME             */
*         4  RRNCADTD BIT(1),    /* DEACTIVATE DEVICE                */
*         4  RRNCADGO BIT(1),    /* DEACTIVATE GROUP ORDERLY         */
*      3  RRNCMFB  BIT(8),       /* FLAG FIELD B - COMMANDS          */
*         4  RRNCBDLO BIT(1),    /* DEACTIVATE LINE ORDERLY          */
*         4  RRNCBDLH BIT(1),    /* DEACTIVATE LINE HALT             */
*         4  RRNCBDLR BIT(1),    /* DISPLAY LINE RESOURCE ID         */
*         4  RRNCBRDS BIT(1),    /* REQUEST DEVICE STATUS            */
*         4  RRNCBRLS BIT(1),    /* REQUEST LINE STATUS              */
*         4  RRNCBNPL BIT(1),    /* CHANGE LINE NEG POLL RESPONSE LIM*/
*         4  RRNCBMOD BIT(1),    /* COPY/SET DESTINATION NODE        */
*         4  RRNCBALT BIT(1),    /*  ACTIVATE LINE TRACE             */
*      3  RRNCMFC  BIT(8),       /* FLAG FIELD C - COMMANDS          */
*         4  RRNCCRCN BIT(1),    /* RESET CONDITIONAL                */
*         4  RRNCCRDQ BIT(1),    /* RESET DEVICE QUEUE               */
*         4  RRNCCRST BIT(1),    /* REQUEST DEVICE STATISTICS        */
*         4  RRNCCCRC BIT(1),    /* CHANGE RETRY COUNTS              */
*         4  RRNCCRIM BIT(1),    /* RESET IMMEDIATE                  */
*         4  RRNCCRCM BIT(1),    /* RESET CONTROL MODE               */
*         4  RRNCCSIM BIT(1),    /* COPY/REPLACE SESSION INIT INFO   */
*         4  RRNCCCSL BIT(1),    /* CHANGE SESSION LIMIT             */
*      3  RRNCMFD  BIT(8),       /* FLAG FIELD D - COMMANDS          */
*         4  RRNCDCSP BIT(1),    /* CHANGE SERIVCE PAUSE             */
*         4  RRNCDSTD BIT(1),    /* DISPLAY STORAGE                  */
*         4  RRNCDDTL BIT(1),    /* CHANGE DEVICE TRANSMIT LIMIT     */
*         4  RRNCDBCK BIT(1),    /* SWITCHED NETWORK BACKUP          */
*         4  RRNCDDSI BIT(1),    /* COPY/REPLACE DEV SESSION INIT INFO*
*         4  RRNCDREC BIT(1),    /* RESET AT END OF COMMAND          */
*         4  RRNREMPO BIT(1),    /* REMOTE POWER OFF                 */
*         4 RRNRSV05  BIT(1),    /*       NOT  USED                  */
*   2  RRNFLUX  PTR(31),         /* POINTER TO FIRST LUX             */
*   2  RRNCPLUB CHAR(6),         /* SYMBOLIC UNIT NAME OF NCP DATASET*/
*   2  RRNEPADR PTR(15),         /* EP SUBCHANNEL ADDRESS            */
*   2  RRNNMDPD  CHAR(8),        /* FILENAME FOR DUMP DATA SET       */
*      3  RRNDPLUB CHAR(6),      /* LUB NAME FOR DUMP DATASET        */
*      3  RRNPUBI  BIT(8),       /* PUB INDEX                        */
*      3  RRNRSV88 CHAR(1),      /* RESERVED-DOS ONLY                */
*   2  RRNRSV04  CHAR(6),        /* RESERVED                         */
*   2  RRNDELAY  CHAR(2),        /* INITIAL VALUE FROM DELAY         */
*   2  RRNNMNCP  CHAR(8),        /* DSNAME FOR NCP LOAD MODULE       */
*   2  RRNHPRE PTR(16),          /* HOST PREFIX INFORMATION          */
*      3  RRNHLENH PTR(8),       /* LENGTH OF HOST HEADER PREFIX     */
*      3  RRNHLENT PTR(8),       /* LENGTH OF HOST TEXT PREFIX       */
*   2  RRNHBUFS FIXED(15),       /* SIZE OF BUFFER UNITS FOR HOST    */
*   2  RRNCTPCC PTR(8),          /* CNT OF BUFFERS RECEIVING PCCU DATA*
*   2  RRNNCPNM CHAR(7),         /* NAME OF NCP LOAD MOD 7 CHAR MAX  */
*   2  RRNMSIZE PTR(31),         /* MAX SIZE OF SEND                 */
*   2  RRNRPLPT PTR(31),         /* C/R POINTER TO RPL               */
*   2  RRNNCSPL PTR(31),         /* POINTER TO NCSPL                 */
*   2  RRNLASTE PTR(31),         /* PTR TO LAST ENTRY IN RN SEGMENT  */
*   2  RRNRDCUA CHAR(3),         /* DEFAULT CUA                      */
*   2  *        PTR(8),          /* RESERVED                         */
*   2  RRNRINNM CHAR(8);         /* DEFAULT INNODE NAME IN LOCAL   0357
*                                   RDT TO CONNECT REMOTE RN         */
*                                                                  0357
*DCL                                                               0358
*1  ISTRGP BDY(WORD) BASED,      /* GROUP ENTRY                      */
*   2  RGPPRE CHAR(LENGTH(ISTRPRE)),        /*  USE ISTRPRE DSECT    */
*   2  RGPFLG BIT(8),            /*  FLAG FIELD                      */
*      3  RGPADIL BIT(1),        /* =1 SWITCHED, =0 NON-SWIT         */
*      3  RGPASS  BIT(1),        /* START/STOP                       */
*      3  RGPABSC  BIT(1),       /* BINARY SYNCHRONOUS               */
*      3  RGPASDLC BIT(1),       /* DATA LINK CONTROL                */
*      3 RGPRSV02  BIT(4),       /*     NOT USED                     */
*   2  RGPRSV03 FIXED(8),        /* USED TO FORCE ALINEMENT          */
*   2  RGPCTELN FIXED(15),       /* COUNT OF LINE ENTRIES FOR GROUP  */
*   2  RGPCTECL FIXED(15),       /* CNT OF CLUSTER ENTRIES FOR GROUP */
*   2  RGPCTETR FIXED(15),       /* CNT TERMINAL ENTRIES FOR GROUP   */
*   2  RGPCTEIN FIXED(15),       /* COUNT OF INNODE ENTRIES FOR GROUP*/
*   2  RGPCTECM FIXED(15),       /* CNT COMPONENT ENTRIES FOR GROUP  */
*   2  RGPRVPT1 PTR(31),         /* RESERVED                         */
*   2  RGPRVPT2 PTR(31);         /* RESERVED                         */
*                                                                  0358
*                                                                  0358
*DCL                                                               0359
*1  ISTRLN BDY(WORD) BASED,      /* LINE ENTRY                       */
*   2  RLNPRE CHAR(LENGTH(ISTRPRE)), /* USE COMMON PREFIX            */
*   2  RLNADR PTR(31),                                             0359
*      3  RLNFLAG BIT(8),                                          0359
*         4  RLNEAM   BIT(1),    /* ENABLE ANSWER MODE DONE          */
*         4  RLNRBISA BIT(1),    /* INITIAL STATUS 1=ACTIVE          */
*         4  RLNRSV01 BIT(6),    /* RESERVED                         */
*      3  RLNUCBAD PTR(24),      /* UCB/PUB ADDRESS                  */
*         4  RLNCUA CHAR(3),     /* NOT USED                         */
*   2  RLNCTECL FIXED(15),       /* CNT OF CLUSTER ENTRIES FOR LINE  */
*   2  RLNCTETR FIXED(15),       /* CNT OF TERMINAL ENTRIES FOR LINE */
*   2  RLNCTEIN FIXED(15),       /* COUNT OF INNODE ENTRIES FOR LINE */
*   2  RLNCTECM FIXED(15),       /* CNT OF COMPONENT ENTRIES FOR LINE*/
*   2  RLNACTCT FIXED(15),       /* COUNT OF COMPONENTS, CLUSTERS  0359
*                                             AND TERMINALS ON LINE  */
*   2  RLNSTAT1 BIT(8),          /* LINK TRAP STATUS                 */
*      3 RLNTRAP  BIT(1),        /* INTERCEPT NEXT LINK OPERATION    */
*      3 RLNLRST  BIT(1),        /* LINK RESTART COND CAUSED TRAP    */
*      3 RLNINOPL BIT(1),        /* LINK INOP CONDITION CAUSED TRAP  */
*      3 RLNINOPP BIT(1),        /* PU INOP CONDITION CAUSED TRAP    */
*      3 RLNVD    BIT(1),        /* VARY INACT CONDITION CAUSED TRAP */
*      3 RLNRSV03 BIT(3),        /* RESERVED                         */
*    2 RLNSTAT2 BIT(8),          /* LINK NORMAL STATUS               */
*      3 RLNOHIN  BIT(1),        /* OFFHOOK REPORTED TO SW SUBAREA-  */
*                                /* REPLY DUE                        */
*      3 RLNINUSE BIT(1),        /* LINK RESOURCES ALLOCATED TO PU   */
*      3 RLNRSV04 BIT(6),        /* RESERVED                         */
*   2  RLNRDF CHAR(4),           /*  RESOURCE DEFINITION FLAG        */
*      3  RLNRDFA  BIT(8),       /* FLAGS FIELD A                    */
*         4  RLNRACNT BIT(2),    /*  NEXT TWO FIELDS                 */
*            5  RLNRACAT BIT(1), /* CALL INITIATOR-TERMINAL          */
*            5  RLNRACAN BIT(1), /* CALL INITIATOR-NCP               */
*         4  RLNGANSW BIT(1),    /* C/R GENNED IN ANSWER MODE, 1=YES */
*         4  RLNPORT  BIT(1),    /* THIS IS A PORT ENTRY             */
*         4  RLNIDV   BIT(1),    /* THIS IS AN ID VERIFIED PORT      */
*         4  RLNRAEP  BIT(1),    /* TYPE IS EP                       */
*         4  RLNRANCP BIT(1),    /* TYPE IS NCP                      */
*         4  RLNRAPEP BIT(1),    /* TYPE IS PEP                      */
*      3  RLNRDFB  BIT(8),       /* FLAGS FIELD B                    */
*         4  RLNRBUSE BIT(1),    /* EP/NCP USE  1=NCP                */
*         4  RLNANSWR BIT(1),    /* ON = SEND ENABLE ANSWER          */
*                                /* AT ACTIVATE                      */
*         4  RLNAUTOD BIT(1),    /* ON=AUTODIAL, OFF=MANUAL          */
*         4  RLNRSV0B BIT(1),    /* RESERVED                         */
*         4  RLNTTV   BIT(1),    /* THIS IS TERM TYPE VERIFICATION 0359
*                                   PORT                             */
*         4  RLNRAPOL BIT(1),    /* POLLED LINE                      */
*         4  RLNRATRN BIT(1),    /* SDLC LINE                        */
*         4  RLNMULTP BIT(1),    /* 0 = POINT TO POINT,            0359
*                                   1 = MULTI POINT                  */
*      3  RLNRDFC  BIT(8),       /* FLAGS FIELD C - LINE CODES       */
*                                /* SEE CONSTANTS FOR DEFINITION     */
*      3  RLNRDFD  BIT(8),       /* FLAGS FIELD D - RESERVED         */
*   2  RLNAUTOA FIXED(15),       /* AUTOCALL ADDRESS                 */
*   2  RLNRDSLM FIXED(8),        /* SCHED. LIM BASED ON LINE SPEED 2-4*
*   2  RLNCTSES FIXED(8),        /* COUNT OF CONCURRENT SESSIONS     */
*   2  RLNACTRM PTR(8),          /* COUNT OF ACTIVE REMOTES FOR THIS
*                                   TRUNK                            */
*   2  RLNRESV1 BIT(8),          /* RESERVED/UNUSED                  */
*   2  RLNACTSN FIXED(15),       /* COUNT ACTIVE NODES ON LINK       */
*   2  RLNPOLMT FIXED(8),        /* NEG POLL RESPONSE LIMIT          */
*   2  RLNPAUSE FIXED(8),        /* POLL DELAY/PAUSE                 */
*   2  RLNCRFLG BIT(8),          /* FLAG-CONFIGURATION RESTART       */
*      3 RLNACTLN BIT(1),        /* ACTIVATE LINK OK                 */
*      3 RLNSWNCP BIT(1),        /* SWITCH PEP LINE TO NCP OK        */
*      3 RLNLSCMD BIT(3),        /* LINE SCHEDULING COMMANDS       0359
*                                   ISSUED OK                        */
*        4 RLNNPRLM BIT(1),      /* CHNG NEG POLL RESP LIMIT OK      */
*        4 RLNSESLM BIT(1),      /* CHNG SESSION LIMIT OK            */
*        4 RLNSVSKP BIT(1),      /* CHNG SERVICE SEEK PAUSE OK       */
*      3 RLNSWEP  BIT(1),        /* SWITCH TO EP                     */
*      3 RLNCRRSV BIT(2),        /* RESERVED FOR CONFIG RESTART      */
*   2  *        CHAR(1),         /* RESERVED                         */
*   2  RLNX2SW  PTR(31),         /* ADDRESS OF 370X TO SWITCH        */
*                                /* COMMUNICATION NCSPL              */
*   2  RLNNCSPL PTR(31),         /* ADDRESS OF SPIN-OFF NCSPL        */
*                                /* FOR VARY DEACTIVATE              */
*   2  RLNRVPT2 PTR(31);         /* RESERVED                         */
*                                                                  0359
*                                                                  0359
*DCL RLNRCEDC BIT(8) CONSTANT('01'X);  /* EBCDIC (CONSTANTS)         */
*DCL RLNRCUSA BIT(8) CONSTANT('02'X);  /* USASCII                    */
*DCL RLNRCBCD BIT(8) CONSTANT('03'X);  /* BCD                        */
*DCL RLNRCEBC BIT(8) CONSTANT('04'X);  /* EBCD                       */
*DCL RLNRCCOR BIT(8) CONSTANT('05'X);  /* COR                        */
*DCL RLNRCKAT BIT(8) CONSTANT('06'X);  /* KATAKANA                   */
*DCL RLNRCIT2 BIT(8) CONSTANT('08'X);  /* ITA2                       */
*DCL RLNRCZS3 BIT(8) CONSTANT('09'X);  /* ZSC3                       */
*                                                                  0367
*                                                                  0367
*DCL                                                               0368
*1  ISTRPT BDY(WORD) BASED,        /* PORT ENTRY                     */
*   2 RPTLN CHAR(LENGTH(ISTRLN)),  /* INCLUDE LINE ENTRY             */
*   2 RPTLNCID BDY(WORD) CHAR(4),  /* COMM ID OF LINE                */
*     3 RPTLNSAF CHAR(2),          /* SAF                            */
*     3 RPTLNDAF CHAR(2),          /* DAF                            */
*   2 RPTCTNM CHAR(8),             /* CTERM NAME                     */
*   2 RPTDITT PTR(31),             /* POINTER TO DITT TABLE          */
*     3 RPTDIVT PTR(31),           /* POINTER TO DIVT TABLE          */
*   2 RPTATERM PTR(31),            /* POINTER TO ASSOCIATED ENTRY    */
*   2 RPTUTERM PTR(31),            /* POINTER TO UTERM ENTRY         */
*   2 RPTFLAG1 CHAR(1),            /* PORT SOLICITOR FLAGS           */
*     3  RPTASLEP BIT(1),          /* THIS PORT SOLICITOR IS WAITING
*                                     TO BE REDRIVEN BY CLSDST       */
*     3 RPTVRYPD BIT(1),           /* VARY PENDING IN THIS CTERM     */
*     3 RPTHLVPD BIT(1),           /* VARY PENDING IN HIGHER LEVEL 0368
*                                     NODE                           */
*     3 RPTONLIN BIT(1),           /* ONLINE/OFFLINE(VARY)           */
*     3 RPTVIODN BIT(1),           /* I/O DONE FOR THIS NODE         */
*     3 RPTVYIMM BIT(1),           /* VARY IMM ISSUED FOR PORT       */
*     3 RPTDYNAM BIT(1),           /* BHSET = DYNAMIC                */
*     3 RPTISTAT BIT(1),           /* CTERM(PORT) IS INITIALLY ACTIVE*/
*                                  /* 1 = YES                        */
*   2 RPTRSV01 CHAR(1),            /* RESERVED                       */
*   2 RPTDAFSV BIT(16),            /* SAVE TERMINAL DAF              */
*   2 RPTPEPCT FIXED(15),          /* PEP COUNT FOR CTERM            */
*   2 RPTPTHCT FIXED(15),          /* PATH COUNT FOR CTERM           */
*   2 RPTNSNSV PTR(31),            /* SAVE TERMINAL NEXT SCHED NODE
*                                     POINTER                        */
*   2  RPTRSV02 PTR(31),           /* RESERVED                       */
*   2  RPTRSV03 PTR(31);           /* RESERVED                       */
*                                                                  0368
*                                                                  0368
*DCL                                                               0369
*1  ISTRCL BDY(WORD) BASED,      /* CLUSTER ENTRY                    */
*   2  RCLPRE CHAR(LENGTH(ISTRPRE)),    /* USE COMMON PREFIX         */
*   2  RCLADR PTR(31),                                             0369
*      3  RCLFLAG BIT(8),                                          0369
*         4  RCLRSV22 BIT(1),    /* RESERVED                         */
*         4  RCLRBISA BIT(1),    /* INITIAL STATUS 1=ACTIVE          */
*         4  RCLBATCH BIT(1),    /* BATCHED MESSAGE INPUT          0369
*                                   FEATURE                          */
*         4  RCLRSV33 BIT(5),    /* RESERVED                         */
*      3  RCLGPADR PTR(24),      /* ADDRESSING INFORMATION POINTER 0369
*                                                  (ADDR RCLCNGP)    */
*   2  RCLCTETR FIXED(15),       /* CNT TERMINAL ENTRIES FOR CLUSTER */
*   2  RCLCTECM FIXED(15),       /* CNT COMPONENT ENTRIES FOR CLUSTER*/
*   2  RCLRSV01 FIXED(15),       /* FILLER TO FORCE ALIGNMENT        */
*   2  RCLCTNGP FIXED(15),       /* GPOLL CHARACTER COUNT            */
*   2  RCLGPOLA PTR(31),         /* GPOLL CHARACTER STRING POINTER   */
*   2  RCLRVPT1 PTR(31),         /* RESERVED                         */
*   2  RCLRVPT2 PTR(31);         /* RESERVED                         */
*                                                                  0369
*                                                                  0369
*DCL                                                               0370
*1  ISTRTR BDY(WORD) BASED,      /* TERMINAL AND/OR COMPONENT ENTRY  */
*   2  RTRCRPR CHAR(LENGTH(ISTRCPRE)),     /* USE ISTRCPRE DSECT     */
*   2  RTRADR PTR(31),                                             0370
*      3  RTRFLAG BIT(8),                                          0370
*         4  RTRRSV21 BIT (1),   /* RESERVED */                    0370
*         4  RTRRBISA BIT(1),    /* INITIAL STATUS 1 = ACITVE        */
*         4  RTRRSV51 BIT(3),    /* RESERVED                         */
*         4  RTRVTERM BIT(1),    /* VTERM TERMINAL ENTRY             */
*         4 RTRRSV22 BIT(2),     /* UNUSED                           */
*      3  RTRADRPT PTR(24),      /* TO BE USED FOR POINTER TO      0370
*                                            ADDRESSING INFORMATION  */
*   2  RTRCTECM FIXED(15),       /* COUNT OF COMPONENT             0370
*                                               ENTRIES FOR TERMINAL */
*   2  RTRRSV01 FIXED(15),       /*  FILLER TO FORCE ALINEMENT       */
*   2  RTRRSV45 CHAR(4),         /* RESERVED                         */
*   2  RTRRDFA  BIT(8),          /* FLAG FIELD A                     */
*      3  RTRRAATN BIT(1),       /* TERMINAL CAN INTERRUPT PCCU      */
*      3  RTRRAALL BIT(3),       /* 3 FLAG FIELD                     */
*         4  RTRRAPT1 BIT(1),    /* PT1 BLOCK HANDLER FLAGS          */
*         4  RTRRAPT2 BIT(1),    /* PT2                              */
*         4  RTRRAPT3 BIT(1),    /* PT3                              */
*      3  RTRRACDT BIT(1),       /* CRITICAL DATA FLAG               */
*      3  RTRRSV60 BIT(1),       /* RESERVED                         */
*      3  RTRRACTR BIT(1),       /* LOGICAL DEVICE FLAG              */
*      3  RTRRSV02 BIT(1),       /* UNUSED                           */
*   2  RTRRDFB  BIT(8),          /* FLAG FIELD B - RESOURCE DEF      */
*      3  RTRRBECT BIT(1),       /* EMBEDDED LINE CONTROL            */
*      3  RTRRBEND BIT(1),       /* EOT/EOB                          */
*      3  RTRRSV32 BIT(6),       /* RESERVED                         */
*   2  RTRRDFC  BIT(8),          /* FLAG FIELD C - RESOURCE DEF      */
*      3  RTRRCIT1 BIT(1),       /* EIB CHAR AFTER ITB ON RECV       */
*      3  RTRRCIT2 BIT(1),       /* EIB CHAR AFTER ITB ON SEND       */
*      3  RTRRCPT3 BIT(1),       /* DEVICE HAS PT3 BHSET             */
*      3  RTRRCBLK BIT(1),       /* RECORD DATA - BLOCK              */
*      3  RTRRCMSG BIT(1),       /* RECORD DATA - MESSAGE            */
*      3  RTRRCXMS BIT(1),       /* RECORD DATA - XMISSION           */
*      3  RTRRSV23 BIT(2),       /* RESERVED/UNUSED                  */
*   2  RTRRDFD  BIT(8),          /* FLAG FIELD D - RESERVED          */
*      3  RTRRDBHN  BIT(1),      /* BHSET = NONE                     */
*      3  RTRRDBHD  BIT(1),      /* BHSET = DYNAMIC                  */
*      3  RTRRDBHI  BIT(1),      /* BHSET = SETNAME AND EXECUTR      */
*      3  RTRRSV10 BIT(2),       /* RESERVED                         */
*      3  RTRRSV11 BIT(3),       /* RESERVED                         */
*   2  RTRRDFE  BIT(8),          /* FLAG FIELD E - RESOURCE DEF      */
*/*                RTRREFT1  FEATURE FLAGS  (9 BITS)                 */
*      3  RTRREBRK BIT(1),       /* TRANSMIT INTERRUPT               */
*      3  RTRRSV0A BIT(1),       /* RESERVED                         */
*      3  RTRREACR BIT(1),       /* ACCELERATED CARRIAGE RETURN      */
*      3  RTRRECHK BIT(1),       /* CHECKING FEATURE                 */
*      3  RTRREATT BIT(1),       /*  TERMINAL INTERRUPT              */
*      3  RTRRESUP BIT(1),       /*  TIMEOUT SUPPRESSION             */
*      3  RTRRESCT BIT(1),       /*  STATION CONTROL                 */
*   2  RTRRDFF  BIT(8),          /* FLAG FIELD F - RESOURCE DEF      */
*      3  RTRRFXCT BIT(1),       /* TRANSMIT CONTROL                 */
*/*                      RTRRFFT2 FEATURE 2 FLAGS (NEXT 5 BITS)      */
*      3  RTRRFPEN BIT(1),       /* SELECTOR PEN                     */
*      3  RTRRFPFK BIT(1),       /* PROGRAM FUNCTION DEYBOARD        */
*      3  RTRRFANK BIT(1),       /* STANDARD ALPHA-NUMERIC KEYBOARD  */
*      3  RTRRFDEK BIT(1),       /* DATA ENTRY KEYBOARD              */
*      3  RTRRSV24 BIT(3),       /* UNUSED/RESERVED                  */
*   2  RTRTRMAX CHAR(1),         /* MAX # TRANSMISSIONS TERM TO PCCU */
*   2  RTRCRFLG PTR(8),          /* FLAG-CONFIGURATION RESTART       */
*      3 RTRCRSV1 BIT(2),        /* RESERVED FOR CONFIG RESTART      */
*      3 RTRLSCMD BIT(1),        /* LINE SCHEDULING CMD ISSUED OK    */
*        4 RTRDTRLM BIT(1),      /* CHNG DEV TRANSMISSION LIMIT OK   */
*      3 RTRCRSV2 BIT(5),        /* RESERVED FOR CONFIG. RESTART     */
*   2  RTRBHSN1 CHAR(8),         /* DEFAULT BHSET NAME IS BHF IS ON  */
*   2  RTRRVPT1 PTR(31),         /* RESERVED                         */
*   2  RTRRSV03 FIXED(15),       /* FILLER TO FORCE ALIGNMENT        */
*   2  RTRCTDIA FIXED(15),       /* CNT OF CHARS. IN TERM DIAL NUMBER*/
*   2  RTRCTPOL FIXED(15),       /* # CHARS. IN TERM POLL STRING     */
*   2  RTRCTADR FIXED(15),       /* COUNT OF ADDRESSING CHARACTERS   */
*   2  RTRCADDR  CHAR(8),        /* COMPONENT ADDRESSING CHARS       */
*   2  RTRPOLA PTR(31),          /* POINTER TO POLLING CHARACTERS    */
*   2  RTRDIAA PTR(31),          /* POINTING TO DIAL CHARACTERS      */
*   2  RTRRDFG  BIT(8),          /* CORRESPONDENCE CODE USED BY THIS
*                                   TERM LINE. SEE CONSTANTS.        */
*   2  RTRRSVDD CHAR(7),         /* RESERVED                         */
*   2  RTRBSCID CHAR(21),        /* BSC ID FIELD                     */
*      3  RTRIDLEN FIXED(8),     /* LENGTH OF ID                     */
*      3  RTRIDCAS CHAR(20),     /* ID CHARACTER                     */
*   2  RTRLCTI BIT(8),           /* LINE CONTROL TYPE ID             */
*   2  RTRRSV04 CHAR(2);         /* RESERVED                         */
*                                                                  0370
* DCL RTRDNCBA PTR(31) DEF(ISTRTR) POS(41);  /* SCAFFOLDING          */
*/* CONSTANTS FOR FIELD RTRRDFG                                      */
*DCL RTRRCBCD BIT(8) CONSTANT('03'X); /* BCD                         */
*DCL RTRRCEBC BIT(8) CONSTANT('04'X); /* EBCD                        */
*DCL RTRRCCOR BIT(8) CONSTANT('05'X); /* COR                         */
*                                                                  0374
*/*     CONSTANTS FOR FIELD RTRLCTI                                  */
*DCL RTR2741  BIT(8) CONSTANT('00'X);  /* 2741                       */
*DCL RTR2740A BIT(8) CONSTANT('02'X);  /* 2740-1 A (BASIC)           */
*DCL RTR2740D BIT(8) CONSTANT('06'X);  /* 2740-1 D (TRANS CONTROL)   */
*DCL RTR2740E BIT(8) CONSTANT('0A'X);  /* 2740-1 E (TRANS          0378
*                                   CONTROL WITH CHECKING            */
*DCL RTR2740F BIT(8) CONSTANT('0C'X);  /* 2740-1 F (CHECKING)        */
*DCL RTR1050  BIT(8) CONSTANT('1C'X);  /* 1050                       */
*DCL RTRTWX   BIT(8) CONSTANT('22'X);  /* TWX                        */
*/*                                                                  */
*/*   ENTRY IN LOCAL RN FOR REMOTE SEGMENT                           */
*/*                                                                  */
*DCL  1  ISTRIN   BDY(WORD) BASED,   /* INNODE REMOTE ENT IN LOCAL RN*/
*        2 RINCRPRE CHAR(LENGTH(ISTRCPRE)),  /* PREFIX               */
*        2 RINDFD   BIT(8),          /* FLAG FIELD                   */
*          3 RINREMPO BIT(1),        /* REMOTE POWER OFF             */
*            4 RTRREMPO BIT(1),      /* ALIAS                        */
*          3 RINNODEF BIT(1),        /* REMOTE TERM ENTRY INV AS ENT */
*            4 RTRNODEF BIT(1),      /* ALIAS                        */
*          3 RINLDISC BIT(1),        /* DISCONNECT REMOTE REQUIRED   */
*            4 RTRLDISC BIT(1),      /* ALIAS                        */
*          3 RINRSV01 BIT(5),        /* RESERVED                     */
*        2 RINNODID PTR(8),          /* NODE ID OF REMOTE            */
*          3 RTRNODID PTR(8),        /* ALIAS                        */
*        2 RINRLDAF CHAR(2),         /* DAF OF REMOTE WHEN ACTIVE    */
*          3 RTRRLDAF CHAR(2),       /* ALIAS                        */
*        2 RINREMOT PTR(31),         /* PTR TO RN ENTRY FOR REMOTE   */
*          3 RTRREMOT PTR(31),       /* ALIAS                        */
*        2 RINVPAB  PTR(31),         /* ADDR VARY PAB FOR REMOTE     */
*          3 RTRVPAB  PTR(31),       /* ALIAS                        */
*        2 RINRPHCN PTR(31),         /* ADDR RPH WAITING FOR CONTACT */
*          3 RTRRPHCN PTR(31),       /* ALIAS                        */
*        2 RINNCSPL PTR(31),         /* ADDR FOR NCSPL FOR DEACTIVATE*/
*          3 RTRNCSPL PTR(31),       /* ALIAS                        */
*        2 RINCNCNT PTR(8),          /* CONTACT COUNT FOR REMOTE     */
*          3 RTRCNCNT PTR(8),        /* ALIAS                        */
*        2 RINRSV02 CHAR(3),         /* RESERVED                     */
*        2 RINLOCRN PTR(31),         /* PTR TO RN ENTRY OF LOCAL     */
*        2 RINRSV04 CHAR(4),         /* RESERVED                     */
*        2 RINRSV05 CHAR(4);         /* RESERVED                     */
*/*                                                                  */
*DCL                                                               0383
*1   ISTRDS BDY(WORD) BASED,       /* LCDO ENTRY                     */
*           2  RDSPRE CHAR(LENGTH(ISTRPRE)), /* ENTRY PREFIX         */
*           2  RDSCTTRM FIXED(15), /* COUNT OF ENTRY POINTERS      0383
*                                     IN DIAL OUT TABLE              */
*           2  RDSCTATR FIXED(15), /*                                */
*           2  RDSADDOT PTR(31);   /* ADDRESS OF DIAL OUT TABLE      */
*/*                                                                  */
*DCL                                                               0384
*1   ISTDOT BDY(WORD) BASED,       /* DIAL OUT TABLE                 */
*           2  DOTADTRM PTR(31);   /* PTR TO DIAL OUT OR DIAL IN/  0384
*                                     OUT TERMINAL RDTE              */
*/*                                                                  */
*DCL                                                               0385
*1 ISTRCC BDY(WORD) BASED,             /* PU ENTRY                   */
*  2 RCCPRE   CHAR(LENGTH(ISTRPRE)),   /* COMMON PREFIX              */
*  2 RCCTYPE  CHAR(1),                 /* PU TYPE                    */
*  2 RCCFLAG  BIT(8),                  /* FLAG FIELD                 */
*    3 RCCRBISA BIT(1),                /* I STATUS 1=ACTIVE          */
*    3 RCCCUDIE BIT(1),                /* CLUSTER DEACTIVATING       */
*    3 RCCERPIP BIT(1),                /* ERP IN PROCESS             */
*    3 RCCLDISC BIT(1),                /* DISCONNECT REQUEST         */
*    3 RCCOHIMM BIT(1),                /* RTGOH RECEIVED AND WAS     */
*                                      /* AN IMMEDIATE TYPE          */
*    3 RCCOUERP BIT(1),                /* REPEAT ERP                 */
*    3 RCCPRGDN BIT(1),                /* PURGE ISSUED               */
*    3 RCCCTPGD BIT(1),                /* CONTACT PURGED             */
*  2 RCCFLAGB BIT(8),                  /* FLAG FIELD                 */
*    3 RCCDSTCT BIT(1),                /* DEACT TO DECR STCNT IN HDR */
*    3 RCCDIALP BIT(1),                /* DIAL IN PROGRESS           */
*    3 RCCIRETR BIT(1),                /* IRETRY 1 = YES             */
*    3 RCCBNNSP BIT(1),                /* BNNSUP FOR 3270            */
*    3 RCCFINAL BIT(1),                /* ON = DEACT PU FINAL REQD   */
*    3 RCCRESET BIT(1),                /* ON = RESET DEACT IN PROCESS*/
*    3 RCCBRKCN BIT(1),                /* ON-DISCOUNT=YES SPECIFIED  */
*                                      /* OFF-DISCOUNT=NO SPECIFIED  */
*    3 RCCRTGOH BIT(1),                /* ON=RTGOH RECEIVED          */
*  2 RCCCNCNT  PTR(8),                 /* CONTACT COUNT              */
*  2 RCCCTELU FIXED(15),               /* COUNT OF PU LU ENTRIES     */
*  2 RCCSTAID CHAR(8),                 /* 64 BIT PU STATION ID       */
*    3 RCCIDPA1 BIT(16),               /* FILLER OF 2 BYTES OF 0     */
*    3 RCCID48,                                                    0385
*      4 RCCIDPUT BIT(8),              /* PU TYPE                    */
*      4 RCCIDPA2 BIT(8),              /* FILLER OF 1 BYTE OF 0      */
*      4 RCCIDBLK BIT(12),             /* IDBLK VALUE                */
*      4 RCCIDNUM BIT(20),             /* IDNUM VALUE                */
*  2 RCCSESCT PTR(8),                  /* SESSION COUNT              */
*  2 *        CHAR(1),                 /* RESERVED                   */
*  2  RCCVPAB PTR(31),                 /* ADDRESS OF VARY PAB        */
*  2 RCCDPAB  PTR(31),                 /* ADDR RESTART PAB           */
*  2 RCCEPAB  PTR(31),                 /* ADDR OF ERP PAB            */
*  2 RCCRPHCN PTR(31),                 /* ADDR RPH WAIT FOR CONTACT  */
*  2 RCCNCSPL PTR(31),                 /* ADDR NCSPL FOR DEACTIVATE  */
*  2 RCCCRFLG BIT(8),                  /* FLAG-CONFIGURATION RESTART */
*    3 RCCACTPU BIT(1),                /* ACTIVATE PHYSICAL          */
*    3 RCCCTCFL BIT(1),          /* HIGHER FAILURE-CONTACT FLUSHED   */
*    3 RCCCRRSV BIT(6),                /* RES. FOR CONFIG. RESTART   */
*  2 RCCRSV02 PTR(24),                 /* RESERVED                   */
*  2 RCCTPAB  PTR(31),                 /* TOLTEP SSCP PAB            */
*  2 RCCDPQ   PTR(31),                 /* DIAL PENDING NCSPL QUE PTR */
*  2 RCCPATHT PTR(31),                 /* PTR TO PATH TABLE          */
*  2 RCCPATHZ FIXED(15),               /* # ENTRIES IN PATH TABLE    */
*  2 RCCINDEX FIXED(15),               /* INDEX TO PATH TABLE        */
*  2 RCCMXDAT FIXED(15),               /* MAXDATA SIZE               */
*  2 RCCMXOUT FIXED(8),                /* MAXOUT VALUE               */
*  2 RCCPASSL FIXED(8),                /* PASSLIM VALUE              */
*  2 RCCADDR  FIXED(8),                /* STATION ADDRESS            */
*  2 RCCRSPT2 PTR(24),                 /* RESERVED                   */
*  2 RCCSWTOX PTR(31),                 /* SWITCHED TO 370X           */
*                                      /* COMMUNICATIONS NCSPL       */
*  2 RCCXTOSW PTR(31),                 /* 370X TO SWITCHED           */
*                                      /* COMMUNICATIONS NCSPL       */
*  2 RCCRVPT2 PTR(31);                 /* RESERVED                   */
*/* RCCTYPE - PU TYPE CODES                                          */
*DCL RCCPU01  BIT(8) CONSTANT('01'X);  /* PU TYPE 1                  */
*DCL RCCPU02  BIT(8) CONSTANT('02'X);  /* PU TYPE 2                  */
*DCL RCCPU03  BIT(8) CONSTANT('03'X);  /* PU TYPE 3                  */
*DCL RCCPU04  BIT(8) CONSTANT('04'X);  /* PU TYPE 4                  */
*/*                                                                  */
*DCL                                                               0390
*1 ISTRLU BDY(WORD) BASED,             /* LU ENTRY                   */
*  2 RLUCRPR CHAR(LENGTH(ISTRCPRE)),   /* COMMON PREFIX              */
*  2 RLUTYPE  CHAR(1),                 /* LU TYPE                    */
*  2 RLUFLAG  CHAR(1),                 /* RLU FLAGS                  */
*    3 RLURBISA BIT(1),                /* I STATUS 1=ACTIVE          */
*    3 RLUBATCH BIT(1),                /* 1 IF BATCH = YES           */
*    3 RLUGSTAT BIT(1),                /* C/R GENNED ISTATUS VALUE   */
*                                      /* 1 = ACTIVE                 */
*    3 RLUNDSES BIT(1),                /* SPECIAL END SESSION        */
*    3 RLURSV00 BIT(4),                /* RESERVED                   */
*  2 RLUCRFLG BIT(8),                  /* FLAG-CONFIGURATION RESTART */
*    3 RLUACTLU BIT(1),                /* ACTIVATE LOGICAL UNIT OK   */
*    3 RLUCRRSV BIT(7),                /* RESERVED FOR CONFIG RESTART*/
*  2 RLUSSCFM BIT(8),                  /* FUNCTION MANAGER TYPE      */
*  2 RLUINTA PTR(31),                  /* RESERVED                   */
*  2 RLUPACE CHAR(2),                  /* VPACING COUNTS             */
*    3 RLUPACEN CHAR(1),               /* N COUNT                    */
*    3 RLUPACEM CHAR(1),               /* M COUNT                    */
*  2 RLUNCPPC CHAR(2),                 /* NCP PACING COUNTS          */
*    3 RLUNCPPN CHAR(1),               /* N COUNT                    */
*    3 RLUNCPPM CHAR(1),               /* M COUNT                    */
*  2 RLULOCAD CHAR(1),                 /* LOCAL ADDRESS OF LU        */
*  2 RLURSV01 CHAR(3),                 /* RESERVED                   */
*  2 RLUUSSTB CHAR(12) BDY(WORD),      /* USSTAB                     */
*    3 RLUUSSNM CHAR(8),               /* USSTAB NAME                */
*    3 RLUUSSPT PTR(31),               /* USSTAB ADDRESS             */
*  2 RLUMODET CHAR(12) BDY(WORD),      /* MODETAB                    */
*    3 RLUMODEN CHAR(8),               /* MODETAB NAME               */
*    3 RLUMODEP PTR(31),               /* MODETAB ADDRESS            */
*  2 RLULGMOD CHAR(8),                 /* LOGMODE                    */
*  2 RLURSV02 PTR(31);                 /* RESERVED                   */
*/*  RLUSSCFM - FOLLOWING EQUATES ARE FOR THE VARIOUS                */
*/*             FUNCTION MANAGER TYPES                               */
*DCL RLUFSS   BIT(8) CONSTANT('01'X);  /* FORMATTED SYS SERVICES     */
*DCL RLUUSS   BIT(8) CONSTANT('02'X);  /* UNFORMATTED SYS SERVICES   */
*DCL RLUU3270 BIT(8) CONSTANT('04'X);  /* UNFORMATTED SYS SVCS 3270  */
*/*  RLUTYPE - EQUATES FOR LU TYPE                                   */
*DCL RLUTYP04 BIT(8) CONSTANT('04'X);  /* LU TYPE IS 4               */
*/*                                                                  */
*DCL 1 ISTRPX BDY(WORD) BASED,     /* SKELETON PUX ENTRY             */
*      2 RPXPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */
*      2 RPXFLUX  PTR(31),         /* PTR TO FIRST LUX IN CHAIN      */
*      2 RPXMAXLU PTR(8),          /* MAX NUMBER OF LU'S             */
*                                  /* FOR THIS LINK                  */
*      2 RPXRSV02 PTR(24),         /* RESERVED                       */
*      2 RPXRSV01 PTR(31);         /* RESERVED                       */
*/*                                                                  */
*DCL 1 ISTRLX BDY(WORD) BASED,     /* SKELETON LUX ENTRY             */
*      2 RLXPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */
*      2 RLXNLUX  PTR(31),         /* PTR TO NEXT LUX IN CHAIN       */
*      2 RLXFLAGA CHAR(1),         /* FLAG BYTE                      */
*        3 RLXINUSE BIT(1),        /* ON = LUX IS IN USE             */
*        3 RLXRSV01 BIT(7),        /* RESERVED                       */
*      2 RLXRSV02 CHAR(3),         /* RESERVED                       */
*      2 RLXRSV03 PTR(31);         /* RESERVED                       */
*/*                                                                  */
*DCL 1 ISTRSW BDY(WORD) BASED,     /* SWITCHED SUBAREA HDR ENTRY     */
*      2 RSWPRE CHAR(LENGTH(ISTRDT)),   /* USE ISTRDT DSECT          */
*      2 RSWDIALT PTR(31),         /* PTR TO DIAL #'S TABLE          */
*      2 RSWGRUPT PTR(31),         /* PTR TO GROUP NAMES TABLE       */
*      2 RSWDIALZ FIXED(15),       /* # ENTRIES IN DIAL NO. TABLE    */
*      2 RSWGRUPZ FIXED(15),       /* # ENTRIES IN GRP NAME TABLE    */
*      2 RSWCTELU FIXED(15),       /* COUNT OF LU ENTRIES IN THIS SEG*/
*      2 RSWRSV02 CHAR(2),         /* RESERVED                       */
*      2 RSWRSV01 PTR(31);         /* RESERVED                       */
*/*                                                                  */
*DCL 1 ISTRDA BDY(WORD) BASED,     /* DAN ENTRY                      */
*      2 RDAPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */
*      2 RDAADR   PTR(31),                                         0398
*        3 RDAFLAG  BIT(8),        /* FLAG BYTE                      */
*          4 RDARBISA BIT(1),      /* INITIAL STATUS, 1 = ACTIVE     */
*          4 RDARSV01 BIT(7),      /* RESERVED                       */
*        3 RDAUCBAD PTR(24),       /* UCB.PUB ADDRESS                */
*          4 RDACHQI  BIT(8),      /* CHANNEL QUEUE INDEX            */
*          4 RDALUBA  BIT(16),     /* @ OF LOGICAL UNIT BLOCK        */
*      2 RDADACUA CHAR(3),         /* CHANNEL UNIT ADDRESS           */
*      2 RDACTPCC PTR(8),          /* CNT OF BUFFERS RECEIVING DATA  */
*      2 RDADFCUA CHAR(3),         /* DEFAULT CUA                    */
*      2 RDAPUBI  BIT(8),          /* PUB INDEX                      */
*      2 RDARSVPT PTR(31);         /* RESERVED                       */
*/*                                                                  */
*DCL 1 ISTRLS BDY(WORD) BASED,     /* LOCAL SUBAREA HEADER ENTRY     */
*      2 RLSPRE CHAR(LENGTH(ISTRDT)),   /* USE ISTRDT DSECT          */
*      2 RLSCTELU FIXED(15),       /* COUNT OF LU ENTRIES IN THIS SEG*/
*      2 RLSRSV01 FIXED(15),       /* RESERVED                       */
*      2 RLSRSV02 PTR(31);         /* RESERVED                       */
*/*                                                                  */
*DCL  1  ISTDNT BDY(WORD) BASED,  /* DIAL NUMBER TABLE               */
*        2 DNTCTDIG FIXED(8),     /* NUMBER OF DIGITS IN TEL. NUM.   */
*        2 DNTTELNO CHAR(32);     /* TELEPHONE NUMBER                */
*/*                                                                  */
* DCL  1  ISTGNT BDY(WORD) BASED, /* GROUP NAMES TABLE               */
*         2 GNTGRPNM CHAR(8);     /* GROUP NAME ENTRY                */
*/*                                                                  */
*DCL  1  ISTPAT BDY(WORD) BASED,  /* PATH TABLE                      */
*        2 PATGINDX FIXED(15),    /* INDEX TO GROUP NAME TABLE       */
*        2 PATDINDX FIXED(15),    /* INDEX TO DIAL NUMBER TABLE      */
*        2 PATPTHID PTR(8),       /* PATH ID                         */
*        2 PATGRPID PTR(8),       /* GROUP PATH ID                   */
*        2 PATRDCNT PTR(8),       /* REDIAL COUNT                    */
*        2 PATFLAGA BIT(8),       /* FLAG BYTE                       */
*          3 PATUSEFG BIT(1),     /* ON = PATH INITIALLY USABLE      */
*          3 PATRSV01 BIT(7);     /* RESERVED                        */
*/* END OF ATBUILD */                                              0403
*                                                                  0403
*/* ATBUILD (ISTDCCRR,ISTRH,ISTFSB,ISTFDB,ISTNMLPB,ISTLCPB) NOSEG */
*/*   COMPONENT RECOVERY RECORD                                      */
*/*                                                                  */
*/*  RE-FIX CRRDOFLD                                   003 07/18/74  */
*/*                                                                  */
*DECLARE                                                           0403
* 1 ISTDCCRR BDY(WORD) BASED,                                      0403
*  2 CRRCRR CHAR(4),         /*CONTROL BLOCK ID AND LENGTH + 2 BYTES */
*  2 CRRRSV22 CHAR(8),       /* RESERVED                             */
*  2 CRRSPACE CHAR(*);       /* BASE FOR SAVE AREA (CRRSAREA)        */
* DECLARE                                                          0404
* 1 CRRSAREA BASED (ADDR(CRRSPACE)), /* SAVE AREA AND WORKING STORAGE*/
*  2 CRRSAVE CHAR(72),       /*SAVEAREA FOR CALLS EXTERNAL TO CONTROL
*                              LAYER                                 */
*  2 CRRSAVE1 CHAR(72),      /*72 BYTE SAVE AREA FOR MOVE RTN        */
*  2 CRRFSB PTR(31),         /*POINTER TO FSB                        */
*  2 CRRMAS CHAR(8),         /*MODULE AUDIT SW FOR CONTROL LAYER     */
*   3 CRRMAS1 CHAR(1),       /*MODULE AUDIT SWITCH                   */
*    4 CRRM00 BIT(1),        /*ISTDCC01 - START1                     */
*    4 CRRM01 BIT(1),        /*RESERVED                              */
*    4 CRRM02 BIT(1),        /*ISTDCC02 - REQUEST FINISH             */
*    4 CRRM10 BIT(1),        /*ISTDCC10 - SOLICIT LDO                */
*    4 CRRM11 BIT(1),        /*ISTDCC11 - READ LDO                   */
*    4 CRRM12 BIT(1),        /*ISTDCC12 - WRITE LDO                  */
*    4 CRRM13 BIT(1),        /*ISTDCC13 - RESET LDO                  */
*    4 CRRM20 BIT(1),        /*ISTDCC20 - SOLICIT MACRO PROCESSOR    */
*   3 CRRMAS2 CHAR(1),       /*MODULE AUDIT SWITCH                   */
*    4 CRRM21 BIT(1),        /*ISTDCC21 - READ MACRO PROCESSOR       */
*    4 CRRM22 BIT(1),        /*ISTDCC22 - WRITE MACRO PROCESSOR      */
*    4 CRRM23 BIT(1),        /*ISTDCC23 - RESET MACRO PROCESSOR      */
*    4 CRRM24 BIT(1),        /*ISTDCC24 - SOLICIT ALL MACRO PROCESSOR*/
*    4 CRRM25 BIT(1),        /*ISTDCC25 - READ ANY MACRO PROCESSOR   */
*    4 CRRM30 BIT (1),       /*ISTDCC30 - FEEDBACK START             */
*    4 CRRM31 BIT(1),        /*ISTDCC31 - ANALYZER                   */
*    4 CRRM32 BIT(1),        /*ISTDCC32 - FEEDBACK FINISH            */
*   3 CRRMAS3 CHAR(1),       /*MODULE AUDIT SWITCH                   */
*    4 CRRM40 BIT(1),        /*ISTDCC40 - SOLICIT/READ LDO FDBK      */
*    4 CRRM41 BIT(1),        /*ISTDCC41 = WRITE LDO FDBK             */
*    4 CRRM42 BIT(1),        /*ISTDCC42- RESET LDO FDBK              */
*    4 CRRM50 BIT(1),        /*ISTDCC50 SOLICIT/READ/WRITE/MACRO FDBK*/
*    4 CRRM51 BIT(1),        /*ISTDCC51 - RESET MACRO FDBK           */
*    4 CRRM75 BIT(1),        /*ISTDCC75 - FUNCT'NL RECOVERY RTN      */
*    4 CRRM80 BIT(1),        /*ISTDCC80 - PURGE OUTBOUND             */
*    4 CRRM81 BIT(1),        /*ISTDCC81 - PURGE INBOUND              */
*   3 CRRMAS4 CHAR(1),       /* AUDIT TRAIL SWITCH                   */
*    4 CRRM60 BIT(1),        /*ISTDCC60 - INPUT BUFFER MOVE          */
*    4 CRRM61 BIT(1),        /*ISTDCC61 - MOVE FIXED TO PAGEABLE     */
*    4 CRRM82 BIT(1),        /*ISTDCC82 - PREEMPT/RESTORE OUTBOUND   */
*    4 CRRM83 BIT(1),        /*ISTDCC83 - PREEMPT/RESTORE INBOUND    */
*    4 CRRM85 BIT(1),        /*ISTDCC85                              */
*    4 CRRM3X BIT(1),        /*MODULE AUDIT SWITCH FOR ISTDCC3X      */
*                            /* (ISTDCC35)                           */
*    4 *      BIT(2),        /*RESERVED                              */
*   3 CRRRMAS1 CHAR(1),      /*1ST. MODULE AUDIT BYTE                */
*    4 CRRRM21  BIT(1),      /*RECEIVE OUTBOUND                      */
*    4 CRRRM22  BIT(1),      /*SEND OUTBOUND                         */
*    4 CRRRM23  BIT(1),      /*RESETSR OUTBOUND                      */
*    4 CRRRM26  BIT(1),      /*SEND RESP                             */
*    4 CRRRM30  BIT(1),      /*RECORD FEEDBACK START                 */
*    4 CRRRM51  BIT(1),      /*RECORD INBOUND ROUTER                 */
*    4 CRRRM52  BIT(1),      /*SYNCH FEEDBACK                        */
*    4 CRRRM53  BIT(1),      /*SEND FEEDBACK                         */
*   3 CRRRMAS2 CHAR(1),      /*2ND. MODULE AUDIT BYTE                */
*    4 CRRRM54  BIT(1),      /*ASYNCH FEEDBACK                       */
*    4 CRRRM55  BIT(1),      /*RESETSR FEEDBACK                      */
*    4 CRRRM63  BIT(1),      /*HSKPANYQ                              */
*    4 CRRRM65  BIT(1),      /*SETRQL                                */
*    4 CRRRM80  BIT(1),      /*CLEAR OUTBOUND                        */
*    4 CRRRM81  BIT(1),      /*CLEAR INBOUND                         */
*    4 *        BIT(2),      /*RESERVED                              */
*   3 CRRRMAS3 CHAR(1),      /*SESSION CONTROL MODULE AUDIT SWITCHES */
*     4 CRRSMAS  CHAR(1),    /* ALIAS                                */
*       5 CRRMSC01 BIT(1),   /* ISTSEC01                             */
*       5 CRRMSC10 BIT(1),   /* ISTSEC10                             */
*       5 CRRMSC21 BIT(1),   /* ISTSEC21                             */
*       5 CRRMSC30 BIT(1),   /* ISTSEC30                             */
*       5 CRRMSC40 BIT(1),   /* ISTSEC40                             */
*       5 CRRMSC51 BIT(1),   /* ISTSEC51                             */
*       5 *        BIT(2),   /* RESERVED                             */
*   3 CRRRMAS4 CHAR(1),      /*RESERVED                              */
*  2 CRRATS CHAR(8),         /*AUDIT TRAIL SW FOR CONTROL LAYER      */
*   3 CRRATS1 CHAR(1),       /*AUDIT TRAIL SWITCH                    */
*    4 CRRC00 BIT(1),        /*ISTDCC00-START1                       */
*    4 CRRC01 BIT(1),        /*RESERVED                              */
*    4 CRRC02 BIT(1),        /*ISTDCC02 - REQUEST PROCESSOR FINISH   */
*    4 CRRC10 BIT(1),        /*ISTDCC10 - SOLICIT LDO PROCESSOR      */
*    4 CRRC11 BIT(1),        /*ISTDCC11 - READ LDO PROCESSOR         */
*    4 CRRC12 BIT(1),        /*ISTDCC12 - WRITE LDO PROCESSOR        */
*    4 CRRC13 BIT(1),        /*ISTDCC13 - RESET LDO PROCESSOR        */
*    4 CRRC20 BIT(1),        /*ISTDCC20 - SOLICIT MACRO PROCESSOR    */
*   3 CRRATS2 CHAR(1),       /*AUDIT TRAIL SWITCH                    */
*    4 CRRC21 BIT(1),        /*ISTDCC21 - READ MACRO PROCESSOR       */
*    4 CRRC22 BIT(1),        /*ISTDCC22 - WRITE MACRO PROCESSOR      */
*    4 CRRC23 BIT(1),        /*ISTDCC23 - RESET MACRO PROCESSOR      */
*    4 CRRC24 BIT(1),        /*ISTDCC24 - SOLICIT ALL                */
*    4 CRRC25 BIT(1),        /*ISTDCC25 - READ ANY                   */
*    4 CRRC30 BIT(1),        /*ISTDCC30 - FDBK PROCESSOR START       */
*    4 CRRC31 BIT(1),        /*ISTDCC31 - ANALYZER                   */
*    4 CRRC32 BIT(1),        /*ISTDCC32 - FDBK PROCESSOR FINISH      */
*   3 CRRATS3 CHAR(1),       /*AUDIT TRAIL SWITCH                    */
*    4 CRRC40 BIT(1),        /*ISTDCC40 - FDBK SOLICIT READ LDO      */
*    4 CRRC41 BIT(1),        /*ISTDCC41 - FDBK WRITE LDO             */
*    4 CRRC42 BIT(1),        /*ISTDCC42 - FDBK RESET DLO             */
*    4 CRRC50 BIT(1),        /*ISTDCC50 - SOL/READ/WRITE MACRO FDBK  */
*    4 CRRC51 BIT(1),        /*ISTDCC51 - RESET MACRO FDBK.          */
*    4 CRRC75 BIT(1),        /*ISTDCC75 - FUNCTIONAL RECOVERY        */
*    4 CRRC80 BIT(1),        /*ISTDCC80 - PURGE OUTBOUND             */
*    4 CRRC81 BIT(1),        /*ISTDCC81 - PURGE INBOUND              */
*   3 CRRATS4 CHAR(1),       /*AUDIT TRAIL SWITCH                    */
*    4 CRRC60 BIT(1),        /*ISTDCC60 - INPUT BUFFER MOVE          */
*    4 CRRC61 BIT(1),        /*ISTDCC61 - MOVE FIXED TO PAGEABLE     */
*    4 CRRC82 BIT(1),        /*ISTDCC82 - PREEMPT/RESTORE OUTBOUND   */
*    4 CRRC83 BIT(1),        /*ISTDCC83 - PREEMPT/RESTORE INBOUND    */
*    4 CRRC85 BIT(1),        /*ISTDCC85                              */
*    4 CRRC3X BIT(1),        /*AUDIT TRAIL SWITCH FOR ISTDCC3X       */
*                            /*  (ISTDCC35)                          */
*    4 *      BIT(2),        /*RESERVED                              */
*   3 CRRRATS1 CHAR(1),      /*1ST. BYTE SWITCHES                    */
*    4 CRRRC21  BIT(1),      /*RECEIVE OUTBOUND                      */
*    4 CRRRC22  BIT(1),      /*SEND OUTBOUND                         */
*    4 CRRRC23  BIT(1),      /*RESETSR OUTBOUND                      */
*    4 CRRRC26  BIT(1),      /*SEND RESP                             */
*    4 CRRRC30  BIT(1),      /*RECORD FEEDBACK START                 */
*    4 CRRRC51  BIT(1),      /*RECORD INBOUND ROUTER                 */
*    4 CRRRC52  BIT(1),      /*SYNCH FEEDBACK                        */
*    4 CRRRC53  BIT(1),      /*SEND FEEDBACK                         */
*   3 CRRRATS2 CHAR(1),      /*2ND. BYTE SWITCHES                    */
*    4 CRRRC54  BIT(1),      /*ASYNCH FEEDBACK                       */
*    4 CRRRC55  BIT(1),      /*RESETSR FEEDBACK                      */
*    4 CRRRC63  BIT(1),      /*HSKPANYQ                              */
*    4 CRRRC65  BIT(1),      /*SETRPL                                */
*    4 CRRRC80  BIT(1),      /*CLEAR OUTBOUND                        */
*    4 CRRRC81  BIT(1),      /*CLEAR INBOUND                         */
*    4 CRRPLIC  BIT(1),      /* ON=PURGING LAST FSB IN CHAIN         */
*    4 *        BIT(1),      /*RESERVED                              */
*   3 CRRRATS3 CHAR(1),      /* SC AUDIT TRAIL SWITCHES              */
*    4 CRRSATS  CHAR(1),     /* ALIAS                                */
*     5 CRRASC01 BIT(1),     /* ISTSEC01                             */
*     5 CRRASC10 BIT(1),     /* ISTSEC10                             */
*     5 CRRASC21 BIT(1),     /* ISTSEC21                             */
*     5 CRRASC30 BIT(1),     /* ISTSEC30                             */
*     5 CRRASC40 BIT(1),     /* ISTSEC40                             */
*     5 CRRASC51 BIT(1),     /* ISTSEC51                             */
*     5 *        BIT(2),     /* RESERVED                             */
*   3 CRRRATS4 CHAR(1),      /* RESERVED                             */
*  2 CRRFLGS1 CHAR(1),                                             0404
*   3 CRRDOCUR BIT(1),       /*READ HAS OCCURRED FLAG                */
*   3 CRRFLDOS BIT(1),       /*FIRST LDO SWITCH                      */
*   3 CRRINIO BIT(1),        /*INITIATE I/O FLAG                     */
*   3 CRRPREIO BIT(1),       /*AWAITING PREVIOUS I/O FLAG            */
*   3 CRRFINI BIT(1),        /*GO TO FINISH RTN SWITCH               */
*   3 CRRCPROC BIT(1),       /*CONTINUE PROCESSING FMCB              */
*   3 CRRREQP BIT(1),        /*REQUEST PROCESSING                    */
*   3 CRRSOLRQ BIT(1),       /*SOLICIT REQUEST FLAG                  */
*  2 CRRFLGS2 CHAR(1),                                             0404
*   3 CRRDEXP BIT(1),        /*DATA EXPECTED FLAG FOR FMCB           */
*   3 CRRPRGIP  BIT(1),      /*PURGE IN PROGRESS                     */
*   3 CRRENDLW BIT(1),       /*END OF LCCW'S FLAG                    */
*   3 CRRPOST BIT(1),        /*DO 'POSTING' FLAG                     */
*   3 CRRELSRI BIT(1),       /*ERROR LOCK SET, RESET WAS ISSUED       *
*   3 CRREXTS  BIT(1),       /*EXIT SCHEDULED                        */
*   3 CRRDPROC BIT(1),       /*INDICATE INPUT DATA SHOULD          0404
*                              BE PROCESSED                          */
*   3 CRRDFSB BIT(1),        /*FSB/FDB SHOULD BE DEQUEUED            */
*  2 CRRFLGS3 CHAR(1),                                             0404
*   3 CRRDFDBK BIT(1),       /*FDBK START HAS TO BE INVOKED          */
*   3 CRRDREQ BIT(1),        /*FDBK START HAS TO BE INVOKED          */
*   3 CRRSTSPR BIT(1),       /* SATISFY SPECIFIC READ                */
*   3 CRRDEBQ BIT(1),        /*FMCB ON ACBDEB Q FOR READ ANY         */
*   3 CRRRSV08 BIT(1),       /* RESERVED                             */
*   3 CRRSUBBK BIT(1),       /* AWAITING SUB-BLOCK PROCESSING        */
*   3 CRRRESET BIT(1),       /* RESET OPERATION SWITCH               */
*   3 CRRDLCCW BIT(1),       /* READ LCCW BUILT VIA SOLICIT          */
*  2 CRRFLGS4 CHAR(1),                                             0404
*   3 CRRFMCLK BIT(1),       /* 1=CTLLOCK HELD - 0=NOT HELD @Z40GKDS */
*   3 CRRRSV04 BIT(7),       /*RESERVED                              */
*  2  CRRFLGS CHAR(1),       /* BYTE FOR INDICATORS                  */
*     3  CRRSW0 BIT(1),      /* MISC.SWITCH                          */
*     3  CRRSW1 BIT(1),      /* MISC.SWITCH                          */
*     3  CRRSW2 BIT(1),      /* MISC.SWITCH                          */
*     3  CRRSW3 BIT(1),      /* MISC.SWITCH                          */
*     3  CRRSW4 BIT(1),      /* INTERNAL CONTROL SWITCH              */
*     3  CRRSW5 BIT(1),      /* INTERNAL CONTROL SWITCH              */
*     3  CRRSW6 BIT(1),      /* INTERNAL CONTROL SWITCH              */
*     3  CRRSW7 BIT(1),      /* INTERNAL CONTROL SWITCH              */
*  2  CRRRFLG1 CHAR(1),      /* RECORD FLAGS                         */
*     3  CRRRPLS  BIT(1),    /* RPL SATISFIED                        */
*     3  CRRRPLOQ BIT(1),    /* RPL Q'ED                             */
*     3  CRRRPSBD BIT(1),    /* FSB DISCARDED                        */
*     3  CRRDBLCK BIT(1),    /* ACDIB LOCK HELD                      */
*     3  CRRRTYPE BIT(4),    /* RPL TYPES                            */
*      4 CRRDFASY BIT(1),    /* ASYN DATA                            */
*      4 CRRRESP  BIT(1),    /* RESP DATA                            */
*      4 CRRDFSYN BIT(1),    /* SYN DATA                             */
*      4 CRRNSNA  BIT(1),    /* NON-RECORD DATA                      */
*  2 CRRFDBK1 BIT(24),       /* PRIMARY FEEDBACK DATA                */
*   3 CRRRTNCD BIT(8),       /* MAJOR RETURN CODE                    */
*   3 CRRFDB2 BIT(8),        /* MINOR RETURN CODE                    */
*    4 CRRERLK BIT(1),       /* ERROR LOCK SET FOR DEVICE            */
*    4 CRRRVID BIT(1),       /* RVI RECEIVED FROM DEVICE             */
*    4 CRRATND BIT(1),       /* ATTENTION RECEIVED FROM DEVICE       */
*    4 CRRDVUNS BIT(1),      /* DEVICE IS NOT USABLE                 */
*    4 CRRIOERR BIT(1),      /* ON - ERROR OCCURRED ON OUTPUT        */
*                            /* OFF - ERROR OCCURRED ON INPUT        */
*      /* NOTE - THE PREVIOUS BIT APPLIES ONLY WHEN ERROR OCCURRED   */
*    4 CRRDLGFL BIT(1),      /* DIALOG INIT. FAILURE OR INTERRUPTION */
*    4 CRRCUERR BIT(1),      /* CONTROL UNIT AND/OR CHANNEL ERROR    */
*    4 CRRSTSAV BIT(1),      /* SENSE DATA IS AVAILABLE              */
*   3 CRRFDB3 BIT(8),        /* DATA FLAGS                           */
*    4 CRRUINPT BIT(1),      /* UNSOLICITED INPUT                    */
*    4 CRRUNUSD BIT(1),      /* UNUSED                               */
*    4 CRRRDEOB BIT(1),      /* DATA ENDED WITH EOB                  */
*    4 CRRRDEOM BIT(1),      /* DATA ENDED WITH EOM                  */
*    4 CRRRDEOT BIT(1),      /* DATA ENDED WITH EOT                  */
*    4 CRRLGFRC BIT(1),      /* LOGOFF MESSAGE RECEIVED FROM DEVICE  */
*    4 CRRRLG BIT(1),        /* LEADING GRAPHICS RECEIVED FROM DEVICE*/
*    4 CRRRDSOH BIT(1),      /* BLOCK RECEIVED BEGINNING WITH SOH    */
*  2 CRRRSV99 CHAR(1),       /* RESERVED                             */
*  2 CRRDTACT FIXED(15),     /* FSB DATA COUNT                       */
*  2 CRRFDBK2 BIT(32),       /* SECONDARY FEEDBACK DATA              */
*   3 CRRDSB BIT(16),        /* SENSE DATA                           */
*    4 CRRDSB1 BIT(8),       /* FIRST BYTE OF SENSE DATA             */
*    4 CRRDSB2 BIT(8),       /* SECOND BYTE OF SENSE DATA            */
*   3 CRRESR BIT(16),        /* EXTENDED SYSTEM RESPONSE             */
*    4 CRRESR1 BIT(8),       /* FIRST BYTE OF EXTENDED SYS. RESP.    */
*    4 CRRESR2 BIT(8),       /* SECOND BYTE OF EXTENDED SYS. RESP.   */
*  2 CRRCLCCW PTR(31),       /*POINTER TO CURRENT LCCW               */
*  2 CRRFMCB PTR(31),        /*POINTER TO FMCB                       */
*  2 CRRCMDAD PTR(31),       /*ADDR 1ST LCCW OF WRITE CMD            */
*  2 CRRLCPB PTR(31),        /*POINTER TO LCPB                       */
*  2 CRRUECB  PTR(31),       /*PTR TO UECB                           */
*  2 CRRCLDO PTR(31),        /*POINTER TO CURRENT LDO                */
*  2 CRRTRBUF CHAR(8) BDY(WORD), /*PARAMETER LIST FOR I/O BUFFR TRACE*/
*    3 CRRTRRES CHAR(3),     /*RESERVED                              */
*    3 CRRBIND  CHAR(1),     /*TYPE OF BUFFER TRACE                  */
*    3 CRRARPL  PTR(31),     /*POINTER TO APPLICATION RPL            */
*  2 CRRVALCK PTR(31),       /* VALCHEK AREA LENGTH                  */
*  2 CRRATCVT PTR(31),       /* POINTER TO ATCVT                     */
*  2 CRRLCNT CHAR(2),        /*LCCW COUNT FIELD                      */
*  2 CRRRES1 CHAR(2),                                              0404
*  2 CRRRTN1 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN2 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN3 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN4 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN5 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN6 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN7 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN8 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN9 PTR(31),        /*RTN REG SAVE AREA                     */
*  2 CRRRTN10 PTR(31),       /*RTN REG SAVE AREA                     */
*  2 CRRRTN11 PTR(31),       /*RTN REG SAVE AREA                     */
*  2 CRRRTN12 PTR(31),       /*RTN REG SAVE AREA                     */
*      /***      INPUT BUFFER MOVE PARM LIST - ISTDCC60 -         ***/
*  2 CRRBARAD PTR(31),       /* AREA ADDRESS                         */
*  2 CRRBLDAD PTR(31),       /*LDO ADDRESS                           */
*  2 CRRBFLGS CHAR(1),        /* FLAGS                               */
*   3 CRRBFLG1 BIT(1),        /* INTERNAL SWITCH                     */
*   3 CRRDIRPT BIT(1),        /* SEND POST=SCHED             @ZA32152*/
*   3 *        BIT(6),        /* NOT USED                    @ZA32152*/
*                             /* DELETION                            */
*  2 CRRBRTCD FIXED(8),       /*RETURN CODE                          */
*  2 CRRBLEN FIXED(15),       /* LENGTH                       ,      */
*  2 CRRBTLEN FIXED(31),      /* TOTAL LENGTH                        */
*  2  CRRLDOCT FIXED(15),     /* LDO COUNT                           */
*  2  CRRXFNCD CHAR(1),       /* FUNCTION CODE FOR EXTENSION TO      */
*                             /* ISTDCC30, (ISTDCC3X)                */
*  2  CRRRVCR1 CHAR(1),       /* RESERVED */                       0404
*  2  CRRRVCR2 CHAR(8),       /* RESERVED */                       0404
*  2  CRRRVPT1 PTR(31),       /* RESERVED */                       0404
*  2  CRRRVPT2 PTR(31),       /* RESERVED */                       0404
*  2  CRRRVPT3 PTR(31),       /* RESERVED */                       0404
*  2  CRRRVPT4 PTR(31),       /* RESERVED */                       0404
*  2  CRRRVPT5 PTR(31);       /* RESERVED */                       0404
*   /*** CRRBRTCD - VALUES FOR RETURN CODE FROM ISTDCC60      ***/ 0405
* DCL CRRBRSUC FIXED(8) CONSTANT(0);  /* GOOD RETURN CODE ALL DATA 0405
*                                        MOVED                       */
* DCL CRRBMDAT FIXED(8) CONSTANT(4);  /* MORE DATA REMAINING RETURN
*                                        CODE                        */
* DCL CRRBEROR FIXED(8) CONSTANT(8);  /* ERROR RETURN CODE           */
*   /***   CONSTANTS   ***/                                        0408
* DCL CRRILDOP FIXED(8) CONSTANT(6);  /*INVALID LDO OPCODE           */
* DCL CRRILSEQ FIXED(8) CONSTANT(7);   /*INVALID LDO SEQUENCE        */
*                                      /*MORE THAN 1 SOL/READ        */
*                                      /*LDO IN LCP                  */
* DCL CRRDOFLD FIXED(8) CONSTANT(32);  /* DEVICE IS OFFLINE OR HAS   */
*                                      /*  DISCONNECTED              */
* DCL CRRWANCR FIXED(8) CONSTANT(8);   /*WRITE NACK, WRITE NACK WITH
*                                         LG, WRITE ALT ACK, WRITE 0411
*                                         RVI NOT CHAINED TO A READ  */
* DCL CRRSANOD FIXED(8) CONSTANT(12);  /*SOLICIT ALL REQ AND NO DEVICE
*                                        CONNECTED                   */
* DCL CRRSANDA FIXED(8) CONSTANT(13);  /*SOLICIT ALL REQ AND NO DEVICE
*                                        AVAILABLE TO SOLICIT        */
* DCL CRRSTOOD FIXED(8) CONSTANT(14);  /*SOLICIT TO OUTPUT ONLY      */
*                                      /*DEVICE TYPE                 */
* DCL CRRBUFTE FIXED(8) CONSTANT(15);  /*REQUEST REJECTED DUE TO BUFFER
*                                        THRESHOLD EXCEEDED          */
* DCL CRRRTOOD FIXED(8) CONSTANT(16);  /*READ TO AN OUTPUT ONLY      */
*                                      /*DEVICE TYPE                 */
* DCL CRRWTOI FIXED(8) CONSTANT(17);   /*WRITE TO INPUT ONLY         */
*                                      /*DEVICE TYPE                 */
* DCL CRREWNS FIXED(8) CONSTANT(18);   /*ERASE WRITE TO NON-2265     */
*                                      /*OR 3270 DEVICE              */
* DCL CRREWAU3 FIXED(8) CONSTANT(19);  /*ERASE WRITE ALL UNPRO       */
*                                      /*TO NON-3270 DEVICE          */
* DCL CRRCWTOO FIXED(8) CONSTANT(20);  /*CONV WRITE TO OUTPUT        */
*                                      /*ONLY DEVICE                 */
* DCL CRREWCNV FIXED(8) CONSTANT(21);  /* ERASE WRITE CONVERSATIONAL */
* DCL CRRCCCPY FIXED(8) CONSTANT(22);  /*COMM CHAINED OR DATA CHAINED
*                                        COPY LDO TO 3270 DEVICE     */
* DCL CRRIDA FIXED(8) CONSTANT(23);    /*INVALID DATA AREA ADDR      */
*                                      /*OR LENGTH SPECIFIED         */
* DCL CRRILDOA FIXED(8) CONSTANT(24);  /*INVALID LDO ADDRESS         */
* DCL CRRJTOJ FIXED(8) CONSTANT(25);   /*JUMP LDO JUMPS TO           */
*                                      /*JUMP LDO                    */
* DCL CRRM100 FIXED(8) CONSTANT(26);   /*MORE THAN 100 NON-JUMP LDO'S
*                                        IN LCP                      */
* DCL CRRRILCP FIXED(8) CONSTANT(27);  /*RESET LDO IMBEDDED WITHIN   */
*                                      /*LCP                         */
* DCL CRRCRIRT FIXED(8) CONSTANT(28);  /*INVALID MACRO REQUEST IN RPL*/
* DCL CRRRIOCC FIXED(8) CONSTANT(29);  /* INVALID READ               */
*                                      /* WITH COMMAND CHAINING      */
* DCL CRREWBLK FIXED(8) CONSTANT(30);  /*ERASE WRITE ERROR         0430
*                                         IN BLOCK MODE              */
* DCL CRRCRSDC FIXED(8) CONSTANT(31);  /* SOLICIT LDO HAS DATA CHAIN
*                                         FLAG SET                   */
*  DCL CRRIRSTP FIXED(8) CONSTANT(33);  /* INVALID RESET TYPE IN RPL */
*  DCL CRRIVACB FIXED(8) CONSTANT(34);  /* INVALID ACB               */
*  DCL CRRIVEXL FIXED(8) CONSTANT(35);  /* INVALID EXIT LIST         */
*  DCL CRRWRBLK FIXED(8) CONSTANT(36);  /*WRITE BLOCK TO 3270 DEVICE */
*  DCL CRRMBTWD FIXED(8) CONSTANT(37);  /* READ MODIFIED OR READ BUF-
*                                          FER TO A NON-3270 DEVICE  */
*  DCL CRRCPYNS FIXED(8) CONSTANT(38),  /* COPY TO NON-3270 DEVICE   */
*      CRRWCNVR FIXED(8) CONSTANT(39),  /* WRITE CONV: REJCT DATA EXP*/
*     CRRRDNFO FIXED(8) CONSTANT(40),  /* READ NOT THE FIRST OPERATION
*                                         TO A 3735                  */
*     CRRCRJEL FIXED(8) CONSTANT(41),  /* RESET CONDITIONAL REJECTED
*                                        BECAUSE DEVICE ERROR LOCK SET*
*     CRRINVRM FIXED(8) CONSTANT(42),  /* INVALID READ MODL, NOT BLOCK,
*                                       MSG TRANSMISSION OR CONTINEOUS*
*     CRRRTRUN FIXED(8) CONSTANT(48),  /* DATA TRUNCATION OCCURRED  */
*    CRRSDQT  FIXED(8) CONSTANT(50), /* DFSYN ATTEMPT IN QUIESCE    */
*    CRRSDEX  FIXED(8) CONSTANT(51), /* RESPOND=EX ALONE IN RPL     */
*    CRRSDNP  FIXED(8) CONSTANT(52), /* PREV POST=SCHED NOT POSTED  */
*    CRRSCEM  FIXED(8) CONSTANT(53), /* CHAIN ERROR, MIDDLE/LAST REQ*/
*    CRRSCEF  FIXED(8) CONSTANT(54), /* CHAIN ERROR, 1ST OR ONLY REQ*/
*    CRRSNQC  FIXED(8) CONSTANT(55), /* SEND CTL=QC, QUIESCE NOT REQ*/
*    CRRSDNVC FIXED(8) CONSTANT(56), /* INVALID CTL=OPTION          */
*    CRRSDFR  FIXED(8) CONSTANT(57), /* SEND IN DATA FLOW RESET     */
*    CRRSNOS  FIXED(8) CONSTANT(58), /* SEND DATA FLOW CTL INVALID  */
*    CRRSNOVT FIXED(8) CONSTANT(59), /* RESP WITH 0 OUTSTANDING     */
*    CRRSNMC  FIXED(8) CONSTANT(60), /* CHASE WHEN CANCEL EXPECT    */
*    CRRSSEQ  FIXED(8) CONSTANT(61), /* SEQ. NR. NOT EXPECTED       */
*    CRRSINVS FIXED(8) CONSTANT(62), /* RESP=OPTION NOT MATCH RESP  */
*    CRRSINVR FIXED(8) CONSTANT(63), /* INVALID RESP FOR POST=RESP  */
*    CRRRNORT FIXED(8) CONSTANT(2),  /* NO RTYPE IN RPL             */
*    CRRNFMLK FIXED(8) CONSTANT(65), /* FMCB LOCK COULD NOT BE GOT  */
*    CRRRSTSR FIXED(8) CONSTANT(52), /* RESETSR IN PROGRESS         */
*    CRRIVREQ BIT(8) CONSTANT('67'X);/* REQUEST INVALID FOR THIS MODE*/
*/*** MAJOR RETURN CODE CONSTANTS  --- CRRRTNCD                    ***/
* DCL CRRNOERR BIT(8) CONSTANT('00'X), /* SUCCESSFUL COMPLETION      */
*     CRRCBLKE BIT(8) CONSTANT('04'X), /* CONTROL BLOCK ERROR        */
*     CRRLOGIC BIT(8) CONSTANT('08'X), /* LOGICAL ERROR              */
*     CRRPHYSC BIT(8) CONSTANT('0C'X), /* PHYSICAL ERROR             */
*     CRRNGRCC BIT(8) CONSTANT('10'X), /* NEGATIVE RESPONSE TO     0438
*                                         CONDITIONAL COMMAND        */
*     CRRSPECC BIT(8) CONSTANT('14'X), /* SPECIAL CONDITION          */
*     CRRCMDRT BIT(8) CONSTANT('18'X), /* OPERATION WAS RESET        */
*     CRRPURGE BIT(8) CONSTANT('1C'X), /* OPERATION WAS PURGED       */
*     CRRRLEX  BIT(8) CONSTANT('2C'X); /* RESPLIM EXCEEDED           */
*DCL CRRTYPE BIT(8) CONSTANT('22'X);    /* TYPE CODE FOR DCCRR       */
*DCL CRREXRQ  BIT(8) CONSTANT('30'X);   /* EXCEPTION REQUEST         */
*DCL CRREXRS  BIT(8) CONSTANT('34'X);   /* EXCEPTION RESPONSE        */
*DCL CRRNOIN  BIT(8) CONSTANT('38'X);   /* NO INPUT AVAILABLE        */
*DCL CRRSYERR BIT(8) CONSTANT('24'X);   /* SYSTEM ERROR              */
*/*                                                                  */
*/* ***  ISTRCC26 PARAMETERS                                         */
*/*                                                                  */
*DCL CRRHOLD  BIT(8) CONSTANT('04'X);                              0444
*DCL CRRRHOLD BIT(8) CONSTANT('08'X);                              0445
*DCL CRRARESP BIT(8) CONSTANT('12'X);                              0446
*/*                                                                  */
*/*  RU CONTROL BYTE EQUATES                                         */
*/*                                                                  */
*DCL CRRCNCL  BIT(8) CONSTANT('83'X);                              0447
*DCL CRRQC    BIT(8) CONSTANT('81'X);                              0448
*DCL CRRQEC   BIT(8) CONSTANT('80'X);                              0449
*DCL CRRCHASE BIT(8) CONSTANT('84'X);                              0450
*DCL CRRRELQ  BIT(8) CONSTANT('82'X);                              0451
*DCL CRRQI    BIT(8) CONSTANT('87'X);                              0452
*DCL CRRSHUTC BIT(8) CONSTANT('C1'X);                              0453
*DCL CRRHLDRU BIT(8) CONSTANT('01'X);   /* 'HOLD' CONTROL CODE       */
*DCL CRRRHLDR BIT(8) CONSTANT('02'X);   /* 'RELEASE HOLD' CTL CODE   */
*DCL CRRSHUTD BIT(8) CONSTANT('C0'X);   /* SHUTD CONTROL CODE        */
*DCL CRRBID   BIT(8) CONSTANT('C8'X);   /* BID CONTROL CODE          */
*DCL CRRLUS   BIT(8) CONSTANT('04'X);   /* LUS CONTROL CODE          */
*DCL CRRRTR   BIT(8) CONSTANT('05'X);   /* RTR CONTROL CODE          */
*DCL CRRSIGNL BIT(8) CONSTANT('C9'X);   /* SIGNAL CONTROL CODE       */
*DCL CRRRSHTD BIT(8) CONSTANT('C2'X);   /* RSHUTD CONTROL CODE       */
*/*   SESSION CONTROL EQUATES                                        */
*DCL CRRSCID  BIT(8) CONSTANT('20'X);   /* SESSION CONTROL ID        */
*DCL CRRSCFME BIT(8) CONSTANT('16'X);   /* SESSION CTL FME (ISTSEC40)*/
*DCL CRRSCFD  BIT(8) CONSTANT('20'X);   /* SESSION CONTROL FUNCTION
*                                          DISABLE (ISTSEC40)        */
*DCL CRRCLSIP BIT(8) CONSTANT('03'X);                              0465
*DCL CRRDNOP  BIT(8) CONSTANT('5F'X);                              0466
*DCL CRRINVAL BIT(8) CONSTANT('69'X);                              0467
*DCL CRRSINVC BIT(8) CONSTANT('38'X);                              0468
*DCL CRRSNOUT BIT(8) CONSTANT('3B'X);                              0469
*DCL CRRINVRT BIT(8) CONSTANT('6A'X);                              0470
*DCL CRRCIDNG BIT(8) CONSTANT('05'X); /* CID NO GOOD                  *
*DCL CRRRNO   BIT(8) CONSTANT('62'X); /* RESOURCE NOT OWNED          */
*/*                                                                  */
*DCL CRRFRFSB BIT(8) CONSTANT('04'X), /* FUNCTION CODE FOR FREEFSB   */
*    CRRCKCNT BIT(8) CONSTANT('10'X), /* FUNCTION CODE FOR CKCONT    */
*    CRRUNSXT BIT(8) CONSTANT('0C'X), /* FUNCTION CODE FOR UNSEXT    */
*    CRRUCBNT BIT(8) CONSTANT('08'X), /* FUNCTION CODE FOR UECBINIT  */
*    CRRCKATT BIT(8) CONSTANT('04'X), /* FUNCTION CODE FOR CKATT     */
*    CRRCKUSD BIT(8) CONSTANT('00'X); /* FUNCTION CODE FOR CKUNSD    */
*DCL CRRACINV BIT(8) CONSTANT('69'X), /* INVALID ACTION              */
*    CRRSCFNR BIT(8) CONSTANT('24'X); /* ISTSEC40-FUNCTION NOT RECOG.*/
*DCL  1  ISTRH     BDY(WORD) BASED,      /* REQUEST HEADER           */
*       2  RHFLAGS  CHAR(3),             /* REQUEST HEADER FLAGS     */
*        3  RH1    BIT(8),               /* FIRST RH BYTE            */
*           4  RHQS     BIT(1),          /* 0-REQUEST,1-RESPONSE     */
*           4  RHTYPE   BIT(1),          /* 0-DATA,1-CONTROL         */
*           4  RHSCI    BIT(1),          /* 0-FM,1-SYSTEM CONTROL    */
*           4  RHDIRI   BIT(1),          /* 0-WITH,1-AGAINST         */
*           4  RHFORMAT BIT(1),          /* 0-UNFORMATTED,1-FORMATTED*/
*           4  RHSENSE  BIT(1),          /* 0-NOT INCLUDED,1-INCLUDED*/
*           4  RHCHAIN  BIT(2),          /* CHAINING CONTROL         */
*                                        /* 0-MIDDLE                 */
*                                        /* 1-LAST                   */
*                                        /* 2-FIRST                  */
*                                        /* 3-ONLY                   */
*        3  RH2    BIT(8),               /* SECOND RH BYTE           */
*           4  RHFME    BIT(1),          /* Q-FME REQUESTED,S-FME    */
*           4  RHPE     BIT(1),          /* Q-PE REQUESTED,S-PE      */
*           4  RHRRN    BIT(1),          /* Q-RRN REQUESTED,S-RRN    */
*           4  RHEXCEPT BIT(1),          /* Q-EXCEPTION RESPONSES    */
*                                        /* ONLY,S-ERROR             */
*           4  RHRETRY  BIT(1),          /* Q-RETRY,                 */
*              5  RHBUSY  BIT(1),        /* S-BUSY                   */
*           4  RHRSVD1  BIT(1),          /* Q-RESERVED               */
*              5  RHINOP  BIT(1),        /* S-INOPERATIVE            */
*           4  RHRSVD2  BIT(1),          /* Q-RESERVED,S-RESERVE     */
*           4  RHPACE   BIT(1),          /* Q-PACING REQUEST,S-PACE  */
*        3  RH3    BIT(8),               /* THIRD RH BYTE            */
*           4  RHBB     BIT(1),          /* BEGIN SEQUENCE           */
*           4  RHEB     BIT(1),          /* END SEQUENCE             */
*           4  RHCDIR   BIT(1),          /* CHANGE DIRECTION         */
*           4  RHRCDIR  BIT(1),          /* REQUEST CHANGE DIRECTION */
*           4  RHRSVD3  BIT(1),          /* RESERVED                 */
*           4  RHLOG    BIT(1),          /* LOG                      */
*           4  RHRSVD4  BIT(1),          /* RESERVED                 */
*           4  RHRSVD5  BIT(1);          /* RESERVED                 */
*DCL RHFIRST  BIT(2) CONSTANT('10'B);    /* FIRST IN CHAIN           */
*DCL RHMIDLE  BIT(2) CONSTANT('00'B);    /* MIDDLE OF CHAIN          */
*DCL RHLAST   BIT(2) CONSTANT('01'B);    /* LAST IN CHAIN            */
*DCL RHONLY   BIT(2) CONSTANT('11'B);    /* ONLY ONE IN CHAIN        */
*DCL RHRESP   BIT(24) CONSTANT('938000'X); /* RH RESPONSE MASK       */
*DCL RHREQ    BIT(24) CONSTANT('030000'X); /* RH REQUEST MASK        */
*/* FEEDBACK DATA BLOCK */                                         0482
*/* THE FOLLOWING DCR'S HAVE BEEN APPLIED */                       0482
*/* 1K0474 */                                                      0482
*DECLARE                                                           0482
*  1  ISTFDB  BDY(WORD) BASED,                                     0482
*   2  FDBFDBA     PTR(31),             /* POINTER TO NEXT FDB       */
*   2  FDBDATAA    PTR(31),             /* POINTER TO FEEDBACK DATA  */
*   2  FDBDATCT    FIXED(15),           /* DATA COUNT                */
*   2  FDBOFSET    PTR(15);            /* AMOUNT OF CORE PRECEDING 0482
*                                      THE FSB/FDB TO BE FREED IK0474 *
*/* FEEDBACK STATUS BLOCK */                                       0483
*/*  ADD A CONSTANT                                    007 12/13/74   *
*DCL  1  ISTFSB BDY(WORD) BASED(FSBPTR),                           0483
*       2  FSBFSB BDY(WORD),           /* FSB WITHOUT FDB             *
*        3  FSBTYPE CHAR(1),           /* CONTROL BLOCK TYPE          *
*        3  FSBLNGTH PTR(8),           /* LENGTH IN BYTES             *
*        3  FSBMNRCD BIT(8),           /* MINOR RETURN CODE OR        *
*                                      /* PHYSICAL CONDITION FLAGS    *
*           4  FSBMNELI BIT(1),        /* ERROR LOCK INDICATOR        *
*           4  FSBMNRVI BIT(1),        /* RVI RECEIVED                *
*           4  FSBMNATN BIT(1),        /* ATTN RECEIVED               *
*           4  FSBMNDNU BIT(1),        /* DEVICE NOT USABLE           *
*           4  FSBMNEOP BIT(1),        /* OUTPUT ERROR                *
*           4  FSBMNDIF BIT(1),        /* DIALOG INITIATION FEATURE   *
*           4  FSBMNOA BIT(1),         /* OPERATION ABORTED DUE TO CON*
*           4  FSBMNSDA BIT(1),        /* SENSE DATA AVAILABLE        *
*        3  FSBSFLGS BIT(8),           /* TPIOS SESSION FLAGS         *
*           4 FSBPGBUF BIT(1),         /* PAGEABLE BUFFER             *
*           4 FSBRSV02 BIT(6),         /* RESERVED            @ZA25404*
*           4 FSBLATOP BIT(1),         /* FSB HAS DCLCPB      @ZA25404*
*        3  FSBFSBA PTR(31),           /* ADDR OF NEXT FSB            *
*           4  FSBGATE BIT(1),         /* GATING FLAG                 *
*        3  FSBBTH CHAR(8),            /* BTH FIELDS                  *
*           4  FSBCID CHAR(4),         /* COMMUNICATION ID            *
*              5 FSBSAF BIT(16),       /* SIXTEEN BIT SOURCE ID       *
*              5 FSBDAF BIT(16),       /* SIXTEEN BIT DESTINATION ID  *
*           4  FSBRQTAG CHAR(2),       /* REQUEST TAG                 *
*              5  FSBSEQID BIT(16),    /* SEQUENCE NUMBER OR ID,SDCC  *
*               6  FSBFLAGS BIT(8),    /* FLAG BYTE                   *
*                 7  FSBRFIND BIT(1),  /* REQUEST FEEDBACK INDICATOR  *
*                 7  FSBACIND BIT(1),  /* ADDITIONAL COMMAND INDICATOR*
*                 7  FSBFFIND BIT(1),  /* FUNCTION FLAG GENERATED     *
*                 7  FSBLBIND BIT(1),  /* LAST BLOCK INDICATOR        *
*                 7  FSBNONCB BIT(1),  /* NO NCB FOR THIS REQUEST     *
*                 7  FSBINPET BIT(1),  /* INVITE PERPETUAL RESPONSE   *
*                 7  FSBASBTU BIT(1),  /* ASSOCIATED RESPONSE TO COME *
*                 7  FSBDTRCE BIT(1),  /* DEVICE TRACE REQUEST        *
*               6  FSBSEQ CHAR(1),     /* SEQENCE NUMBER              *
*                 7  FSBCMD CHAR(1),   /* LCCW COMMAND FOR LOCAL DEV  *
*           4  FSBCSWST CHAR(2),       /* CSW STATUS                  *
*              5  FSBTHFLD CHAR(2),    /* TRANSMISSION HEADER         *
*               6  FSBTH1  CHAR(1),    /* TH BYTE 1                   *
*                7  FSBSYSRS CHAR(1),  /* SYSTEM RESPONSE             *
*                 8  FSBSERR BIT(1),   /* ERROR FLAG                  *
*                 8  FSBSPHSE BIT(2),  /* RESPONSE PHASE              *
*                 8  FSBSCODE BIT(5),  /* RESPONSE CODE               *
*               6  FSBTH2  CHAR(1),    /* TH BYTE 2                   *
*                7  FSBEXTRS CHAR(1),  /* EXTENDED RESPONSE           *
*                 8  FSBXFSTS BIT(3),  /* FIRST STATUS                *
*                    9  FSBXNORM BIT(1),  /* OFF FOR NORM 1ST STATUS  *
*                 8  FSBXCODE BIT(5),  /* EXTENDED RESPONSE CODE      *
*                    9  FSBXFINS BIT(4),  /* FINAL STATUS             *
*                    9  FSBXLCI BIT(1),   /* LEADING CHARS INDICATED  *
*        3  FSBNETRS BIT(16),          /* NETWORK RESPONSE            *
*           4  FSBSRCAT BIT(8),        /* SYSTEM RESPONSE CATEGORY    *
*              5  FSBMJRCD BIT(8),     /* MAJOR RETURN CODE           *
*           4  FSBERC BIT(8),          /* EXTENTED RESPONSE CONDITIONS*
*              5  FSBELI BIT(1),       /* END OF LCP INDICATOR        *
*              5  FSBECI BIT(1),       /* END OF COMMAND INDICATOR    *
*              5  FSBEBI BIT(1),       /* END OF BLOCK INDICATOR      *
*              5  FSBEMI BIT(1),       /* END OF MESSAGE INDICATOR    *
*              5  FSBETI BIT(1),       /* END OF TRANSMISSION IND.    *
*              5  FSBFBMI BIT(1),      /* FIRST BLOCK IN MESSAGE INDIC*
*                 6  FSBLMRI BIT(1),   /* LOGOFF MESSAGE RECEIVED     *
*              5  FSBLGI BIT(1),       /* LEADING GRAPHICS INDICATOR  *
*              5  FSBSOHI BIT(1),      /* SOH INDICATOR               *
*        3  FSBDMGRS BIT(16),          /* DEVICE MANAGEMENT RESPONSE  *
*           4  FSBSS1 BIT(8),          /* STATUS SENSE BYTE 1         *
*              5  *     BIT(5),        /* RESERVED                    *
*              5  FSBSSUS BIT(1),      /* UNIT SPECIFY                *
*              5  FSBSSDE BIT(1),      /* DEVICE END                  *
*              5  *     BIT(1),        /* RESERVED                    *
*           4  FSBSS2 BIT(8),          /* STATUS SENSE BYTE 2         *
*              5  *     BIT(2),        /* RESERVED                    *
*              5  FSBSSCR BIT(1),      /* COMMAND REJECT              *
*              5  FSBSSIR BIT(1),      /* INTERV. REQUIRED            *
*              5  FSBSSEC BIT(1),      /* EQUIPMENT CHECK             *
*              5  FSBSSDC BIT(1),      /* DATA CHECK                  *
*              5  FSBSSCC BIT(1),      /* CONTROL CHECK               *
*              5  FSBSSOC BIT(1),      /* OPERATION CHECK             *
*        3  FSBLCPB PTR(31),           /* ADDR OF LCPB                *
*           4  FSBMSGID PTR(31),       /* OPERATOR MESSAGE ID         *
*              5  FSBICNCB PTR(31),    /* ICNCB PTR - CHECKPOINT REST *
*        3  FSBLCCWA PTR(31),          /* LCCW ADDRESS                *
*           4 FSBRLSTS BIT(8),         /* BUFFER RELEASE STATUS       *
*             5 FSBCFTX  BIT(1),       /* BUFFER CONTAINS CONFID TEXT *
*             5 FSBRLRSV BIT(7),       /* RESERVED                    *
*        3  FSBTHCNT BIN(15),          /* TH DATA COUNT               *
*        3  FSBRSV01 CHAR(2),          /* RESERVED                    *
*        2  FSBFDB CHAR(LENGTH(ISTFDB));/* FIRST FDB                  *
*/*       THIS IS AN OVERLAY FOR THE FIELDS BEGINNING AT FSBNETRS     *
*/*       TO SUPPORT THE DEFINED REQUEST/RESPONSE HEADER.             *
*DCL  1  FSBCOMBN BDY(BYTE) DEF(FSBNETRS),                         0484
*        2  FSBALIGN CHAR(1),           /* ALLIGNMENT BYTE            *
*        2  FSBRHFLD CHAR(3),           /* REQUEST/RESPONSE HEADER    *
*           3  FSBRH1 CHAR(1),          /* RH BYTE 1                  *
*           3  FSBRH2 CHAR(1),          /* RH BYTE 2                  *
*           3  FSBRH3 CHAR(1),          /* RH BYTE 3                  *
*              4 FSBLDFLG CHAR(1),      /* LOCAL DEVICE FLAGS FOR  0484
*                                          RECORD MODE                *
*                5 FSBLDRMF BIT(1),     /* RECORD MODE FLAG           *
*                5 FSBLDSCF BIT(1),     /* SESSION CONTROL FLAG       *
*                5 FSBLDFME BIT(1),     /* FME REQUESTED FLAG         *
*                5 FSBLDBBF BIT(1),     /* BEGIN BRACKET FLAG         *
*                5 FSBLDEBF BIT(1),     /* END BRACKET FLAG           *
*                5 FSBLDSOF BIT(1),     /* SEND OUTPUT COMMAND FLAG   *
*                5 FSBLDSIF BIT(1),     /* SEND INPUT COMMAND FLAG    *
*                5 FSBLDCUF BIT(1);     /* CLEAR/UNBIND FLAG          *
*DCL  1  *  BIT(12) DEFINED(FSBRQTAG),  /* COPY OF ZLBRQFLG  @XL03HDM *
*        2  FSBRT00 BIT(1),             /* LOGICAL ERROR FLAG @XL03HDM*
*        2  FSBRT01 BIT(1),             /* CONTRL BLOCK ERROR @XL03HDM*
*        2  FSBRT02 BIT(1),             /* END OF SCHEDULING BLOCK 0485
*                                                            @XL03HDM *
*        2  FSBRT03 BIT(1),             /* WRITE/READ REQUEST @XL03HDM*
*        2  FSBRT04 BIT(1),             /* FEEDBACK REQUESTED @XL03HDM*
*        2  FSBRT05 BIT(1),             /* DECREMENT SCHED COUNT ON
*                                          DEQUEUE           @XL03HDM *
*        2  FSBRT06 BIT(1),             /* WRITE REQUEST     @XL03HDM *
*        2  FSBRT07 BIT(1),             /* SCHEDULING FLAG   @XL03HDM *
*        2  FSBRT08 BIT(1),             /* DEVICE END NOTIFICATION 0485
*                                                            @XL03HDM *
*        2  FSBRT09 BIT(1),             /* CRITICAL TEXT FLAG @XL03HDM*
*        2  FSBRT0A BIT(1),             /* CONTACT           @XL03HDM *
*        2  FSBRT0B BIT(1);             /* DISCONNECT        @XL03HDM *
*DCL FSTYPE    BIT(8) CONSTANT('02'X),  /* TYPE CODE FOR FSB          *
*    FSTRACE   BIT(8) CONSTANT('8F'X),  /* TRACE FSB                  *
*    FSTYPEA   BIT(8) CONSTANT('80'X),  /* FID1 FSB                   *
*    FRREJBB BIT(8) CONSTANT('90'X),    /* REJECTED BEGIN BRACKET     *
*    FRREJBS BIT(8) CONSTANT('94'X),    /* REJECTED BRACKET STATUS    *
*    FSTHCON BIT(16) CONSTANT('1E00'X), /* 3270 RECORD TH BYTES 1,2   *
*    FRMNSALU BIT(8) CONSTANT('00'X),   /* NO SESSION EXISTS          *
*    FRMRCDNP BIT(8) CONSTANT('29'X),   /* RESET CONDL REJECT-        *
*                                       /* ERROR LOCK SET             *
*    FSATHCON BIT(16) CONSTANT('1F00'X),/* ASYCHRONOUS TH CONSTANT    *
*            /* MAJOR RETURN CODE TYPE VALUES */                   0486
*    FRNORM    BIT(8) CONSTANT('00'X),  /* NORMAL FEEDBACK            *
*    FRCBLKE   BIT(8) CONSTANT('04'X),  /* CONTROL BLOCK ERROR        *
*    FRLOGICE  BIT(8) CONSTANT('08'X),  /* LOGICAL ERROR IN ACCESS 0486
*                                          METHOD                     *
*    FRPHYSC   BIT(8) CONSTANT('0C'X),  /* I/O ERROR                  *
*    FRPPRIEX  BIT(8) CONSTANT('0D'X),  /* RU PURGED DUE TO EXCEPTION *
*                                       /* ON PRIOR ELEMENT ON CHAIN  *
*    FRNEGRCC  BIT(8) CONSTANT('10'X),  /* CONDIT COMMND NOT PERFORMED*
*    FRESPEC   BIT(8) CONSTANT('0C'X),  /* SPECIAL  CONDITION         *
*    FRCMDRST  BIT(8) CONSTANT('18'X),  /* COMMAND TERMINATED BY RESET*
*    FRPURGE   BIT(8) CONSTANT('1C'X),  /* REQUEST PURGED             *
*    FRDISCNT  BIT(8) CONSTANT('28'X),  /* DEVICE DISCONNECTED        *
*    FRMLCCWS BIT(8) CONSTANT('04'X),  /* LCCW SYNCH COMPLETION CODE  *
*    FRNETP    BIT(8) CONSTANT('80'X),  /* NETWORK PROCESSING         *
*    FRLINTR   BIT(8) CONSTANT('84'X),  /* LINE TRACE                 *
*    FRMDR     BIT(8) CONSTANT('88'X),  /* MDR RECORD                 *
*    FROLT     BIT(8) CONSTANT('8C'X),  /* OLTT                       *
*    FRNOTIFY  BIT(8) CONSTANT('30'X),  /* NOTIFY                     *
*    FRCLRRSP  BIT(8) CONSTANT('31'X);  /* CLEAR RESPONSE             *
*                                                                  0486
*/* MINOR RETURN CODES FOR NORMAL FEEDBACK */                      0487
*                                                                  0487
*DCL FRMOK     BIT(8) CONSTANT('00'X),  /* OK SO FAR                  *
*    FRMRCDPR BIT(8) CONSTANT('04'X),  /* RESET CONDITION SUCCESSFUL,
*                                         READ AHEAD DATA PRESENT    */
*    FRMLSYN  BIT(8) CONSTANT('04'X),  /* LCCW SYNCHRONIZATION       */
*    FRMSRCTL BIT(8) CONSTANT('0C'X),  /* CTL COM'D SESSION RECORD   */
*    FRMIRCTL BIT(8) CONSTANT('10'X),  /* CTL COM'D INCIDENT RECORD  */
*    FRMRSTEL BIT(8) CONSTANT('40'X),   /* RESET ERROR LOCK COMPLETED *
*    FRMRSTQP BIT(8) CONSTANT('41'X),   /* RESET OF QUEUE COMPLETE    *
*    FRMRELCB BIT(8) CONSTANT('30'X),   /* RELEASE CB                 *
*    FRMNPCR  BIT(8) CONSTANT('31'X),   /* CLEAR RESPONSE             *
*    FRMNPUR  BIT(8) CONSTANT('32'X),   /* UNBIND RESPONSE            *
*    FRMRSTSR BIT(8) CONSTANT('33'X);   /* RESETSR RESPONSE           *
*                                                                  0487
*/* MINOR RETURN CODES FOR CONTROL BLOCK ERROR */                  0488
*DCL FRMINVCF  BIT(8) CONSTANT('81'X),  /* INVLD CHAINING FLD IN LCCW *
*    FRMIECMD  BIT(8) CONSTANT('87'X),  /* INVALID ESCAPE CMD         *
*    FRMLGCNT  BIT(8) CONSTANT('88'X),  /* LEADING GRAPHICS COUNT > 15*
*    FRMESCNT  BIT(8) CONSTANT('89'X),  /* ESCAPE CMD COUNT < 4       *
*    FRMCPCNT  BIT(8) CONSTANT('8A'X),  /* COPY LCC COUNT NE 3        *
*    FRMINDAT  BIT(8) CONSTANT('97'X),  /* INVALID DATA ADDR/LENGTH   *
*    FRMINCNT  BIT(8) CONSTANT('8B'X),  /* INVALID DATA COUNT         *
*    FRMINDTR BIT(8) CONSTANT('17'X),   /* INVLD DATA/CNT-RECORD MODE *
*    FRMNSEGE BIT(8) CONSTANT('1C'X);   /* SEGMENTING ERROR           *
*                                                                  0488
*/* PHYSICAL CONDITION MINOR RETURN CODES */                       0489
*DCL FRMDENOT BIT(8) CONSTANT('01'X),  /* 3270 DEVICE END NOTIFICAT'N *
*    FRMLOERR BIT(8) CONSTANT('88'X),  /* 3270 LOCAL OUTPUT ERROR  0489
*                                         WITHOUT SENSE               *
*    FRMNRP   BIT(8) CONSTANT('80'X),  /* NEGATIVE RESPONSE TO POLLING*
*    FRMLERR  BIT(8) CONSTANT('80'X),  /* 3270 LOC I/O ERR W/O SENSE  *
*    FRMLOSNS BIT(8) CONSTANT('89'X),  /* 3270 LOC OUTPUT ERR W/SENSE *
*    FRMLESNS BIT(8) CONSTANT('81'X);  /* 3270 LOC I/O ERR WITH SENSE *
*/* MINOR RETURN CODES FOR LOGICAL ERRORS */                       0490
*DCL FRMVTAME  BIT(8) CONSTANT('A0'X),  /* VTAM ERROR                 *
*    FRMILRS   BIT(8) CONSTANT('A1'X),  /* INCOMPATABLE LOCAL/REMOTE  *
*                                       /* SYSGENS                    *
*    FRMRDIP   BIT(8) CONSTANT('A2'X),  /* RESET OR DEACTIVATE        *
*                                       /* + CLEAR IN PROGRESS        *
*    FRMUSELE  BIT(8) CONSTANT('A3'X),  /* USER LOGIC ERROR           *
*    FRMINVL   BIT(8) CONSTANT('A3'X),  /* USER LOGIC ERROR           *
*    FRMCTLCF  BIT(8) CONSTANT('A4'X),  /* CONTROL COMMAND            *
*    FRMOLTF   BIT(8) CONSTANT('A5'X),  /* OLTT FAILURE               *
*    FRMCDITS  BIT(8) CONSTANT('A6'X),  /* CONFLICTING DIALOGUE       *
*                                       /* INITIATION/TERMINATION     *
*    FRMCRNF   BIT(8) CONSTANT('A7'X),  /* CONVERSATIONAL REPLY NOT   *
*                                       /* FEASIBLE                   *
*    FRMELNV   BIT(8) CONSTANT('A9'X),  /* ESCAPE LCCW NOT VALID      *
*    FRMNELNV  BIT(8) CONSTANT('AA'X),  /* NON ESCAPE LCCW NOT VALID  *
*    FRMLCH    BIT(8) CONSTANT('AB'X),  /* LCCW COUNT EXCEEDS 255     *
*    FRMNORD   BIT(8) CONSTANT('AC'X),  /* NO READ WHERE REQUIRED     *
*    FRMINVBS  BIT(8) CONSTANT('AD'X), /* INVALID BTU SYSTEM RESPONSE *
*    FRMSEQER  BIT(8) CONSTANT('AE'X), /* RESPONSE SEQUENCE EEROR     *
*    FRMERNR BIT(8) CONSTANT('AF'X),   /* EXPECTED RESPONSE NOT RECVED*
*    FRMTRUN  BIT(8) CONSTANT('B0'X), /* DATA TRUNCATION OCCURRED     *
*    FRMCPYE2 BIT(8) CONSTANT('B1'X), /* ATTEMPT TO COPY FROM DEVICE
*                                     ON DIFFERENT CLUSTER            *
*    FRMRELNP BIT(8) CONSTANT('B2'X), /* RESET ERROR LOCK NOT PRFORMD *
*    FRMCPYE1 BIT(8) CONSTANT('B3'X), /* ATTMPT TO COPY FROM UNOP DEV *
*    FRMCPYE3 BIT(8) CONSTANT('B3'X),  /* ATTEMPT TO COPY FROM A DEVICE
*                                         NOT ALLOCATED TO THE COPIER *
*    FRMPRM1 BIT(8) CONSTANT('B4'X), /* ATTEMPT TO PREEMPT A       0490
*                                       PREEMPTED FMCB               */
*    FRMPRM2 BIT(8) CONSTANT('B5'X), /* ATTEMPT TO PREEMPT AN FMCB WITH
*                                       PREEMPT PENDING              */
*    FRMBHNDG BIT(8) CONSTANT('B6'X),  /* DIALOGUE ENTRY FAILED DUE TO
*                                         INVALID BH SET              *
*    FRMMDNDG BIT(8) CONSTANT('B7'X),  /* DIALOGUE ENTRY FAILED DUE TO
*                                         INVALID PROCESSING OPTIONS  *
*    FRMRCNA BIT(8) CONSTANT('B8'X),   /* READ CONTINUOUS NOT ALLOWED *
*    FRMRDLGO BIT(8) CONSTANT('B9'X);  /* READ WITH DATA LENGTH GT 1  *
*                                      /* INTERNAL TPIOS ONLY         *
*/* MINOR RETURN CODES FOR CONDITIONAL COMMAND NOT PERFORMED */    0491
*DCL  FRMNRCC BIT(8) CONSTANT('00'X),  /* RESET NOT PERFORMED         *
*     FRMYTC  BIT(8) CONSTANT('80'X);  /* YIELDED TO CONTENTION       *
*                                                                  0491
*/*  MINOR CODE FOR COMMAND RESET        */                        0492
*DCL  FRMCDRST BIT(8) CONSTANT('00'X);   /* COMMAND HAS BEEN RESET */
*/*  MINOR RETURN CODES FOR NOTIFY                                   */
*DCL FRMPREMT BIT(8) CONSTANT('0B'X),   /* TOLTEP PREMPT             */
*    FRMRESTR BIT(8) CONSTANT('0C'X),   /* RESTORE AFTER PREEMPT     */
*    FRNCDTRM BIT(8) CONSTANT('0D'X);   /* CONDITIONAL TERM SELF     */
*                                                                  0493
*/* MINOR RETURN CODES FOR REQUEST PURGED */                       0494
*DCL  FRPRARSS BIT(8) CONSTANT('01'X), /* 3705 ABEND, RESTART SUCSFL */
*     FRPRABND BIT(8) CONSTANT('02'X), /* EARLY WARN, RECOV IN PROG  */
*     FRPPCHFL BIT(8) CONSTANT('03'X), /* PERMANENT CHANNEL FAILURE  */
*     FRPRANSH BIT(8) CONSTANT('04'X), /* AUTO NETWORK SHUTDOWN      */
*     FRPAPABD BIT(8) CONSTANT('05'X), /* APPLICATION ABENDED        */
*     FRPCLSDO BIT(8) CONSTANT('06'X), /* CLSDST OCCURRED            */
*     FRPVRYOF BIT(8) CONSTANT('07'X), /* VARY OFFLINE OCCURRED      */
*     FRPDISCO BIT(8) CONSTANT('08'X), /* DISCONNECT OCCURRED        */
*     FRPDBTEX BIT(8) CONSTANT('09'X), /* BUFFER THRESHOLD EXCEEDED  */
*     FRPRTF   BIT(8) CONSTANT('10'X), /* TEMP RECORD DEVICE FAILURE */
*     FRPRTS   BIT(8) CONSTANT('11'X), /* TERMINATE SELF             */
*     FRPRAP   BIT(8) CONSTANT('0A'X), /* APPL ISSUED CLEAR          */
*     FRPRPR   BIT(8) CONSTANT('0B'X), /* PREEMPT                    */
*     FRNFRE   BIT(8) CONSTANT('0C'X), /* RESTORE                    */
*     FRPARSSL BIT(8) CONSTANT('81'X); /* THIS IS LAST OPERATION PURGED
*                                         FOR 3705 ABEND, RESTART  0494
*                                         SUCCESSFUL         @DL29HDM *
*/* MINOR RETURN CODES FOR NETWORK PROCESSING */                   0495
*DCL  FRMMTAID  BIT(8) CONSTANT('00'X), /* MTA DEVICE IDENTIFIED      *
*     FRMNPLQ   BIT(8) CONSTANT('04'X), /* NEG POLL LIMIT REACHED     *
*                                       /* QUEUE OPTION               *
*     FRMNPDES BIT(8) CONSTANT('08'X),  /*DEVICE END STATUS          */
*     FRMNPSE  BIT(8) CONSTANT('80'X),  /* ERROR SENSE/STATUS        */
*     FRMDEBSF  BIT(8) CONSTANT('84'X), /* DEVICE ERROR - BSC         *
*                                       /* STATUS TO FOLLOW           *
*     FRMBIDE  BIT(8) CONSTANT('0C'X),  /* BSC ID ERROR               *
*     FRMMTABS BIT(8) CONSTANT('18'X), /* MTA/BSC VERIFY SUCCESSFUL IN
*                                          370X                      */
*     FRMBSCER BIT(8) CONSTANT('90'X),  /* BSC ID VERIFY SUCCESSFUL
*                                         (IN HOST), ERROR LOCK SET  */
*     FRMNUTRM BIT(8) CONSTANT('94'X),  /* BSC ID VERIFY UNSUCCESSFUL
*                                          ERROR LOCK SET            */
*     FRMNPHPS BIT(8) CONSTANT('10'X),  /* HOLD - PENDING SENSE/ST   */
*     FRMNPRMD BIT(8) CONSTANT('20'X), /* REQUEST MANUALDIAL         */
*     FRMBSCOK BIT(8) CONSTANT('1C'X), /* BSC ID ASSOCIATION SUCCESS-
*                                         FUL IN TPIOS                *
*     FRMBSCKO BIT(8) CONSTANT('1E'X),  /* BSCID SUCSSFUL IN VS1 TPIOS*
*     FRMUNID BIT(8) CONSTANT('14'X),  /* UNIDENTIFIED DIAL IN TERMNL *
*     FRMNPRDV BIT(8) CONSTANT('42'X); /* RESET CONDITIONAL FAILED    *
*DCL FRMFIRM  BIT(8) CONSTANT('10'X),  /* LU FAILED                   *
*    FRMTERM  BIT(8) CONSTANT('11'X);  /* TERMINATE RECEIVED          *
*                                                                  0496
*/* MINOR RETURN CODES FOR LINE TRACE   */                         0497
*DCL  FRMLINTR BIT(8) CONSTANT('00'X), /* LINE TRACE                  *
*     FRMLTRE  BIT(8) CONSTANT('04'X); /* LINE TRACE TERMINATED BY ERR*
*                                                                  0497
*/* MINOR RETURN CODES FOR MDR RECORDS */                          0498
*DCL  FRMMDR   BIT(8) CONSTANT('00'X); /* MDR RECORDS                 *
*                                                                  0498
*/* MINOR RETURN CODES FOR OLTT */                                 0499
*DCL  FRMOLTR  BIT(8) CONSTANT('80'X), /* OLT REQUEST MESSAGE         *
*     FRMOLTE  BIT(8) CONSTANT('04'X), /* OLTT CMD TERMINATED         *
*     FRMOLTNC BIT(8) CONSTANT('90'X), /* NO CCW STRING QUEUED        *
*     FRMOLTNT BIT(8) CONSTANT('91'X), /* CCW STRING QUEUED - NOT TEST
*                                         MODE REQS                   *
*     FRMOLTNS BIT(8) CONSTANT('92'X); /* I/O NOT STARTED - HDV NOT
*                                         ISSUED                     */
*                                                                  0499
*/* ***** MINOR RETURN CODE FOR COMMAND RESET  **** ** */          0500
*DCL  FRMRSTRM BIT(8) CONSTANT('80'X), /* RESET BY SUCCSSFUL TRM      *
*     FRMRUTRM BIT(8) CONSTANT('81'X); /* RESET BY SUCCSSFUL TRM      *
*                                                                  0500
*/* **** MINOR RETURN CODES FOR PHYSICAL CONDITION **** */         0501
*DCL  FRMUSDA BIT(8) CONSTANT('00000001'B), /* UNSOL SENSE DATA AVAIL *
*     FRMSE   BIT(8) CONSTANT('10000001'B), /* ERROR SENSE DATA AVAIL *
*     FRMUSE  BIT(8) CONSTANT('10000001'B), /* ERROR,UNSOLICITED,SENSE*
*     FRMDDR  BIT(8) CONSTANT('90'X),    /* ASYN DIAL DISCON RECEIVED *
*     FRMNCLR BIT(8) CONSTANT('0A'X),    /* CLEARED BY CLEAR          *
*     FRMCU   BIT(8) CONSTANT('06'X),    /* CLEARED BY CLEAR/UNBIND   *
*     FRMCUN  BIT(8) CONSTANT('07'X);    /* CLRD BY CLEAR/UNBIND/NOTFY*
*        /* NCP SYSTEM RESPONSE FIELD */                           0502
*/* RESPONSE PHASE */                                              0502
*DCL  NCPPHSE0 BIT(2) CONSTANT('00'B), /* PHASE 0 RESPONSE            *
*     NCPPHSE1 BIT(2) CONSTANT('01'B), /* PHASE 1 RESPONSE            *
*     NCPPHSE2 BIT(2) CONSTANT('10'B), /* PHASE 2 RESPONSE            *
*     NCPPHSE3 BIT(2) CONSTANT('11'B); /* PHASE 3 RESPONSE            *
*                                                                  0502
*/* PHASE 0 NON ERROR RESPONSES */                                 0503
*DCL  NCPDAC   BIT(5) CONSTANT('00011'B), /* DEVICE ASSTN COMPLETE    *
*     NCPMTAID BIT(5) CONSTANT('00100'B), /* MTA DEVICE IDENTIFIED    *
*     NCPCAPM  BIT(5) CONSTANT('00101'B), /* CHANNEL ADAPTER TO PRIM  *
*                                         /* MODE                     *
*     NCPCASM  BIT(5) CONSTANT('00110'B), /* CHANNEL ADAPTER TO       *
*                                         /* SECONDARY MODE           *
*     NCPESYSS BIT(5) CONSTANT('00111'B), /* ENTERING SYSTEM SLOWDOWN *
*     NCPLSYSS BIT(5) CONSTANT('01000'B), /* LEAVING SYSTEM SLOWDOWN  *
*     NCPICOMP BIT(5) CONSTANT('01001'B), /* INIT COMPLETE            *
*     NCPMDR   BIT(5) CONSTANT('01010'B), /* MDR RECORD               *
*     NCPANSCT BIT(5) CONSTANT('11011'B), /* AUTO NETWORK SHUTDOWN    *
*                                         /* VIA CHANNEL TIMEOUT      *
*     NCPANSOP BIT(5) CONSTANT('11100'B), /* AUTO NETWORK SHUTDOWN    *
*                                         /* VIA OPERATIONS PANEL     *
*     NCPANSC  BIT(5) CONSTANT('11101'B), /* AUTO NETWORK SHUTDOWN    *
*                                         /* COMPLETE                 *
*     NCPMSLOG BIT(5) CONSTANT('11110'B), /* SERVICEABILITY AID -     *
*                                         /* MASS STORAGE LOGGING     *
*     NCPOFLO  BIT(5) CONSTANT('11111'B); /* OVERFLOW CONFIGURATION   *
*                                                                  0503
*/* PHASE 1,2,3 NON ERROR RESPONSES */                             0504
*DCL  NCPOK    BIT(5) CONSTANT('00000'B), /* COMMAND OK SO FAR        *
*     NCPLGR   BIT(5) CONSTANT('00001'B), /* LEADING GRAPHICS RECEIVED*
*     NCPOKD   BIT(5) CONSTANT('00010'B), /* OK SO FAR WITH DATE      *
*     NCPNPLQ  BIT(5) CONSTANT('00011'B), /* NEGITIVE POLL LIMIT      *
*                                         /* QUEUE OPTION             *
*     NCPOLTR  BIT(5) CONSTANT('00100'B), /* OLT REQUEST              *
*     NCPNPLNW BIT(5) CONSTANT('00110'B), /* NEGATIVE POLL LIMIT - -  *
*                                         /* NOWAIT OPTION            *
*     NCPLINTR BIT(5) CONSTANT('00111'B), /* LINE TRACE               *
*     NCPBSTAT BIT(5) CONSTANT('00101'B); /* BSC STATUS MESSAGE       *
*                                                                  0504
*/* PHASE 0 ERROR RESPONSES */                                     0505
*DCL  NCPCHERR BIT(5) CONSTANT('00000'B), /* CHANNEL ERROR            *
*     NCPIRID  BIT(5) CONSTANT('00001'B), /* INVALID RESOURCE ID      *
*     NCPICMD  BIT(5) CONSTANT('00010'B), /* INVALID COMMAND          *
*     NCPIMOD  BIT(5) CONSTANT('00011'B), /* INVALID MODIFIER         *
*     NCPRSIP  BIT(5) CONSTANT('00100'B), /* RESET OR DEACTIVATE IN   *
*                                         /* PROGRESS                 *
*     NCPDIACT BIT(5) CONSTANT('00101'B), /* DEVICE INACTIVE          *
*     NCPLIACT BIT(5) CONSTANT('00110'B), /* LINE INACTIVE            *
*     NCPCNVR  BIT(5) CONSTANT('00111'B), /* COMMAND NOT VALID FOR    *
*                                         /* RESOURCE                 *
*     NCPCSXE  BIT(5) CONSTANT('01000'B), /* COMMAND SYNTAX ERROR     *
*     NCPCNBS  BIT(5) CONSTANT('01001'B), /* COMMAND DID NOT CONFORM  *
*                                         /* TO BSC SPECIFICATIONS    *
*     NCPICDL  BIT(5) CONSTANT('01010'B), /* INVALID CONTROL DATA LENG*
*     NCPRSNP  BIT(5) CONSTANT('01011'B), /* RESET NOT PERFORMED      *
*     NCPGPA BIT(5) CONSTANT('01011'B), /* GEN. POLL ABORTED          *
*     NCPDNCR  BIT(5) CONSTANT('01100'B), /* DATA NOT CORE RESIDENT   *
*     NCPDSQL  BIT(5) CONSTANT('01101'B), /* DIAL SET QUEUE LIMIT     *
*                                         /* REACHED                  *
*     NCPSDLI  BIT(5) CONSTANT('01110'B), /* SWITCHED DEVICE LINE     *
*                                         /* INCOMPATIBILITY          *
*     NCPITXL  BIT(5) CONSTANT('01111'B), /* INVALID TEXT LENGTH      *
*     NCPICOD  BIT(5) CONSTANT('10001'B), /* INVALID CONTROL DATA     *
*     NCPINBTU BIT(5) CONSTANT('10010'B), /* INCOMPLETE BTU           *
*     NCPDATIU BIT(5) CONSTANT('10100'B), /* DATA IN USE              *
*     NCPICCM  BIT(5) CONSTANT('10101'B), /* INVALID CONTROL COMMAND  *
*                                         /* OR MODIFIER              *
*     NCPOLTRJ BIT(5) CONSTANT('10110'B), /* OLT COMMAND REJECTED     *
*     NCPMULTD BIT(5) CONSTANT('11000'B), /* MULTIPLE DIAL REQUESTS   *
*     NCPMODI  BIT(5) CONSTANT('11001'B), /* MODE INCONSISTENCY       *
*     NCPBUFNA BIT(5) CONSTANT('11010'B), /* BUFFER NOT AVAILABLE     *
*     NCPSYSS  BIT(5) CONSTANT('11011'B), /* COMMAND REJECTED --      *
*                                         /* SYSTEM IN SHUTDOWN       *
*     NCPERLS  BIT(5) CONSTANT('11100'B), /* COMMAND REJECTED --      *
*                                         /* ERROR LOCK SET           *
*     NCPCNOP  BIT(5) CONSTANT('11101'B), /* COMMAND REJECTED----     *
*                                         /* CHANNEL INOPERATIVE      *
*     NCPCRS   BIT(5) CONSTANT('11110'B), /* COMMAND RESET OR LINE    *
*                                         /* DEACTIVATED              *
*     NCPESC0  BIT(5) CONSTANT('11111'B); /* PHASE 0 ERROR ESCAPE     *
*/* EXTENDED RESPONSE (FINAL STATUS ) FOR PHASE 0 ERROR ESCAPE */  0506
*DCL  NCPIPLE  BIT(5) CONSTANT('00001'B), /* IPL LOCK ON     @XL03HDM *
*     NCPIVNE  BIT(5) CONSTANT('00101'B), /* INVALID NODE    @XL03HDM *
*     NCPTELE  BIT(5) CONSTANT('00100'B); /* TRUNK ERROR LOCK ON      *
*                                                                  0506
*/* PHASE 1,2,3 ERROR RESPONSES */                                 0507
*DCL  NCPDACHK BIT(5) CONSTANT('00000'B), /* DATA CHECK               *
*     NCPPIVR  BIT(5) CONSTANT('00001'B), /* POSSIBLE INTERVENTIONS   *
*                                         /* REQUIRED                 *
*     NCPIVR   BIT(5) CONSTANT('00010'B), /* INTERVENTION REQUIRED    *
*     NCPNPLW  BIT(5) CONSTANT('00011'B), /* NEGATIVE POLL LIMIT---   *
*                                         /* WAIT OPTION              *
*     NCPYCNT  BIT(5) CONSTANT('00100'B), /* YIELD TO CONTENTION      *
*     NCPDEBF  BIT(5) CONSTANT('00101'B), /* DEVICE ERROR--BSC STATUS *
*                                         /* TO FOLLOW                *
*     NCPBIDER BIT(5) CONSTANT('00110'B), /* BSC ID ERROR             *
*     NCPLTRT  BIT(5) CONSTANT('00111'B), /* LINE TRACE TERMINATED    *
*     NCPOCT   BIT(5) CONSTANT('01000'B), /* OLT COMMAND TERMINATED   *
*     NCPSSNS  BIT(5) CONSTANT('01001'B), /* SESSION NOT STARTED      *
*                                         /* BSC STATUS MESSAGE       *
*                                         /* AS NON ERROR RESPONSE    *
*     NCPESTAT BIT(5) CONSTANT('01010'B), /* BSC ERROR STATUS MESSAGE *
*     NCPDCREC BIT(5) CONSTANT('01100'B), /* DATA DISCONNECT RECEIVED *
*     NCPBRREC BIT(5) CONSTANT('10011'B), /* BREAK RECEIVED           *
*     NCPCRJS  BIT(5) CONSTANT('11000'B), /* CONTACT REJECTED ----    *
*                                         /* SESSION STARTED          *
*     NCPDDIC  BIT(5) CONSTANT('11001'B), /* DIAL DATA INCONSISTENCY  *
*                                         /* COMMAND RESET ----       *
*                                         /* AS PHASE 0 RESPONSE      *
*     NCPIPLR  BIT(5) CONSTANT('01101'B), /* IPL REQUIRED    @XL03HDM *
*     NCPTRNKE BIT(5) CONSTANT('01110'B), /* TRUNK ERROR     @XL03HDM *
*     NCPBLKR  BIT(5) CONSTANT('01111'B); /* REMOTE BLOCK RETURNED TO
*                                            HOST            @XL03HDM *
*                                                                  0507
*/* NCP EXTENTDED RESPONSE FIELD VALUES */                         0508
*/* FIRST STATUS VALUES */                                         0508
*DCL  NCPXCNTL  BIT(3) CONSTANT('000'B), /* CONTROL                   *
*     NCPXTXT   BIT(3) CONSTANT('001'B), /* TEXT                      *
*     NCPXTTXT  BIT(3) CONSTANT('010'B), /* TRANSPARENT TEXT          *
*     NCPXHEAD  BIT(3) CONSTANT('011'B), /* HEADING                   *
*     NCPXSPEC  BIT(3) CONSTANT('100'B), /* SPECIAL                   *
*     NCPXHCHK  BIT(3) CONSTANT('111'B); /* HARDWARE CHECK            *
*                                                                  0508
*/* FINAL STATUS VALUES WITH NORMAL FIRST STATUS IE CONTROL,TEXT,     *
*/* TRANSPARENT TEXT OR HEADING                                       *
*DCL  NCPXTIMT BIT(4) CONSTANT('0000'B), /* TIMEOUT                   *
*     NCPXCUTF BIT(4) CONSTANT('0010'B), /* CUTOFF                    *
*     NCPXABLK BIT(4) CONSTANT('0011'B), /* ABORT BLOCK               *
*     NCPXEHE  BIT(4) CONSTANT('0100'B), /* EOT HALTED ERP            *
*     NCPXDCE  BIT(4) CONSTANT('0101'B), /* DLE CONTROL END           *
*     NCPXWRAK BIT(4) CONSTANT('0110'B), /* WRONG ACK                 *
*     NCPXRSBE BIT(4) CONSTANT('1000'B), /* RECIEVED SUB BLOCK END    *
*     NCPXETX  BIT(4) CONSTANT('1001'B), /* END OF TEXT               *
*     NCPXETB  BIT(4) CONSTANT('1010'B), /* END OF BLOCK              *
*     NCPXENQ  BIT(4) CONSTANT('1011'B), /* ENQUIRY                   *
*     NCPXEOT  BIT(4) CONSTANT('1100'B), /* END OF TRANSMISSION       *
*     NCPXRVI  BIT(4) CONSTANT('1101'B), /* REVERSE INTERRUPT         *
*     NCPXPACK BIT(4) CONSTANT('1110'B), /* POSITIVE ACK              *
*     NCPXWACK BIT(4) CONSTANT('1111'B); /* WAIT ACK                  *
*                                                                  0509
*/* FINAL STATUS VALUES WITH SPECIAL FIRST STATUS */               0510
*/* TIMEOUT-- SAME AS NORMAL FIRST STATUS */                       0510
*                                                                  0510
*DCL  NCPXCREJ BIT(4) CONSTANT('0001'B), /* COMMAND REJECT            *
*     NCPXBPE  BIT(4) CONSTANT('0010'B), /* BUFFER POOL END           *
*     NCPXSLTD BIT(4) CONSTANT('0011'B), /* SELECTED                  *
*     NCPXRDS  BIT(4) CONSTANT('0100'B), /* RECEIVED DISCONNECT SIGNAL*
*     NCPXLDTA BIT(4) CONSTANT('0101'B), /* LOST DATA                 *
*     NCPXRSET BIT(4) CONSTANT('0110'B), /* RESET                     *
*     NCPXPLLD BIT(4) CONSTANT('0111'B), /* POLLED                    *
*     NCPXXSBE BIT(4) CONSTANT('1000'B), /* TRANSMIT SUB BLOCK END    *
*     NCPXESWR BIT(4) CONSTANT('1001'B), /* EOT SENT AFTER WACK RECVD *
*     NCPXRBT  BIT(4) CONSTANT('1010'B), /* RECEIVED BREAK IN TEXT    *
*     NCPXPLLS BIT(4) CONSTANT('1011'B), /* POLLING STOP              *
*     NCPXEOTS BIT(4) CONSTANT('1100'B), /* EOT SENT                  *
*     NCPXRCB  BIT(4) CONSTANT('1101'B), /* RECEIVED BREAK            *
*     NCPXDSCT BIT(4) CONSTANT('1110'B), /* DISCONNECTED              *
*     NCPXCNTD BIT(4) CONSTANT('1111'B); /* CONNECTED                 *
*                                                                  0510
*/* FINAL STATUS VALUES WITH HARDWARE CHECK FIRST STATUS */        0511
*DCL  NCPXUSER BIT(4) CONSTANT('0000'B), /* USER ERROR        @ZA31006*
*     NCPXCSBC BIT(4) CONSTANT('0010'B), /* CSB CHECK                 *
*     NCPXADC  BIT(4) CONSTANT('0100'B), /* ADAPTER CHECK             *
*     NCPXEQUC BIT(4) CONSTANT('0110'B), /* EQUIPMANT CHECK   @ZA31006*
*     NCPXMODC BIT(4) CONSTANT('1000'B), /* MODEM CHECK               *
*     NCPXDTOC BIT(4) CONSTANT('1010'B), /* DSR TURN ON CHECK         *
*     NCPXDTFC BIT(4) CONSTANT('1100'B), /* DSR TURN OFF CHECK        *
*     NCPXACUC BIT(4) CONSTANT('1110'B); /* ACU CHECK                 *
*                                                                  0511
*/* **** MISCELLANEOUS EQUATES ****                                  */
*DCL FSBLCWMX BIT(8) CONSTANT('FF'X),   /* MAX # LCCW'S LCPB         */
*    FRMCRJSS BIT(8) CONSTANT('08'X),  /* CONTACT RJCTED, SESN STARTED*
*    FSBNRMST BIT(8) CONSTANT('0C'X);   /* NORMAL I/O STATUS OF CE,DE *
*/*                                                                   *
*/*          SESSION FLAG VALUES                                      *
*DCL FSESCS    BIT(8) CONSTANT('01'X),  /* CONTACT SUCCESSFULL        *
*    FSESIS    BIT(8) CONSTANT('02'X),  /* INVITE SUCCESSFULL         *
*    FSESCR    BIT(8) CONSTANT('03'X),  /* CONTACT REJECTED           *
*    FSESDS    BIT(8) CONSTANT('04'X),  /* DISCONNECT SUCCESSFULL    */
*    FSESCWDS  BIT(8) CONSTANT('05'X),  /* CONTACT/WRITE/DISCONNECT  */
*                                       /* SUCCESSFULL               */
*    FSESIDS   BIT(8) CONSTANT('06'X),  /* INVITE/DISCONNECT SUCCESS */
*    FSESIADS  BIT(8) CONSTANT('07'X),  /* INVITE W. AUTO RESTART  0513
*                                          COMPLETED A CYCLE         */
*    FSESDF    BIT(8) CONSTANT('08'X),  /* COMM'D WITH DISCON. FAILED*/
*    FSESCF   BIT(8) CONSTANT('09'X),   /* WRITE WITH CONTACT AND DIS-
*                                          CONNECT FAILED             *
*    FSESIF    BIT(8) CONSTANT('0A'X),  /* INVITE WITH CONNECT FAILED*/
*    FSESSSDF  BIT(8) CONSTANT('0B'X),  /* WRITE WITH CONTACT AND DIS-
*                                       CONNECT FAILED TO END SESSION *
*    FSESISDF BIT(8) CONSTANT('0C'X),  /* INVITE STARTED SESSION BUT
*                                         DISCONNECT FAILED           *
*    FSESIR    BIT(8) CONSTANT('0E'X);  /* INVITE REJECTED - DISC SENT*
*/*                                                                   *
*/*       RH, TH, SENSE CONSTANTS                                     *
*DCL FSSEQSNS BIT(32) CONSTANT('00000000'X); /* SEQ NUM SENSE FIELD   *
*DCL FSSEQSLN BIT(8)  CONSTANT('04'X);       /* LENGTH OF ABOVE       *
*DCL FSEPRRH  BIT(24) CONSTANT('930100'X);   /* STAND-ALONE PACING    *
*                                            /* RESPONSE RH           *
*DCL FSDEONLY BIT(16) CONSTANT('0200'X);     /* DE ONLY STATUS        *
*DCL FSSNAMSK BIT(16) CONSTANT('3FFF'X);     /* MASK TO ZERO FIRST TWO
*                                               BITS OF STATUS        *
*/* *****        NETWORK MANAGER CONTROL BLOCK                ****** */
*/*                                                                  */
*/*  REVISIONS                                         003 08/15/75  */
*/*                                                                  */
*DCL  1  ISTNMLPB BASED,                                           0519
*        2  NMLCPB CHAR(LENGTH(ISTLCPB)), /* INCLUDE PTIOS LCPB      */
*        2  NMLCW2 CHAR(LENGTH(ISTLCCW)), /* NETWORK MANAGER LCCW    */
*        2  NMLCW3 CHAR(LENGTH(ISTLCCW)), /* NETWORK MANAGER LCCW    */
*        2  NMCONTRL CHAR(8) BDY(WORD), /* CONTROL FIELDS            */
*           3  NMFNCTCD BIT(8),        /* NETWORK MNGR FUNCTION CODE */
*           3  NMPSRTRY CHAR(1),       /*PORT SOLICITOR I/O RTRY COUNT*
*           3  NMLCWCMD CHAR(2),       /* NMLPB NETWORK MNGR LCCW COM-
*                                         MANDS (PS) INDICATORS      */
*              4  NMINVT BIT(1),       /* INVITE                     */
*              4  NMCNTCT BIT(1),      /* CONTACT                    */
*              4  NMRESTI BIT(1),      /* RESET IMMEDIATE          0519
*                                        COMMAND OUTSTANDING         */
*              4  NMPURGE BIT(1),      /* PURGE (RESET)              */
*              4  NMDSEOC BIT(1),      /* DISCONNECT WITH END OF CALL*/
*              4  NMRDBLK BIT(1),      /* READ BLOCK                 */
*              4  NMFBDTA BIT(1),      /* LOAD/DUMP I/O REQUEST    0519
*                                         EXPECTS DATA RETURNED      */
*              4  NMSTCTLR BIT(1),     /* START CONTROL RESTART    0519
*                                         (FUNCTION CODE MUST BE   0519
*                                         NMFCD01)                   */
*              4  NMSTCTLI BIT(1),     /* START CONTROL INITIAL    0519
*                                         (FUNCTION CODE MUST BE   0519
*                                         NMFCD01)                   */
*              4  NMSTCTLF BIT(1),     /* START CONTROL FINAL      0519
*                                         (FUNCTION CODE MUST BE   0519
*                                         NMFCD01)                   */
*              4  NMVRYPRG BIT(1),     /* VARY DEACT IMMED ISS PURGE */
*              4  NMECRST  BIT(1),     /* RESET NOT DONE BY CLOSEDST */
*              4  NMRSV01 BIT(4),      /* NOT ASSIGNED               */
*           3  NMRDTEA PTR(31),        /* END CONTROL TERM RDRE ADDR */
*              4  NMNCSPL PTR(31),     /* ADDR OF NCSPL FOR REMOTE 0519
*                                         LOAD/DUMP SUBTASK          */
*        2  NMIPSEQ FIXED(8),          /* INVITE PERPETUAL COUNT     */
*        2  NMLRSV06 BIT(8),           /* RESERVED                   */
*        2  NMLRSV02 CHAR(2),          /* RESERVED                   */
*        2  NMECBPTR PTR(31),          /* ADDR OF LOAD/DUMP SUBTASK'S
*                                         ECB TO BE POSTED           */
*        2  NMLDRDTE PTR(31),          /* RDTE ADDR FOR CLOSE        */
*                                      /* UNDER ABEND                */
*        2  NMLRSV04 PTR(31),          /* RESERVED                   */
*        2  NMLRSV05 PTR(31);          /* RESERVED                   */
*DCL  NMLPBTYP BIT(8) CONSTANT('27'X), /* NETWORK MNGR LCPB TYPE CODE*/
*     NMFCD01 BIT(8) CONSTANT('01'X),  /* FIRST TIME START CONTROL   */
*     NMFCD02 BIT(8) CONSTANT('02'X),  /* REDRIVE PORT               */
*     NMFCD03 BIT(8) CONSTANT('03'X),  /* STRT INPUT (RESET(READ))   */
*     NMFCD04 BIT(8) CONSTANT('04'X),  /* END CONTROL                */
*     NMFCD05 BIT(8) CONSTANT('05'X),  /* LOAD/DUMP I/O REQUEST      */
*     NMFCD06 BIT(8) CONSTANT('06'X);  /* DUMP I/O REQUEST           */
*/* END OF ATBUILD */                                              0521
*                                                                  0521
*/* ATBUILD (ISTFMCB)  */                                          0521
*/*      VTAM PROCESS OPTION DEFINITION BLOCK                       */
*/*  USE RESERVED BIT                                  002 06/10/74 */
*/*  MOVED PROCPUID FROM BYTE 1 TO BYTE 2                  05/09/78 */
*DECLARE                                                           0521
*  1 ISTPROCD BDY(WORD) BASED,                                     0521
*    2 PROPROC  BIT(32),          /* PROCESSING OPTIONS             */
*      3 PROPROC1 BIT(8),         /* PROCESSING OPTIONS - 1         */
*        4 PROASYIP BIT(1),       /* 1=ASYIPX 0=NASYIPX             */
*        4 PROTRUNC BIT(1),       /* 1=TRUNC 0=KEEP                 */
*        4 PROXPOPT BIT(1),       /* 1=BINARY 0=NBINARY             */
*        4 PRODFASY BIT(1),       /* PROC-0=NDFASYX/1=DFASYX        */
*        4 PRORESPX BIT(1),       /* PROC-0=NRESPX/1=RESPX          */
*        4 PROCA    BIT(1),       /* 1=RECEIVE ANY CA/0=NO CA       */
*        4 PROCS    BIT(1),       /* 1=RECEIVE ANY CS/0=NO CS       */
*        4 PRORPLC  BIT(1),       /* 1=OPTION IN RPL/0=NO RPL       */
*      3 PROPROC2 BIT(8),         /* PROCESSING OPTIONS - 2         */
*        4 PRORSV03 BIT(1),       /* RESERVED                       */
*        4 PROERPO  BIT(1),       /* 1=NERPOUT 0=ERPOUT             */
*        4 PROLGOT  BIT(1),       /* 1=NLGOUT 0=LGOUT               */
*        4 PRORSV04 BIT(1),       /* RESERVED                       */
*        4 PRORSV05 BIT(1),       /* RESERVED                       */
*        4 PRONTFL  BIT(1),       /* 1=NTMFLL 0=TMFLL               */
*        4 PROEMLC  BIT(1),       /* 1=ELC 0=NELC                   */
*        4 PROCFTX  BIT(1),       /* 1=CONFTXT 0=NCONFTXT           */
*      3 PROPROC3 BIT(8),         /* PROCESSING OPTIONS - 3         */
*        4 PRORSV07 BIT(1),       /* RESERVED                       */
*        4 PROERPI  BIT(1),       /* 1=NERPIN 0=ERPIN               */
*        4 PROLGIN  BIT(1),       /* 1=NLGIN 0=LGIN                 */
*        4 PRONTO   BIT(1),       /* 1=NTIMEOUT 0=TIMEOUT           */
*        4 PROSUBLK BIT(1),       /* OFF = INHIBIT SUBBLOCKING      */
*                                 /* ON = ALLOW SUBBLOCKING         */
*        4 PROMONIT BIT(1),       /* 1=MONITOR 0=NMONITOR           */
*        4 PROMONT2 BIT(1),       /* 1=MONITOR, 0=NMONITOR          */
*        4 PROMONT3 BIT(1),       /* 1=CONT.MONIT.          @ZA19910*/
*                                 /* 0=STOP AFTER FIRST ATTN@ZA19910*/
*      3 PROPROC4 BIT(8),         /* PROCESSING OPTIONS - 4         */
*        4 PROEIB   BIT(1),       /* 1=EIB 0=NEIB                   */
*        4 PRORSV12 BIT(1),       /* RESERVED                       */
*        4 PRORSV13 BIT(1),       /* RESERVED                       */
*        4 PRORSV14 BIT(1),       /* RESERVED                       */
*        4 PROMODB  BIT(1),       /* BLOCK                          */
*        4 PROMODM  BIT(1),       /* MSG                            */
*        4 PROMODT  BIT(1),       /* TRANS (DEFAULT)                */
*        4 PROMODC  BIT(1);       /* CONT                           */
*/*                                                                 */
*/*                                                                 */
*DCL 1 PROPROCS BASED(ADDR(ISTPROCD)),  /* REDEFINITION OF         0522
*                                          OPTIONS FOR SETMODE MASK  */
*     2  PRORSV41 BIT(8),               /* PROCESSING OPTIONS - 1    */
*     2  PROSETMS CHAR(3),              /* SETMODE OPTION BYTES      */
*        3  PROSETM2 BIT(8),            /* PROCESSING OPTIONS - 2    */
*           4  PRORSV42 BIT(5),         /* RESERVED                  */
*           4  PROSNTFL BIT(1),         /* INHIBIT TIME FILL       0522
*                                          SS - ONLY                 */
*           4  PRORSV43 BIT(2),         /* RESERVED                  */
*        3  PROSETM3 BIT(8),            /* PROCESSING OPTIONS - 3    */
*           4  PROCPUID BIT(1),         /* ON=SUPPRESS PROMPTING     */
*           4  PRORSV44 BIT(2),         /* RESERVED                  */
*           4  PROSNTO BIT(1),          /* ON = BSC - EIB INSERTION
*                                          SS - INHIBIT TIMEOUT      */
*           4  PRORSV45 BIT(1),         /* RESERVED                  */
*           4  PROSMONT BIT(1),         /* ON = MONITOR FOR ATTN   0522
*                                          INTS - SS ONLY            */
*           4  PRORSV46 BIT(2),         /* RESERVED                  */
*        3  PROSETM4 BIT(8),            /* PROCESSING OPTIONS - 4    */
*           4  PROSCON  BIT(1),         /* ON = CONTINUOUS MODE    0522
*                                          (TPIOS ONLY)              */
*           4  PRORSV47 BIT(5),         /* RESERVED                  */
*           4  PROSRDEF BIT(2);         /* RECORD DEFINITION       0522
*                                          01 = BLOCK, 10 = MSG,   0522
*                                          11 = TRANSMISSION         */
*DCL PROSBLCK BIT(8) CONSTANT('01'X); /* TO INDICATE BLOCK MODE      */
*DCL PROSMSG  BIT(8) CONSTANT('02'X); /* TO INDICATE MSG MODE        */
*DCL PROSTRNS BIT(8) CONSTANT('03'X); /* TO INDICATE TRANSMISSION  0525
*                                          MODE                      */
*DCL PROSCONT BIT(8) CONSTANT('83'X); /* TO INDICATE CONTINUOUS MODE */
*DCL PROSANDC BIT(8) CONSTANT('7F'X); /* TO EQUATE CONT TO TRANS   0527
*                                          FOR 370X                  */
*DCL PROSORC  BIT(8) CONSTANT('80'X); /* TO RESTORE CONT INDICATOR   */
*/* FUNCTION MANAGEMENT CONTROL BLOCK                                 *
*/*  DELTA                                             005 05/15/75   *
*DCL  1  ISTFMCB BDY(DWORD) BASED(FMCBPTR),                        0529
*        2  FMCTYPE CHAR(1),           /* CONTROL TYPE BLOCK CODE     *
*        2  FMCLNGTH PTR(8),           /* LENGTH IN BYTES             *
*        2  FMCSAF CHAR(2),            /* ID OF SOURCE                *
*        2  FMCNXTCB PTR(31),          /* ADDR OF NEXT FMCB IN ACDEB  *
*        2  FMCTSKID PTR(31),          /* TASK IDENTIFIER             *
*                                      /* OS - TCB ADDR, DOS - PIK    *
*        2  FMCDVTA PTR(31),           /* ADDR OF DVT ENTRY           *
*                                      /* POINT TABLE                 *
*        2  FMCDNCBA PTR(31),          /* ADDR OF DNCB FOR THIS NODE  *
*        2  FMCFMCBA PTR(31),          /* ADDR OF NEXT FMCB FOR THIS  *
*                                      /* NODE                        *
*        2  FMCUSFLD CHAR(4) BDY(WORD), /* USE INFO. FIELD            *
*        2  FMCSTAT BIT(8),            /* SOURCE STATUS INFO.         *
*          3  FMCPRMTR BIT(1),         /* FMCB IS A PREEMPTOR         *
*          3  FMCPRMTE BIT(1),         /* FMCB IS A PREEMPTEE         *
*          3  FMCDAPT  BIT(1),         /* DEVICE ACCEPTED             *
*          3  FMCDEVOF BIT(1),         /* DEVICE VARIED OR SET BY     *
*                                      /* VARY DSACT.                 *
*          3  FMCDEDSC BIT(1),         /* DEVICE DISCONNECTED         *
*          3  FMCZF007 BIT(1),         /* BUFFER TRACE ACTIVE FLAG    *
*          3  FMCLTEAS BIT(1),         /* LOST TERM EXIT SCHEDULED FOR
*                                         THIS FMCB                   *
*          3  FMCVSP1  BIT(1),         /* SOFT PURGE IN PROGRESS      *
*        2  FMCSTAT1 BIT(8),           /* STATUS INFORMATION          *
*          3  FMCVSP2  BIT(1),         /* A USER REQUEST WAS SOFT  0529
*                                         PURGED                      *
*          3  FMCHPURG BIT(1),         /* SESSION HAS BEEN HARD PURGED*
*          3  FMCLTCLS BIT(1),      /* LOST TERM EXIT SCHED FOR CLSDST*
*          3  *        BIT(5),         /* RESERVED                    *
*        2  *        CHAR(1),          /* RESERVED                    *
*        2  FMCCMDFL CHAR(1),          /* COMMAND FLAGS               *
*           3  FMCCMDR  BIT(1),        /* 1=INITIATE SELF REVD        *
*           3  FMCVSNA  BIT(1),        /* FMCB FOR VARY SESSION       *
*           3  FMCSNA   BIT(1),        /* USER SESSION WITH NEW DEV'S *
*           3  *        BIT(5),        /* RESERVED                    *
*        2  FMCDEBA PTR(31),           /* ADDR OF ACDEB               *
*        2  FMCCMPS1 FIXED(32),                                    0529
*           3  FMCBUFLM BIT(16),       /* LIMIT OF QUEUED BUFFERS     *
*           3  FMCBUFNB BIT(16),       /* NUMBER OF QUEUED BUFFERS    *
*        2  FMCRPLH PTR(31),           /* ADDR OF HELD RPL            *
*        2  FMCVWT   PTR(31),          /* RPH ADDR FOR VARY WAIT      *
*        2 FMCPROCD CHAR(LENGTH(ISTPROCD)),/*PROCESS OPTION FROM NIB  *
*        2  FMCMODE CHAR(8),              /* MODE NAME FROM NIB       *
*        2  FMCFASYA PTR(31),             /* DFASY ANY Q CHAIN        *
*        2  FMCPAB1 CHAR(LENGTH(ISTPAB)) BDY(DWORD),/* CONTROL LAYER
*                                           OUTBOUND PAB              *
*        2  FMCPAB2 CHAR(LENGTH(ISTPAB)) BDY(DWORD),/* CONTROL LAYER
*                                            INBOUND PAB              *
*        2  FMCPAB3 CHAR(LENGTH(ISTPAB)) BDY(DWORD),/* SYNCH WITH  0529
*                                           OUTBOUND PAB              *
*        2  FMCPAB4 CHAR(LENGTH(ISTPAB)) BDY(DWORD),/* TPIOS INBOUND
*                                           PAB                       *
*        2  FMCPAB5 CHAR(LENGTH(ISTPAB)) BDY(DWORD),/* TPIOS ALL BUT
*                                           SYNCH WITH OUTBOUND PAB   *
*        2  FMCEXLST PTR(31),         /* ADDRESS OF CEXLST            *
*        2  FMCSIPA  PTR(31),         /* ADDRESS OF SESSION CONTROL
*                                                   INBOUND PAB       *
*           3 FMCSIP PTR(31),         /* SCAFFOLD FOR DCR***          *
*        2  FMCNXOSQ FIXED(32),       /* NEXT OUTBOUND SEQUENCE NUMS. *
*           3 FMCNXCFM FIXED(16),     /* NEXT OUTBOUND FM SEQ. NUMBER *
*            4  FMCOSSN  BIT(16),                                  0529
*           3 FMCNXOSC FIXED(16),     /* NEXT OUTBOUND SC SEQ. NUMBER *
*            4  FMCOASN  BIT(16),                                  0529
*        2  FMCISSN  FIXED(16),       /* INBOUND SYNC SEQUENCE NUMBER *
*        2  FMCRVD01 CHAR(1),         /* FOR CONTROL LAYER XXXX       *
*        2  FMCSSTAT CHAR(1),         /* SESSION-CPM STATUS           *
*           3 FMCSNBI  BIT(1),        /* SESSION NOT BOUND            *
*           3 FMCCIPI  BIT(1),        /* TPIOS CLEAR IN PROGRESS      *
*           3 FMCUIPI  BIT(1),        /* UNBIND IN PROGRESS           *
*           3 FMCSDTR  BIT(1),        /* SDT REQUIRED                 *
*           3 FMCBIP   BIT(1),        /* BIND IN PROGRESS             *
*           3 FMCNSALU BIT(1),        /* NO SESSION EXISTS BETWEEN THE*
*                                     /* APPLICATION AND THE LU       *
*           3 FMCPURCH BIT(1),        /* TPIOS PURGING CHAIN START    *
*           3 FMCCONF  BIT(1),        /* SICK FLAG                    *
*        2  FMCPACE  FIXED(32),       /* PACING COUNTS                *
*           3 FMCPACEN CHAR(1),       /* N VALUE OF PACING            *
*            4  FMCNPCNT BIT(8),                                   0529
*           3 FMCPACEM CHAR(1),       /* M VALUE OF PACING            *
*            4  FMCMPCNT BIT(8),                                   0529
*           3 FMCPACPC FIXED(8),      /* CURRENT PACING COUNT         *
*            4  FMCCPCNT BIT(8),                                   0529
*           3  FMCCVAL  CHAR(1),      /* CHAIN VALUES                 *
*            4 FMCOBCE  BIT(4),       /* CURRENT OUTBOUND             *
*             5 FMCFIRST BIT(1),      /* FIRST PIECE                  *
*             5 FMCMIDLE BIT(1),      /* MIDDLE PIECE                 *
*             5 FMCLAST  BIT(1),      /* LAST PIECE                   *
*             5 FMCONLY  BIT(1),      /* ONLY PIECE                   *
*            4 FMCIBCE  BIT(2),       /* CURRENT INBOUND              *
*            4 FMCPRCLS BIT(2),       /* PRESENTATION CLASS,       0529
*                                           01=RECORD                 *
*        2 FMCCLEXT,                  /* BASIC CONTROL LAYER EXTENSION*
*         3  FMCRPLA PTR(31),          /* ADDR OF APPLICATION RPL     *
*            4  FMCRPLRS PTR(8),       /* RESERVED                    *
*            4  FMCRPLPT PTR(24),      /* POINTER TO RPL              *
*         3  FMCFBA PTR(31),           /* ADDR OF FSB DATA QUEUE      *
*            4  FMCFBRSV PTR(8),       /* RESERVED                    *
*            4  FMCFBPTR PTR(24),      /* POINTER TO FSB              *
*         3  FMCRAFM PTR(31),          /* ADDR OF FMCB ON ACDEB READ  *
*                                      /* ANY QUEUE                   *
*         3  FMCDCLOK CHAR(LENGTH(ISTLOK)),  /* CNTRL LAYER FMCB LOCK *
*         3  FMCCMPS2 FIXED(32),                                   0529
*            4  FMCFLGA CHAR(1),       /* FLAG FIELD 1 (CONTROL       *
*                                      /* LAYER)                      *
*               5  FMCFLGA0 BIT(1),    /* DATA EXPECTED               *
*               5  FMCFLGA1 BIT(1),    /* IN DIALOGUE                 *
*               5  FMCFLGA2 BIT(1),    /* FMCB ON ACDEB FOR READ ANY  *
*               5  FMCFLGA3 BIT(1),    /* INCOMING DATA FLUSH         *
*               5  FMCFLGA4 BIT(1),    /* PURGE IN PROGRESS           *
*               5  FMCFLGA5 BIT(1),    /* BUFFER THRESHOLD EXCEEDED   *
*               5  FMCFLGA6 BIT(1),    /* READ DONE TO 3735 (ON)      *
*               5  FMCFLGA7 BIT(1),      /* RESERVED       @Z40GKDS  */
*            4  FMCFLGCL CHAR(1),      /* FLAG FIELD2 (RECORD CONTROL *
*                                      /* LAYER)                      *
*               5 FMCFLGB0 BIT(1),     /* FMCB ON ACDEB DFASY ANY Q   *
*               5 FMCFLGB1 BIT(1),     /* FMCB ON ACDEB REQ ANY Q     *
*               5 FMCFLGB2 BIT(1),     /* SATISFY DFASY SPEC.         *
*               5 FMCFLGB3 BIT(1),     /* SATISFY RESP SPEC.          *
*               5 FMCFLGB4 BIT(1),     /* RESERVED                    *
*               5 FMCFLGB5 BIT(1),     /* POST=SCHED OUTSTANDING      *
*               5 FMCFLGB6 BIT(1),     /* HOLD RESPONSE OUTSTANDING   *
*               5 FMCFLGB7 BIT(1),     /* RESERVED                    *
*             4  FMCPSCMD CHAR(1),       /* PORT OUTSTANDING COMMAND
*                                           FIELD                    */
*               5  FMCINVT BIT(1),       /* INVITE                   */
*               5  FMCCNTCT BIT(1),      /* CONTACT                  */
*               5  FMCRESTI BIT(1),      /* RESET IMMEDIATE        0529
*                                          COMMAND OUTSTANDING       */
*               5  FMCPURGE BIT(1),      /* PURGE(RESET)             */
*               5  FMCDSEOC BIT(1),      /* DISCONNECT END OF CALL   */
*               5  FMCRDBLK BIT(1),      /* READ BLOCK(START       0529
*                                           INPUT)                   */
*               5  FMCRSV88 BIT(2),      /* NOT DEFINED              */
*            4  FMCPSTAT CHAR(1),        /* PORT SOLICITOR STATUS FLAGS
*                                                                    */
*               5  FMCELKST BIT(1),      /* ERROR LOCK SET           */
*               5  FMCIDVFD BIT(1),      /* TPIOS COULD NOT FIND   0529
*                                           A                        */
*               5  FMCDDOCD BIT(1),      /* DIAL DISCONNECT OCCURRED */
*               5  FMCPCLSD BIT(1),      /* PORT BEING CLOSED BY PORT
*                                           SOLICITOR                */
*               5  FMCRSV89 BIT(4),      /* RESERVED                 */
*           3  FMCPRMRC CHAR(1),         /* PURGE MINOR RETURN CODE  */
*        2  FMCBHSET CHAR(1),            /* BHSET ID INDEX FOR     0529
*                                           CONNECTED APPLICATION    */
*        2  FMCSTAT2 BIT(8),             /* PURGE FLAGS              */
*           3  FMCVPIP BIT(1),           /* VARY PURGE IN PROGRESS   */
*           3  FMCZF00A BIT(1),          /* PURGE SUCCESSFULLY     0529
*                                           COMPLETED                */
*           3  FMCIAIO BIT(1),           /* INHIBIT ALL I/O          */
*           3  FMCALIPR BIT(1),          /* ALLOCATION IN PROGRESS   */
*           3  FMCCPIP BIT(1),           /* CLSDST PURGE IN        0529
*                                           PROGRESS                 */
*           3  FMCSEQI BIT(1),           /* SEQ/ID, 1=SEQUENCE NUMBER*/
*           3  FMCPSPIP BIT(1),       /*PORTSOL PURGE IN PROG@ZA30004*/
*           3  FMCCDPIP BIT(1),       /*CLSDST PURGE IN PROG @ZA30004*/
*        2  FMCLUSTR BIT(8),             /* COUNT OF START CTLS REC  */
*        2  FMCIPSEQ FIXED(8),           /* INVITE PERPETUAL COUNT   */
*        2  FMCMODEB CHAR(1),            /* MODE BYTE                */
*           3 FMCHOLD  BIT(1),           /* BUFFER FLOOD CONDITION   */
*           3 FMCCLEAR BIT(1),           /* CLEAR IN PROGRESS        */
*           3 FMCAPQ   BIT(1),           /* APPLICATION QUIESCED     */
*           3 FMCLUQ   BIT(1),           /* LU QUIESCED              */
*           3 FMCRSTSR BIT(1),           /* RESETSR IN PROGRESS      */
*           3 FMCRESOT BIT(1),           /* RESPONSE OUTSTANDING     */
*           3 FMCIBPRG BIT(1),           /* I/B PURGE CHAIN          */
*           3 FMCOBPRG BIT(1),           /* O/B PURGE CHAIN          */
*        2  FMCCLSEQ CHAR(4),            /* CL SEQUENCE NUMBERS      */
*           3 FMCTSQNO CHAR(2),          /* EXPECTED RESPONSE SEQ NR */
*           3 FMCBSQNO CHAR(2),          /* SQNO LAST RECEIVED       */
*        2  FMCCTLB  CHAR(1),            /* CTL TYPE OUTSTANDING     */
*        2  FMCRRESP CHAR(1),            /* RESPOND TYPE EXPECTED    */
*           3 FMCFPE   BIT(1),           /* 1=PATH END RESPONSE      */
*           3 FMCFEX   BIT(1),           /* 1=EXCEPTION RESPONSE     */
*           3 FMCFME   BIT(1),           /* 0=FUNCTION MNMT END RESP */
*           3 FMCFRRN  BIT(1),           /* 1=REACHED RECOVERY MODE  */
*           3 FMCTSLHA BIT(1),           /* 1=TERM SELF LAST HAS ARVD*/
*           3 *        BIT(3),           /* RESERVED                 */
*        2  FMCPSTRS CHAR(2),            /* CNT OUTSTANDING POST=RESP*/
*        2  FMCRSPLM CHAR(2),            /* RESPLIM VALUE            */
*        2  FMCSSEGQ PTR(31),            /* SYNC FLOW SEGMENT QUEUE  */
*           3  FMCSEGD  PTR(31),         /* SEGMENTED INPUT DATA QUE */
*        2  FMCLOCK CHAR(LENGTH(ISTLOK)), /* FMCB LOCK               */
*        2  FMCRDTPT PTR(31),            /* PTR TO RDTE AFTER FMCB 0529
*                                           DISCONNECT               */
*        2  FMCASEGQ PTR(31),            /* ASYN FLOW SEGMENT QUEUE  */
*        2  FMCFBAS  PTR(31),            /* DFASY DATA Q PTR         */
*           3 FMCZV002 PTR(31),          /* RESET ORDERLY LCPB ADDR  */
*             4 FMCFBXM  PTR(31),        /* PTR TO 1ST BUFFER OF TRAN*/
*        2  FMCFBRE  PTR(31),            /* RESP DATA Q PTR          */
*        2  FMCSNCTL CHAR(4),            /* SESSION CONTROL FIELD    */
*           3 FMCSCFLG CHAR(1),          /* FLAG BYTE                */
*             4 FMCIBSAC BIT(2),         /* SAVE IBSQAC              */
*             4 FMCOBSAC BIT(2),         /* SAVE OBSQAC              */
*             4 FMCLURO  BIT(1),         /* LU OWES RESPONSE         */
*             4 FMCAPRO  BIT(1),         /* APPL OWES RESPONSE       */
*             4 FMCSCCLO BIT(1),         /* CLEAR OUTSTANDING        */
*             4 FMCSTCTL BIT(1),         /* 1=CLUS ALREADY SCHED     */
*           3 FMCSCCTL CHAR(1),          /* SC LAST CTL RECEIVED     */
*           3 FMCSCSQN BIT(16),          /* SC LAST SEQ NR RECEIVED  */
*        2  FMCFRESA PTR(31),            /* RESP ANY Q CHAIN PTR     */
*/* END OF COMMON AREA...EXCEPT CONSTANTS                            */
*/*                                                                  */
*/*   VS1 TPIOS EXTENSION                                            */
*/*                                                                  */
*     2  FMCVS1,                        /* VS1 EXTENSION             */
*        3  FMCZFLAG BIT(32),           /* VS/1 TPIOS FLAGS          */
*           4  FMCZF001 BIT(1),         /* LSCB BTW ALLOCATION REQUIRED
*                                                                    */
*           4  FMCZF002 BIT(1),         /* I/O SCHEDULING TO BE    0529
*                                          SUSPENDED                 */
*           4  FMCZF003 BIT(1),         /* TPIOS WAIT IS FOR 370X  0529
*                                          SLOWDOWN                  */
*           4  FMCZF004 BIT(1),         /* READ OUTSTANDING FLAG     */
*           4  FMCZF005 BIT(1),         /* 1ST BSC (SWITCH) TRANS  0529
*                                          ACTION                    */
*           4   FMCZF006 BIT(4),        /* DEVICE SESSION STATUS IN
*                                          OUTBOUND SCHEDULING       */
*              5  FMCZFA06 BIT(1),      /* IN SESSION                */
*              5  FMCZFB06 BIT(1),      /* INVITE OUTSTANDING        */
*              5  FMCZFC06 BIT(1),      /* CONTACT OUTSTANDING       */
*              5  FMCZFD06 BIT(1),      /* DISCONNECT OUTSTANDING    */
*           4  FMCZF009 BIT(1),         /* RESET AT END OF COMMAND 0529
*                                          (LOCAL 3270)              */
*           4  FMCRSV10 BIT(1),         /* RESERVED                  */
*           4  FMCZF00B BIT(1),         /* FMCB PREEMPTED FLAG       */
*           4  FMCZF00C BIT(1),         /* 1ST BLK IN MSG FLAG (O/B) */
*           4  FMCZF00D BIT(1),         /* TRM RECEIVED FLAG         */
*           4  FMCZF00E BIT(1),         /* PREEMPT PENDING FLG       */
*           4  FMCZF00F BIT(1),         /* PREEMPT LCCW FLAG         */
*           4  FMCZF010 BIT(1),         /* RESET IN PROGRESS (AND  0529
*                                          SUSPENDED)                */
*           4  FMCZF011 BIT(1),         /* RESET ERROR LOCK INHIBITED*/
*           4  FMCZF012 BIT(1),         /* FMCB IN CONTACT QUEUE     */
*           4  FMCZF013 BIT(1),         /* FMCB IN INVITE QUEUE      */
*           4  FMCZF014 BIT(1),         /* LSCB FLAG                 */
*           4  FMCZF015 BIT(1),         /* RESET CLEANUP PHASE 1   0529
*                                          EXEC                      */
*           4  FMCZF016 BIT(1),         /* DNCB LOCK HELD            */
*           4  FMCZF017 BIT(1),         /* APPLICATION I/O SCHEDQ LOCK
*                                          INVITE                    */
*           4  FMCZF018 BIT(1),         /* EOT RECV'D FLAG           */
*           4  FMCZF019 BIT(1),         /* RESET ORDERLY IN PROGRESS
*                                          FLAG                      */
*           4  FMCZF020 BIT(1),         /* TPIOS CONT IN PROGRESS    */
*           4  FMCZF021 BIT(1),         /* DISCONNECT IN PROGRESS    */
*           4  FMCZF022 BIT(1),         /* DELAYED SCHEDQ LOCK       */
*           4  FMCZF023 BIT(1),         /* RESET IN PROCESS          */
*           4  FMCZF024 BIT(1),         /* PHASE-3 RECEIVED FOR      */
*           4  FMCZF025 BIT(1),         /* PREEMPT IN QUEUE          */
*        3  FMCZH001 FIXED(16),         /* FMCB LINE STATE FIELD     */
*        3  FMCZFCSQ FIXED(16),         /* SEQ NUMBER OF LAST 1ST    */
*                                       /* IN CHAIN RU               */
*        3  FMCSHEDQ PTR(31),           /* APPLICATION I/O SCHEDULE Q*/
*        3  FMCLBXM  PTR(31),            /* PTR TO LAST BUFF OF TRANS*/
*           4  FMCSHEAQ PTR(31),        /* ASYNCH I/O SCHEDULE QUEUE */
*              5  *        PTR(8),                                 0529
*              5  FMCASCDQ PTR(24),     /* ASYNCH I/O SCHEDULE QUEUE
*                                          ADDRESS FIELD             */
*        3  FMCLCPBQ PTR(31),           /* APPLICATION FEEDBACK    0529
*                                          QUEUE                     */
*           4  FMCLCPB1 PTR(8),                                    0529
*           4  FMCLCPB2 PTR(24),        /* ADDRESS FIELD             */
*        3  FMCLCPAQ PTR(31),           /* ASYNCH FEEDBACK WAIT QUEUE*/
*           4  *        PTR(8),                                    0529
*           4  FMCAWATQ PTR(24),        /* ASYNCH FEEDBACK WAIT QUEUE
*                                          ADDRESS FIELD             */
*        3  FMCZV001 PTR(31),           /* DIALOGUE SCHEDULE QUEUE 0529
*                                          CHAIN POINTER             */
*        3  FMCZX001 FIXED(8),          /* APPLICATION SESSION COUNT */
*        3  FMCZX002 FIXED(8),          /* RESERVED                  */
*        3  FMCZX003 FIXED(8),          /* I/O SCHEDULE QUEUE COUNT  */
*        3  FMCZX004 FIXED(8),          /* STPR SCHEDULE COUNT       */
*        3  FMCZX005 FIXED(8),          /* NEGATIVE RESP TO POLL CTR */
*        3  FMCZX006 FIXED(8),          /* RESET COUNT               */
*        3  FMCSEQ1 FIXED(8),           /* REQ TAG SEQ CTR           */
*           4  FMCSEQ1T BIT(4),         /* REQUEST TAG OVERFLOW      */
*           4  FMCSEQ1B BIT(4),         /* REQUEST TAG COUNT         */
*        3  FMCZFLG2 BIT(8),            /* VS/1 TPIOS FLAGS          */
*           4  FMCZF026 BIT(1),         /* DEAD PREEMPT REMEMBER     */
*           4  FMCZF027 BIT(1),         /* DATA RECEIVED FLAG        */
*           4  *        BIT(6),         /* RESERVED                  */
*        3  FMCLOCK2 CHAR(LENGTH(ISTLOK)), /* FMCB LOCK WORD         */
*        3  FMCZV004 PTR(31),            /* RESET FOR LCP FSB BFR ADDR
*                                                                    */
*        3  FMCCVFLG BIT(8),                                       0529
*           4 FMCVYRPH BIT(1),         /* THIS IS VARYS RPH          */
*           4 FMCPSRPH BIT(1),        /*WAIT ON PORTSOL PURGE@ZA30004*/
*           4 FMCCDRPH BIT(1),        /*WAIT ON CLSDST PURGE @ZA30004*/
*           4 FMCOWRPH BIT(1),         /* WAIT ON OWN PURGE  @ZA30004*/
*           4 FMCFRRPH BIT(1),         /* WAIT IN OCCFR      @ZA30004*/
*           4 FMCRSV0X BIT(3),                                     0529
*        3  FMCCLRPH PTR(24);            /* RPH WAITING ON PURGE     */
*DCL 1 FMCFLAG BASED(ADDR(FMCPSCMD)),  /* ADDITIONAL CONTROL       0530
*                                         LAYER FLAGS                */
*      2  FMCFLGB CHAR(1),             /* FLAG FIELD 2 (CONTROL    0530
*                                         LAYER)                     */
*         3  FMCFLGA8 BIT(1),          /* RESET CONDITIONAL        0530
*                                         IS ACTIVE                  */
*         3  FMCFLRSV BIT(7);          /* UNUSED                     */
*/*                                                                  */
*/* ***********   FMCB LINE STATE EQUATES           *************    */
*/*                                                                  */
*DCL FMCZHF01 BIT(16) CONSTANT('0005'X); /* NEG RESP TO POLLING    0531
*                                          (RESET PHASE)             */
*DCL FMCZHF11 BIT(16) CONSTANT ('0004'X); /* NEG RESP TO POLLING   0532
*                                          (DISC. PHASE)             */
*DCL FMCZHF21 BIT(16) CONSTANT ('0006'X);  /* NEG RESP TO POLLING  0533
*                                          (INVITE PHASE)            */
*DCL FMCZHF31 BIT(16) CONSTANT ('0000'X);  /* NULL (NORMAL) STATE    */
*DCL FMCZHF41 BIT(16) CONSTANT ('0007'X);  /* RESCHEDULE STATE       */
*DCL FMCZHF51 BIT(16) CONSTANT ('B007'X);  /* ERROR/RESCHEDULE STATE
*                                                                    */
*DCL FMCZHF61 BIT(16) CONSTANT ('9007'X);  /* LOCICAL ERROR STATE    */
*DCL FMCZHF71 BIT(16) CONSTANT ('A007'X);  /* PHYSICAL ERROR STATE   */
*DCL FMCZHF81 BIT(16) CONSTANT ('0008'X);  /* PREEMPT PENDING STATE  */
*DCL FMCZHRIP BIT(16) CONSTANT ('1000'X);  /* RESYNCH IN PROGRESS    */
*/* COMMON CONSTANTS FOLLOW                                          */
*DCL FMTYPE   BIT(8) CONSTANT('03'X);    /* TYPE CODE FOR FMCB       */
*DCL FMCOBCEI BIT(4) CONSTANT('0001'B);                            0542
*DCL FMCIBCEI BIT(2) CONSTANT('11'B);                              0543
*DCL FMCRCD   CHAR(8) CONSTANT('RECORD  '); /* EQUATE FOR RECORD MODE *
*DCL FMCPSOL  CHAR(8) CONSTANT('ISTYPSOL'); /* EQUATE FOR PORT SOLICIT*
*                                           /* SKELETON DVT           *
*/* END OF ATBUILD */                                       /*@DL31HMD*
*DCL TIEPTR PTR(31) REG(4),                        /* BASE FOR ISTTIE
*                                                            @DL31HMD*/
*    IFTPTR PTR(31),                        /* BASE FOR ISTIFTPL     */
*    RDTEPTR PTR(31),                       /* RDTE BASE             */
*    LDNCBPTR PTR(31),                      /* BASE FOR LDNCB        */
*    CVTPTR PTR(31) CONSTANT(0),            /* BECAUSE CVT USES IT   */
*    AVTPTR PTR(31) CONSTANT(0),            /* BECAUSE ISTAVT USES   */
*    RPARM0 PTR(31) REG(0),                 /* PARM REG 0            */
*    RPARM2 PTR(31) REG(2),                 /* PARM REG 2            */
*    RSAVE PTR(31) REG(13),                 /* SAVE REGISTER         */
*    RCDREG PTR(31) REG(15);                /* RETURN CODE REG       */
*DCL TIDINCMS BIT(8) CONSTANT('03'X);                              0547
*DCL CREG14 PTR(31) REG(14),    /* REG 14                    @DL31HMD*/
*    CSAVE  PTR(31) REG(5),     /* SAVE REG 14               @DL31HMD*/
*    LCPBPTR PTR(31) REG(6),    /* LCPB POINTER              @DL31HMD*/
*    FMCBPTR PTR(31) REG(10),   /* FMCB ADDR CHANGED FOR VS2 @DL31HMD*/
*    FSBPTR  PTR(31) REG(8),    /* FSB ADDR                  @DL31HMD*/
*    FDBPTR  PTR(31) REG(9),    /* FDB ADDR                  @DL31HMD*/
*    QPTR    PTR(31) BASED;     /* FOR FSB FREE              @DL31HMD*/
*DCL ZERB BIT(1) CONSTANT('0'B),            /* BIT OFF               */
*    ONEB BIT(1) CONSTANT('1'B);            /* BIT ON                */
*DCL CMS0 CONSTANT(0);                      /*ZERO           @DM14348*/
*DCL ZAPREG BIT(32) CONSTANT('7FFFFFFF'X),  /* HIGH BIT OFF          */
*    HIGHON BIT(32) CONSTANT('80000000'X),  /* TURN ON HIGH BIT      */
*    SAFOFF BIT(32) CONSTANT('0000FFFF'X);  /* CLEAR SAF             */
*DCL 1 INCMS001 BASED(IFTPABPR),            /* DSECT FOR AREA        */
*      2 INCMSVPB PTR(31),                  /* VARY PAB POINTER      */
*      2 INCMSDAF BIT(16),                  /* DAF FIELD             */
*      2 INCMSVAF BIT(16);                  /* MAJOR DAF             */
*DCL ISTOCCDF ENTRY BASED(ATCSRTDF) VALUERANGE(*);         /*@DM93160*/
*DCL RPHSAV REG(3) PTR(31); /* USED TO SAVE RPH ADDR         @DM93170*/
*RFY TIEPTR RSTD;                                          /*@DL31HMD*/
*TIEPTR = RPHWEA;                           /* GET ADDRESS OF ISTTIE */
         L     TIEPTR,RPHWEA(,RPHPTR)                              0556
*RFY ISTTIE BASED(TIEPTR);                  /* TELL COMPILER         */
*/*  TEST FOR TERM REQUEST FOR TEST                          @DL31HMD*/
*IF TIEREQ = TIEREQ0 /* TERM REQUEST                         @DL31HMD*/
*   THEN CALL TRMHDL; /*YES                                  @DL31HMD*/
         CLI   TIEREQ(TIEPTR),0                                    0558
         BNE   @RF00558                                            0558
         BAL   @14,TRMHDL                                          0559
*ELSE DO;    /* NOT REQUEST FOR TEST CONTINUE                @DL31HMD*/
         B     @RC00558                                            0560
@RF00558 DS    0H                                                  0561
*IFTPTR = TIEPTR1;                          /* GET ADDRESS OF IFTPL  */
         L     IFTPTR,TIEPTR1(,TIEPTR)                             0561
*RFY ISTIFTPL BASED(IFTPTR);                /* TELL COMPILER         */
*RFY ISTCRA BASED(RPHCRR);                  /* BASE THE CRA          */
*RFY ISTDCCRR BASED(CRACRR);                /* BASE THE VARY CRR     */
*IFTVOCLK = ZERB;                           /* CLEAR LOCK BIT        */
*IFTRDTLK = ZERB;                           /* CLEAR THE LOCK BIT    */
         NI    IFTVOCLK(IFTPTR),B'10011111'                        0566
*IFTRETCD = 0;                              /* CLEAR THE RETURN CODE */
         MVI   IFTRETCD(IFTPTR),X'00'                              0567
*RFY RCDREG RSTD;                           /* KEEP THE RETURN CODES */
*                                                                  0568
* DO; /* LISATCVT CVTBASE(PAGEABLE,(RCDREG)) */                    0569
*   RCDREG = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0570
         L     RCDREG,ATCLCPTR                                     0570
* END; /*LISATCVT*/                                                0571
*CRRATCVT = RCDREG;                         /* GET ATCVT ADDRESS     */
         L     @14,RPHCRR(,RPHPTR)                                 0572
         L     @14,CRACRR(,@14)                                    0572
         ST    RCDREG,CRRATCVT+12(,@14)                            0572
*RFY ISTATCVT BASED(CRRATCVT);              /* TELL COMPILER         */
*/*** START -TPLOCK (VOCLOCK)TYPE(SHARE)- ***/                     0574
* DO;                                                              0574
* DCL GPR05F FIXED(31) REG(05);                                    0575
* DCL GPR05P PTR(31)   REG(05);                                    0576
* DCL GPR06F FIXED(31) REG(06);                                    0577
* DCL GPR06P PTR(31)   REG(06);                                    0578
* DCL GPR07F FIXED(31) REG(07);                                    0579
* DCL GPR07P PTR(31)   REG(07);                                    0580
* DCL GPR08F FIXED(31) REG(08);                                    0581
* DCL GPR08P PTR(31)   REG(08);                                    0582
* DCL GPR09F FIXED(31) REG(09);                                    0583
* DCL GPR09P PTR(31)   REG(09);                                    0584
* DCL GPR10F FIXED(31) REG(10);                                    0585
* DCL GPR10P PTR(31)   REG(10);                                    0586
* DCL GPR11F FIXED(31) REG(11);                                    0587
* DCL GPR11P PTR(31)   REG(11);                                    0588
* DCL GPR12F FIXED(31) REG(12);                                    0589
* DCL GPR12P PTR(31)   REG(12);                                    0590
* DCL GPR13F FIXED(31) REG(13);                                    0591
* DCL GPR13P PTR(31)   REG(13);                                    0592
* DCL GPR14F FIXED(31) REG(14);                                    0593
* DCL GPR14P PTR(31)   REG(14);                                    0594
*                                                                  0594
* DCL GPR00F FIXED(31) REG(00);                                    0595
* DCL GPR00P PTR(31)   REG(00);                                    0596
* DCL GPR01F FIXED(31) REG(01);                                    0597
* DCL GPR01P PTR(31)   REG(01);                                    0598
* DCL GPR02F FIXED(31) REG(02);                                    0599
* DCL GPR02P PTR(31)   REG(02);                                    0600
* DCL GPR03F FIXED(31) REG(03);                                    0601
* DCL GPR03P PTR(31)   REG(03);                                    0602
* DCL GPR04F FIXED(31) REG(04);                                    0603
* DCL GPR04P PTR(31)   REG(04);                                    0604
* DCL GPR15F FIXED(31) REG(15);                                    0605
* DCL GPR15P PTR(31)   REG(15);                                    0606
* RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;            0607
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*        GPR15P = ATCAP35;              /*ADDRESS OF LOCK ROUTINE*/
         L     @12,RPHCRR(,RPHPTR)                                 0609
         L     @12,CRACRR(,@12)                                    0609
         L     @12,CRRATCVT+12(,@12)                               0609
         L     GPR15P,ATCAP35(,@12)                                0609
*        GPR02P = ADDR(ATCVOCLK);       /*SET PARAM - LOCKWORD PTR*/
         LA    GPR02P,ATCVOCLK(,@12)                               0610
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0611
         L     GPR04P,RPHCRR(,GPR01P)                              0611
*        GPR00P = CRALMS02;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,2                                            0612
*        GPR03P = ADDR(GPR04P->CRAL2PTR);                          0613
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0613
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*        DCL FMZL0013 BASED(GPR15P) LABEL VALUERANGE(*);           0614
*        CALL FMZL0013;                                            0615
         BALR  @14,@15                                             0615
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      0616
*                                                                  0616
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
* RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;          0617
*        END;                                                      0618
*/*** END -TPLOCK (VOCLOCK)TYPE(SHARE)- ***/                       0619
*IF RCDREG ^= 0 THEN IFTRETCD = IFTRTN04; /* NO VOCLOCK      @DL31HLH*/
         LTR   RCDREG,RCDREG                                       0619
         BZ    @RF00619                                            0619
         MVI   IFTRETCD(IFTPTR),X'04'                              0620
* ELSE DO;                                                         0621
         B     @RC00619                                            0621
@RF00619 DS    0H                                                  0622
*  IFTVOCLK = ONEB;                         /* FLAG LOCK OBTAINED    */
*                                                                  0622
         OI    IFTVOCLK(IFTPTR),B'01000000'                        0622
*/*** START -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- ***/                   0623
*   DO;                                                            0623
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;          0624
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*        GPR15P = ATCAP36;              /*ADDRESS OF LOCK ROUTINE*/
         L     @12,RPHCRR(,RPHPTR)                                 0626
         L     @12,CRACRR(,@12)                                    0626
         L     @12,CRRATCVT+12(,@12)                               0626
         L     GPR15P,ATCAP36(,@12)                                0626
*        GPR02P = ADDR(ATCRDTLK);       /*SET PARAM - LOCKWORD PTR*/
         LA    GPR02P,ATCRDTLK(,@12)                               0627
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0628
         L     GPR04P,RPHCRR(,GPR01P)                              0628
*        GPR00P = CRALMS03;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,4                                            0629
*        GPR03P = ADDR(GPR04P->CRAL3PTR);                          0630
         LA    GPR03P,CRAL3PTR(,GPR04P)                            0630
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*        DCL FMZL0018 BASED(GPR15P) LABEL VALUERANGE(*);           0631
*        CALL FMZL0018;                                            0632
         BALR  @14,@15                                             0632
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      0633
*                                                                  0633
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;        0634
*        END;                                                      0635
*/*** END -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- ***/                     0636
*  IF RCDREG ^= 0 THEN IFTRETCD = IFTRTN08; /* SAY NO RDT LOCK       */
         LTR   RCDREG,RCDREG                                       0636
         BZ    @RF00636                                            0636
         MVI   IFTRETCD(IFTPTR),X'08'                              0637
*   ELSE DO;                                /* LOCK WAS OBTAINED     */
         B     @RC00636                                            0638
@RF00636 DS    0H                                                  0639
*    IFTRDTLK = ONEB;                       /* FLAG LOCK OBTAINED    */
         OI    IFTRDTLK(IFTPTR),B'00100000'                        0639
*RFY (RPARM0,RPARM2,RSAVE) RSTD;            /* GET REGS              */
*    RPARM2 = 0;                            /* CLEAR REG 2           */
         SLR   RPARM2,RPARM2                                       0641
*    RSAVE = ADDR(CRRSAREA);                /* POINT TO SAVE IN RPH  */
         L     @14,RPHCRR(,RPHPTR)                                 0642
         LA    @09,12                                              0642
         AL    @09,CRACRR(,@14)                                    0642
         LR    RSAVE,@09                                           0642
*    RPARM0 = ADDR(IFTSYMDV);               /* POINT TO NAME @DL31HMD*/
         LA    RPARM0,IFTSYMDV(,IFTPTR)                            0643
*    RPARM0 = RPARM0 × HIGHON;              /* SET HIGH BIT          */
         O     RPARM0,@CF01662                                     0644
*    CALL ISTOCCDF;                         /* FIND THE RDTE         */
         L     @12,CRRATCVT(,@09)                                  0645
         L     @15,ATCSRTDF(,@12)                                  0645
         BALR  @14,@15                                             0645
*    IF RCDREG ^= 0 THEN IFTRETCD = IFTRTN0C;/* SAY SRT FIND FAILED  */
         LTR   RCDREG,RCDREG                                       0646
         BZ    @RF00646                                            0646
         MVI   IFTRETCD(IFTPTR),X'0C'                              0647
*     ELSE DO;                              /* RDTE FOUND            */
         B     @RC00646                                            0648
@RF00646 DS    0H                                                  0649
*RFY (RPARM2,RSAVE) UNRSTD;                 /* RELEASE REGS          */
*      RDTEPTR = RPARM0;                    /* GET RDTE ADDR         */
         LR    RDTEPTR,RPARM0                                      0650
*RFY RPARM0 UNRSTD;                         /* RELEASE REG           */
*RFY ISTRDT BASED(RDTEPTR);                 /* BASE THE RDT          */
*RFY ISTRPRE BASED(RDTEPTR);                /* BASE THE PREFIX       */
*      IF IFTDEVOF = ONEB    /* RESET DEVOF FUNCTION         @DL31HMD*/
*         THEN DO; /* YES                                    @DL31HMD*/
         TM    IFTDEVOF(IFTPTR),B'00010000'                        0654
         BNO   @RF00654                                            0654
*         RFY (RPARM2,RCDREG) RSTD;                        /*@DL31HMD*/
*         RPARM2 = IFTPABPR;  /* GET CID                     @DL31HMD*/
*                                                                  0657
         L     RPARM2,IFTPABPR(,IFTPTR)                            0657
*           DO; /* CIDCTL(FIND)  */                                0658
*                                                                  0658
*           RFY (EMCR2,EMCR3) RSTD;                                0659
*             GEN SETS(RPHWORK)                                    0660
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0660
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*             EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                  0661
         SLR   EMCR3,EMCR3                                         0661
*             EMCR3 = '01'X; /*INDICATE SHARED LOCK*/              0662
         LA    EMCR3,1                                             0662
*             CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/
*                                                                  0663
         L     @12,ATCLCPTR                                        0663
         L     @15,ATCCDFND(,@12)                                  0663
         BALR  @14,@15                                             0663
*           RFY (EMCR2,EMCR3) UNRSTD;                              0664
*           END; /*CIDCTL*/    /* GET FMCB                    @DL31HMD*
*         IF RCDREG ^= 0 THEN IFTRETCD = IFTRTN24;/* NO FMCB @DL31HLH*/
         LTR   RCDREG,RCDREG                                       0666
         BZ    @RF00666                                            0666
         MVI   IFTRETCD(IFTPTR),X'24'                              0667
*         ELSE DO; /* RESET DEVOF                            @DL31HMD*/
         B     @RC00666                                            0668
@RF00666 DS    0H                                                  0669
*          RFY FMCBPTR RSTD;                               /*@DL31HMD*/
*          FMCBPTR = RPARM2; /* XFER FMCB ADDR               @DL31HMD*/
         LR    FMCBPTR,RPARM2                                      0670
*          RFY (RPARM2,RCDREG) UNRSTD;                     /*@DL31HMD*/
*          RFY ISTFMCB BASED(FMCBPTR);                     /*@DL31HMD*/
*          FMCDEVOF = ZERB;   /* RESET DEVOF                 @DL31HMD*/
         NI    FMCDEVOF(FMCBPTR),B'11101111'                       0673
*          RFY FMCBPTR UNRSTD;                             /*@DL31HMD*/
*          RFY RPARM2 RSTD;                                /*@DL31HMD*/
*          RPARM2 = IFTPABPR; /* GET CID                     @DL31HMD*/
*                                                                  0676
         L     RPARM2,IFTPABPR(,IFTPTR)                            0676
*            DO; /* CIDCTL(FINISH)  */                             0677
*                                                                  0677
*            RFY (EMCR2,EMCR3) RSTD;                               0678
*              GEN SETS(RPHWORK)                                   0679
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0679
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*              EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                 0680
         SLR   EMCR3,EMCR3                                         0680
*              CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/
*                                                                  0681
         L     @12,ATCLCPTR                                        0681
         L     @15,ATCCDFIN(,@12)                                  0681
         BALR  @14,@15                                             0681
*            RFY (EMCR2,EMCR3) UNRSTD;                             0682
*            END; /*CIDCTL*//* RELEASE LOCK                 @DL31HMD*/
*          RFY RPARM2 UNRSTD;                              /*@DL31HMD*/
*         END;                                             /*@DL31HMD*/
*      END;                                                /*@DL31HMD*/
@RC00666 DS    0H                                                  0687
*      IF IFTTBON = ONEB × IFTTBOFF = ONEB THEN /* TEST BIT CHANGE ? */
@RF00654 TM    IFTTBON(IFTPTR),B'11000000'                         0687
         BZ    @RF00687                                            0687
*DO;                                                               0688
*/********************************************************************/
*/*                                                                  */
*/* DOTESTBT - SEGMENT OF ISTINCMS                                   */
*/*                                                                  */
*/*           THIS SEGMENT SETS THE DEVICE-IN-TEST BIT IN THE RDTE   */
*/*           PREFIX ACCORDING TO THE REQUEST PASSED VIA THE FUNCTION*/
*/*           BYTE IN THE TOLTEP INTERFACE PARAMETER LIST (ISTIFTPL).*/
*/*                                                                  */
*/*      INPUTS: THE RDTE IS ADDRESSABLE,                            */
*/*              THE PARAMETER LIST IS ADDRESSABLE                   */
*/*                                                                  */
*/********************************************************************/
*IF IFTTBON = ONEB THEN DO;                 /* WANT TEST BIT ON ?    */
         TM    IFTTBON(IFTPTR),B'10000000'                         0689
         BNO   @RF00689                                            0689
* RPRINTST = ONEB;                          /* YES, TURN ON TEST     */
         OI    RPRINTST(RDTEPTR),B'00000001'                       0691
* IFTTBON = ZERB;                           /* RESET FUNCTION BIT    */
         NI    IFTTBON(IFTPTR),B'01111111'                         0692
* END;                                                             0693
*IF IFTTBOFF = ONEB THEN DO;                /* WANT TEST BIT OFF ?   */
@RF00689 TM    IFTTBOFF(IFTPTR),B'01000000'                        0694
         BNO   @RF00694                                            0694
* RPRINTST = ZERB;                          /* YES, TURN OFF TEST BIT*/
         NI    RPRINTST(RDTEPTR),B'11111110'                       0696
* IFTTBOFF = ZERB;                          /* RESET FUNCTION BIT    */
         NI    IFTTBOFF(IFTPTR),B'10111111'                        0697
*  IF RPRENTRY=RPRENTLC             /*IF ENTRY IS A LOCAL DEVICE*/ 0698
*      THEN DO;                                            /*@XM9804K*/
         CLI   RPRENTRY(RDTEPTR),X'45'                             0698
         BNE   @RF00698                                            0698
*         RFY (RPARM0,RPARM2,RCDREG,RSAVE) RSTD;       /*    @ZM32444*/
*         RPARM2=RPRCOMID & SAFOFF;          /* GET DAF      @ZM32444*/
*                                                                  0701
         L     RPARM2,RPRCOMID(,RDTEPTR)                           0701
         N     RPARM2,@CF05632                                     0701
*          DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */                   0702
*                                                                  0702
*          RFY (EMCR2,EMCR3) RSTD;                                 0703
*            GEN SETS(RPHWORK)                                     0704
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0704
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*            EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                   0705
         SLR   EMCR3,EMCR3                                         0705
*            EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/            0706
         LA    EMCR3,2                                             0706
*            CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/
*                                                                  0707
         L     @12,ATCLCPTR                                        0707
         L     @15,ATCCDFND(,@12)                                  0707
         BALR  @14,@15                                             0707
*          RFY (EMCR2,EMCR3) UNRSTD;                               0708
*          END; /*CIDCTL*/     /* GET NCB PTR  @ZM32444*/          0709
*         IF RCDREG=0 THEN                  /* NCB PTR FOUND @ZM32444*/
         LTR   RCDREG,RCDREG                                       0710
         BNZ   @RF00710                                            0710
*            DO;                                           /*@ZM32444*/
*              LDNCBPTR=RPARM0;     /* SAVE NIB PTR          @ZM32444*/
         LR    LDNCBPTR,RPARM0                                     0712
*              RFY ISTLDNCB BASED(LDNCBPTR);               /*@ZM32444*/
*              LDNZF006=ZERB;            /* TURN OFF DEVICE IN TEST
*                                             MODE IN LDNCB  @ZM32444*/
         L     @14,LDNZF006-3(,LDNCBPTR)                           0714
@GL00001 LR    @12,@14                                             0714
         N     @12,@CF05790                                        0714
         CS    @14,@12,LDNZF006-3(LDNCBPTR)                        0714
         BNE   @GL00001                                            0714
*              ADDR(LDNIOSB)->IOSDIE=0; /* ZERO DIE PTR      @ZM32444*/
         SLR   @14,@14                                             0715
         ST    @14,IOSDIE+412(,LDNCBPTR)                           0715
*              RPARM2=RPRCOMID & SAFOFF;     /* GET DAF      @ZM32444*/
*                                                                  0716
         L     RPARM2,RPRCOMID(,RDTEPTR)                           0716
         N     RPARM2,@CF05632                                     0716
*               DO; /* CIDCTL(FINISH)  */                          0717
*                                                                  0717
*               RFY (EMCR2,EMCR3) RSTD;                            0718
*                 GEN SETS(RPHWORK)                                0719
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0719
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                 EMCR3 = '00'X; /*CLEAR EXTRA BITS*/              0720
         SLR   EMCR3,EMCR3                                         0720
*                 CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*
*                                                                  0721
         L     @12,ATCLCPTR                                        0721
         L     @15,ATCCDFIN(,@12)                                  0721
         BALR  @14,@15                                             0721
*               RFY (EMCR2,EMCR3) UNRSTD;                          0722
*               END; /*CIDCTL*/                           /*@ZM32444*/
*            END;                                          /*@ZM32444*/
*         ELSE                                                     0725
*            IFTRETCD=IFTRTN20; /* INDICATE CID FIND FAILED  @ZA37060*/
         B     @RC00710                                            0725
@RF00710 MVI   IFTRETCD(IFTPTR),X'20'                              0725
*      END;                                                /*@ZM32444*/
*      ELSE IF (RPRENTRY=RPRENTTR   /*IF ENTRY IS A TERM UNDER AN LC*/
*             & RPRNSNEA->RPRENTRY=RPRENTLC)                       0727
*             THEN DO;        /*TURN OFF DEVICE IN TEST MODE @XM9804K*/
         B     @RC00698                                            0727
@RF00698 CLI   RPRENTRY(RDTEPTR),X'80'                             0727
         BNE   @RF00727                                            0727
         L     @14,RPRNSNEA(,RDTEPTR)                              0727
         CLI   RPRENTRY(@14),X'45'                                 0727
         BNE   @RF00727                                            0727
*         RPARM2=RPRNSNEA->RPRCOMID & SAFOFF;  /* GET DAF    @ZM32444*/
*                                                                  0729
         L     RPARM2,RPRCOMID(,@14)                               0729
         N     RPARM2,@CF05632                                     0729
*          DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */                   0730
*                                                                  0730
*          RFY (EMCR2,EMCR3) RSTD;                                 0731
*            GEN SETS(RPHWORK)                                     0732
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0732
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*            EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                   0733
         SLR   EMCR3,EMCR3                                         0733
*            EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/            0734
         LA    EMCR3,2                                             0734
*            CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/
*                                                                  0735
         L     @12,ATCLCPTR                                        0735
         L     @15,ATCCDFND(,@12)                                  0735
         BALR  @14,@15                                             0735
*          RFY (EMCR2,EMCR3) UNRSTD;                               0736
*          END; /*CIDCTL*/     /* GET NCB PTR  @ZM32444*/          0737
*         IF RCDREG=0 THEN                  /* NCB PTR FOUND @ZM32444*/
         LTR   RCDREG,RCDREG                                       0738
         BNZ   @RF00738                                            0738
*            DO;                                           /*@ZM32444*/
*              LDNCBPTR=RPARM0;     /* SAVE NIB PTR          @ZM32444*/
         LR    LDNCBPTR,RPARM0                                     0740
*              RFY ISTLDNCB BASED(LDNCBPTR);               /*@ZM32444*/
*              LDNZF006=ZERB;            /* TURN OFF DEVICE IN TEST
*                                             MODE IN LDNCB  @ZM32444*/
         L     @14,LDNZF006-3(,LDNCBPTR)                           0742
@GL00003 LR    @12,@14                                             0742
         N     @12,@CF05790                                        0742
         CS    @14,@12,LDNZF006-3(LDNCBPTR)                        0742
         BNE   @GL00003                                            0742
*              ADDR(LDNIOSB)->IOSDIE=0; /* ZERO DIE PTR      @ZM32444*/
         SLR   @14,@14                                             0743
         ST    @14,IOSDIE+412(,LDNCBPTR)                           0743
*              RPARM2=RPRNSNEA->RPRCOMID & SAFOFF; /*GET DAF @ZM32444*/
*                                                                  0744
         L     @14,RPRNSNEA(,RDTEPTR)                              0744
         L     RPARM2,RPRCOMID(,@14)                               0744
         N     RPARM2,@CF05632                                     0744
*               DO; /* CIDCTL(FINISH)  */                          0745
*                                                                  0745
*               RFY (EMCR2,EMCR3) RSTD;                            0746
*                 GEN SETS(RPHWORK)                                0747
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0747
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                 EMCR3 = '00'X; /*CLEAR EXTRA BITS*/              0748
         SLR   EMCR3,EMCR3                                         0748
*                 CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*
*                                                                  0749
         L     @12,ATCLCPTR                                        0749
         L     @15,ATCCDFIN(,@12)                                  0749
         BALR  @14,@15                                             0749
*               RFY (EMCR2,EMCR3) UNRSTD;                          0750
*               END; /*CIDCTL*/                           /*@ZM32444*/
*         RFY (RPARM0,RPARM2,RCDREG,RSAVE) UNRSTD;       /*  @ZM32444*/
*            END;                                          /*@ZM32444*/
*         ELSE                                                     0754
*            IFTRETCD=IFTRTN20; /* INDICATE CID FIND FAILED  @ZA37060*/
         B     @RC00738                                            0754
@RF00738 MVI   IFTRETCD(IFTPTR),X'20'                              0754
*                END;                                     /* @ZM32444*/
*             ELSE;            /*IF NEITHER, NO LDNCB EXISTS @ZM32444*/
@RF00727 DS    0H                                                  0757
* END;                                                             0757
@RC00727 DS    0H                                                  0757
@RC00698 DS    0H                                                  0758
*/********************************************************************/
*/* END OF SEGMENT DOTESTBT                                          */
*/********************************************************************/
*END;                                                              0758
@RF00694 DS    0H                                                  0759
*      IF IFTRETCD ^= 0 THEN;               /* ERROR ? SKIP REST     */
@RF00687 CLI   IFTRETCD(IFTPTR),0                                  0759
         BNE   @RT00759                                            0759
*       ELSE DO;                            /* OK SO FAR             */
*        IF IFTSTDAF = ONEB THEN            /* WANT DAF ?            */
         TM    IFTSTDAF(IFTPTR),B'00100000'                        0762
         BNO   @RF00762                                            0762
*DO;                                                               0763
*/********************************************************************/
*/*                                                                  */
*/* DODAF    - SEGMENT OF ISTINCMS                                   */
*/*                                                                  */
*/*           THIS SEGMENT OBTAINS THE DAF (DESTINATION ADDRESS      */
*/*           FIELD) FROM THE RDTE AND STORES IT IN THE STORAGE AREA */
*/*           WHICH IS POINTED TO BY THE PARAMETER LIST (IFTPABPR).  */
*/*                                                                  */
*/*      INPUTS: THE RDTE IS ADDRESSABLE,                            */
*/*              THE PARAMETER LIST IS ADDRESSABLE,                  */
*/*              THE STORAGE AREA IS ADDRESSABLE VIA THE LIST        */
*/*                                                                  */
*/********************************************************************/
*RFY ISTRLN BASED(RDTEPTR);                                /*@DL31HMD*/
*IF (RPRENTRY = RPRENTLN) & /* IF NODE IS A LINE             @DL31HMD*/
*   (RLNPORT = ONEB)        /* AND A SWITCHED LINE (PORT)    @DL31HMD*/
*   THEN DO;                                               /*@DL31HMD*/
         CLI   RPRENTRY(RDTEPTR),X'50'                             0765
         BNE   @RF00765                                            0765
         TM    RLNPORT(RDTEPTR),B'00010000'                        0765
         BNO   @RF00765                                            0765
*        RFY ISTRPT BASED(RDTEPTR);                        /*@DL31HMD*/
*        INCMSDAF = RPTLNDAF; /* PICK UP LINE DAF FROM PORT  @DL31HMD*/
         L     @12,IFTPABPR(,IFTPTR)                               0768
         MVC   INCMSDAF(2,@12),RPTLNDAF(RDTEPTR)                   0768
*        END;                                              /*@DL31HMD*/
*ELSE            /* NOT A PORT                               @DL31HMD*/
*INCMSDAF = RPRDAF;                         /* PUT THE DAF IN AREA   */
         B     @RC00765                                            0770
@RF00765 L     @12,IFTPABPR(,IFTPTR)                               0770
         MVC   INCMSDAF(2,@12),RPRDAF(RDTEPTR)                     0770
*IFTSTDAF = ZERB;                           /* TURN OFF STORE DAF BIT*/
@RC00765 NI    IFTSTDAF(IFTPTR),B'11011111'                        0771
*/********************************************************************/
*/* END OF SEGMENT DODAF                                             */
*/********************************************************************/
*END;                                                              0772
*        IF IFTRETCD ^= 0 THEN;             /* ERROR ? SKIP REST     */
@RF00762 CLI   IFTRETCD(IFTPTR),0                                  0773
         BNE   @RT00773                                            0773
*         ELSE DO;                          /* OK SO FAR             */
*          IF IFTFLNNM = ONEB THEN          /* WANT LINE NAME ?      */
         TM    IFTFLNNM(IFTPTR),B'00010000'                        0776
         BNO   @RF00776                                            0776
*DO;                                                               0777
*/********************************************************************/
*/*                                                                  */
*/* DOLINENM - SEGMENT OF ISTINCMS                                   */
*/*                                                                  */
*/*           THIS SEGMENT SEARCHES THE RDTE CHAIN (RPRNSNEA) FOR AN */
*/*           RDTE WHOSE TYPE IS 'LINE'. IF SUCH AN RDTE IS FOUND,   */
*/*           ITS SYMBOLIC NAME IS STORED IN THE OUTPUT NAME FIELD   */
*/*           OF THE PARAMETER LIST (IFTSYMRT). IF THE END OF THE    */
*/*           RDTE CHAIN IS REACHED WITHOUT FINDING A 'LINE' ENTRY   */
*/*           THE RETURN CODE IN THE PARAMETER LIST (IFTRETCD) IS    */
*/*           SET TO IFTRTN18 - UNEXPECTED RDT STRUCTURE.            */
*/*                                                                  */
*/*      INPUTS: THE RDTE IS ADDRESSABLE                             */
*/*              THE PARAMETER LIST IS ADDRESSABLE                   */
*/*                                                                  */
*/********************************************************************/
*DO WHILE IFTFLNNM = ONEB & RDTEPTR ^= 0;   /* SEARCH FOR LINE ENTRY */
         B     @DE00778                                            0778
@DL00778 DS    0H                                                  0779
* IF RPRENTRY = RPRENTLN THEN DO;           /* FIND ONE ?            */
         CLI   RPRENTRY(RDTEPTR),X'50'                             0779
         BNE   @RF00779                                            0779
*  IFTSYMRT = RPRNAME;                      /* PUT NAME IN PARM LIST */
         MVC   IFTSYMRT(8,IFTPTR),RPRNAME(RDTEPTR)                 0781
*  IFTFLNNM = ZERB;                         /* RESET FUNCTION BIT    */
         NI    IFTFLNNM(IFTPTR),B'11101111'                        0782
*  END;                                                            0783
*  ELSE DO;                                 /* NOT LINE ENTRY        */
         B     @RC00779                                            0784
@RF00779 DS    0H                                                  0785
*   RDTEPTR = RPRNSNEA;                     /* GET NEXT ENTRY        */
         L     RDTEPTR,RPRNSNEA(,RDTEPTR)                          0785
*   END;                                                           0786
*END;                                                              0787
@RC00779 DS    0H                                                  0787
@DE00778 TM    IFTFLNNM(IFTPTR),B'00010000'                        0787
         BNO   @DC00778                                            0787
         LTR   RDTEPTR,RDTEPTR                                     0787
         BNZ   @DL00778                                            0787
@DC00778 DS    0H                                                  0788
*IF IFTFLNNM = ONEB THEN IFTRETCD = IFTRTN18;/* UNEXPECTED RDT STRUCT*/
         TM    IFTFLNNM(IFTPTR),B'00010000'                        0788
         BNO   @RF00788                                            0788
         MVI   IFTRETCD(IFTPTR),X'18'                              0789
*/********************************************************************/
*/* END OF SEGMENT DOLINENM                                          */
*/********************************************************************/
*END;                                                              0790
@RF00788 DS    0H                                                  0791
*          IF IFTRETCD ^= 0 THEN;           /* ERROR ? SKIP REST     */
@RF00776 CLI   IFTRETCD(IFTPTR),0                                  0791
         BNE   @RT00791                                            0791
*           ELSE DO;                        /* OK SO FAR             */
*            IF IFTTBIO = ONEB × IFTTBIOF = ONEB THEN /* BLOCK I/O ? */
         TM    IFTTBIO(IFTPTR),B'00001100'                         0794
         BZ    @RF00794                                            0794
*DO;                                                               0795
*/********************************************************************/
*/*                                                                  */
*/* DOBLKIO - SEGMENT OF ISTINCMS                                    */
*/*                                                                  */
*/*          THIS SEGMENT SEARCHES THE RDTE CHAIN (RPRNSNEA) FOR AN  */
*/*          RDTE WHOSE TYPE IS 'LOCAL-DEVICE' (BEGINNING AT THE     */
*/*          CURRENT RDTE, WHETHER MODIFIED BY 'DOLINENM' OR FOUND   */
*/*          BY ISTOCCDF). IF SUCH AN RDTE IS FOUND, CIDCTL IS       */
*/*          ISSUED WITH THE FINDNCB OPTION AND A LOCK DAF REQUEST.  */
*/*          IF THE END OF THE RDTE CHAIN IS REACHED WITHOUT FINDING */
*/*          A 'LOCAL-DEVICE' ENTRY, THE RETURN CODE IN THE          */
*/*          PARAMETER LIST IS SET TO IFTRTN18 - UNEXPECTED RDT      */
*/*          STRUCTURE. IF THE CIDCTL IS SUCCESSFUL THE BLOCK I/O    */
*/*          BIT IN THE LDNCB IS SET ACCORDING TO THE BLOCK I/O      */
*/*          FUNCTION BIT IN THE PARAMETER LIST, AND A CIDCTL IS     */
*/*          ISSUED TO RELEASE THE DAF LOCK. IF THE CIDCTL IS        */
*/*          UNSUCCESSFUL, THE RETURN CODE IN THE PARAMETER LIST IS  */
*/*          SET TO IFTRTN20 - CID FIND FAILED.                      */
*/*                                                                  */
*/*      INPUTS: THE RDTE IS ADDRESSABLE                             */
*/*              THE PARAMETER LIST IS ADDRESSABLE                   */
*/*                                                                  */
*/********************************************************************/
*DO WHILE RDTEPTR ^= 0 & IFTRETCD = IFTRTN00 & (IFTTBIO = ONEB ×   0796
*                                               IFTTBIOF = ONEB);  0796
         B     @DE00796                                            0796
@DL00796 DS    0H                                                  0797
* IF RPRENTRY = RPRENTLC THEN DO;           /* FOUND LOCAL ENTRY ?   */
         CLI   RPRENTRY(RDTEPTR),X'45'                             0797
         BNE   @RF00797                                            0797
*RFY (RPARM0,RPARM2,RCDREG,RSAVE) RSTD;     /* GET NEEDED REGS       */
*  RPARM2 = RPRCOMID & SAFOFF;              /* GET SAF=0 AND DAF     */
*                                                                  0800
         L     RPARM2,RPRCOMID(,RDTEPTR)                           0800
         N     RPARM2,@CF05632                                     0800
*   DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */                          0801
*                                                                  0801
*   RFY (EMCR2,EMCR3) RSTD;                                        0802
*     GEN SETS(RPHWORK)                                            0803
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0803
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                          0804
         SLR   EMCR3,EMCR3                                         0804
*     EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/                   0805
         LA    EMCR3,2                                             0805
*     CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/       0806
*                                                                  0806
         L     @12,ATCLCPTR                                        0806
         L     @15,ATCCDFND(,@12)                                  0806
         BALR  @14,@15                                             0806
*   RFY (EMCR2,EMCR3) UNRSTD;                                      0807
*   END; /*CIDCTL*/                                                0808
*  IF RCDREG ^= 0 THEN IFTRETCD = IFTRTN20; /* SAY CID FIND FAILED   */
         LTR   RCDREG,RCDREG                                       0809
         BZ    @RF00809                                            0809
         MVI   IFTRETCD(IFTPTR),X'20'                              0810
*   ELSE DO;                                /* CID FIND WENT OK      */
         B     @RC00809                                            0811
@RF00809 DS    0H                                                  0812
*    LDNCBPTR = RPARM0;                     /* SAVE NCB PTR          */
         LR    LDNCBPTR,RPARM0                                     0812
*RFY (RPARM0,RPARM2,RCDREG,RSAVE) UNRSTD;   /* RELEASE REGS          */
*RFY ISTLDNCB BASED(LDNCBPTR);              /* BASE THE NCB          */
*    IF IFTTBIO = ONEB THEN DO;             /* WANT BLOCK I/O ON ?   */
         TM    IFTTBIO(IFTPTR),B'00001000'                         0815
         BNO   @RF00815                                            0815
*     LDNTPBIO = ONEB;                      /* TURN ON BLOCK I/O     */
         L     @12,LDNTPBIO-1(,LDNCBPTR)                           0817
@GL00006 LR    @09,@12                                             0817
         O     @09,@CF05794                                        0817
         CS    @12,@09,LDNTPBIO-1(LDNCBPTR)                        0817
         BNE   @GL00006                                            0817
*     IFTTBIO = ZERB;                       /* TURN OFF FUNCTION BIT */
         NI    IFTTBIO(IFTPTR),B'11110111'                         0818
*     END;                                                         0819
*    IF IFTTBIOF = ONEB THEN DO;            /* WANT BLOCK I/O OFF ?  */
@RF00815 TM    IFTTBIOF(IFTPTR),B'00000100'                        0820
         BNO   @RF00820                                            0820
*     LDNTPBIO = ZERB;                      /* TURN OFF BLOCK I/O    */
         L     @12,LDNTPBIO-1(,LDNCBPTR)                           0822
@GL00007 LR    @09,@12                                             0822
         N     @09,@CF05798                                        0822
         CS    @12,@09,LDNTPBIO-1(LDNCBPTR)                        0822
         BNE   @GL00007                                            0822
*     IFTTBIOF = ZERB;                      /* TURN OFF FUNCTION BIT */
         NI    IFTTBIOF(IFTPTR),B'11111011'                        0823
*     END;                                                         0824
*RFY (RPARM0,RPARM2,RCDREG,RSAVE) RSTD;     /* GET NEEDED REGS       */
@RF00820 DS    0H                                                  0826
*    RPARM2 = RPRCOMID & SAFOFF;            /* GET SAF=0 AND DAF     */
*                                                                  0826
         L     RPARM2,RPRCOMID(,RDTEPTR)                           0826
         N     RPARM2,@CF05632                                     0826
*     DO; /* CIDCTL(FINISH)  */                                    0827
*                                                                  0827
*     RFY (EMCR2,EMCR3) RSTD;                                      0828
*       GEN SETS(RPHWORK)                                          0829
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0829
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*       EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                        0830
         SLR   EMCR3,EMCR3                                         0830
*       CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/     0831
*                                                                  0831
         L     @12,ATCLCPTR                                        0831
         L     @15,ATCCDFIN(,@12)                                  0831
         BALR  @14,@15                                             0831
*     RFY (EMCR2,EMCR3) UNRSTD;                                    0832
*     END; /*CIDCTL*/                                              0833
*RFY (RPARM0,RPARM2,RCDREG,RSAVE) UNRSTD;   /* RELEASE REGS          */
*     END;                                                         0835
*  END;                                                            0836
*  ELSE DO;                                 /* NOT RIGTH TYPE        */
         B     @RC00797                                            0837
@RF00797 DS    0H                                                  0838
*   RDTEPTR = RPRNSNEA;                     /* GET NEXT RDTE         */
         L     RDTEPTR,RPRNSNEA(,RDTEPTR)                          0838
*   IF RDTEPTR = 0 THEN IFTRETCD = IFTRTN18;/* SAY UNEXPECTED RDT STR*/
         LTR   RDTEPTR,RDTEPTR                                     0839
         BNZ   @RF00839                                            0839
         MVI   IFTRETCD(IFTPTR),X'18'                              0840
*   END;                                                           0841
@RF00839 DS    0H                                                  0842
*END;                                                              0842
@RC00797 DS    0H                                                  0842
@DE00796 LTR   RDTEPTR,RDTEPTR                                     0842
         BZ    @DC00796                                            0842
         CLI   IFTRETCD(IFTPTR),0                                  0842
         BNE   @DC00796                                            0842
         TM    IFTTBIO(IFTPTR),B'00001100'                         0842
         BNZ   @DL00796                                            0842
@DC00796 DS    0H                                                  0843
*/********************************************************************/
*/* END OF SEGMENT DOBLKIO                                           */
*/********************************************************************/
*END;                                                              0843
*            IF IFTRETCD ^= 0 THEN;         /* ERROR ? SKIP REST     */
@RF00794 CLI   IFTRETCD(IFTPTR),0                                  0844
         BNE   @RT00844                                            0844
*             ELSE DO;                      /* OK SO FAR             */
*              IF IFTFLDNP = ONEB THEN      /* WANT LDNCP ADDRESS ?  */
         TM    IFTFLDNP(IFTPTR),B'00000010'                        0847
         BNO   @RF00847                                            0847
*DO;                                                               0848
*/********************************************************************/
*/*                                                                  */
*/* DOLDNPTR - SEGMENT OF ISTINCMS                                   */
*/*                                                                  */
*/*           THIS SEGMENT SEARCHES THE RDTE CHAIN (RPRNSNEA) FOR AN */
*/*           RDTE WHOSE TYPE IS 'LOCAL-DEVICE' (BEGINNING AT THE    */
*/*           CURRENT RDTE, WHETHER MODIFIED BY DOLINENM, DOBLKIO, OR*/
*/*           FOUND BY ISTOCCDF). IF SUCH AN RDTE IS FOUND, A CIDCTL */
*/*           IS ISSUED WITH THE FIND NCB OPTION. IF THE END OF THE  */
*/*           RDTE CHAIN IS REACHED WITHOUT FINDING A 'LOCAL-DEVICE' */
*/*           ENTRY, THE RETURN CODE IN THE PARAMETER LIST IS SET TO */
*/*           IFTRTN18 - UNEXPECTED RDT STRUCTURE. IF THE CIDCTL     */
*/*           IS SUCCESSFUL, THE ADDRESS OF THE LDNCB IS STORED IN   */
*/*           THE PARAMETER LIST (IFTLDNPR) AND CIDCTL IS ISSUED TO  */
*/*           RELEASE THE LDNCB. IF THE CIDCTL FAILS AND ITS RETURN  */
*/*           CODE INDICATES NO NCB EXISTS, THE PARAMETER LIST       */
*/*           RETURN CODE IS SET TO IFTRTN1C - LOCAL 3270 NOT OPEN.  */
*/*           IF THE CIDCTL FAILS AND ITS RETURN CODE IS NOT         */
*/*           'NO-NCB', THE RETURN CODE IN THE PARAMETER LIST IS SET */
*/*           TO IFTRTN20 - CID FIND FOR LDNCB FAILED.               */
*/*                                                                  */
*/*      INPUTS: THE RDTE IS ADDRESSABLE,                            */
*/*              THE PARAMETER LIST IS ADDRESSABLE                   */
*/*                                                                  */
*/********************************************************************/
*DO WHILE RDTEPTR ^= 0 & IFTRETCD = IFTRTN00 & IFTFLDNP = ONEB;    0849
         B     @DE00849                                            0849
@DL00849 DS    0H                                                  0850
* IF RPRENTRY = RPRENTLC THEN DO;           /* FOUND ?               */
         CLI   RPRENTRY(RDTEPTR),X'45'                             0850
         BNE   @RF00850                                            0850
*RFY (RPARM0,RPARM2,RCDREG,RSAVE) RSTD;     /* GET NEEDED REGS       */
*  RPARM2 = RPRCOMID & SAFOFF;              /* GET SAF=0 AND DAF     */
*                                                                  0853
         L     RPARM2,RPRCOMID(,RDTEPTR)                           0853
         N     RPARM2,@CF05632                                     0853
*   DO; /* CIDCTL(FIND)  */                                        0854
*                                                                  0854
*   RFY (EMCR2,EMCR3) RSTD;                                        0855
*     GEN SETS(RPHWORK)                                            0856
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0856
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                          0857
         SLR   EMCR3,EMCR3                                         0857
*     EMCR3 = '01'X; /*INDICATE SHARED LOCK*/                      0858
         LA    EMCR3,1                                             0858
*     CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/       0859
*                                                                  0859
         L     @12,ATCLCPTR                                        0859
         L     @15,ATCCDFND(,@12)                                  0859
         BALR  @14,@15                                             0859
*   RFY (EMCR2,EMCR3) UNRSTD;                                      0860
*   END; /*CIDCTL*/                                                0861
*  IF RCDREG ^= 0 THEN DO;                  /* IF CIDCTL FAILED      */
         LTR   RCDREG,RCDREG                                       0862
         BZ    @RF00862                                            0862
*   IF RCDREG = 12 THEN IFTRETCD = IFTRTN1C; /* SAY NOT OPENED       */
         C     RCDREG,@CF01491                                     0864
         BNE   @RF00864                                            0864
         MVI   IFTRETCD(IFTPTR),X'1C'                              0865
*    ELSE IFTRETCD = IFTRTN20;              /* SAY CID FIND FAILED   */
         B     @RC00864                                            0866
@RF00864 MVI   IFTRETCD(IFTPTR),X'20'                              0866
*   END;                                                           0867
*   ELSE DO;                                /* CID FIND WENT OK      */
         B     @RC00862                                            0868
@RF00862 DS    0H                                                  0869
*    IFTLDNPR = RPARM0;           /* STORE LDNCB PTR         @DL31HMD*/
         ST    RPARM0,IFTLDNPR(,IFTPTR)                            0869
*    IFTFLDNP = ZERB;                       /* TURN OFF FUNCTION BIT */
         NI    IFTFLDNP(IFTPTR),B'11111101'                        0870
*    RPARM2 = RPRCOMID & SAFOFF;            /* INSURE SAF=0, DAF     */
*                                                                  0871
         L     RPARM2,RPRCOMID(,RDTEPTR)                           0871
         N     RPARM2,@CF05632                                     0871
*     DO; /* CIDCTL(FINISH)  */                                    0872
*                                                                  0872
*     RFY (EMCR2,EMCR3) RSTD;                                      0873
*       GEN SETS(RPHWORK)                                          0874
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0874
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*       EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                        0875
         SLR   EMCR3,EMCR3                                         0875
*       CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/     0876
*                                                                  0876
         L     @12,ATCLCPTR                                        0876
         L     @15,ATCCDFIN(,@12)                                  0876
         BALR  @14,@15                                             0876
*     RFY (EMCR2,EMCR3) UNRSTD;                                    0877
*     END; /*CIDCTL*/                                              0878
*RFY (RPARM0,RPARM2,RCDREG,RSAVE) UNRSTD;   /* RELEASE REGS          */
*    END;                                                          0880
* END;                                                             0881
* ELSE DO;                                  /* NOT LOCAL             */
         B     @RC00850                                            0882
@RF00850 DS    0H                                                  0883
*  RDTEPTR = RPRNSNEA;                      /* GET NEXT RDTE         */
         L     RDTEPTR,RPRNSNEA(,RDTEPTR)                          0883
*  IF RDTEPTR = 0 THEN IFTRETCD = IFTRTN18; /* SAY UNEXPECTED RDT STR*/
         LTR   RDTEPTR,RDTEPTR                                     0884
         BNZ   @RF00884                                            0884
         MVI   IFTRETCD(IFTPTR),X'18'                              0885
*  END;                                                            0886
@RF00884 DS    0H                                                  0887
*END;                                                              0887
@RC00850 DS    0H                                                  0887
@DE00849 LTR   RDTEPTR,RDTEPTR                                     0887
         BZ    @DC00849                                            0887
         CLI   IFTRETCD(IFTPTR),0                                  0887
         BNE   @DC00849                                            0887
         TM    IFTFLDNP(IFTPTR),B'00000010'                        0887
         BO    @DL00849                                            0887
@DC00849 DS    0H                                                  0888
*/********************************************************************/
*/* END OF SEGMENT DOLDNPTR                                          */
*/********************************************************************/
*END;                                                              0888
*              IF IFTRETCD ^= 0 THEN;       /* ERROR ? SKIP REST     */
@RF00847 CLI   IFTRETCD(IFTPTR),0                                  0889
         BNE   @RT00889                                            0889
*               ELSE DO;                    /* OK SO FAR             */
*                IF IFTFPABP = ONEB THEN    /* WANT PAB ADDRESS ?    */
         TM    IFTFPABP(IFTPTR),B'00000001'                        0892
         BNO   @RF00892                                            0892
*DO;                                                               0893
*/********************************************************************/
*/*                                                                  */
*/* DOVRYPAB - SEGMENT OF ISTINCMS                                   */
*/*                                                                  */
*/*           THIS SEGMENT SEARCHES THE RDTE CHAIN (RPRNSNEA) FOR AN */
*/*           RDTE WHOSE TYPE IS 'LOCAL-CONTROLLER' (BEGINNING       */
*/*           WITH THE CURRENT RDTE, WHETHER MODIFIED BY DOLINENM,   */
*/*           DOBLKIO, OR DOLDNPTR OR FOUND BY ISTOCCDF). IF SUCH    */
*/*           AN RDTE IS FOUND, THE DAF IS PLACED IN THE AREA POINTED*/
*/*           TO BY THE PARAMETER LIST. THE SEARCH THEN CONTINUES    */
*/*           FOR AN RDTE WHOSE TYPE IS 'LOCAL HEADER' OR 'RN'. IF   */
*/*           AN RDTE IS FOUND, THE ADDRESS OF THE VARY PAB IS STORED*/
*/*           IN THE AREA POINTED TO BY THE PARAMETER LIST (IFTPABPR)*/
*/*           IF NO SUCH RDTE IS FOUND, THE PARAMETER LIST RETURN    */
*/*           CODE IS SET TO IFTRTN18 - UNEXPECTED RDT STRUCTURE.    */
*/*                                                                  */
*/*      INPUTS: THE RDTE IS ADDRESSABLE,                            */
*/*              THE PARAMETER LIST IS ADDRESSABLE                   */
*/*              THE STORAGE AREA IS ADDRESSABLE VIA THE LIST        */
*/*                                                                  */
*/********************************************************************/
*RFY RCDREG RSTD;                           /* GET A LOOP CONTROL SW */
*RCDREG = 0;                                /* CLEAR SWITCH          */
         SLR   RCDREG,RCDREG                                       0895
*DO WHILE RCDREG = 0;                       /* LOOK FOR ENTRY        */
         B     @DE00896                                            0896
@DL00896 DS    0H                                                  0897
* IF RPRENTRY = RPRENTLC THEN INCMSVAF = RPRDAF; /* STORE DAF        */
         CLI   RPRENTRY(RDTEPTR),X'45'                             0897
         BNE   @RF00897                                            0897
         L     @14,IFTPABPR(,IFTPTR)                               0898
         MVC   INCMSVAF(2,@14),RPRDAF(RDTEPTR)                     0898
*  ELSE;                                                   /*@XM12199*/
@RF00897 DS    0H                                                  0900
* IF RPRNSNEA = 0 × RPRENTRY = RPRENTRN                  /*  @XM12199*/
*    THEN RCDREG = ZAPREG;            /* IF DONE - STOP LOOP @XM12199*/
         L     @14,RPRNSNEA(,RDTEPTR)                              0900
         LTR   @14,@14                                             0900
         BZ    @RT00900                                            0900
         CLI   RPRENTRY(RDTEPTR),X'01'                             0900
         BNE   @RF00900                                            0900
@RT00900 DS    0H                                                  0901
         L     RCDREG,@CF02870                                     0901
*  ELSE RDTEPTR = RPRNSNEA;                 /* GET NEXT RDTE         */
         B     @RC00900                                            0902
@RF00900 L     RDTEPTR,RPRNSNEA(,RDTEPTR)                          0902
*END;                                       /* END OF SEARCH LOOP    */
@RC00900 DS    0H                                                  0903
@DE00896 LTR   RCDREG,RCDREG                                       0903
         BZ    @DL00896                                            0903
*IF (RPRENTRY ^= RPRENTRN) & (RPRENTRY ^= RPRENTLH) THEN IFTRETCD =
         CLI   RPRENTRY(RDTEPTR),X'01'                             0904
         BE    @RF00904                                            0904
         CLI   RPRENTRY(RDTEPTR),X'03'                             0904
         BE    @RF00904                                            0904
*                                                       IFTRTN18;  0905
         MVI   IFTRETCD(IFTPTR),X'18'                              0905
* ELSE DO;                                  /* LOCAL-HEADER OR RN    */
         B     @RC00904                                            0906
@RF00904 DS    0H                                                  0907
*  IF RPRENTRY = RPRENTRN THEN INCMSVAF = RPRDAF; /* IF RN GET DAF   */
         CLI   RPRENTRY(RDTEPTR),X'01'                             0907
         BNE   @RF00907                                            0907
         L     @14,IFTPABPR(,IFTPTR)                               0908
         MVC   INCMSVAF(2,@14),RPRDAF(RDTEPTR)                     0908
*  INCMSVPB = RDTTPAB;                 /* GET TOLTEP PAB PTR @ZM32443*/
@RF00907 L     @14,IFTPABPR(,IFTPTR)                               0909
         L     @12,RDTTPAB(,RDTEPTR)                               0909
         ST    @12,INCMSVPB(,@14)                                  0909
*  IFTFPABP = ZERB;                         /* TURN OFF FUNCTION BIT */
         NI    IFTFPABP(IFTPTR),B'11111110'                        0910
* END;                                                             0911
*/********************************************************************/
*/* END OF SEGMENT DOVRYPAB                                          */
*/********************************************************************/
*END;                                                              0912
@RC00904 DS    0H                                                  0913
*                END;                                              0913
@RF00892 DS    0H                                                  0914
*              END;                                                0914
@RT00889 DS    0H                                                  0915
*            END;                                                  0915
@RT00844 DS    0H                                                  0916
*          END;                                                    0916
@RT00791 DS    0H                                                  0917
*        END;                                                      0917
@RT00773 DS    0H                                                  0918
*      END;                                                        0918
@RT00759 DS    0H                                                  0919
*    END;                                                          0919
@RC00646 DS    0H                                                  0920
*  END;                                                            0920
@RC00636 DS    0H                                                  0921
*IF IFTRDTLK = ONEB THEN DO;                /* HOLD RDT LOCK ?       */
*                                                                  0921
@RC00619 TM    IFTRDTLK(IFTPTR),B'00100000'                        0921
         BNO   @RF00921                                            0921
*/*** START -TPUNLOCK (RDTLOCK)- ***/                              0923
*  DO;                                                             0923
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             0924
*/* END OF ATBUILD */                                              0924
*                                                                  0924
*  RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;           0924
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*        GPR02P = ADDR(ATCRDTLK);       /*SET PARAM - LOCKWORD PTR*/
         L     @14,RPHCRR(,RPHPTR)                                 0926
         L     @14,CRACRR(,@14)                                    0926
         L     GPR02P,CRRATCVT+12(,@14)                            0926
         LA    GPR02P,ATCRDTLK(,GPR02P)                            0926
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0927
         L     GPR04P,RPHCRR(,GPR01P)                              0927
*        GPR00P = CRALMS03;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,4                                            0928
*        GPR03P = ADDR(GPR04P->CRAL3PTR);                          0929
         LA    GPR03P,CRAL3PTR(,GPR04P)                            0929
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*                                                                  0930
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                   0930
*    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                   0931
         L     GPR15P,ATCLCPTR                                     0931
*  END; /*LISATCVT*/                                               0932
*        GPR15P=GPR15P->ATCAP33;                                   0933
         L     GPR15P,ATCAP33(,GPR15P)                             0933
*        DCL FMZL0063 BASED(GPR15P) LABEL VALUERANGE(*);           0934
*        CALL FMZL0063;                                            0935
         BALR  @14,@15                                             0935
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      0936
*                                                                  0936
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*  RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;         0937
*        END;                                                      0938
*/*** END -TPUNLOCK (RDTLOCK)- ***/                                0939
* IFTRDTLK = ZERB;                          /* RESET LOCK HELD       */
         NI    IFTRDTLK(IFTPTR),B'11011111'                        0939
* END;                                                             0940
*IF IFTVOCLK = ONEB THEN DO;                /* HOLD VOC LOCK ?       */
*                                                                  0941
@RF00921 TM    IFTVOCLK(IFTPTR),B'01000000'                        0941
         BNO   @RF00941                                            0941
*/*** START -TPUNLOCK (VOCLOCK)- ***/                              0943
*  DO;                                                             0943
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             0944
*/* END OF ATBUILD */                                              0944
*                                                                  0944
*  RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;           0944
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*        GPR02P = ADDR(ATCVOCLK);       /*SET PARAM - LOCKWORD PTR*/
         L     @14,RPHCRR(,RPHPTR)                                 0946
         L     @14,CRACRR(,@14)                                    0946
         L     GPR02P,CRRATCVT+12(,@14)                            0946
         LA    GPR02P,ATCVOCLK(,GPR02P)                            0946
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0947
         L     GPR04P,RPHCRR(,GPR01P)                              0947
*        GPR00P = CRALMS02;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,2                                            0948
*        GPR03P = ADDR(GPR04P->CRAL2PTR);                          0949
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0949
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*                                                                  0950
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                   0950
*    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                   0951
         L     GPR15P,ATCLCPTR                                     0951
*  END; /*LISATCVT*/                                               0952
*        GPR15P=GPR15P->ATCAP33;                                   0953
         L     GPR15P,ATCAP33(,GPR15P)                             0953
*        DCL FMZL0073 BASED(GPR15P) LABEL VALUERANGE(*);           0954
*        CALL FMZL0073;                                            0955
         BALR  @14,@15                                             0955
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      0956
*                                                                  0956
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*  RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;         0957
*        END;                                                      0958
*/*** END -TPUNLOCK (VOCLOCK)- ***/                                0959
* IFTVOCLK = ZERB;                          /* RESET LOCK HELD       */
         NI    IFTVOCLK(IFTPTR),B'10111111'                        0959
* END;                                                             0960
*IF IFTTPPST = ZERB THEN                    /* RPH TO POST ?         */
*                                                                  0961
@RF00941 TM    IFTTPPST(IFTPTR),B'10000000'                        0961
         BNZ   @RF00961                                            0961
*/*TPPOST  (IFTECBPR)  */                                          0962
*  DO;                                                             0962
*                                       /*DECLARE AND RESTRICT REGS*/
*    RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,                       0963
*              GPR06F,GPR14F,GPR15F) RSTD;                         0963
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0964
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           0964
*/* END OF ATBUILD */                                              0964
*    GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);                  0964
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*    GPR04F=IFTECBPR;                   /*LOAD RPH PNTR INTO REG 4*/
         L     GPR04F,IFTECBPR(,IFTPTR)                            0965
*    RFY GPR03F RSTD;                                              0966
*    GPR03F=0;                                                     0967
*                                                                  0967
         SLR   @12,@12                                             0967
         LR    GPR03F,@12                                          0967
*  DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR05F)*/
*    RESPECIFY (GPR02F) RESTRICTED;                                0969
*    GPR05F = GPR02F; /*SAVE REGISTER 2*/                          0970
         LR    GPR05F,GPR02F                                       0970
*    IPK; /*SAVE CURRENT PSW KEY*/                                 0971
         IPK                                                       0971
*    GPR06F = GPR02F;                                              0972
         LR    GPR06F,GPR02F                                       0972
*    GPR02F = GPR05F; /*RESTORE REGISTER 2*/                       0973
         LR    GPR02F,GPR05F                                       0973
*    SPKA (GPR03F); /*SET PSW KEY*/                                0974
         SPKA  0(GPR03F)                                           0974
*    RESPECIFY (GPR02F) UNRESTRICTED;                              0975
*  END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR05F)*/
*    RFY GPR03F UNRSTD;                                            0977
*    GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;                     0978
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0978
         LA    GPR05P,0(,GPR05P)                                   0978
         SLR   @11,@11                                             0978
         IC    @11,RPHPABOF(,GPR04P)                               0978
         ALR   GPR05P,@11                                          0978
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*    GPR14P=0;                          /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@12                                          0979
*    GPR15P='FFFFFFFF'X;                /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       0980
         BCTR  GPR15P,0                                            0980
*                                       /*ADDRESS                 */
*    CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                          0981
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0981
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*    BC (8,FMZT0083);                   /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0083                                          0982
*                                       /*OF EXPANSION              */
*FMZL0083:                                                         0983
*    IF GPR04P->RPHWT='1'B THEN         /*WT/EXT CONTENTION FLAG ON */
FMZL0083 TM    RPHWT(GPR04P),B'00001000'                           0983
         BNO   @RF00983                                            0983
*    DO;                                /*IN RPH                    */
*      GPR14P=GPR04P->RPHRESMA×RPHWT1;  /*LOAD REG 14 WITH FLAG FIELD*/
         L     GPR14P,RPHRESMA(,GPR04P)                            0985
         O     GPR14P,@CF00783                                     0985
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*      GPR15P=GPR14P×RPHPT1;            /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       0986
         O     GPR15P,@CF00787                                     0986
*                                       /*AND TURN POST FLAG ON      */
*      CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                        0987
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0987
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*      BC (4,FMZL0083);                 /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0083                                          0988
*                                       /*TO TEST CONTENTION FLAG    */
*      BC (8,FMZT0083);                 /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0083                                          0989
*                                       /*BRANCH TO BYPASS CODE GEN  */
*    END;                               /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*    ELSE;                              /*WT/EXT CONTENTION FLAG OFF*/
@RF00983 DS    0H                                                  0992
*    IF GPR04P->RPHTSKID=GPR01P->RPHTSKID                          0992
*    THEN DO;                                                      0992
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0992
         BNE   @RF00992                                            0992
*      GPR05P->PABCHNGP=GPR01P->RPHPABQP;                          0994
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0994
*                                       /*PUT PAB QUEUE ADDRESS*/  0995
*                                       /*IN SECOND WORD OF PAB     */
*      GPR01P->RPHPABQP=GPR05P;         /*PUT PAB ADDRESS (IN MAJOR */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0995
*                                       /*CONTROL BLOCK) IN PAB */ 0996
*                                       /*QUEUE ADRESS IN RPH    */
*      END;                                                        0996
*    ELSE DO;                                                      0997
         B     @RC00992                                            0997
@RF00992 DS    0H                                                  0998
*      GPR00F=0;                        /*SET REG 0 TO INDICATE ENA*/
*                                                                  0998
         SLR   GPR00F,GPR00F                                       0998
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                   0999
*    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                   1000
         L     GPR15P,ATCLCPTR                                     1000
*  END; /*LISATCVT*/                    /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*      CALL GPR15P->ATCAP32;            /* CALL ISTAPC32: TPSCHED */
         L     @12,ATCAP32(,GPR15P)                                1002
         LR    @15,@12                                             1002
         BALR  @14,@15                                             1002
*      END;                                                        1003
*FMZT0083:                                                         1004
*                                                                  1004
*  DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/                1004
@RC00992 DS    0H                                                  1004
FMZT0083 DS    0H                                                  1005
*    GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/               1005
         LR    GPR05F,GPR06F                                       1005
*    SPKA (GPR05F); /*SET PSW KEY*/                                1006
         SPKA  0(GPR05F)                                           1006
*  END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/               1007
*    GEN REFS(GPR04P,                                              1008
*    RPHWORK)                                                      1008
*        SETS(GPR02F,GPR03F,                                       1008
*              GPR04F,GPR05F,GPR06F);                              1008
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*    RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,                1009
*    GPR14F,GPR15F) UNRSTD;             /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*  END;  /****END OF TPPOST GENERATION****/                        1010
* ELSE                                      /* NO, MUST BE ECB       */
* DO;                                                      /*@DM93170*/
         B     @RC00961                                            1011
@RF00961 DS    0H                                                  1012
*  RFY RPHSAV RSTD;   /* RESTRICT RPH SAVE REG               @DM93170*/
*  RPHSAV = RPHPTR;   /* SAVE RPH ADDR OVER VPOST            @DM93170*/
         LR    RPHSAV,RPHPTR                                       1013
*SSET:                                                             1014
*/*VSETLCK  (RCDREG,OBTAIN,LOCAL,(IFTECBPR,ISTINCMS(MSREST)))*/    1014
*       DO;                                                        1014
SSET     DS    0H                                                  1015
*                                        /*DECLARE AND RESTRICT REGS */
*                                        /*   2,10,11,12,13,14, AND 15
**/                                                                1015
*       RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P) RSTD;
*                                        /*SAVE REGS 2 AND 10 THRU 14*/
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      1016
*                                                                  1016
         STM   GPR10F,GPR12F,0(GPR13P)
         ST    GPR14F,12(GPR13P)
         ST    GPR02F,16(GPR13P)
*                                        /*INVOKE MODESET TO CHANGE  */
*                                        /*PSW PROTECTION KEY TO 0   */
*        GEN SETS(2);                                              1017
*                                                                  1017
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2
*         GPR10P=GPR13P;                 /*PUT SAVE AREA ADDR IN R 10*/
         LR    GPR10P,GPR13P                                       1018
*                                        /*INVOKE OS/VS SETLOCK MACRO*/
*         GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);               1019
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *
               RELATED=(IFTECBPR,ISTINCMS(MSREST))
*         GPR15P=GPR13P;                 /*PUT RETURN CODE IN R 15 */
         LR    GPR15P,GPR13P                                       1020
*                                        /*INVOKE MODESET MACRO TO   */
*           DO;                          /*RESTORE PSW PROTECTION KEY*/
*        GEN SETS(2);                                              1022
         MODESET KEYADDR=(2),WORKREG=2
*           END;                         /* RESTORE REGISTERS        */
*         GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,              1024
*         GPR12F,GPR13F,GPR14F,GPR02F);                            1024
         LR    GPR13F,GPR10F
         LM    GPR10F,GPR12F,0(GPR13P)
         L     GPR14F,12(GPR13P)
         L     GPR02F,16(GPR13P)
*         IF GPR15F=4 THEN GPR15F=0;                               1025
         C     GPR15F,@CF00052                                     1025
         BNE   @RF01025                                            1025
         SLR   GPR15F,GPR15F                                       1026
*         RCDREG=GPR15F;                 /*PUT RETURN CODE IN RCREG*/
*                                                                  1027
@RF01025 DS    0H                                                  1028
*       RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P) UNRSTD;
*       END;  /*VSETLCK */                                         1029
*/*VPOST  ECB((IFTECBPR))*/                                        1030
*   DO;                                                            1030
*                                                                  1030
*   RFY (GPR00P,GPR01P,GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P
*GPR14P,GPR15P) RSTD;                    /*DECLARE AND RESTRICT REGS */
*                                        /* SAVE REGS         */   1032
*     GEN REFS(GPR00F,GPR01F,GPR02F,GPR05F,GPR09F,                 1032
*     GPR10F,GPR11F,GPR12P,GPR13P,GPR14F,GPR15F);                  1032
         STM   GPR14F,GPR12F,0(GPR13P)
*     GPR00P=GPR13P;                     /*SAVE REG 13 IN REG 0     */
         LR    GPR00P,GPR13P                                       1033
*                                        /*INVOKE XREGSET MACRO TO*/
*                                        /*CHECK ECB PARAMETER AND*/
*                                        /*PUT ADDRESS IN REG 1   */
*                                                                  1034
*/*XREGSET  PID('ECB')PPARM((IFTECBPR))RREG(1,GPR01P)*/            1034
*   DO;                                                            1034
*     GPR01P=IFTECBPR;                   /*SET RREG SYMBOL TO VALUE*/
         L     GPR01P,IFTECBPR(,IFTPTR)                            1035
*                                        /*OF PPARM OPERAND        */
*   END;  /* XREGSET */                                            1036
*     GPR10F=0;                          /*SET COMPLETION CODE TO 0*/
         SLR   GPR10F,GPR10F                                       1037
*     GPR11P=GPR01P;                     /*PUT ECB ADDR IN REG 11    */
         LR    GPR11P,GPR01P                                       1038
*     DCL CMZP0098 PTR(31) LOCATION(16); /*ESTABLISH POINTER TO CVT  */
*/*VMDESET  ((15),ZERO,(2))*/                                      1040
*   DO;                                  /* INVOKE MODESET MACRO    */
*     GEN SETS (2);                                                1041
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2
*     GPR15F=0;                                                    1042
         SLR   GPR15F,GPR15F                                       1042
*                                        /*PUT RETURN CODE IN RCREG*/
*   END;  /* VMDESET */                                            1043
*     GPR05F=GPR02F;                                               1044
         LR    GPR05F,GPR02F                                       1044
*     CALL CMZP0098->CVT0PT01;           /*BRANCH TO TASK SUPERVISOR */
         L     @08,CMZP0098                                        1045
         L     @15,CVT0PT01(,@08)                                  1045
         BALR  @14,@15                                             1045
*                                        /* POST ROUTINE (IEA0PT01)  */
*     GPR02F=GPR05F;                                               1046
*                                                                  1046
         LR    GPR02F,GPR05F                                       1046
*/*VMDESET  ((15),,,(2))*/                                         1047
*   DO;                                  /* INVOKE MODESET MACRO    */
*     GEN SETS (2);                                                1048
         MODESET KEYADDR=(2),WORKREG=2
*     GPR15F=0;                                                    1049
         SLR   GPR15F,GPR15F                                       1049
*                                        /*PUT RETURN CODE IN RCREG*/
*   END;  /* VMDESET */                                            1050
*     GPR13P=GPR00P;                     /*RESTORE SAVE AREA ADDR  */
         LR    GPR13P,GPR00P                                       1051
*                                        /*     FROM REGISTER 0    */
*                                        /*RESTORE REGS */         1052
*     GEN REFS(GPR13P) SETS(GPR00F,                                1052
*     GPR01F,GPR02F,GPR05F,GPR09F,GPR10F,GPR11F,                   1052
*     GPR12F,GPR14F,GPR15F);                                       1052
*                                                                  1052
         LM    GPR14F,GPR12F,0(GPR13P)
*   RFY (GPR00P,GPR01P,GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P
*GPR14P,GPR15P) UNRSTD;                  /*UNRESTRICT REGS */      1053
*   END; /* VPOST */                                 /*@DM93180*/  1054
*SREST:                                                            1055
*/*VSETLCK  (RCDREG,RELEASE,LOCAL,(IFTECBPR,ISTINCMS(MSSET)))*/    1055
*        DO;                                                       1055
SREST    DS    0H                                                  1056
*                                        /*DECLARE AND RESTRICT REGS */
*                                        /*   2,10,11,12,13,14, AND 15
**/                                                                1056
*        RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P) RSTD;
*                                        /*SAVE REGS 2 AND 10 THRU 14*/
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      1057
*                                                                  1057
         STM   GPR10F,GPR12F,0(GPR13P)
         ST    GPR14F,12(GPR13P)
         ST    GPR02F,16(GPR13P)
*                                        /*INVOKE MODESET TO CHANGE  */
*                                        /*PSW PROTECTION KEY TO 0   */
*        GEN SETS(2);                                              1058
*                                                                  1058
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2
*          GPR10P=GPR13P;                /*PUT SAVE AREA ADDR IN R 10*/
         LR    GPR10P,GPR13P                                       1059
*                                        /*INVOKE OS/VS SETLOCK MACRO*/
*          GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);              1060
         SETLOCK RELEASE,TYPE=LOCAL,                                   *
               RELATED=(IFTECBPR,ISTINCMS(MSSET))
*          GPR15P=GPR13P;                /*PUT RETURN CODE IN R 15 */
         LR    GPR15P,GPR13P                                       1061
*                                        /*INVOKE MODESET MACRO TO   */
*            DO;                         /*RESTORE PSW PROTECTION KEY*/
*        GEN SETS(2);                                              1063
         MODESET KEYADDR=(2),WORKREG=2
*            END;                        /* RESTORE REGISTERS        */
*          GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,             1065
*          GPR12F,GPR13F,GPR14F,GPR02F);                           1065
         LR    GPR13F,GPR10F
         LM    GPR10F,GPR12F,0(GPR13P)
         L     GPR14F,12(GPR13P)
         L     GPR02F,16(GPR13P)
*          IF GPR15F=4 THEN GPR15F=0;                              1066
         C     GPR15F,@CF00052                                     1066
         BNE   @RF01066                                            1066
         SLR   GPR15F,GPR15F                                       1067
*          RCDREG=GPR15F;                /*PUT RETURN CODE IN RCREG*/
*                                                                  1068
@RF01066 DS    0H                                                  1069
*        RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P) UNRSTD;
*        END;  /*VSETLCK */                                        1070
*  RPHPTR = RPHSAV;   /* RESTORE RPH ADDR                    @DM93170*/
         LR    RPHPTR,RPHSAV                                       1071
*  RFY RPHSAV UNRSTD; /* RELEASE REG                         @DM93170*/
* END;                                                     /*@DM93170*/
*END;    /* NOT A RFT KEY EXIT                               @DL31HMD*/
@RC00961 DS    0H                                                  1075
*/* TPEXIT  NORM */                                                1075
* DO;                                                              1075
@RC00558 DS    0H                                                  1076
*   RESPECIFY GPR15P RSTD;                                         1076
*                                                                  1076
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1077
*/* END OF ATBUILD */                                              1077
*                                                                  1077
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    1077
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    1078
         L     GPR15P,ATCLCPTR                                     1078
* END; /*LISATCVT*/                                                1079
*   RESPECIFY GPR00F RSTD;                                         1080
*   GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */                 1081
         LA    GPR00F,4                                            1081
*   GPR15P=GPR15P->ATCAP31;                                        1082
         L     GPR15P,ATCAP31(,GPR15P)                             1082
*   DCL FMZL0111 BASED(GPR15P) LABEL VALUERANGE(*);                1083
*   CALL FMZL0111;                                                 1084
         BALR  @14,@15                                             1084
*   RESPECIFY (GPR00F,GPR15P) UNRSTD;                              1085
* END; /***** END OF TPEXIT  *****/                                1086
*/* THIS SUBROUTINE - TRMHDL - WAS CREATED TO HANDLE A TERMINAL REQUEST
*                                                            @DL31HMD*/
*/* FOR TEST. (I.E. OPERATOR HITS RFT KEY ON CONSOLE) ITS PURPOSE  1087
*IS TO NOTIFY THE CONNECTED APPLICATION THAT HIS CONNECTION        1087
*HAS BEEN BROKEN                                             @DL31HMD*/
*TRMHDL: PROC OPTIONS(NOSAVE,NOSAVEAREA);                  /*@DL31HMD*/
         B     @PB00002                                            1087
TRMHDL   DS    0H                                                  1088
*RFY (CREG14,CSAVE,RPARM2,RCDREG) RSTD;                 /*   @DL31HMD*/
*CSAVE = CREG14;    /* SAVE RETURN ADDRESS                   @DL31HMD*/
         LR    CSAVE,CREG14                                        1089
*RFY CREG14 UNRSTD;                                        /*@DL31HMD*/
*RPARM2 = TIEPTR1;  /* GET CID INTO PARM REG                 @DL31HMD*/
*                                                                  1091
         L     RPARM2,TIEPTR1(,TIEPTR)                             1091
*  DO; /* CIDCTL(FIND)  */                                         1092
*                                                                  1092
*  RFY (EMCR2,EMCR3) RSTD;                                         1093
*    GEN SETS(RPHWORK)                                             1094
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1094
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*    EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                           1095
         SLR   EMCR3,EMCR3                                         1095
*    EMCR3 = '01'X; /*INDICATE SHARED LOCK*/                       1096
         LA    EMCR3,1                                             1096
*    CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/        1097
*                                                                  1097
         L     @12,ATCLCPTR                                        1097
         L     @15,ATCCDFND(,@12)                                  1097
         BALR  @14,@15                                             1097
*  RFY (EMCR2,EMCR3) UNRSTD;                                       1098
*  END; /*CIDCTL*/   /* GET FMCB ADDRESS                      @DL31HMD*
*IF RCDREG = 0      /* IF SUCESSFUL                          @DL31HMD*/
*   THEN DO;                                               /*@DL31HMD*/
         LTR   RCDREG,RCDREG                                       1100
         BNZ   @RF01100                                            1100
*   RFY FMCBPTR RSTD;                                      /*@DL31HMD*/
*   RFY ISTFMCB BASED(FMCBPTR);                            /*@DL31HMD*/
*   FMCBPTR = RPARM2;   /* XFER FMCB ADDRESS                 @DL31HMD*/
         LR    FMCBPTR,RPARM2                                      1104
*   RFY RPARM2 UNRSTD;                                     /*@DL31HMD*/
*   RFY RCDREG UNRSTD;                                     /*@DL31HMD*/
*   IF FMCDEVOF = ONEB  /* IS CONNECTION ALREADY DEAD        @DL31HMD*/
*      & FMCCPIP=ZERB   /* CLSDST PURGE NOT IN PROGRESS      @ZA30524*/
*      THEN DO;                                            /*@DL31HMD*/
         TM    FMCDEVOF(FMCBPTR),B'00010000'                       1107
         BNO   @RF01107                                            1107
         TM    FMCCPIP(FMCBPTR),B'00001000'                        1107
         BNZ   @RF01107                                            1107
*      /* GET AN LCPB FOR PURGE                              @DL31HMD*/
*      RFY RCDREG RSTD;                                    /*@DL31HMD*/
*        /*REQSTORE CBID(NMLPB)CLEAR(YES)SAVE(YES)RPH(RPHPTR)*/    1110
*         DO;                                                      1110
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         1111
*/* END OF ATBUILD */                                              1111
*                                                                  1111
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                   1111
*                                                                  1111
*        RFY (GPR01P,GPR13P) RSTD;                                 1112
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      1113
*                                                                  1113
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
*        RFY (GPR01P,GPR13P) UNRSTD;                               1114
*                                                                  1114
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */             1115
*          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/             1116
         L     GPR15P,ATCLCPTR                                     1116
*        END; /*LISATCVT*/                                         1117
*          GPR02P=GPR15P->ATCBPDA × '80000000'X;                   1118
         L     GPR02P,ATCBPDA(,GPR15P)                             1118
         O     GPR02P,@CF01662                                     1118
*          DCL 1 FMZA0123 FIXED(31) STATIC LOCAL,                  1119
*              2 *        FIXED(8) INIT(184),                      1119
*              2 *        PTR(24) INIT(0);                         1119
*          GPR03F=FMZA0123;                                        1120
         L     GPR03F,FMZA0123                                     1120
*          GPR04F=19;                                              1121
         LA    GPR04F,19                                           1121
*          GPR15P=GPR15P->ATCSMRQ;                                 1122
         L     GPR15P,ATCSMRQ(,GPR15P)                             1122
*          DCL FMZL0123 BASED(GPR15P) LABEL VALUERANGE(*);         1123
*          CALL FMZL0123;                                          1124
*                                                                  1124
         BALR  @14,@15                                             1124
*        RFY (GPR13P) RSTD;                                        1125
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      1126
*                                                                  1126
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
*        RFY (GPR13P) UNRSTD;                                      1127
*                                                                  1127
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                 1128
*        END ;                                                     1129
*          /********* END OF REQSTORE EXPANSION **********/        1130
*      IF RCDREG = 8   /* WAS REQUEST QUEUED                 @DL31HMD*/
*         THEN                                                     1130
         C     RCDREG,@CF00058                                     1130
         BNE   @RF01130                                            1130
*/*  TPWAIT   */                                                   1131
*                DO; /* BEGIN TPWAIT GENERATION*/                  1131
*                RFY (GPR01P,GPR14P,GPR15P) RSTD;                  1132
*                RFY (GPR00P) RSTD;                                1133
*                GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))         1134
*                REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);         1134
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*                RFY (GPR00P) UNRSTD;                              1135
*                GPR15P=ADDR(LHAA0142);                            1136
         LA    GPR15P,LHAA0142                                     1136
*                GPR14P=0;                                         1137
         SLR   GPR14P,GPR14P                                       1137
*                GPR15P=GPR15P & '00FFFFFF'X;                      1138
         N     GPR15P,@CF05718                                     1138
*                GPR15P=GPR15P × RPHWT1;                           1139
         O     GPR15P,@CF00783                                     1139
*                CS (GPR14P,GPR15P,GPR01P->RPHRESMA);              1140
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         1140
*                BC (7,LHAB0142);                                  1141
*                                                                  1141
         BC    7,LHAB0142                                          1141
*/* TPEXIT  NONE */                                                1142
*                DO;                                               1142
*                  RESPECIFY GPR15P RSTD;                          1143
*                                                                  1143
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1144
*/* END OF ATBUILD */                                              1144
*                                                                  1144
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     1144
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     1145
         L     GPR15P,ATCLCPTR                                     1145
*                END; /*LISATCVT*/                                 1146
*                  RESPECIFY GPR00F RSTD;                          1147
*                  GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/   1148
         SLR   GPR00F,GPR00F                                       1148
*                  GPR15P=GPR15P->ATCAP31;                         1149
         L     GPR15P,ATCAP31(,GPR15P)                             1149
*                  DCL FMZL0147 BASED(GPR15P) LABEL VALUERANGE(*); 1150
*                  CALL FMZL0147;                                  1151
         BALR  @14,@15                                             1151
*                  RESPECIFY (GPR00F,GPR15P) UNRSTD;               1152
*                END; /***** END OF TPEXIT  *****/                 1153
*LHAB0142:;      GPR01P->RPHRESMA = 0;                             1154
LHAB0142 DS    0H                                                  1155
         SLR   @12,@12                                             1155
         ST    @12,RPHRESMA(,GPR01P)                               1155
*                RFY (GPR00P) RSTD;                                1156
*LHAA0142:;      GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))         1157
LHAA0142 DS    0H                                                  1158
*                REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);         1158
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*                RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;         1159
*                END; /*****END OF TPWAIT *****/ /* YES WAIT       1160
*             @DL31HMD*/                                           1160
*      ELSE;                                               /*@DL31HMD*/
@RF01130 DS    0H                                                  1162
*      RFY RCDREG UNRSTD;                                  /*@DL31HMD*/
*      RFY ISTLCPB BASED(LCPBPTR);                         /*@DL31HMD*/
*      RFY ISTNMLPB BASED(LCPBPTR);                        /*@DL31HMD*/
*      RFY LCPBPTR RSTD;                                   /*@DL31HMD*/
*      LCPBPTR = RPHSRPRM;   /* XFER LCPB ADDRESS            @DL31HMD*/
         L     LCPBPTR,RPHSRPRM(,RPHPTR)                           1166
*      LCPCID = TIEPTR1;   /* GET CID FROM TIE               @DL31HMD*/
         L     @12,TIEPTR1(,TIEPTR)                                1167
         ST    @12,LCPCID(,LCPBPTR)                                1167
*      IF TIERETCD = TIERCRD  /* IS THIS A RECORD DEVICE     @DL31HMD*/
*         THEN DO;                                         /*@DL31HMD*/
         CLI   TIERETCD(TIEPTR),4                                  1168
         BNE   @RF01168                                            1168
*         LCPTYPE = LCPETYPE; /* SET LCPB TYPE               @DL31HMD*/
         MVI   LCPTYPE(LCPBPTR),X'40'                              1170
*         LCPLNGTH = LENGTH(ISTNMLPB); /*SET UP LENGTH       @DL31HMD*/
         MVI   LCPLNGTH(LCPBPTR),X'64'                             1171
*         LCPRPHA = RPHPTR; /* RPH TO POST                   @DL31HMD*/
         ST    RPHPTR,LCPRPHA(,LCPBPTR)                            1172
*         LCPFTYPE = ONEB;  /* SET POST RPH FLAG             @DL31HMD*/
         OI    LCPFTYPE(LCPBPTR),B'10000000'                       1173
*         LCPASYN = ONEB;   /* SET ASYN FLAG                 @DL31HLH*/
         OI    LCPASYN(LCPBPTR),B'01000000'                        1174
*         LCPMNRCD='81'X;   /* SET UP LCPB MINOR R.C.        @ZD14900*/
         MVI   LCPMNRCD(LCPBPTR),X'81'                             1175
*         RFY ISTLCCW BASED(LCPNXLCW);                     /*@DL31HMD*/
*         RFY ISTRH BASED(ADDR(LCCWDATA));                 /*@DL31HMD*/
*         LCPNXLCW = ADDR(NMLCW2); /*  SET UP CCW POINTER    @DL31HMD*/
         LA    @12,NMLCW2(,LCPBPTR)                                1178
         ST    @12,LCPNXLCW(,LCPBPTR)                              1178
*         LCCWOP = LCRUDNFY; /* CLR/UNB/NTFY OP CODE         @DL31HMD*/
         MVI   LCCWOP(@12),X'F4'                                   1179
*         LCCWIDAT = ONEB; /* IMMEDIATE DATA IN CCW DATA     @DL31HMD*/
*         LCCWCD = ONEB;  /* CHAIN DATA                      @DL31HMD*/
         OI    LCCWIDAT(@12),B'10001000'                           1181
*         LCCWCNT = '0003'X;   /* COUNT OF THREE             @DL31HMD*/
         MVC   LCCWCNT(2,@12),@CH05728                             1182
*         RHTYPE = ONEB;  /* SET RHTYPE                      @DL31HMD*/
*         RHSCI = ONEB;   /* SET SYS CONTROL                 @DL31HMD*/
*         RHFORMAT = ONEB; /* FORMATTED                      @DL31HMD*/
         AL    @12,@CF00052                                        1185
         OI    RHTYPE(@12),B'01101000'                             1185
*         RHFME = ONEB; /* FME EXPECTED                      @DL31HMD*/
         OI    RHFME(@12),B'10000000'                              1186
*         RHCHAIN = RHONLY; /* AND ONLY RH GOING OUT         @DL31HMD*/
         OI    RHCHAIN(@12),B'00000011'                            1187
*         /* SET UP SECOND LCCW                              @DL31HMD*/
*         ADDR(NMLCW3)->LCCWIDAT = ONEB; /* IMMEDIATE DATA   @DL31HMD*/
         LA    @12,64                                              1188
         ALR   @12,LCPBPTR                                         1188
         OI    LCCWIDAT(@12),B'00001000'                           1188
*         ADDR(NMLCW3)->LCCWCNT = '0002'X; /* COUNT OF 2     @DL31HMD*/
         MVC   LCCWCNT(2,@12),@CH05729                             1189
*         ADDR(NMLCW3)->LCCWDATA = '32010000'X; /* UNBIND    @DL31HMD*/
*                                                                  1190
         MVC   LCCWDATA(4,@12),@CF05730                            1190
*/*  TPQUE (LCPBPTR,FMCPAB5) RESET */                              1191
*                                                                  1191
*           DO;                                                    1191
*           RFY (GPR00P,GPR01P,GPR02P,GPR15P) RSTD;                1192
*           GEN REFS(GPR01P) SETS(RPHWORK)                         1193
*        (STM   GPR14P,GPR09P,RPHWORK(GPR01P));                    1193
         STM   GPR14P,GPR09P,RPHWORK(GPR01P)
*           GPR00P=ADDR(FMCPAB5);                                  1194
         LA    GPR00P,FMCPAB5(,FMCBPTR)                            1194
*           GPR02P=LCPBPTR;                                        1195
         LR    GPR02P,LCPBPTR                                      1195
*           CALL ATCLCPTR->ATCAP34->ISTAPC34;                      1196
         L     @12,ATCLCPTR                                        1196
         L     @15,ATCAP34(,@12)                                   1196
         BALR  @14,@15                                             1196
*           GEN REFS(RPHWORK,GPR01P) NOSETS                        1197
*        (LM    GPR14P,GPR09P,RPHWORK(GPR01P));                    1197
         LM    GPR14P,GPR09P,RPHWORK(GPR01P)
*           RFY (GPR00P,GPR01P,GPR02P,GPR15P) UNRSTD;              1198
*           END; /**** END OF TPQUE GENERATION ****/ /* QUEUE TO ATOP
*DL31HMD*/                                                         1199
*         END;                                             /*@DL31HMD*/
*      ELSE DO; /* NOT A RECORD DEVICE                       @DL31HMD*/
         B     @RC01168                                            1201
@RF01168 DS    0H                                                  1202
*      RFY RPARM2 RSTD;                                    /*@DL31HMD*/
*      RPARM2 = '81'X; /* SET UP TPPURGE RETURN CODE         @DL31HMD*/
         LA    RPARM2,129                                          1203
*/*TPPURGE  (LCPBPTR,FMCPAB1,RPARM2)  NRESET*/                     1204
*          DO;                                                     1204
*                                        /*DECLARE AND RESTRICT REGS */
*          RFY (GPR14F,GPR15F,GPR00F,GPR01F,GPR08F,GPR09F) RSTD;   1205
*                                        /*14,15,0,1,2,3,4,5,6,7,8,9 */
*                                                                  1206
*/* ATBUILD (ISTRPH)  */                                           1206
*/* END OF ATBUILD */                                              1206
*          GEN REFS(GPR14F,GPR09F) SETS(GPR01P,RPHWORK,ISTRPH);    1206
         STM GPR14F,GPR09F,RPHWORK-ISTRPH(GPR01F)
*          GPR09P=GPR01P;                                          1207
*                                                                  1207
         LR    GPR09P,GPR01P                                       1207
*/* ATBUILD (ISTLCCW,ISTLCPB,ISTPLCPB)  */                         1208
*/* ***** PURGE REQUEST LCPB  ***** */                             1208
*                                                                  1208
*/* THE FOLLOWING DCRS HAVE BEEN APPLIED                             */
*                                                                  1208
*/* 1H0464 - MAR 2, 73 - DM  */                                    1208
*DCL   1  ISTPLCPB BDY(DWORD) BASED,                               1208
*         2  PLCLCPB CHAR(LENGTH(ISTLCPB)),  /* STANDARD LCPB        */
*         2  PLCLCCW CHAR(LENGTH(ISTLCCW));  /* PURGE LCCW           */
*/* END OF ATBUILD */                    /****************************/
*                                        /*BASE LCPB TEMPLATE AND    */
*                                        /*PLCPB TEMPLATE ON LCPB    */
*                                        /*POINTER PASSED IN MACLIST */
*                                        /****************************/
*          DCL PNTR0163 REGISTER(8) POINTER(31);                   1209
*          PNTR0163=LCPBPTR;             /*SET POINTER VARIABLE TO   */
         LR    PNTR0163,LCPBPTR                                    1210
*                                        /*VALUE OF POINTER PASSED   */
*                                        /*IN MACLIST                */
*          PNTR0163->LCPTYPE=PLCPTYPE;   /*INIT TYPE CODE FIELD      */
         MVI   LCPTYPE(PNTR0163),X'28'                             1211
*          PNTR0163->LCPLNGTH=LENGTH(PNTR0163->ISTPLCPB);          1212
         LA    @12,64                                              1212
         STC   @12,LCPLNGTH(,PNTR0163)                             1212
*                                        /*INIT LENGTH FIELD WITH    */
*                                        /*LENGTH OF PASSED PLCPB    */
*          PNTR0163->LCPNXLCW=ADDR(PNTR0163->PLCLCCW);             1213
         LA    @12,PLCLCCW(,PNTR0163)                              1213
         ST    @12,LCPNXLCW(,PNTR0163)                             1213
*                                        /*INIT ADDR-NEXT-LCCW FIELD */
*                                        /*WITH ADDR OF NEXT LCCW    */
*          PNTR0163->LCPMNRCD=RPARM2;    /*INIT LCP-MINOR-REJECTION- */
         STC   RPARM2,LCPMNRCD(,PNTR0163)                          1214
*                                        /*CODE FIELD WITH RETURN    */
*                                        /*CODE PASSED IN MACLIST    */
*          PNTR0163=PNTR0163->LCPNXLCW;  /*BASE LCCW TEMPLATE ON     */
         LR    PNTR0163,@12                                        1215
*                                        /*PLCCW POINTER IN LCPB     */
*          PNTR0163->LCCWOP=LCCWPRGE;    /*SET LCCW OP CODE TO PURGE */
         MVI   LCCWOP(PNTR0163),X'6B'                              1216
*          PNTR0163->LCCWFLAG=0;         /*SET LCCW FLAGS TO ZEROES  */
         MVI   LCCWFLAG(PNTR0163),X'00'                            1217
*          PNTR0163->LCCWCNT=0;          /*SET LCCW DATA COUNT TO 0  */
         SLR   @12,@12                                             1218
         STH   @12,LCCWCNT(,PNTR0163)                              1218
*          PNTR0163->LCCWDATA=GPR01P×'80000000'X;                  1219
         LR    @11,GPR01P                                          1219
         O     @11,@CF01662                                        1219
         ST    @11,LCCWDATA(,PNTR0163)                             1219
*                                        /*SET HIGH-ORDER BIT OF RPH */
*                                        /*ADDR PASSED VIA REG 1 TO 1*/
*                                        /*TO INDICATE RPH AND LOAD  */
*                                        /*INTO LCCW DATA ADDR FIELD */
*                                                                  1220
*/*  TPQUE (LCPBPTR,FMCPAB1) NORM NSTR */                          1220
*                                                                  1220
*        DO;                                                       1220
*        RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;            1221
*        GPR00P=0;                                                 1222
         LR    GPR00P,@12                                          1222
*        GPR15P=ADDR(FMCPAB1); /*HOLD PAB PTR*/                    1223
         LA    GPR15P,FMCPAB1(,FMCBPTR)                            1223
*        GPR04P=LCPBPTR; /*WORK ELE PTR*/                          1224
         LR    GPR04P,LCPBPTR                                      1224
*        GPR05P=GPR15P; /*PASS PAB PTR*/                           1225
         LR    GPR05P,GPR15P                                       1225
*        CALL ATCLCPTR->ATCAP37->ISTAPC37;                         1226
         L     @12,ATCLCPTR                                        1226
         L     @15,ATCAP37(,@12)                                   1226
         BALR  @14,@15                                             1226
*        GEN(NOPR  8)NOSETS NOREFS;                                1227
         NOPR  8
*        RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;          1228
*        END; /**** END OF TPQUE GENERATION ****/                  1229
*          GEN SETS(GPR14F,GPR15F,GPR00F,GPR01F,GPR02F,GPR03F,     1230
*             GPR04F,GPR05F,GPR06F,GPR07F,GPR08F,GPR09F)           1230
*             REFS(RPHWORK,ISTRPH,GPR09F);                         1230
         LM  GPR14F,GPR09F,RPHWORK-ISTRPH(GPR09F)
*          RFY(GPR14F,GPR15F,GPR00F,GPR01F,GPR08F,GPR09F) UNRSTD;  1231
*                                        /*UNRESTRICT REGISTERS    */
*        END;  /* TPPURGE */ /*PURGE IO @ZA19880*/                 1232
*      RFY RPARM2 UNRSTD;                                  /*@DL31HMD*/
*      END;                                                /*@DL31HMD*/
*      RFY FMCBPTR UNRSTD;                                 /*@DL31HMD*/
@RC01168 DS    0H                                                  1236
*      RFY RPARM2 RSTD;                                    /*@DL31HMD*/
*      RPARM2 = TIEPTR1;   /* GET CID                        @DL31HMD*/
*                                                                  1237
         L     RPARM2,TIEPTR1(,TIEPTR)                             1237
*        DO; /* CIDCTL(FINISH)  */                                 1238
*                                                                  1238
*        RFY (EMCR2,EMCR3) RSTD;                                   1239
*          GEN SETS(RPHWORK)                                       1240
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1240
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*          EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                     1241
         SLR   EMCR3,EMCR3                                         1241
*          CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/  1242
*                                                                  1242
         L     @12,ATCLCPTR                                        1242
         L     @15,ATCCDFIN(,@12)                                  1242
         BALR  @14,@15                                             1242
*        RFY (EMCR2,EMCR3) UNRSTD;                                 1243
*        END; /*CIDCTL*/ /* RELEASE LOCKS                   @DL31HMD*/
*      RFY RPARM2 UNRSTD;                                  /*@DL31HMD*/
*                                                                  1245
*/*  TPWAIT   */                                                   1246
*        DO; /* BEGIN TPWAIT GENERATION*/                          1246
*        RFY (GPR01P,GPR14P,GPR15P) RSTD;                          1247
*        RFY (GPR00P) RSTD;                                        1248
*        GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))                 1249
*        REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);                 1249
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*        RFY (GPR00P) UNRSTD;                                      1250
*        GPR15P=ADDR(LHAA0176);                                    1251
         LA    GPR15P,LHAA0176                                     1251
*        GPR14P=0;                                                 1252
         SLR   GPR14P,GPR14P                                       1252
*        GPR15P=GPR15P & '00FFFFFF'X;                              1253
         N     GPR15P,@CF05718                                     1253
*        GPR15P=GPR15P × RPHWT1;                                   1254
         O     GPR15P,@CF00783                                     1254
*        CS (GPR14P,GPR15P,GPR01P->RPHRESMA);                      1255
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         1255
*        BC (7,LHAB0176);                                          1256
*                                                                  1256
         BC    7,LHAB0176                                          1256
*/* TPEXIT  NONE */                                                1257
*        DO;                                                       1257
*          RESPECIFY GPR15P RSTD;                                  1258
*                                                                  1258
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1259
*/* END OF ATBUILD */                                              1259
*                                                                  1259
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */             1259
*          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/             1260
         L     GPR15P,ATCLCPTR                                     1260
*        END; /*LISATCVT*/                                         1261
*          RESPECIFY GPR00F RSTD;                                  1262
*          GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/           1263
         SLR   GPR00F,GPR00F                                       1263
*          GPR15P=GPR15P->ATCAP31;                                 1264
         L     GPR15P,ATCAP31(,GPR15P)                             1264
*          DCL FMZL0181 BASED(GPR15P) LABEL VALUERANGE(*);         1265
*          CALL FMZL0181;                                          1266
         BALR  @14,@15                                             1266
*          RESPECIFY (GPR00F,GPR15P) UNRSTD;                       1267
*        END; /***** END OF TPEXIT  *****/                         1268
*LHAB0176:;                                                        1269
LHAB0176 DS    0H                                                  1270
*        GPR01P->RPHRESMA = 0;                                     1270
         SLR   @15,@15                                             1270
         ST    @15,RPHRESMA(,GPR01P)                               1270
*        RFY (GPR00P) RSTD;                                        1271
*LHAA0176:;                                                        1272
LHAA0176 DS    0H                                                  1273
*        GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))                 1273
*        REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);                 1273
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*        RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                 1274
*        END; /*****END OF TPWAIT *****/ /* WAIT FOR PURGE         1275
*             @DL31HMD*/                                           1275
*      RFY LCPBPTR UNRSTD;                                 /*@DL31HMD*/
*      RFY ISTFSB BASED(FSBPTR);                           /*@DL31HMD*/
*      RFY ISTFDB BASED(FDBPTR);                           /*@DL31HMD*/
*      RFY (FSBPTR,FDBPTR) RSTD;                           /*@DL31HMD*/
*      FSBPTR = RPHWEA;  /* POINT TO FSB                     @DL31HMD*/
         L     FSBPTR,RPHWEA(,RPHPTR)                              1280
*      RPHWEA = FSBLCPB;  /* SET UP LCPB ADDRESS IN RPH      @DL31HLH*/
         L     @12,FSBLCPB(,FSBPTR)                                1281
         ST    @12,RPHWEA(,RPHPTR)                                 1281
*      FDBPTR = ADDR(FSBFDB); /* THEN GET FDB                @DL31HMD*/
         LA    FDBPTR,FSBFDB(,FSBPTR)                              1282
*      FSBPTR = FDBPTR - FDBOFSET; /* FIND TRUE START OF FSB @DL31HMD*/
         LR    FSBPTR,FDBPTR                                       1283
         SH    FSBPTR,FDBOFSET(,FDBPTR)                            1283
*      FSBPTR->QPTR = FDBFDBA; /* SET UP CHAIN FOR RELSTORE  @DL31HMD*/
         L     @12,FDBFDBA(,FDBPTR)                                1284
         ST    @12,QPTR(,FSBPTR)                                   1284
*        /*RELSTORE BUFADDR(FSBPTR)CHAIN(YES)*/                    1285
*         DO;                                                      1285
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1286
*/* END OF ATBUILD */                                              1286
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                   1286
*         RFY (GPR01P,GPR13P) RSTD;                                1287
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1288
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1289
*         GPR04P=FSBPTR;                                           1290
         LR    GPR04P,FSBPTR                                       1290
*         DCL 1 FMZA0191 FIXED(31) STATIC LOCAL,                   1291
*             2 * FIXED(8) INIT(80),                               1291
*             2 * PTR(24) INIT(0);                                 1291
*         GPR03F = FMZA0191;                                       1292
*                                                                  1292
         L     GPR03F,FMZA0191                                     1292
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */             1293
*          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/             1294
         L     GPR15P,ATCLCPTR                                     1294
*        END; /*LISATCVT*/                                         1295
*         GPR02P = GPR15P->ATCBPDA;                                1296
         L     GPR02P,ATCBPDA(,GPR15P)                             1296
*         GPR15P=GPR15P->ATCSMRS;                                  1297
         L     GPR15P,ATCSMRS(,GPR15P)                             1297
*         DCL FMZL0191 BASED(GPR15P) LABEL VALUERANGE(*);          1298
*         CALL FMZL0191;                                           1299
         BALR  @14,@15                                             1299
*         RFY GPR13P RSTD;                                         1300
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1301
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1302
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                 1303
*        END ;/**********END OF RELSTORE EXPANSION**********/      1304
*   /*@DL31HMD*/                                                   1305
*        /*RELSTORE BUFADDR(RPHWEA)*/                              1305
*         DO;                                                      1305
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1306
*/* END OF ATBUILD */                                              1306
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                   1306
*         RFY (GPR01P,GPR13P) RSTD;                                1307
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1308
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1309
*         GPR04P=RPHWEA;                                           1310
         L     GPR04P,RPHWEA(,RPHPTR)                              1310
*         DCL 1 FMZA0207 FIXED(31) STATIC LOCAL,                   1311
*             2 * FIXED(8) INIT(64),                               1311
*             2 * PTR(24) INIT(0);                                 1311
*         GPR03F = FMZA0207;                                       1312
*                                                                  1312
         L     GPR03F,FMZA0207                                     1312
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */             1313
*          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/             1314
         L     GPR15P,ATCLCPTR                                     1314
*        END; /*LISATCVT*/                                         1315
*         GPR02P = GPR15P->ATCBPDA;                                1316
         L     GPR02P,ATCBPDA(,GPR15P)                             1316
*         GPR15P=GPR15P->ATCSMRS;                                  1317
         L     GPR15P,ATCSMRS(,GPR15P)                             1317
*         DCL FMZL0207 BASED(GPR15P) LABEL VALUERANGE(*);          1318
*         CALL FMZL0207;                                           1319
         BALR  @14,@15                                             1319
*         RFY GPR13P RSTD;                                         1320
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1321
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1322
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                 1323
*        END ;/**********END OF RELSTORE EXPANSION**********/      1324
*              /*@DL31HMD*/                                        1325
*      RFY (FSBPTR,FDBPTR) UNRSTD;                         /*@DL31HMD*/
*      END;                                                /*@DL31HMD*/
*   ELSE DO; /* DEVICE DISCONNECTED                          @DL31HMD*/
         B     @RC01107                                            1327
@RF01107 DS    0H                                                  1328
*   RFY RPARM2 RSTD;                                       /*@DL31HMD*/
*   RPARM2 = TIEPTR1; /* SET UP CID                          @DL31HMD*/
*                                                                  1329
         L     RPARM2,TIEPTR1(,TIEPTR)                             1329
*     DO; /* CIDCTL(FINISH)  */                                    1330
*                                                                  1330
*     RFY (EMCR2,EMCR3) RSTD;                                      1331
*       GEN SETS(RPHWORK)                                          1332
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1332
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*       EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                        1333
         SLR   EMCR3,EMCR3                                         1333
*       CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/     1334
*                                                                  1334
         L     @12,ATCLCPTR                                        1334
         L     @15,ATCCDFIN(,@12)                                  1334
         BALR  @14,@15                                             1334
*     RFY (EMCR2,EMCR3) UNRSTD;                                    1335
*     END; /*CIDCTL*/ /* RELEASE LOCKS                      @DL31HMD*/
*   RFY RPARM2 UNRSTD;                                     /*@DL31HMD*/
*   END;                                                   /*@DL31HMD*/
*  END;                                                    /*@DL31HMD*/
*ELSE;    /* CIDCTL FAILED JUST EXIT                         @DL31HMD*/
@RF01100 DS    0H                                                  1341
*/************ TWO LINES MOVED HERE BY APAR DY15259 ******** @ZA32663*/
*TIEPTR->QPTR=CMS0;  /*CLEAR CHAIN FIELD                     @DM14348*/
@RC01100 SLR   @12,@12                                             1341
         ST    @12,QPTR(,TIEPTR)                                   1341
*  /*RELSTORE BUFADDR(TIEPTR)*/                                    1342
*   DO;                                                            1342
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1343
*/* END OF ATBUILD */                                              1343
*  RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                         1343
*         RFY (GPR01P,GPR13P) RSTD;                                1344
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1345
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1346
*         GPR04P=TIEPTR;                                           1347
*         DCL 1 FMZA0227 FIXED(31) STATIC LOCAL,                   1348
*             2 * FIXED(8) INIT(64),                               1348
*             2 * PTR(24) INIT(0);                                 1348
*         GPR03F = FMZA0227;                                       1349
*                                                                  1349
         L     GPR03F,FMZA0227                                     1349
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                   1350
*    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                   1351
         L     GPR15P,ATCLCPTR                                     1351
*  END; /*LISATCVT*/                                               1352
*         GPR02P = GPR15P->ATCBPDA;                                1353
         L     GPR02P,ATCBPDA(,GPR15P)                             1353
*         GPR15P=GPR15P->ATCSMRS;                                  1354
         L     GPR15P,ATCSMRS(,GPR15P)                             1354
*         DCL FMZL0227 BASED(GPR15P) LABEL VALUERANGE(*);          1355
*         CALL FMZL0227;                                           1356
         BALR  @14,@15                                             1356
*         RFY GPR13P RSTD;                                         1357
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1358
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1359
*  RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                       1360
*  END ;/**********END OF RELSTORE EXPANSION**********/ /* RELEASE TIE
*                @DL31HMD*/                                        1361
*/********************************************************** @ZA32663*/
*RFY CREG14 RSTD;                                                  1362
*CREG14 = CSAVE; /* RESTORE RETURN REG                       @DL31HMD*/
         LR    CREG14,CSAVE                                        1363
*RFY (CREG14,CSAVE) UNRSTD;                               /* @DL31HMD*/
*END TRMHDL;                                               /*@DL31HMD*/
*                                                                  1365
@EL00002 DS    0H                                                  1365
@EF00002 DS    0H                                                  1365
@ER00002 BR    @14                                                 1365
@PB00002 DS    0H                                                  1365
*/* TPEPILOG   */                                                  1366
* GEN (PRINT OFF);                                                 1366
*                                                                  1366
*                                                                  1366
         PRINT OFF
* DECLARE                                                          1367
*   EMCR0 PTR REG(0),                                              1367
*   EMCR1 PTR REG(1),                                              1367
*   EMCR2 PTR REG(2),                                              1367
*   EMCR3 PTR REG(3),                                              1367
*   EMCR4 PTR REG(4),                                              1367
*   EMCR5 PTR REG(5),                                              1367
*   EMCR6 PTR REG(6),                                              1367
*   EMCR7 PTR REG(7),                                              1367
*   EMCR8 PTR REG(8),                                              1367
*   EMCR9 PTR REG(9),                                              1367
*   EMCR10 PTR REG(10),                                            1367
*   EMCR11 PTR REG(11),                                            1367
*   EMCR12 PTR REG(12),                                            1367
*   EMCR13 PTR REG(13),                                            1367
*   EMCR14 PTR REG(14),                                            1367
*   EMCR15 PTR REG(15);                                            1367
*                                                                  1367
* DECLARE                                                          1368
*   ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*), /*CIDCTL ADD ROUTINE*/
*   ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*), /*CIDCTL DELETE ROUTINE*/
*   ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*), /*CIDCTL FIND ROUTINE*/
*   ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*), /*CIDCTL FIND NCB ROUTINE*
*   ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*); /*CIDCTL FINISH ROUTINE*/
*   DCL CMZCIDM FIXED(15) DEFINED(ATCCIDM); /*CIDMASK ALIAS*/      1369
* DCL ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*); /*RESET ROUTINE*/    1370
* DCL ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*); /*TPQUE ROUTINE*/    1371
* GEN (PRINT ON);                                                  1372
         PRINT ON
*/* END OF TPEPILOG */                                             1373
*END ISTINCMS                               /* END ALL PROCEDURES    */
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        *
*/*%INCLUDE SYSLIB  (IHASRB  )                                        *
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        *
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        *
*/*%INCLUDE SYSUT5  (DOTESTBT)                                        *
*/*%INCLUDE SYSUT5  (DODAF   )                                        *
*/*%INCLUDE SYSUT5  (DOLINENM)                                        *
*/*%INCLUDE SYSUT5  (DOBLKIO )                                        *
*/*%INCLUDE SYSUT5  (DOLDNPTR)                                        *
*/*%INCLUDE SYSUT5  (DOVRYPAB)                                        *
*;                                                                 1373
@DATA    DS    0H
@CH05728 DC    XL2'0003'
@CH05729 DC    XL2'0002'
@DATD    DSECT
         DS    0F
ISTINCMS CSECT
         DS    0F
@CF00052 DC    F'4'
@CF00058 DC    F'8'
@CF01491 DC    F'12'
@CF00783 DC    XL4'08000000'
@CF00787 DC    XL4'04000000'
@CF01662 DC    XL4'80000000'
@CF02870 DC    XL4'7FFFFFFF'
@CF05632 DC    XL4'0000FFFF'
@CF05718 DC    XL4'00FFFFFF'
@CF05730 DC    XL4'32010000'
@CF05790 DC    BL4'11111111111111111111111111110111'
@CF05794 DC    BL4'00000000000000100000000000000000'
@CF05798 DC    BL4'11111111111111011111111111111111'
@DATD    DSECT
         DS    0D
SRBPTR   DS    A
IOSBPTR  DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTINCMS CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
FMZA0123 DS    FL4
         ORG   FMZA0123
@NM00097 DC    AL1(184)
@NM00098 DC    AL3(0)
         ORG   FMZA0123+4
FMZA0191 DS    FL4
         ORG   FMZA0191
@NM00099 DC    AL1(80)
@NM00100 DC    AL3(0)
         ORG   FMZA0191+4
FMZA0207 DS    FL4
         ORG   FMZA0207
@NM00101 DC    AL1(64)
@NM00102 DC    AL3(0)
         ORG   FMZA0207+4
FMZA0227 DS    FL4
         ORG   FMZA0227
@NM00103 DC    AL1(64)
@NM00104 DC    AL3(0)
         ORG   FMZA0227+4
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RDTEPTR  EQU   @05
IFTPTR   EQU   @08
LDNCBPTR EQU   @03
CMZK0002 EQU   @01
RPHPTR   EQU   @01
LCPBPTR  EQU   @06
IOBPRPTR EQU   @03
IOBSTPTR EQU   @03
FSBPTR   EQU   @08
FMCBPTR  EQU   @10
TIEPTR   EQU   @04
RPARM0   EQU   @00
RPARM2   EQU   @02
RSAVE    EQU   @13
RCDREG   EQU   @15
CREG14   EQU   @14
CSAVE    EQU   @05
FDBPTR   EQU   @09
RPHSAV   EQU   @03
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR07P   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR12P   EQU   @12
GPR13F   EQU   @13
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR15F   EQU   @15
GPR15P   EQU   @15
EMCR2    EQU   @02
EMCR3    EQU   @03
PNTR0163 EQU   @08
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ATCLCPTR EQU   1032
CMZP0098 EQU   16
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVT0PT01 EQU   CVTMAP+152
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHCVFLG EQU   RPHRPHA
RPHGATE  EQU   RPHCVFLG
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWCD   EQU   LCCWFLAG
LCCWIDAT EQU   LCCWFLAG
LCCWLSI  EQU   LCCWFLAG
LCCWCNT  EQU   ISTLCCW+2
LCCWDATA EQU   ISTLCCW+4
ISTLCPB  EQU   0
LCPTYPE  EQU   ISTLCPB
LCPLNGTH EQU   ISTLCPB+1
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPASYN  EQU   LCPFLAG2
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPNXLCW EQU   ISTLCPB+20
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
LCPFTYPE EQU   LCPRPHA
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
PFCFTA   EQU   ISTPFCRR+12
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRWKARA EQU   ISTZCRR+156
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRAFRR   EQU   CRAHDR+4
CRALKACT EQU   CRABASIC+8
CRAL2PTR EQU   CRABASIC+16
CRAL3PTR EQU   CRABASIC+20
CRAPROCR EQU   ISTCRA+312
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTCNSTA EQU   0
CNSTFLDA EQU   ISTCNSTA+16
CNSTFLDB EQU   ISTCNSTA+19
ISTVYCRR EQU   0
VYCAUDIT EQU   ISTVYCRR+22
VYCNTRD  EQU   VYCAUDIT
NINCMS   EQU   VYCNTRD+1
VYCCRT   EQU   VYCAUDIT+12
CINCMS   EQU   VYCCRT+1
IOBPREFX EQU   0
IOBCFLG1 EQU   IOBPREFX
IOBSTDRD EQU   0
IOBFLAG1 EQU   IOBSTDRD
IOBCYCCK EQU   IOBFLAG1
IOBRSTRT EQU   IOBFLAG1
IOBFLAG2 EQU   IOBSTDRD+1
IOBPURGE EQU   IOBFLAG2
IOBRDHA0 EQU   IOBFLAG2
IOBSENS0 EQU   IOBSTDRD+2
IOBS0B7  EQU   IOBSENS0
IOBSENS1 EQU   IOBSTDRD+3
IOBECBPT EQU   IOBSTDRD+4
IOBFLAG3 EQU   IOBSTDRD+8
IOBFL3   EQU   IOBFLAG3
IOBCNC   EQU   IOBFL3
IOBICL   EQU   IOBFL3
IOBCSW   EQU   IOBSTDRD+9
IOBIOCSW EQU   IOBCSW
IOBSTBYT EQU   IOBIOCSW+3
IOBUSTAT EQU   IOBSTBYT
IOBCSTAT EQU   IOBSTBYT+1
IOBSTART EQU   IOBSTDRD+16
IOBDCBPT EQU   IOBSTDRD+20
IOBFLAG4 EQU   IOBDCBPT
IOBRESTR EQU   IOBSTDRD+24
IOBINCAM EQU   IOBSTDRD+28
IOBBTAMF EQU   IOBINCAM
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00045 EQU   IOSB+20
IOSCSW   EQU   @NM00045+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSDIE   EQU   IOSB+68
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
ISTTIE   EQU   0
TIERETCD EQU   ISTTIE+2
TIEREQ   EQU   ISTTIE+3
TIETIEA  EQU   ISTTIE+4
TIESNA   EQU   ISTTIE+8
TIEPTR1  EQU   TIESNA
TIERPHA  EQU   ISTTIE+12
ISTIFTPL EQU   0
IFTFB0   EQU   ISTIFTPL
IFTTBON  EQU   IFTFB0
IFTTBOFF EQU   IFTFB0
IFTSTDAF EQU   IFTFB0
IFTFLNNM EQU   IFTFB0
IFTTBIO  EQU   IFTFB0
IFTTBIOF EQU   IFTFB0
IFTFLDNP EQU   IFTFB0
IFTFPABP EQU   IFTFB0
IFTSB0   EQU   ISTIFTPL+2
IFTTPPST EQU   IFTSB0
IFTVOCLK EQU   IFTSB0
IFTRDTLK EQU   IFTSB0
IFTDEVOF EQU   IFTSB0
IFTECBPR EQU   ISTIFTPL+4
IFTSYMDV EQU   ISTIFTPL+8
IFTSYMRT EQU   ISTIFTPL+16
IFTPABPR EQU   ISTIFTPL+24
IFTLDNPR EQU   ISTIFTPL+28
IFTRETCD EQU   ISTIFTPL+32
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00056 EQU   LOKCHNG+2
ISTDYPAB EQU   0
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBPDA  EQU   ATCCOM+128
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCSMRQ  EQU   ATCCOM+180
ATCSMRS  EQU   ATCCOM+188
ATCSRTDF EQU   ATCCOM+208
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCAP33  EQU   ISTATCVT+444
ATCAP35  EQU   ISTATCVT+448
ATCAP36  EQU   ISTATCVT+452
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVOCLK EQU   ISTATCVT+468
ATCRDTLK EQU   ISTATCVT+472
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00064 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00066 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNCB   EQU   0
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
ISTLDNCB EQU   0
LDNCFLAG EQU   ISTLDNCB+54
LDNFLAGS EQU   ISTLDNCB+107
LDNZF006 EQU   LDNFLAGS
LDNTPBIO EQU   LDNFLAGS+2
LDNFLAG2 EQU   ISTLDNCB+110
LDNZIOLK EQU   ISTLDNCB+184
LDNZERPF EQU   ISTLDNCB+185
LDNZCPAN EQU   LDNZERPF
LDNZEPIN EQU   LDNZERPF
LDNZLPC  EQU   ISTLDNCB+186
LDNDCDEB EQU   ISTLDNCB+304
LDNZSAV3 EQU   ISTLDNCB+376
LDNZSAV4 EQU   LDNZSAV3+8
LDNIOSB  EQU   ISTLDNCB+412
LDNZH003 EQU   ISTLDNCB+577
ISTRPRE  EQU   0
RPRNAME  EQU   ISTRPRE
RPRCOMID EQU   ISTRPRE+8
RPRDAF   EQU   RPRCOMID+2
RPRENTRY EQU   ISTRPRE+20
RPRFLAGA EQU   ISTRPRE+21
RPRFLAGB EQU   ISTRPRE+22
RPRINTST EQU   RPRFLAGB
RPRCAUSE EQU   ISTRPRE+23
RPRNSNEA EQU   ISTRPRE+36
RPRFLAGD EQU   ISTRPRE+61
RPRFLAGC EQU   ISTRPRE+62
ISTRCPRE EQU   0
RCPPMODE EQU   ISTRCPRE+91
RCPLGNIN EQU   ISTRCPRE+92
ISTRDT   EQU   0
RDTPLEN  EQU   ISTRDT+72
RDTPRIOR EQU   RDTPLEN
RDTFLAGB EQU   ISTRDT+91
RDTTPAB  EQU   ISTRDT+104
RDTVYRPH EQU   ISTRDT+108
RDTSTCNT EQU   ISTRDT+112
ISTRAP   EQU   0
RAPFLG   EQU   ISTRAP+108
RAPFLGB  EQU   ISTRAP+109
RAPFLGC  EQU   ISTRAP+110
ISTRLC   EQU   0
RLCADR   EQU   ISTRLC+72
RLCFLAG  EQU   RLCADR
ISTRRN   EQU   0
RRNADR   EQU   ISTRRN+136
RRNFLAG  EQU   RRNADR
RRNUCBAD EQU   RRNADR+1
RRNRDF   EQU   ISTRRN+172
RRNRDFA  EQU   RRNRDF
RRNRDFB  EQU   RRNRDF+1
RRNCMF   EQU   ISTRRN+176
RRNCMFA  EQU   RRNCMF
RRNCMFB  EQU   RRNCMF+1
RRNCMFC  EQU   RRNCMF+2
RRNCMFD  EQU   RRNCMF+3
RRNNMDPD EQU   ISTRRN+192
RRNHPRE  EQU   ISTRRN+216
ISTRGP   EQU   0
RGPFLG   EQU   ISTRGP+72
ISTRLN   EQU   0
RLNADR   EQU   ISTRLN+72
RLNFLAG  EQU   RLNADR
RLNUCBAD EQU   RLNADR+1
RLNSTAT1 EQU   ISTRLN+86
RLNSTAT2 EQU   ISTRLN+87
RLNRDF   EQU   ISTRLN+88
RLNRDFA  EQU   RLNRDF
RLNRACNT EQU   RLNRDFA
RLNPORT  EQU   RLNRDFA
RLNRDFB  EQU   RLNRDF+1
RLNCRFLG EQU   ISTRLN+102
RLNLSCMD EQU   RLNCRFLG
ISTRPT   EQU   0
RPTLNCID EQU   ISTRPT+116
RPTLNDAF EQU   RPTLNCID+2
RPTDITT  EQU   ISTRPT+128
RPTFLAG1 EQU   ISTRPT+140
ISTRCL   EQU   0
RCLADR   EQU   ISTRCL+72
RCLFLAG  EQU   RCLADR
ISTRTR   EQU   0
RTRADR   EQU   ISTRTR+124
RTRFLAG  EQU   RTRADR
RTRRDFA  EQU   ISTRTR+136
RTRRAALL EQU   RTRRDFA
RTRRDFB  EQU   ISTRTR+137
RTRRDFC  EQU   ISTRTR+138
RTRRDFD  EQU   ISTRTR+139
RTRRDFE  EQU   ISTRTR+140
RTRRDFF  EQU   ISTRTR+141
RTRCRFLG EQU   ISTRTR+143
RTRLSCMD EQU   RTRCRFLG
RTRBSCID EQU   ISTRTR+188
ISTRIN   EQU   0
RINDFD   EQU   ISTRIN+124
RINREMPO EQU   RINDFD
RINNODEF EQU   RINDFD
RINLDISC EQU   RINDFD
RINNODID EQU   ISTRIN+125
RINRLDAF EQU   ISTRIN+126
RINREMOT EQU   ISTRIN+128
RINVPAB  EQU   ISTRIN+132
RINRPHCN EQU   ISTRIN+136
RINNCSPL EQU   ISTRIN+140
RINCNCNT EQU   ISTRIN+144
ISTRDS   EQU   0
ISTDOT   EQU   0
ISTRCC   EQU   0
RCCFLAG  EQU   ISTRCC+73
RCCFLAGB EQU   ISTRCC+74
RCCSTAID EQU   ISTRCC+78
RCCID48  EQU   RCCSTAID+2
RCCCRFLG EQU   ISTRCC+108
ISTRLU   EQU   0
RLUFLAG  EQU   ISTRLU+125
RLUCRFLG EQU   ISTRLU+126
RLUPACE  EQU   ISTRLU+132
RLUNCPPC EQU   ISTRLU+134
RLUUSSTB EQU   ISTRLU+140
RLUMODET EQU   ISTRLU+152
ISTRPX   EQU   0
ISTRLX   EQU   0
RLXFLAGA EQU   ISTRLX+76
ISTRSW   EQU   0
ISTRDA   EQU   0
RDAADR   EQU   ISTRDA+72
RDAFLAG  EQU   RDAADR
RDAUCBAD EQU   RDAADR+1
ISTRLS   EQU   0
ISTDNT   EQU   0
ISTGNT   EQU   0
ISTPAT   EQU   0
PATFLAGA EQU   ISTPAT+7
ISTDCCRR EQU   0
CRRSPACE EQU   ISTDCCRR+12
CRRSAREA EQU   0
CRRMAS   EQU   CRRSAREA+148
CRRMAS1  EQU   CRRMAS
CRRMAS2  EQU   CRRMAS+1
CRRMAS3  EQU   CRRMAS+2
CRRMAS4  EQU   CRRMAS+3
CRRRMAS1 EQU   CRRMAS+4
CRRRMAS2 EQU   CRRMAS+5
CRRRMAS3 EQU   CRRMAS+6
CRRSMAS  EQU   CRRRMAS3
CRRATS   EQU   CRRSAREA+156
CRRATS1  EQU   CRRATS
CRRATS2  EQU   CRRATS+1
CRRATS3  EQU   CRRATS+2
CRRATS4  EQU   CRRATS+3
CRRRATS1 EQU   CRRATS+4
CRRRATS2 EQU   CRRATS+5
CRRRATS3 EQU   CRRATS+6
CRRSATS  EQU   CRRRATS3
CRRFLGS1 EQU   CRRSAREA+164
CRRFLGS2 EQU   CRRSAREA+165
CRRFLGS3 EQU   CRRSAREA+166
CRRFLGS4 EQU   CRRSAREA+167
CRRFLGS  EQU   CRRSAREA+168
CRRRFLG1 EQU   CRRSAREA+169
CRRRTYPE EQU   CRRRFLG1
CRRFDBK1 EQU   CRRSAREA+170
CRRFDB2  EQU   CRRFDBK1+1
CRRFDB3  EQU   CRRFDBK1+2
CRRFDBK2 EQU   CRRSAREA+176
CRRDSB   EQU   CRRFDBK2
CRRESR   EQU   CRRFDBK2+2
CRRTRBUF EQU   CRRSAREA+204
CRRATCVT EQU   CRRSAREA+216
CRRBFLGS EQU   CRRSAREA+280
ISTRH    EQU   0
RHFLAGS  EQU   ISTRH
RH1      EQU   RHFLAGS
RHTYPE   EQU   RH1
RHSCI    EQU   RH1
RHFORMAT EQU   RH1
RHCHAIN  EQU   RH1
RH2      EQU   RHFLAGS+1
RHFME    EQU   RH2
RHRETRY  EQU   RH2
RHRSVD1  EQU   RH2
RH3      EQU   RHFLAGS+2
ISTFDB   EQU   0
FDBFDBA  EQU   ISTFDB
FDBOFSET EQU   ISTFDB+10
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBMNRCD EQU   FSBFSB+2
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBERC   EQU   FSBNETRS+1
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
FSBFDB   EQU   ISTFSB+32
ISTNMLPB EQU   0
NMLCW2   EQU   ISTNMLPB+56
NMLCW3   EQU   ISTNMLPB+64
NMCONTRL EQU   ISTNMLPB+72
NMLCWCMD EQU   NMCONTRL+2
NMRDTEA  EQU   NMCONTRL+4
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCSTAT  EQU   ISTFMCB+28
FMCDEVOF EQU   FMCSTAT
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCPAB1  EQU   ISTFMCB+64
FMCPAB5  EQU   ISTFMCB+128
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCCPIP  EQU   FMCSTAT2
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF006 EQU   FMCZFLAG
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
QPTR     EQU   0
INCMS001 EQU   0
INCMSVPB EQU   INCMS001
INCMSDAF EQU   INCMS001+4
INCMSVAF EQU   INCMS001+6
ISTOCCDF EQU   0
FMZL0013 EQU   0
FMZL0018 EQU   0
ISTSDCCF EQU   0
ISTSDCCR EQU   0
FMZL0063 EQU   0
FMZL0073 EQU   0
FMZL0111 EQU   0
FMZL0123 EQU   0
FMZL0147 EQU   0
ISTAPC34 EQU   0
ISTPLCPB EQU   0
PLCLCCW  EQU   ISTPLCPB+56
ISTAPC37 EQU   0
FMZL0181 EQU   0
FMZL0191 EQU   0
FMZL0207 EQU   0
FMZL0227 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCN EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
IOBORG01 EQU   IOBPREFX+8
IOBNIOBA EQU   IOBORG01
IOBNFLG1 EQU   IOBNIOBA
IOBPRTOV EQU   IOBNFLG1
IOBORG02 EQU   IOBPREFX+8
IOBDQADA EQU   IOBORG02
IOBDEQIN EQU   IOBDQADA
IOBORG03 EQU   IOBPREFX+12
IOBORG04 EQU   IOBINCAM
IOBORG12 EQU   IOBINCAM
IOBFL4   EQU   IOBORG12
IOBEXTEN EQU   IOBSTDRD+32
IOBSEEK  EQU   IOBEXTEN
IOBBB    EQU   IOBSEEK+1
IOBCC    EQU   IOBSEEK+3
IOBHH    EQU   IOBSEEK+5
IOBORG05 EQU   IOBEXTEN
IOBORG06 EQU   IOBEXTEN
IOBNXTPT EQU   IOBORG06+4
IOBSTATA EQU   IOBNXTPT
IOBORG07 EQU   IOBEXTEN+8
W1IEXTEN EQU   IOBORG07
IOBORG08 EQU   IOBEXTEN+8
IOBINDCT EQU   IOBORG08+4
IOBUNSQR EQU   IOBORG08+5
IOBFCHAD EQU   IOBORG08+8
IOBORG09 EQU   IOBEXTEN+8
IOBDPLAD EQU   IOBORG09+4
IOBDTYPE EQU   IOBORG09+8
IOBDTYP2 EQU   IOBORG09+9
IOBDSTAT EQU   IOBORG09+10
IOBSTAT1 EQU   IOBDSTAT
IOBORG10 EQU   IOBEXTEN+8
IOBSEEK2 EQU   IOBORG10
IOBORG11 EQU   IOBEXTEN
IOBERCT  EQU   IOBORG11
IOBUCBXV EQU   IOBERCT
IOBNAME  EQU   IOBORG11+4
IOBORG13 EQU   IOBEXTEN
IOBSKADR EQU   IOBORG13
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00089 EQU   FSBRQTAG
CMZCIDM  EQU   ATCCIDM
RTRDNCBA EQU   ISTRTR+40
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
FSBRT0B  EQU   @NM00089+1
FSBRT0A  EQU   @NM00089+1
FSBRT09  EQU   @NM00089+1
FSBRT08  EQU   @NM00089+1
FSBRT07  EQU   @NM00089
FSBRT06  EQU   @NM00089
FSBRT05  EQU   @NM00089
FSBRT04  EQU   @NM00089
FSBRT03  EQU   @NM00089
FSBRT02  EQU   @NM00089
FSBRT01  EQU   @NM00089
FSBRT00  EQU   @NM00089
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00050 EQU   IOSPCISC+4
@NM00049 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00048 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
IOBSKSS  EQU   IOBSKADR+3
IOBSK0   EQU   IOBSKADR+2
IOBSKTT  EQU   IOBSKADR+1
IOBSKRV  EQU   IOBSKADR
IOBCSWSV EQU   IOBORG11+17
IOBSENSV EQU   IOBORG11+16
IOBRCD   EQU   IOBORG11+12
IOBMDREC EQU   IOBORG11+8
IOBNAMEA EQU   IOBNAME+1
IOBNAMSZ EQU   IOBNAME
IOBERCTA EQU   IOBERCT+1
IOBRTYPE EQU   IOBUCBXV
IOBRDCHP EQU   IOBORG10+20
IOBNEXTA EQU   IOBORG10+16
IOBREADA EQU   IOBORG10+12
IOBBUFC  EQU   IOBORG10+8
IOBSK2R  EQU   IOBSEEK2+7
IOBSK2HH EQU   IOBSEEK2+5
IOBSK2CC EQU   IOBSEEK2+3
IOBSK2BB EQU   IOBSEEK2+1
IOBSK2M  EQU   IOBSEEK2
IOBCHNPR EQU   IOBORG09+40
IOBDNCRF EQU   IOBORG09+32
IOBRSV35 EQU   IOBORG09+24
IOBDQPTR EQU   IOBORG09+20
IOBRSV34 EQU   IOBORG09+18
IOBDBYTN EQU   IOBORG09+16
IOBDCPND EQU   IOBORG09+12
IOBSTAT2 EQU   IOBDSTAT+1
IOBSIORT EQU   IOBSTAT1
IOBADDVU EQU   IOBSTAT1
IOBBUFF  EQU   IOBSTAT1
IOBENQUE EQU   IOBSTAT1
IOBPASS2 EQU   IOBSTAT1
IOBSYNCH EQU   IOBSTAT1
IOBNEWVL EQU   IOBSTAT1
IOBABNRM EQU   IOBSTAT1
IOBRELEX EQU   IOBDTYP2
IOBADDTY EQU   IOBDTYP2
IOBTYPE  EQU   IOBDTYP2
IOBRQUST EQU   IOBDTYP2
IOBSUFFX EQU   IOBDTYP2
IOBSBLKL EQU   IOBDTYP2
IOBSKEY  EQU   IOBDTYP2
IOBRELBL EQU   IOBDTYPE
IOBRDEXC EQU   IOBDTYPE
IOBDYNBF EQU   IOBDTYPE
IOBACTAD EQU   IOBDTYPE
IOBFDBCK EQU   IOBDTYPE
IOBEXTSC EQU   IOBDTYPE
IOBOVFLO EQU   IOBDTYPE
IOBVERFY EQU   IOBDTYPE
IOBDPLB  EQU   IOBDPLAD+1
IOBDAYLI EQU   IOBDPLAD
IOBDIOBS EQU   IOBORG09+2
IOBDBYTR EQU   IOBORG09
IOBBCHAD EQU   IOBORG08+12
IOBFCHNB EQU   IOBFCHAD+1
IOBCOUNT EQU   IOBFCHAD
IOBASYN  EQU   IOBORG08+7
IOBAPP   EQU   IOBORG08+6
IOBRSV32 EQU   IOBUNSQR
IOBRSV31 EQU   IOBUNSQR
IOBRSV30 EQU   IOBUNSQR
IOBKNRWR EQU   IOBUNSQR
IOBKNWR  EQU   IOBUNSQR
IOBNTAV2 EQU   IOBUNSQR
IOBNTAV1 EQU   IOBUNSQR
IOBCPBSY EQU   IOBUNSQR
IOBCHNNL EQU   IOBINDCT
IOBRSV29 EQU   IOBINDCT
IOBRSV28 EQU   IOBINDCT
IOBRSV27 EQU   IOBINDCT
IOBKEYAD EQU   IOBINDCT
IOBOVPTR EQU   IOBINDCT
IOBUNSCH EQU   IOBINDCT
IOBDEQCP EQU   IOBINDCT
IOBCCWAD EQU   IOBORG08
W1OEXTEN EQU   W1IEXTEN
IOBCCW   EQU   IOBORG06+8
IOBNXTPB EQU   IOBNXTPT+1
IOBRSV26 EQU   IOBSTATA
IOBRSV25 EQU   IOBSTATA
IOBRSV24 EQU   IOBSTATA
IOBRSV23 EQU   IOBSTATA
IOBRSV22 EQU   IOBSTATA
IOBRSV21 EQU   IOBSTATA
IOBRSV20 EQU   IOBSTATA
IOBAVLFL EQU   IOBSTATA
IOBRSV37 EQU   IOBORG06+1
IOBUCBXG EQU   IOBORG06
IOBCPA   EQU   IOBORG05+32
IOBERINF EQU   IOBORG05+16
IOBERCCW EQU   IOBORG05+8
IOBSNDPT EQU   IOBORG05+7
IOBRCVPT EQU   IOBORG05+6
IOBWORK  EQU   IOBORG05+1
IOBUCBX  EQU   IOBORG05
IOBR     EQU   IOBSEEK+7
IOBHH2   EQU   IOBHH+1
IOBHH1   EQU   IOBHH
IOBCC2   EQU   IOBCC+1
IOBCC1   EQU   IOBCC
IOBBB2   EQU   IOBBB+1
IOBBB1   EQU   IOBBB
IOBM     EQU   IOBSEEK
IOBRSV46 EQU   IOBFL4
IOBRSV47 EQU   IOBFL4
IOBENT   EQU   IOBFL4
IOBEQP   EQU   IOBFL4
IOBBUS   EQU   IOBFL4
IOBDCK   EQU   IOBFL4
IOBREJ   EQU   IOBFL4
IOBOVR   EQU   IOBFL4
IOBCRILC EQU   IOBORG04+1
IOBCRDCC EQU   IOBORG04
IOBGQECB EQU   IOBORG03
IOBSWAP  EQU   IOBORG02+4
IOBDQADB EQU   IOBDQADA+1
IOBRSV13 EQU   IOBDEQIN
IOBRSV12 EQU   IOBDEQIN
IOBRSV11 EQU   IOBDEQIN
IOBRSV10 EQU   IOBDEQIN
IOBRSV09 EQU   IOBDEQIN
IOBRSV08 EQU   IOBDEQIN
IOBRSV07 EQU   IOBDEQIN
IOBDEQ   EQU   IOBDEQIN
IOBNECB  EQU   IOBORG01+4
IOBNIOBB EQU   IOBNIOBA+1
IOBFIRST EQU   IOBNFLG1
IOBUPERR EQU   IOBNFLG1
IOBSPAN  EQU   IOBNFLG1
IOBBKSPC EQU   IOBNFLG1
IOBUPDAT EQU   IOBNFLG1
IOBREAD  EQU   IOBNFLG1
IOBWRITE EQU   IOBNFLG1
IOBSEGMT EQU   IOBPRTOV
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PLCLCPB  EQU   ISTPLCPB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCFRRPH EQU   FMCCVFLG
FMCOWRPH EQU   FMCCVFLG
FMCCDRPH EQU   FMCCVFLG
FMCPSRPH EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00096 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00095 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00094 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00093 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCCDPIP EQU   FMCSTAT2
FMCPSPIP EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB4  EQU   ISTFMCB+112
FMCPAB3  EQU   ISTFMCB+96
FMCPAB2  EQU   ISTFMCB+80
FMCFASYA EQU   ISTFMCB+60
FMCMODE  EQU   ISTFMCB+52
FMCPROCD EQU   ISTFMCB+48
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00092 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00091 EQU   ISTFMCB+30
@NM00090 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PROCPUID EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
NMLRSV05 EQU   ISTNMLPB+96
NMLRSV04 EQU   ISTNMLPB+92
NMLDRDTE EQU   ISTNMLPB+88
NMECBPTR EQU   ISTNMLPB+84
NMLRSV02 EQU   ISTNMLPB+82
NMLRSV06 EQU   ISTNMLPB+81
NMIPSEQ  EQU   ISTNMLPB+80
NMNCSPL  EQU   NMRDTEA
NMRSV01  EQU   NMLCWCMD+1
NMECRST  EQU   NMLCWCMD+1
NMVRYPRG EQU   NMLCWCMD+1
NMSTCTLF EQU   NMLCWCMD+1
NMSTCTLI EQU   NMLCWCMD+1
NMSTCTLR EQU   NMLCWCMD
NMFBDTA  EQU   NMLCWCMD
NMRDBLK  EQU   NMLCWCMD
NMDSEOC  EQU   NMLCWCMD
NMPURGE  EQU   NMLCWCMD
NMRESTI  EQU   NMLCWCMD
NMCNTCT  EQU   NMLCWCMD
NMINVT   EQU   NMLCWCMD
NMPSRTRY EQU   NMCONTRL+1
NMFNCTCD EQU   NMCONTRL
NMLCPB   EQU   ISTNMLPB
FSBRSV01 EQU   FSBFSB+30
FSBTHCNT EQU   FSBFSB+28
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00088 EQU   FSBSS2
@NM00087 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00086 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBELI   EQU   FSBERC
FSBMJRCD EQU   FSBSRCAT
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBDAF   EQU   FSBCID+2
FSBSAF   EQU   FSBCID
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
FSBLNGTH EQU   FSBFSB+1
FSBTYPE  EQU   FSBFSB
FDBDATCT EQU   ISTFDB+8
FDBDATAA EQU   ISTFDB+4
RHRSVD5  EQU   RH3
RHRSVD4  EQU   RH3
RHLOG    EQU   RH3
RHRSVD3  EQU   RH3
RHRCDIR  EQU   RH3
RHCDIR   EQU   RH3
RHEB     EQU   RH3
RHBB     EQU   RH3
RHPACE   EQU   RH2
RHRSVD2  EQU   RH2
RHINOP   EQU   RHRSVD1
RHBUSY   EQU   RHRETRY
RHEXCEPT EQU   RH2
RHRRN    EQU   RH2
RHPE     EQU   RH2
RHSENSE  EQU   RH1
RHDIRI   EQU   RH1
RHQS     EQU   RH1
CRRRVPT5 EQU   CRRSAREA+316
CRRRVPT4 EQU   CRRSAREA+312
CRRRVPT3 EQU   CRRSAREA+308
CRRRVPT2 EQU   CRRSAREA+304
CRRRVPT1 EQU   CRRSAREA+300
CRRRVCR2 EQU   CRRSAREA+292
CRRRVCR1 EQU   CRRSAREA+291
CRRXFNCD EQU   CRRSAREA+290
CRRLDOCT EQU   CRRSAREA+288
CRRBTLEN EQU   CRRSAREA+284
CRRBLEN  EQU   CRRSAREA+282
CRRBRTCD EQU   CRRSAREA+281
@NM00085 EQU   CRRBFLGS
CRRDIRPT EQU   CRRBFLGS
CRRBFLG1 EQU   CRRBFLGS
CRRBLDAD EQU   CRRSAREA+276
CRRBARAD EQU   CRRSAREA+272
CRRRTN12 EQU   CRRSAREA+268
CRRRTN11 EQU   CRRSAREA+264
CRRRTN10 EQU   CRRSAREA+260
CRRRTN9  EQU   CRRSAREA+256
CRRRTN8  EQU   CRRSAREA+252
CRRRTN7  EQU   CRRSAREA+248
CRRRTN6  EQU   CRRSAREA+244
CRRRTN5  EQU   CRRSAREA+240
CRRRTN4  EQU   CRRSAREA+236
CRRRTN3  EQU   CRRSAREA+232
CRRRTN2  EQU   CRRSAREA+228
CRRRTN1  EQU   CRRSAREA+224
CRRRES1  EQU   CRRSAREA+222
CRRLCNT  EQU   CRRSAREA+220
CRRVALCK EQU   CRRSAREA+212
CRRARPL  EQU   CRRTRBUF+4
CRRBIND  EQU   CRRTRBUF+3
CRRTRRES EQU   CRRTRBUF
CRRCLDO  EQU   CRRSAREA+200
CRRUECB  EQU   CRRSAREA+196
CRRLCPB  EQU   CRRSAREA+192
CRRCMDAD EQU   CRRSAREA+188
CRRFMCB  EQU   CRRSAREA+184
CRRCLCCW EQU   CRRSAREA+180
CRRESR2  EQU   CRRESR+1
CRRESR1  EQU   CRRESR
CRRDSB2  EQU   CRRDSB+1
CRRDSB1  EQU   CRRDSB
CRRDTACT EQU   CRRSAREA+174
CRRRSV99 EQU   CRRSAREA+173
CRRRDSOH EQU   CRRFDB3
CRRRLG   EQU   CRRFDB3
CRRLGFRC EQU   CRRFDB3
CRRRDEOT EQU   CRRFDB3
CRRRDEOM EQU   CRRFDB3
CRRRDEOB EQU   CRRFDB3
CRRUNUSD EQU   CRRFDB3
CRRUINPT EQU   CRRFDB3
CRRSTSAV EQU   CRRFDB2
CRRCUERR EQU   CRRFDB2
CRRDLGFL EQU   CRRFDB2
CRRIOERR EQU   CRRFDB2
CRRDVUNS EQU   CRRFDB2
CRRATND  EQU   CRRFDB2
CRRRVID  EQU   CRRFDB2
CRRERLK  EQU   CRRFDB2
CRRRTNCD EQU   CRRFDBK1
CRRNSNA  EQU   CRRRTYPE
CRRDFSYN EQU   CRRRTYPE
CRRRESP  EQU   CRRRTYPE
CRRDFASY EQU   CRRRTYPE
CRRDBLCK EQU   CRRRFLG1
CRRRPSBD EQU   CRRRFLG1
CRRRPLOQ EQU   CRRRFLG1
CRRRPLS  EQU   CRRRFLG1
CRRSW7   EQU   CRRFLGS
CRRSW6   EQU   CRRFLGS
CRRSW5   EQU   CRRFLGS
CRRSW4   EQU   CRRFLGS
CRRSW3   EQU   CRRFLGS
CRRSW2   EQU   CRRFLGS
CRRSW1   EQU   CRRFLGS
CRRSW0   EQU   CRRFLGS
CRRRSV04 EQU   CRRFLGS4
CRRFMCLK EQU   CRRFLGS4
CRRDLCCW EQU   CRRFLGS3
CRRRESET EQU   CRRFLGS3
CRRSUBBK EQU   CRRFLGS3
CRRRSV08 EQU   CRRFLGS3
CRRDEBQ  EQU   CRRFLGS3
CRRSTSPR EQU   CRRFLGS3
CRRDREQ  EQU   CRRFLGS3
CRRDFDBK EQU   CRRFLGS3
CRRDFSB  EQU   CRRFLGS2
CRRDPROC EQU   CRRFLGS2
CRREXTS  EQU   CRRFLGS2
CRRELSRI EQU   CRRFLGS2
CRRPOST  EQU   CRRFLGS2
CRRENDLW EQU   CRRFLGS2
CRRPRGIP EQU   CRRFLGS2
CRRDEXP  EQU   CRRFLGS2
CRRSOLRQ EQU   CRRFLGS1
CRRREQP  EQU   CRRFLGS1
CRRCPROC EQU   CRRFLGS1
CRRFINI  EQU   CRRFLGS1
CRRPREIO EQU   CRRFLGS1
CRRINIO  EQU   CRRFLGS1
CRRFLDOS EQU   CRRFLGS1
CRRDOCUR EQU   CRRFLGS1
CRRRATS4 EQU   CRRATS+7
@NM00084 EQU   CRRSATS
CRRASC51 EQU   CRRSATS
CRRASC40 EQU   CRRSATS
CRRASC30 EQU   CRRSATS
CRRASC21 EQU   CRRSATS
CRRASC10 EQU   CRRSATS
CRRASC01 EQU   CRRSATS
@NM00083 EQU   CRRRATS2
CRRPLIC  EQU   CRRRATS2
CRRRC81  EQU   CRRRATS2
CRRRC80  EQU   CRRRATS2
CRRRC65  EQU   CRRRATS2
CRRRC63  EQU   CRRRATS2
CRRRC55  EQU   CRRRATS2
CRRRC54  EQU   CRRRATS2
CRRRC53  EQU   CRRRATS1
CRRRC52  EQU   CRRRATS1
CRRRC51  EQU   CRRRATS1
CRRRC30  EQU   CRRRATS1
CRRRC26  EQU   CRRRATS1
CRRRC23  EQU   CRRRATS1
CRRRC22  EQU   CRRRATS1
CRRRC21  EQU   CRRRATS1
@NM00082 EQU   CRRATS4
CRRC3X   EQU   CRRATS4
CRRC85   EQU   CRRATS4
CRRC83   EQU   CRRATS4
CRRC82   EQU   CRRATS4
CRRC61   EQU   CRRATS4
CRRC60   EQU   CRRATS4
CRRC81   EQU   CRRATS3
CRRC80   EQU   CRRATS3
CRRC75   EQU   CRRATS3
CRRC51   EQU   CRRATS3
CRRC50   EQU   CRRATS3
CRRC42   EQU   CRRATS3
CRRC41   EQU   CRRATS3
CRRC40   EQU   CRRATS3
CRRC32   EQU   CRRATS2
CRRC31   EQU   CRRATS2
CRRC30   EQU   CRRATS2
CRRC25   EQU   CRRATS2
CRRC24   EQU   CRRATS2
CRRC23   EQU   CRRATS2
CRRC22   EQU   CRRATS2
CRRC21   EQU   CRRATS2
CRRC20   EQU   CRRATS1
CRRC13   EQU   CRRATS1
CRRC12   EQU   CRRATS1
CRRC11   EQU   CRRATS1
CRRC10   EQU   CRRATS1
CRRC02   EQU   CRRATS1
CRRC01   EQU   CRRATS1
CRRC00   EQU   CRRATS1
CRRRMAS4 EQU   CRRMAS+7
@NM00081 EQU   CRRSMAS
CRRMSC51 EQU   CRRSMAS
CRRMSC40 EQU   CRRSMAS
CRRMSC30 EQU   CRRSMAS
CRRMSC21 EQU   CRRSMAS
CRRMSC10 EQU   CRRSMAS
CRRMSC01 EQU   CRRSMAS
@NM00080 EQU   CRRRMAS2
CRRRM81  EQU   CRRRMAS2
CRRRM80  EQU   CRRRMAS2
CRRRM65  EQU   CRRRMAS2
CRRRM63  EQU   CRRRMAS2
CRRRM55  EQU   CRRRMAS2
CRRRM54  EQU   CRRRMAS2
CRRRM53  EQU   CRRRMAS1
CRRRM52  EQU   CRRRMAS1
CRRRM51  EQU   CRRRMAS1
CRRRM30  EQU   CRRRMAS1
CRRRM26  EQU   CRRRMAS1
CRRRM23  EQU   CRRRMAS1
CRRRM22  EQU   CRRRMAS1
CRRRM21  EQU   CRRRMAS1
@NM00079 EQU   CRRMAS4
CRRM3X   EQU   CRRMAS4
CRRM85   EQU   CRRMAS4
CRRM83   EQU   CRRMAS4
CRRM82   EQU   CRRMAS4
CRRM61   EQU   CRRMAS4
CRRM60   EQU   CRRMAS4
CRRM81   EQU   CRRMAS3
CRRM80   EQU   CRRMAS3
CRRM75   EQU   CRRMAS3
CRRM51   EQU   CRRMAS3
CRRM50   EQU   CRRMAS3
CRRM42   EQU   CRRMAS3
CRRM41   EQU   CRRMAS3
CRRM40   EQU   CRRMAS3
CRRM32   EQU   CRRMAS2
CRRM31   EQU   CRRMAS2
CRRM30   EQU   CRRMAS2
CRRM25   EQU   CRRMAS2
CRRM24   EQU   CRRMAS2
CRRM23   EQU   CRRMAS2
CRRM22   EQU   CRRMAS2
CRRM21   EQU   CRRMAS2
CRRM20   EQU   CRRMAS1
CRRM13   EQU   CRRMAS1
CRRM12   EQU   CRRMAS1
CRRM11   EQU   CRRMAS1
CRRM10   EQU   CRRMAS1
CRRM02   EQU   CRRMAS1
CRRM01   EQU   CRRMAS1
CRRM00   EQU   CRRMAS1
CRRFSB   EQU   CRRSAREA+144
CRRSAVE1 EQU   CRRSAREA+72
CRRSAVE  EQU   CRRSAREA
CRRRSV22 EQU   ISTDCCRR+4
CRRCRR   EQU   ISTDCCRR
PATRSV01 EQU   PATFLAGA
PATUSEFG EQU   PATFLAGA
PATRDCNT EQU   ISTPAT+6
PATGRPID EQU   ISTPAT+5
PATPTHID EQU   ISTPAT+4
PATDINDX EQU   ISTPAT+2
PATGINDX EQU   ISTPAT
GNTGRPNM EQU   ISTGNT
DNTTELNO EQU   ISTDNT+1
DNTCTDIG EQU   ISTDNT
RLSRSV02 EQU   ISTRLS+140
RLSRSV01 EQU   ISTRLS+138
RLSCTELU EQU   ISTRLS+136
RLSPRE   EQU   ISTRLS
RDARSVPT EQU   ISTRDA+84
RDAPUBI  EQU   ISTRDA+83
RDADFCUA EQU   ISTRDA+80
RDACTPCC EQU   ISTRDA+79
RDADACUA EQU   ISTRDA+76
RDALUBA  EQU   RDAUCBAD+1
RDACHQI  EQU   RDAUCBAD
RDARSV01 EQU   RDAFLAG
RDARBISA EQU   RDAFLAG
RDAPRE   EQU   ISTRDA
RSWRSV01 EQU   ISTRSW+152
RSWRSV02 EQU   ISTRSW+150
RSWCTELU EQU   ISTRSW+148
RSWGRUPZ EQU   ISTRSW+146
RSWDIALZ EQU   ISTRSW+144
RSWGRUPT EQU   ISTRSW+140
RSWDIALT EQU   ISTRSW+136
RSWPRE   EQU   ISTRSW
RLXRSV03 EQU   ISTRLX+80
RLXRSV02 EQU   ISTRLX+77
RLXRSV01 EQU   RLXFLAGA
RLXINUSE EQU   RLXFLAGA
RLXNLUX  EQU   ISTRLX+72
RLXPRE   EQU   ISTRLX
RPXRSV01 EQU   ISTRPX+80
RPXRSV02 EQU   ISTRPX+77
RPXMAXLU EQU   ISTRPX+76
RPXFLUX  EQU   ISTRPX+72
RPXPRE   EQU   ISTRPX
RLURSV02 EQU   ISTRLU+172
RLULGMOD EQU   ISTRLU+164
RLUMODEP EQU   RLUMODET+8
RLUMODEN EQU   RLUMODET
RLUUSSPT EQU   RLUUSSTB+8
RLUUSSNM EQU   RLUUSSTB
RLURSV01 EQU   ISTRLU+137
RLULOCAD EQU   ISTRLU+136
RLUNCPPM EQU   RLUNCPPC+1
RLUNCPPN EQU   RLUNCPPC
RLUPACEM EQU   RLUPACE+1
RLUPACEN EQU   RLUPACE
RLUINTA  EQU   ISTRLU+128
RLUSSCFM EQU   ISTRLU+127
RLUCRRSV EQU   RLUCRFLG
RLUACTLU EQU   RLUCRFLG
RLURSV00 EQU   RLUFLAG
RLUNDSES EQU   RLUFLAG
RLUGSTAT EQU   RLUFLAG
RLUBATCH EQU   RLUFLAG
RLURBISA EQU   RLUFLAG
RLUTYPE  EQU   ISTRLU+124
RLUCRPR  EQU   ISTRLU
RCCRVPT2 EQU   ISTRCC+144
RCCXTOSW EQU   ISTRCC+140
RCCSWTOX EQU   ISTRCC+136
RCCRSPT2 EQU   ISTRCC+133
RCCADDR  EQU   ISTRCC+132
RCCPASSL EQU   ISTRCC+131
RCCMXOUT EQU   ISTRCC+130
RCCMXDAT EQU   ISTRCC+128
RCCINDEX EQU   ISTRCC+126
RCCPATHZ EQU   ISTRCC+124
RCCPATHT EQU   ISTRCC+120
RCCDPQ   EQU   ISTRCC+116
RCCTPAB  EQU   ISTRCC+112
RCCRSV02 EQU   ISTRCC+109
RCCCRRSV EQU   RCCCRFLG
RCCCTCFL EQU   RCCCRFLG
RCCACTPU EQU   RCCCRFLG
RCCNCSPL EQU   ISTRCC+104
RCCRPHCN EQU   ISTRCC+100
RCCEPAB  EQU   ISTRCC+96
RCCDPAB  EQU   ISTRCC+92
RCCVPAB  EQU   ISTRCC+88
@NM00078 EQU   ISTRCC+87
RCCSESCT EQU   ISTRCC+86
RCCIDNUM EQU   RCCID48+3
RCCIDBLK EQU   RCCID48+2
RCCIDPA2 EQU   RCCID48+1
RCCIDPUT EQU   RCCID48
RCCIDPA1 EQU   RCCSTAID
RCCCTELU EQU   ISTRCC+76
RCCCNCNT EQU   ISTRCC+75
RCCRTGOH EQU   RCCFLAGB
RCCBRKCN EQU   RCCFLAGB
RCCRESET EQU   RCCFLAGB
RCCFINAL EQU   RCCFLAGB
RCCBNNSP EQU   RCCFLAGB
RCCIRETR EQU   RCCFLAGB
RCCDIALP EQU   RCCFLAGB
RCCDSTCT EQU   RCCFLAGB
RCCCTPGD EQU   RCCFLAG
RCCPRGDN EQU   RCCFLAG
RCCOUERP EQU   RCCFLAG
RCCOHIMM EQU   RCCFLAG
RCCLDISC EQU   RCCFLAG
RCCERPIP EQU   RCCFLAG
RCCCUDIE EQU   RCCFLAG
RCCRBISA EQU   RCCFLAG
RCCTYPE  EQU   ISTRCC+72
RCCPRE   EQU   ISTRCC
DOTADTRM EQU   ISTDOT
RDSADDOT EQU   ISTRDS+76
RDSCTATR EQU   ISTRDS+74
RDSCTTRM EQU   ISTRDS+72
RDSPRE   EQU   ISTRDS
RINRSV05 EQU   ISTRIN+156
RINRSV04 EQU   ISTRIN+152
RINLOCRN EQU   ISTRIN+148
RINRSV02 EQU   ISTRIN+145
RTRCNCNT EQU   RINCNCNT
RTRNCSPL EQU   RINNCSPL
RTRRPHCN EQU   RINRPHCN
RTRVPAB  EQU   RINVPAB
RTRREMOT EQU   RINREMOT
RTRRLDAF EQU   RINRLDAF
RTRNODID EQU   RINNODID
RINRSV01 EQU   RINDFD
RTRLDISC EQU   RINLDISC
RTRNODEF EQU   RINNODEF
RTRREMPO EQU   RINREMPO
RINCRPRE EQU   ISTRIN
RTRRSV04 EQU   ISTRTR+210
RTRLCTI  EQU   ISTRTR+209
RTRIDCAS EQU   RTRBSCID+1
RTRIDLEN EQU   RTRBSCID
RTRRSVDD EQU   ISTRTR+181
RTRRDFG  EQU   ISTRTR+180
RTRDIAA  EQU   ISTRTR+176
RTRPOLA  EQU   ISTRTR+172
RTRCADDR EQU   ISTRTR+164
RTRCTADR EQU   ISTRTR+162
RTRCTPOL EQU   ISTRTR+160
RTRCTDIA EQU   ISTRTR+158
RTRRSV03 EQU   ISTRTR+156
RTRRVPT1 EQU   ISTRTR+152
RTRBHSN1 EQU   ISTRTR+144
RTRCRSV2 EQU   RTRCRFLG
RTRDTRLM EQU   RTRLSCMD
RTRCRSV1 EQU   RTRCRFLG
RTRTRMAX EQU   ISTRTR+142
RTRRSV24 EQU   RTRRDFF
RTRRFDEK EQU   RTRRDFF
RTRRFANK EQU   RTRRDFF
RTRRFPFK EQU   RTRRDFF
RTRRFPEN EQU   RTRRDFF
RTRRFXCT EQU   RTRRDFF
RTRRESCT EQU   RTRRDFE
RTRRESUP EQU   RTRRDFE
RTRREATT EQU   RTRRDFE
RTRRECHK EQU   RTRRDFE
RTRREACR EQU   RTRRDFE
RTRRSV0A EQU   RTRRDFE
RTRREBRK EQU   RTRRDFE
RTRRSV11 EQU   RTRRDFD
RTRRSV10 EQU   RTRRDFD
RTRRDBHI EQU   RTRRDFD
RTRRDBHD EQU   RTRRDFD
RTRRDBHN EQU   RTRRDFD
RTRRSV23 EQU   RTRRDFC
RTRRCXMS EQU   RTRRDFC
RTRRCMSG EQU   RTRRDFC
RTRRCBLK EQU   RTRRDFC
RTRRCPT3 EQU   RTRRDFC
RTRRCIT2 EQU   RTRRDFC
RTRRCIT1 EQU   RTRRDFC
RTRRSV32 EQU   RTRRDFB
RTRRBEND EQU   RTRRDFB
RTRRBECT EQU   RTRRDFB
RTRRSV02 EQU   RTRRDFA
RTRRACTR EQU   RTRRDFA
RTRRSV60 EQU   RTRRDFA
RTRRACDT EQU   RTRRDFA
RTRRAPT3 EQU   RTRRAALL
RTRRAPT2 EQU   RTRRAALL
RTRRAPT1 EQU   RTRRAALL
RTRRAATN EQU   RTRRDFA
RTRRSV45 EQU   ISTRTR+132
RTRRSV01 EQU   ISTRTR+130
RTRCTECM EQU   ISTRTR+128
RTRADRPT EQU   RTRADR+1
RTRRSV22 EQU   RTRFLAG
RTRVTERM EQU   RTRFLAG
RTRRSV51 EQU   RTRFLAG
RTRRBISA EQU   RTRFLAG
RTRRSV21 EQU   RTRFLAG
RTRCRPR  EQU   ISTRTR
RCLRVPT2 EQU   ISTRCL+92
RCLRVPT1 EQU   ISTRCL+88
RCLGPOLA EQU   ISTRCL+84
RCLCTNGP EQU   ISTRCL+82
RCLRSV01 EQU   ISTRCL+80
RCLCTECM EQU   ISTRCL+78
RCLCTETR EQU   ISTRCL+76
RCLGPADR EQU   RCLADR+1
RCLRSV33 EQU   RCLFLAG
RCLBATCH EQU   RCLFLAG
RCLRBISA EQU   RCLFLAG
RCLRSV22 EQU   RCLFLAG
RCLPRE   EQU   ISTRCL
RPTRSV03 EQU   ISTRPT+156
RPTRSV02 EQU   ISTRPT+152
RPTNSNSV EQU   ISTRPT+148
RPTPTHCT EQU   ISTRPT+146
RPTPEPCT EQU   ISTRPT+144
RPTDAFSV EQU   ISTRPT+142
RPTRSV01 EQU   ISTRPT+141
RPTISTAT EQU   RPTFLAG1
RPTDYNAM EQU   RPTFLAG1
RPTVYIMM EQU   RPTFLAG1
RPTVIODN EQU   RPTFLAG1
RPTONLIN EQU   RPTFLAG1
RPTHLVPD EQU   RPTFLAG1
RPTVRYPD EQU   RPTFLAG1
RPTASLEP EQU   RPTFLAG1
RPTUTERM EQU   ISTRPT+136
RPTATERM EQU   ISTRPT+132
RPTDIVT  EQU   RPTDITT
RPTCTNM  EQU   ISTRPT+120
RPTLNSAF EQU   RPTLNCID
RPTLN    EQU   ISTRPT
RLNRVPT2 EQU   ISTRLN+112
RLNNCSPL EQU   ISTRLN+108
RLNX2SW  EQU   ISTRLN+104
@NM00077 EQU   ISTRLN+103
RLNCRRSV EQU   RLNCRFLG
RLNSWEP  EQU   RLNCRFLG
RLNSVSKP EQU   RLNLSCMD
RLNSESLM EQU   RLNLSCMD
RLNNPRLM EQU   RLNLSCMD
RLNSWNCP EQU   RLNCRFLG
RLNACTLN EQU   RLNCRFLG
RLNPAUSE EQU   ISTRLN+101
RLNPOLMT EQU   ISTRLN+100
RLNACTSN EQU   ISTRLN+98
RLNRESV1 EQU   ISTRLN+97
RLNACTRM EQU   ISTRLN+96
RLNCTSES EQU   ISTRLN+95
RLNRDSLM EQU   ISTRLN+94
RLNAUTOA EQU   ISTRLN+92
RLNRDFD  EQU   RLNRDF+3
RLNRDFC  EQU   RLNRDF+2
RLNMULTP EQU   RLNRDFB
RLNRATRN EQU   RLNRDFB
RLNRAPOL EQU   RLNRDFB
RLNTTV   EQU   RLNRDFB
RLNRSV0B EQU   RLNRDFB
RLNAUTOD EQU   RLNRDFB
RLNANSWR EQU   RLNRDFB
RLNRBUSE EQU   RLNRDFB
RLNRAPEP EQU   RLNRDFA
RLNRANCP EQU   RLNRDFA
RLNRAEP  EQU   RLNRDFA
RLNIDV   EQU   RLNRDFA
RLNGANSW EQU   RLNRDFA
RLNRACAN EQU   RLNRACNT
RLNRACAT EQU   RLNRACNT
RLNRSV04 EQU   RLNSTAT2
RLNINUSE EQU   RLNSTAT2
RLNOHIN  EQU   RLNSTAT2
RLNRSV03 EQU   RLNSTAT1
RLNVD    EQU   RLNSTAT1
RLNINOPP EQU   RLNSTAT1
RLNINOPL EQU   RLNSTAT1
RLNLRST  EQU   RLNSTAT1
RLNTRAP  EQU   RLNSTAT1
RLNACTCT EQU   ISTRLN+84
RLNCTECM EQU   ISTRLN+82
RLNCTEIN EQU   ISTRLN+80
RLNCTETR EQU   ISTRLN+78
RLNCTECL EQU   ISTRLN+76
RLNCUA   EQU   RLNUCBAD
RLNRSV01 EQU   RLNFLAG
RLNRBISA EQU   RLNFLAG
RLNEAM   EQU   RLNFLAG
RLNPRE   EQU   ISTRLN
RGPRVPT2 EQU   ISTRGP+88
RGPRVPT1 EQU   ISTRGP+84
RGPCTECM EQU   ISTRGP+82
RGPCTEIN EQU   ISTRGP+80
RGPCTETR EQU   ISTRGP+78
RGPCTECL EQU   ISTRGP+76
RGPCTELN EQU   ISTRGP+74
RGPRSV03 EQU   ISTRGP+73
RGPRSV02 EQU   RGPFLG
RGPASDLC EQU   RGPFLG
RGPABSC  EQU   RGPFLG
RGPASS   EQU   RGPFLG
RGPADIL  EQU   RGPFLG
RGPPRE   EQU   ISTRGP
RRNRINNM EQU   ISTRRN+248
@NM00076 EQU   ISTRRN+247
RRNRDCUA EQU   ISTRRN+244
RRNLASTE EQU   ISTRRN+240
RRNNCSPL EQU   ISTRRN+236
RRNRPLPT EQU   ISTRRN+232
RRNMSIZE EQU   ISTRRN+228
RRNNCPNM EQU   ISTRRN+221
RRNCTPCC EQU   ISTRRN+220
RRNHBUFS EQU   ISTRRN+218
RRNHLENT EQU   RRNHPRE+1
RRNHLENH EQU   RRNHPRE
RRNNMNCP EQU   ISTRRN+208
RRNDELAY EQU   ISTRRN+206
RRNRSV04 EQU   ISTRRN+200
RRNRSV88 EQU   RRNNMDPD+7
RRNPUBI  EQU   RRNNMDPD+6
RRNDPLUB EQU   RRNNMDPD
RRNEPADR EQU   ISTRRN+190
RRNCPLUB EQU   ISTRRN+184
RRNFLUX  EQU   ISTRRN+180
RRNRSV05 EQU   RRNCMFD
RRNREMPO EQU   RRNCMFD
RRNCDREC EQU   RRNCMFD
RRNCDDSI EQU   RRNCMFD
RRNCDBCK EQU   RRNCMFD
RRNCDDTL EQU   RRNCMFD
RRNCDSTD EQU   RRNCMFD
RRNCDCSP EQU   RRNCMFD
RRNCCCSL EQU   RRNCMFC
RRNCCSIM EQU   RRNCMFC
RRNCCRCM EQU   RRNCMFC
RRNCCRIM EQU   RRNCMFC
RRNCCCRC EQU   RRNCMFC
RRNCCRST EQU   RRNCMFC
RRNCCRDQ EQU   RRNCMFC
RRNCCRCN EQU   RRNCMFC
RRNCBALT EQU   RRNCMFB
RRNCBMOD EQU   RRNCMFB
RRNCBNPL EQU   RRNCMFB
RRNCBRLS EQU   RRNCMFB
RRNCBRDS EQU   RRNCMFB
RRNCBDLR EQU   RRNCMFB
RRNCBDLH EQU   RRNCMFB
RRNCBDLO EQU   RRNCMFB
RRNCADGO EQU   RRNCMFA
RRNCADTD EQU   RRNCMFA
RRNCACDT EQU   RRNCMFA
RRNCAMBH EQU   RRNCMFA
RRNCAATI EQU   RRNCMFA
RRNCAATG EQU   RRNCMFA
RRNCAATD EQU   RRNCMFA
RRNCAALL EQU   RRNCMFA
RRNRSV55 EQU   RRNRDF+3
RRNPTASL EQU   RRNRDFB+1
RRNRSV01 EQU   RRNRDFB+1
RRNVYDON EQU   RRNRDFB+1
RRNRBBUP EQU   RRNRDFB+1
RRNRSV03 EQU   RRNRDFB
RRNRBCT2 EQU   RRNRDFB
RRNRBCT1 EQU   RRNRDFB
RRNRBSEC EQU   RRNRDFB
RRNRBCCT EQU   RRNRDFB
RRNRBCCL EQU   RRNRDFB
RRNRSV02 EQU   RRNRDFB
RRNRBMDL EQU   RRNRDFB
RRNRAPEP EQU   RRNRDFA
RRNRANCP EQU   RRNRDFA
RRNRBREM EQU   RRNRDFA
RRNRAOLT EQU   RRNRDFA
RRNRASYN EQU   RRNRDFA
RRNRADMP EQU   RRNRDFA
RRNRAIPL EQU   RRNRDFA
RRNRASHT EQU   RRNRDFA
RRNCTENT EQU   ISTRRN+170
RRNCTECM EQU   ISTRRN+168
RRNCTEIN EQU   ISTRRN+166
RRNCTETR EQU   ISTRRN+164
RRNCTECL EQU   ISTRRN+162
RRNCTELI EQU   ISTRRN+160
RRNCTEGP EQU   ISTRRN+158
RRNCTBHS EQU   ISTRRN+156
RRNBHSET EQU   ISTRRN+152
RRNTRENT EQU   ISTRRN+148
RRNRLDIP EQU   ISTRRN+147
RRNRNCUA EQU   ISTRRN+144
RRNGRPA  EQU   ISTRRN+140
RRNLUBA  EQU   RRNUCBAD+1
RRNCHQI  EQU   RRNUCBAD
RRNRSV11 EQU   RRNFLAG
RRNDSTCT EQU   RRNFLAG
RRNERPIP EQU   RRNFLAG
RRNLCDIP EQU   RRNFLAG
RRNLCDIE EQU   RRNFLAG
RRNLCSIP EQU   RRNFLAG
RRNRBISA EQU   RRNFLAG
RRNRSV89 EQU   RRNFLAG
RRNPRE   EQU   ISTRRN
RLCRVPT2 EQU   ISTRLC+80
RLCRVPT1 EQU   ISTRLC+79
RLCLCCUA EQU   ISTRLC+76
RLCUCBAD EQU   RLCADR+1
RLCRSVDE EQU   RLCFLAG
RLCACNT  EQU   RLCFLAG
RLCRSV14 EQU   RLCFLAG
RLCRBISA EQU   RLCFLAG
RLCRSV22 EQU   RLCFLAG
RLCPRE   EQU   ISTRLC
RAPRVPT2 EQU   ISTRAP+116
RAPRVPT1 EQU   ISTRAP+112
RAPBFACT EQU   ISTRAP+111
RAPRSV17 EQU   RAPFLGC
RAPRSV16 EQU   RAPFLGC
RAPRSV15 EQU   RAPFLGC
RAPRSV14 EQU   RAPFLGC
RAPRSV13 EQU   RAPFLGC
RAPRSV12 EQU   RAPFLGC
RAPRSV11 EQU   RAPFLGC
RAPRSV10 EQU   RAPFLGC
RAPANVPC EQU   RAPFLGB
RAPASPO  EQU   RAPFLGB
RAPAPPO  EQU   RAPFLGB
RAPAACQ  EQU   RAPFLGB
RAPAPRMT EQU   RAPFLGB
RAPAPASS EQU   RAPFLGB
RAPABLCK EQU   RAPFLGB
RAPALLF  EQU   RAPFLGB
RAPRSV06 EQU   RAPFLG
RAPRSV05 EQU   RAPFLG
RAPRSV04 EQU   RAPFLG
RAPRSV03 EQU   RAPFLG
RAPATLGN EQU   RAPFLG
RAPASLGI EQU   RAPFLG
RAPAQUI  EQU   RAPFLG
RAPABLGN EQU   RAPFLG
RAPACEQD EQU   ISTRAP+106
RAPTRPRE EQU   ISTRAP+104
RAPACEAP EQU   ISTRAP+100
RAPICEAQ EQU   ISTRAP+96
RAPICEAC EQU   ISTRAP+92
RAPICELG EQU   ISTRAP+88
RAPAPPWD EQU   ISTRAP+80
RAPACDEB EQU   ISTRAP+76
RAPACBA  EQU   ISTRAP+72
RAPPRE   EQU   ISTRAP
RDTVSRPL EQU   ISTRDT+132
RDTCRSPW EQU   ISTRDT+124
RDTCRSDS EQU   ISTRDT+116
@NM00075 EQU   ISTRDT+113
RRNSTCNT EQU   RDTSTCNT
RRNVYRPH EQU   RDTVYRPH
RDTDPAB  EQU   ISTRDT+100
RDTEPAB  EQU   ISTRDT+96
RDTVPAB  EQU   ISTRDT+92
RDTRSV01 EQU   RDTFLAGB
RDTBHSET EQU   RDTFLAGB
RDTCTCFL EQU   RDTFLAGB
RDTCTPGD EQU   RDTFLAGB
RDTPRGDN EQU   RDTFLAGB
RDTOUERP EQU   RDTFLAGB
RDTLGCT  EQU   ISTRDT+90
RDTNODID EQU   ISTRDT+89
RDTMAXID EQU   ISTRDT+88
RDTCTSNT EQU   ISTRDT+86
RDTFLAGS EQU   ISTRDT+84
RDTBACK  EQU   ISTRDT+80
RDTFORW  EQU   ISTRDT+76
RDTLEN   EQU   RDTPLEN+1
RDTPRILS EQU   RDTPRIOR
RDTPRISW EQU   RDTPRIOR
RDTPRIRN EQU   RDTPRIOR
RDTPRILC EQU   RDTPRIOR
RDTPRIAP EQU   RDTPRIOR
@NM00074 EQU   RDTPRIOR
RDTPRE   EQU   ISTRDT
RCPRSV05 EQU   ISTRCPRE+120
RCPRSV04 EQU   ISTRCPRE+116
RCPRSV03 EQU   ISTRCPRE+112
RCPINTA  EQU   RCPLGNIN+16
RCPLGNCT EQU   RCPLGNIN+8
RCPLGNAP EQU   RCPLGNIN
@NM00073 EQU   RCPPMODE
RCPRRECD EQU   RCPPMODE
RCPRBASC EQU   RCPPMODE
RCPBFLIM EQU   ISTRCPRE+90
RCPBHSI2 EQU   ISTRCPRE+89
RCPBHSI1 EQU   ISTRCPRE+88
RCPACETR EQU   ISTRCPRE+84
RCPICEAQ EQU   ISTRCPRE+80
RCPLNAPA EQU   ISTRCPRE+76
RCPICELN EQU   ISTRCPRE+72
RCPPRE   EQU   ISTRCPRE
RPRCONID EQU   ISTRPRE+63
RPRCLVPD EQU   RPRFLAGC
RPRINIMM EQU   RPRFLAGD
RPRRSV05 EQU   RPRFLAGD
RPRCONP  EQU   RPRFLAGD
RPRACTP  EQU   RPRFLAGD
RPRRSON  EQU   RPRFLAGD
RPRCONCT EQU   RPRFLAGD
RPRLTASN EQU   RPRFLAGD
RPRPTHCT EQU   ISTRPRE+60
RPRSWDAF EQU   ISTRPRE+58
RPRSTPCT EQU   ISTRPRE+56
RPRRVPT1 EQU   ISTRPRE+52
RPRDEVCH EQU   ISTRPRE+44
RPRNCBA  EQU   ISTRPRE+40
RPRLGONB EQU   ISTRPRE+32
RPRLGONF EQU   ISTRPRE+28
RPRHDTYP EQU   ISTRPRE+27
RPRTIOCT EQU   ISTRPRE+26
RPRPEPCT EQU   ISTRPRE+24
RPRRSV03 EQU   RPRCAUSE
RPRRSYNC EQU   RPRCAUSE
RPRCRCPT EQU   RPRCAUSE
RPRNOSRT EQU   RPRCAUSE
RPRVYIMM EQU   RPRFLAGB
RPRHLVPD EQU   RPRFLAGB
RPRONLIN EQU   RPRFLAGB
RPRVIODN EQU   RPRFLAGB
RPRAOPN  EQU   RPRFLAGB
RPRENTVT EQU   RPRFLAGB
RPRENTVH EQU   RPRFLAGB
RPRLIVE  EQU   RPRFLAGA
RPRVRYPD EQU   RPRFLAGA
RPRENTED EQU   RPRFLAGA
RPRENTIO EQU   RPRFLAGA
RPRENTBF EQU   RPRFLAGA
RPRTIED  EQU   RPRFLAGA
RPRINV   EQU   RPRFLAGA
RPRACT   EQU   RPRFLAGA
RPRPELEN EQU   ISTRPRE+18
RPRELEN  EQU   ISTRPRE+16
RPRRLOCK EQU   ISTRPRE+12
RPRSAF   EQU   RPRCOMID
LDNZS00F EQU   LDNZH003+1
LDNZS00E EQU   LDNZH003+1
LDNZS00D EQU   LDNZH003+1
LDNZS00C EQU   LDNZH003+1
LDNZS00B EQU   LDNZH003+1
LDNZS007 EQU   LDNZH003
LDNZS006 EQU   LDNZH003
LDNZS005 EQU   LDNZH003
LDNZS004 EQU   LDNZH003
LDNZS003 EQU   LDNZH003
LDNZS002 EQU   LDNZH003
LDNZS001 EQU   LDNZH003
LDNZS000 EQU   LDNZH003
LDNZX006 EQU   ISTLDNCB+576
LDNZC001 EQU   ISTLDNCB+569
LDNZX005 EQU   ISTLDNCB+568
LDNZV006 EQU   ISTLDNCB+564
LDNSRB   EQU   ISTLDNCB+520
@NM00072 EQU   LDNZSAV3+28
LDNRSV06 EQU   LDNZSAV4+16
LDNZSAV6 EQU   LDNZSAV4+12
LDNZSAV5 EQU   LDNZSAV4
LDNZSAVE EQU   LDNZSAV3
LDNZSAV2 EQU   ISTLDNCB+368
LDNZSAV1 EQU   ISTLDNCB+352
LDNZ3RR  EQU   ISTLDNCB+348
LDNZ2RR  EQU   ISTLDNCB+344
LDNZ1RR  EQU   ISTLDNCB+340
LDNRSV0B EQU   ISTLDNCB+336
LDNRSV0A EQU   ISTLDNCB+332
LDNRSV09 EQU   ISTLDNCB+328
LDNRSV08 EQU   ISTLDNCB+324
LDNRSV07 EQU   ISTLDNCB+320
LDNDEAD  EQU   LDNDCDEB+12
LDNUCBAD EQU   LDNDCDEB+8
LDNAPPAD EQU   LDNDCDEB+5
LDNEXSCL EQU   LDNDCDEB+4
LDNDCBAD EQU   LDNDCDEB+1
LDNDEBID EQU   LDNDCDEB
LDNZRIND EQU   ISTLDNCB+300
LDNRPH   EQU   ISTLDNCB+192
LDNZTCP  EQU   ISTLDNCB+188
LDNZCHNC EQU   ISTLDNCB+187
LDNZLPC7 EQU   LDNZLPC
LDNZLPC6 EQU   LDNZLPC
LDNZLPC5 EQU   LDNZLPC
LDNZLPC4 EQU   LDNZLPC
LDNZLPC3 EQU   LDNZLPC
LDNZLPC2 EQU   LDNZLPC
LDNZLPC1 EQU   LDNZLPC
LDNZLPC0 EQU   LDNZLPC
LDNRSV05 EQU   LDNZERPF
LDNZCTOV EQU   LDNZEPIN
LDNZF001 EQU   LDNZEPIN
LDNZFRDW EQU   LDNZCPAN
LDNZFRD  EQU   LDNZCPAN
LDNZNARD EQU   LDNZCPAN
LDNRSV04 EQU   LDNZIOLK
LDNZATBF EQU   LDNZIOLK
LDNZERLK EQU   LDNZIOLK
LDNZDSIC EQU   LDNZIOLK
LDNZPAB1 EQU   ISTLDNCB+168
LDNZV005 EQU   ISTLDNCB+160
LDNZS1VR EQU   ISTLDNCB+136
LDNZS1RR EQU   ISTLDNCB+132
LDNZS1FC EQU   ISTLDNCB+128
LDNZS1BC EQU   ISTLDNCB+124
LDNZLOCK EQU   ISTLDNCB+120
LDNZFBUF EQU   ISTLDNCB+116
LDNZLAST EQU   ISTLDNCB+112
LDNRSV02 EQU   LDNFLAG2
LDNZFF04 EQU   LDNFLAG2
LDNZFF69 EQU   LDNFLAGS+2
LDNZFF03 EQU   LDNFLAGS+2
LDNZFF02 EQU   LDNFLAGS+2
LDNZFF01 EQU   LDNFLAGS+2
LDNZFF00 EQU   LDNFLAGS+2
LDNCLOSD EQU   LDNFLAGS+2
LDNZENTR EQU   LDNFLAGS+2
LDNZICCW EQU   LDNFLAGS+1
LDNZREC  EQU   LDNFLAGS+1
LDNZCTXT EQU   LDNFLAGS+1
LDNZATLK EQU   LDNFLAGS+1
LDNZCHNE EQU   LDNFLAGS+1
LDNZATTP EQU   LDNFLAGS+1
LDNZIOBY EQU   LDNFLAGS+1
LDNZF00A EQU   LDNFLAGS+1
LDNZF009 EQU   LDNFLAGS
LDNZF008 EQU   LDNFLAGS
LDNZF007 EQU   LDNFLAGS
LDNZF005 EQU   LDNFLAGS
LDNZF004 EQU   LDNFLAGS
LDNZF003 EQU   LDNFLAGS
LDNZF002 EQU   LDNFLAGS
LDNZHDCC EQU   ISTLDNCB+106
LDNZARM  EQU   ISTLDNCB+104
LDNZRM   EQU   ISTLDNCB+102
LDNZRB   EQU   ISTLDNCB+100
LDNCPQ   EQU   ISTLDNCB+96
LDNSIOQ  EQU   ISTLDNCB+92
LDNZX002 EQU   ISTLDNCB+91
LDNZX001 EQU   ISTLDNCB+90
LDNZH002 EQU   ISTLDNCB+88
LDNZV001 EQU   ISTLDNCB+84
LDNZACSW EQU   ISTLDNCB+76
LDNZC002 EQU   ISTLDNCB+68
LDNCSWSV EQU   ISTLDNCB+60
LDNCHFLD EQU   ISTLDNCB+56
LDNRESRV EQU   ISTLDNCB+55
@NM00071 EQU   LDNCFLAG
LDNRMF   EQU   LDNCFLAG
LDNIBI   EQU   LDNCFLAG
LDNTSAF  EQU   ISTLDNCB+52
LDNCUUA  EQU   ISTLDNCB+48
LDNCB    EQU   ISTLDNCB
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00070 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBNSNA  EQU   ISTNCB+12
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00069 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCOCWCB EQU   ATCAOSM+344
ATCOCWOB EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00068 EQU   ATCAOSM+333
@NM00067 EQU   @NM00066
ATCSNUF  EQU   @NM00066
ATCOPKL  EQU   @NM00066
ATCABEN  EQU   @NM00066
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00065 EQU   @NM00064
ATCVTMAB EQU   @NM00064
@NM00063 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00062 EQU   ISTATCVT+819
@NM00061 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00060 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCDVTLK EQU   ISTATCVT+456
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMQU  EQU   ATCCOM+184
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00059 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00058 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
LOKXCL   EQU   @NM00056
LOKPRY   EQU   @NM00056
@NM00057 EQU   @NM00056
@NM00055 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
@NM00054 EQU   ISTIFTPL+36
@NM00053 EQU   ISTIFTPL+33
@NM00052 EQU   ISTIFTPL+3
@NM00051 EQU   IFTSB0
IFTFB1   EQU   ISTIFTPL+1
TIEPTR2  EQU   TIERPHA
TIEGATE  EQU   TIETIEA
TIELNGTH EQU   ISTTIE+1
TIETYPE  EQU   ISTTIE
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00047 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00046 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00045
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00044 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
@NM00019 EQU   SRBSECT+40
@NM00018 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOBERRCT EQU   IOBSTDRD+30
IOBRSV19 EQU   IOBINCAM+1
IOBOLTST EQU   IOBBTAMF
IOBRFTMG EQU   IOBBTAMF
IOBRSV17 EQU   IOBBTAMF
IOBRSV16 EQU   IOBBTAMF
IOBRSV15 EQU   IOBBTAMF
IOBRSV14 EQU   IOBBTAMF
IOBINUSE EQU   IOBBTAMF
IOBPRMER EQU   IOBBTAMF
IOBRSTRB EQU   IOBRESTR+1
IOBREPOS EQU   IOBRESTR
IOBDCBPB EQU   IOBDCBPT+1
IOBRSV44 EQU   IOBFLAG4
IOBJES3I EQU   IOBFLAG4
IOBRSV42 EQU   IOBFLAG4
IOBRSV41 EQU   IOBFLAG4
IOBRSV40 EQU   IOBFLAG4
IOBPMERR EQU   IOBFLAG4
IOBCC3WE EQU   IOBFLAG4
IOBGDPOL EQU   IOBFLAG4
IOBSTRTB EQU   IOBSTART+1
IOBSIOCC EQU   IOBSTART
IOBCSB7  EQU   IOBCSTAT
IOBCSB6  EQU   IOBCSTAT
IOBCSB5  EQU   IOBCSTAT
IOBCSB4  EQU   IOBCSTAT
IOBCSB3  EQU   IOBCSTAT
IOBCSB2  EQU   IOBCSTAT
IOBCSB1  EQU   IOBCSTAT
IOBCSB0  EQU   IOBCSTAT
IOBUSB7  EQU   IOBUSTAT
IOBUSB6  EQU   IOBUSTAT
IOBUSB5  EQU   IOBUSTAT
IOBUSB4  EQU   IOBUSTAT
IOBUSB3  EQU   IOBUSTAT
IOBUSB2  EQU   IOBUSTAT
IOBUSB1  EQU   IOBUSTAT
IOBUSB0  EQU   IOBUSTAT
IOBCMDA  EQU   IOBIOCSW
IOBLOG   EQU   IOBFL3
IOBJAM   EQU   IOBICL
IOBMSG   EQU   IOBFL3
IOBSDR   EQU   IOBCNC
IOBACU   EQU   IOBFL3
IOBCDC   EQU   IOBFL3
IOBICC   EQU   IOBFL3
IOBCCC   EQU   IOBFL3
IOBECBPB EQU   IOBECBPT+1
IOBECBCC EQU   IOBECBPT
IOBS1B7  EQU   IOBSENS1
IOBS1B6  EQU   IOBSENS1
IOBS1B5  EQU   IOBSENS1
IOBS1B4  EQU   IOBSENS1
IOBS1B3  EQU   IOBSENS1
IOBS1B2  EQU   IOBSENS1
IOBS1B1  EQU   IOBSENS1
IOBS1B0  EQU   IOBSENS1
IOBSNSC9 EQU   IOBS0B7
IOBS0B6  EQU   IOBSENS0
IOBS0B5  EQU   IOBSENS0
IOBS0B4  EQU   IOBSENS0
IOBS0B3  EQU   IOBSENS0
IOBS0B2  EQU   IOBSENS0
IOBS0B1  EQU   IOBSENS0
IOBS0B0  EQU   IOBSENS0
IOBPNCH  EQU   IOBFLAG2
IOBSTATO EQU   IOBFLAG2
IOBSKUPD EQU   IOBFLAG2
IOBALTTR EQU   IOBFLAG2
IOBRRT2  EQU   IOBRDHA0
IOBRRT3  EQU   IOBPURGE
IOBSENSE EQU   IOBFLAG2
IOBHALT  EQU   IOBFLAG2
IOBSPSVC EQU   IOBRSTRT
IOBUNREL EQU   IOBFLAG1
IOBIOERR EQU   IOBFLAG1
IOBFCREX EQU   IOBCYCCK
IOBRPSTN EQU   IOBFLAG1
IOBERRTN EQU   IOBFLAG1
IOBCMDCH EQU   IOBFLAG1
IOBDATCH EQU   IOBFLAG1
IOBCNOPA EQU   IOBPREFX+12
IOBCICB  EQU   IOBPREFX+8
IOBCECB  EQU   IOBPREFX+4
IOBCONOP EQU   IOBPREFX+3
IOBCINOP EQU   IOBPREFX+2
IOBRSV05 EQU   IOBPREFX+1
IOBPCI   EQU   IOBCFLG1
IOBRSTCH EQU   IOBCFLG1
IOBABAPP EQU   IOBCFLG1
IOBPTST  EQU   IOBCFLG1
IOBRSV04 EQU   IOBCFLG1
IOBRSV03 EQU   IOBCFLG1
IOBRSV02 EQU   IOBCFLG1
IOBRSV01 EQU   IOBCFLG1
VYCRSV02 EQU   ISTVYCRR+128
VYCRSV04 EQU   ISTVYCRR+126
VYCRRCW3 EQU   ISTVYCRR+118
VYCRRSAV EQU   ISTVYCRR+46
VYCRSV03 EQU   VYCCRT+11
CINCFE   EQU   VYCCRT+11
CINCE9   EQU   VYCCRT+11
CINCVO   EQU   VYCCRT+11
CINCR5   EQU   VYCCRT+11
CINCR3   EQU   VYCCRT+10
CINCE8   EQU   VYCCRT+10
CINCE7   EQU   VYCCRT+10
CINCE6   EQU   VYCCRT+10
CINCE5   EQU   VYCCRT+10
CINCE1   EQU   VYCCRT+10
CINCUQ   EQU   VYCCRT+10
CINCUB   EQU   VYCCRT+10
CINCUA   EQU   VYCCRT+9
CINCX9   EQU   VYCCRT+9
CINCX8   EQU   VYCCRT+9
CINCX7   EQU   VYCCRT+9
CINCX6   EQU   VYCCRT+9
CINCX3   EQU   VYCCRT+9
CINCX2   EQU   VYCCRT+9
CINCX1   EQU   VYCCRT+9
CINCX0   EQU   VYCCRT+8
CINCW9   EQU   VYCCRT+8
CINCW8   EQU   VYCCRT+8
CINCW7   EQU   VYCCRT+8
CINCW6   EQU   VYCCRT+8
CINCW5   EQU   VYCCRT+8
CINCW4   EQU   VYCCRT+8
CINCW2   EQU   VYCCRT+8
CINCW0   EQU   VYCCRT+7
CINCV9   EQU   VYCCRT+7
CINCV8   EQU   VYCCRT+7
CINCV7   EQU   VYCCRT+7
CINCV6   EQU   VYCCRT+7
CINCV5   EQU   VYCCRT+7
CINCV4   EQU   VYCCRT+7
CINCV3   EQU   VYCCRT+7
CINCV2   EQU   VYCCRT+6
CINCU8   EQU   VYCCRT+6
CINCU7   EQU   VYCCRT+6
CINCU6   EQU   VYCCRT+6
CINCU5   EQU   VYCCRT+6
CINCU4   EQU   VYCCRT+6
CINCU3   EQU   VYCCRT+6
CINCU2   EQU   VYCCRT+6
CINCU1   EQU   VYCCRT+5
CINCU0   EQU   VYCCRT+5
CINCUM   EQU   VYCCRT+5
CINCS1   EQU   VYCCRT+5
CINCL8   EQU   VYCCRT+5
CINCL7   EQU   VYCCRT+5
CINCL6   EQU   VYCCRT+5
CINCL5   EQU   VYCCRT+5
CINCL4   EQU   VYCCRT+4
CINCL3   EQU   VYCCRT+4
CINCL2   EQU   VYCCRT+4
CINCL1   EQU   VYCCRT+4
CINCL0   EQU   VYCCRT+4
CINCF4   EQU   VYCCRT+4
CINCF3   EQU   VYCCRT+4
CINCF1   EQU   VYCCRT+4
CINCFM   EQU   VYCCRT+3
CINCE4   EQU   VYCCRT+3
CINCE3   EQU   VYCCRT+3
CINCE2   EQU   VYCCRT+3
CINCE0   EQU   VYCCRT+3
CINCD9   EQU   VYCCRT+3
CINCD8   EQU   VYCCRT+3
CINCD7   EQU   VYCCRT+3
CINCD6   EQU   VYCCRT+2
CINCD5   EQU   VYCCRT+2
CINCD4   EQU   VYCCRT+2
CINCD3   EQU   VYCCRT+2
CINCD2   EQU   VYCCRT+2
CINCD1   EQU   VYCCRT+2
CINCIP   EQU   VYCCRT+2
CINCR2   EQU   VYCCRT+2
CINCVN   EQU   VYCCRT+1
CINCVS   EQU   VYCCRT+1
CINCVP   EQU   VYCCRT+1
CINCVX   EQU   VYCCRT+1
CINCFS   EQU   VYCCRT+1
CINCSM   EQU   VYCCRT+1
CINCR1   EQU   VYCCRT+1
CINCLF   EQU   VYCCRT
CINCVA   EQU   VYCCRT
CINCVI   EQU   VYCCRT
CINCMD   EQU   VYCCRT
CINCMY   EQU   VYCCRT
CINCDL   EQU   VYCCRT
CINCIO   EQU   VYCCRT
CINCCL   EQU   VYCCRT
VYCRSV01 EQU   VYCNTRD+11
NINCFE   EQU   VYCNTRD+11
NINCE9   EQU   VYCNTRD+11
NINCVO   EQU   VYCNTRD+11
NINCR5   EQU   VYCNTRD+11
NINCR3   EQU   VYCNTRD+10
NINCE8   EQU   VYCNTRD+10
NINCE7   EQU   VYCNTRD+10
NINCE6   EQU   VYCNTRD+10
NINCE5   EQU   VYCNTRD+10
NINCE1   EQU   VYCNTRD+10
NINCUQ   EQU   VYCNTRD+10
NINCUB   EQU   VYCNTRD+10
NINCUA   EQU   VYCNTRD+9
NINCX9   EQU   VYCNTRD+9
NINCX8   EQU   VYCNTRD+9
NINCX7   EQU   VYCNTRD+9
NINCX6   EQU   VYCNTRD+9
NINCX3   EQU   VYCNTRD+9
NINCX2   EQU   VYCNTRD+9
NINCX1   EQU   VYCNTRD+9
NINCX0   EQU   VYCNTRD+8
NINCW9   EQU   VYCNTRD+8
NINCW8   EQU   VYCNTRD+8
NINCW7   EQU   VYCNTRD+8
NINCW6   EQU   VYCNTRD+8
NINCW5   EQU   VYCNTRD+8
NINCW4   EQU   VYCNTRD+8
NINCW2   EQU   VYCNTRD+8
NINCW0   EQU   VYCNTRD+7
NINCV9   EQU   VYCNTRD+7
NINCV8   EQU   VYCNTRD+7
NINCV7   EQU   VYCNTRD+7
NINCV6   EQU   VYCNTRD+7
NINCV5   EQU   VYCNTRD+7
NINCV4   EQU   VYCNTRD+7
NINCV3   EQU   VYCNTRD+7
NINCV2   EQU   VYCNTRD+6
NINCU8   EQU   VYCNTRD+6
NINCU7   EQU   VYCNTRD+6
NINCU6   EQU   VYCNTRD+6
NINCU5   EQU   VYCNTRD+6
NINCU4   EQU   VYCNTRD+6
NINCU3   EQU   VYCNTRD+6
NINCU2   EQU   VYCNTRD+6
NINCU1   EQU   VYCNTRD+5
NINCU0   EQU   VYCNTRD+5
NINCUM   EQU   VYCNTRD+5
NINCS1   EQU   VYCNTRD+5
NINCL8   EQU   VYCNTRD+5
NINCL7   EQU   VYCNTRD+5
NINCL6   EQU   VYCNTRD+5
NINCL5   EQU   VYCNTRD+5
NINCL4   EQU   VYCNTRD+4
NINCL3   EQU   VYCNTRD+4
NINCL2   EQU   VYCNTRD+4
NINCL1   EQU   VYCNTRD+4
NINCL0   EQU   VYCNTRD+4
NINCF4   EQU   VYCNTRD+4
NINCF3   EQU   VYCNTRD+4
NINCF1   EQU   VYCNTRD+4
NINCFM   EQU   VYCNTRD+3
NINCE4   EQU   VYCNTRD+3
NINCE3   EQU   VYCNTRD+3
NINCE2   EQU   VYCNTRD+3
NINCE0   EQU   VYCNTRD+3
NINCD9   EQU   VYCNTRD+3
NINCD8   EQU   VYCNTRD+3
NINCD7   EQU   VYCNTRD+3
NINCD6   EQU   VYCNTRD+2
NINCD5   EQU   VYCNTRD+2
NINCD4   EQU   VYCNTRD+2
NINCD3   EQU   VYCNTRD+2
NINCD2   EQU   VYCNTRD+2
NINCD1   EQU   VYCNTRD+2
NINCIP   EQU   VYCNTRD+2
NINCR2   EQU   VYCNTRD+2
NINCVN   EQU   VYCNTRD+1
NINCVS   EQU   VYCNTRD+1
NINCVP   EQU   VYCNTRD+1
NINCVX   EQU   VYCNTRD+1
NINCFS   EQU   VYCNTRD+1
NINCSM   EQU   VYCNTRD+1
NINCR1   EQU   VYCNTRD+1
NINCLF   EQU   VYCNTRD
NINCVA   EQU   VYCNTRD
NINCVI   EQU   VYCNTRD
NINCMD   EQU   VYCNTRD
NINCMY   EQU   VYCNTRD
NINCDL   EQU   VYCNTRD
NINCIO   EQU   VYCNTRD
NINCCL   EQU   VYCNTRD
VYCCNS   EQU   ISTVYCRR
CNSRSV05 EQU   CNSTFLDB+2
CNSLOG0B EQU   CNSTFLDB+2
CNSACCTB EQU   CNSTFLDB+2
CNSFREEB EQU   CNSTFLDB+2
CNSGETSB EQU   CNSTFLDB+2
CNSSEARB EQU   CNSTFLDB+2
CNSQUEUB EQU   CNSTFLDB+2
CNSACONB EQU   CNSTFLDB+2
CNSTCONB EQU   CNSTFLDB+1
CNSCLAQB EQU   CNSTFLDB+1
CNSCLINB EQU   CNSTFLDB+1
CNSGBINB EQU   CNSTFLDB+1
CNSLGINB EQU   CNSTFLDB+1
CNSACINB EQU   CNSTFLDB+1
CNSPSINB EQU   CNSTFLDB+1
CNSRQRLB EQU   CNSTFLDB+1
CNSTRRLB EQU   CNSTFLDB
CNSDORLB EQU   CNSTFLDB
CNSRLINB EQU   CNSTFLDB
CNSQREQB EQU   CNSTFLDB
CNSXREQB EQU   CNSTFLDB
CNSAQINB EQU   CNSTFLDB
CNSAUTHB EQU   CNSTFLDB
CNSMRINB EQU   CNSTFLDB
CNSRSV01 EQU   CNSTFLDA+2
CNSLOG0A EQU   CNSTFLDA+2
CNSACCTA EQU   CNSTFLDA+2
CNSFREEA EQU   CNSTFLDA+2
CNSGETSA EQU   CNSTFLDA+2
CNSSEARA EQU   CNSTFLDA+2
CNSQUEUA EQU   CNSTFLDA+2
CNSACONA EQU   CNSTFLDA+2
CNSTCONA EQU   CNSTFLDA+1
CNSCLAQA EQU   CNSTFLDA+1
CNSCLINA EQU   CNSTFLDA+1
CNSGBINA EQU   CNSTFLDA+1
CNSLGINA EQU   CNSTFLDA+1
CNSACINA EQU   CNSTFLDA+1
CNSPSINA EQU   CNSTFLDA+1
CNSRQRLA EQU   CNSTFLDA+1
CNSTRRLA EQU   CNSTFLDA
CNSDORLA EQU   CNSTFLDA
CNSRLINA EQU   CNSTFLDA
CNSQREQA EQU   CNSTFLDA
CNSXREQA EQU   CNSTFLDA
CNSAQINA EQU   CNSTFLDA
CNSAUTHA EQU   CNSTFLDA
CNSMRINA EQU   CNSTFLDA
CNSTPFX  EQU   ISTCNSTA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
@NM00017 EQU   ISTAPCRR+137
@NM00016 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00015 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00014 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00013 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00012 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00011 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00010 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00009 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
ZCRMDATA EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00008 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00007 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZACTV EQU   ZSAZSVMS
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00006 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00005 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00004 EQU   RPHCVFLG
RPHFRRPH EQU   RPHCVFLG
RPHOWRPH EQU   RPHCVFLG
RPHCDRPH EQU   RPHCVFLG
RPHPSRPH EQU   RPHCVFLG
RPHVYRPH EQU   RPHGATE
@NM00003 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00043 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00042 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00041 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00040 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00039 EQU   FLCFSA
@NM00038 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00037 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00036 EQU   FLCIOA
@NM00035 EQU   FLCMCLA+15
@NM00034 EQU   FLCMCLA+14
@NM00033 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00032 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00031 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00030 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00029 EQU   FLCPER
@NM00028 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00027 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00026 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00025 EQU   FLCPIILC
@NM00024 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00023 EQU   FLCSVILC
@NM00022 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00021 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00020 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00710 EQU   @RC00698
@RC00738 EQU   @RC00727
@RC00809 EQU   @RC00797
@RC00862 EQU   @RC00850
@RC01107 EQU   @RC01100
@RC00864 EQU   @RC00862
@ENDDATA EQU   *
         END   ISTINCMS,(C'PLS2212',0603,78205)
