//*---------------------------------------------------------*
//*     INSTALLATION SAMPLE JCL FOR 'PDSTEST'
//*---------------------------------------------------------*
//ASSEMBLE EXEC ASMHCL,
//         SYSOUT=H
//SYSLIB   DD DSN=SYS1.AMODGEN,UNIT=3330-1,VOL=SER=DLIBJ8,DISP=SHR
//         DD DSN=SYS2.MACLIB,DISP=SHR
//         DD DSN=SYS1.MACLIB,DISP=SHR
//SYSIN    DD DSN=ASMI99U.MI110.SOURCE(PDSTEST),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.LINKLOAD,DISP=SHR
//LKED.SYSIN  DD *
 ALIAS URPDSTST
 NAME  PDSTEST(R)
/*
