//TS15500J JOB 527TSO000S0008,ARNIE,CLASS=Q,MSGCLASS=5,
// NOTIFY=TS15500,PERFORM=12,REGION=2048K
// EXEC PGM=IEWL,REGION=2048K,PARM=',AC=1,LIST,XREF,MAP'
//SYSLMOD DD DSN=SYS2.MLINKLIB,DISP=SHR
//SYSLIB DD DSN=TA15500.JES.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=5
//A DD DSN=TA15500.JES.LOAD,DISP=SHR
//SYSLIN DD *
 INCLUDE A(JESMON)
 INCLUDE A(HIST)
 INCLUDE A(RECTRK)
 ENTRY JESMON
 NAME CBT1351A(R)
 INCLUDE A(REPORT)
 INCLUDE A(RECTRK)
 ENTRY JESRPT
 NAME CBT1351B(R)
/*
