)ATTR DEFAULT(%+_)
  Ö   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(LEFT)
  !   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(RIGHT)
)BODY
%------------------------  MANUAL MANAGEMENT FACILITY  -  UPDATE  ------
%COMMAND ===>_ZCMD
%
+PRODUCT/CATEGORY ===>ÖCATEGORY+        +      CURRENCY ===>ÖZ+
+   MANUAL NUMBER ===>ÖMANUALNO    +    +PRODUCT NUMBER ===>ÖPRODUCT +
+          COPIES ===>!Z +              +     TNL LEVEL ===>ÖTNLLEVEL +
+DESCRIPTION:                           +       VERSION ===>ÖZ     +
+  ===>ÖDESCRIPT
%
%                           DISTRIBUTION INFORMATION
%
%S ROW GROUP         LOCATION      CONTACT    STATUS           %SCROLL =
)MODEL CLEAR(SEL) ROWS(SCAN)
_Z!Z +_GROUP       +_LOCATION    +_CONTACT     +_Z+
)INIT
  .HELP = LMMPH130
  .ZVARS = '(CURRENCY NOCOPIES VERSION ZSCBR SEL COPYNO STATUS)'
)PROC
)END
