)ATTR DEFAULT(%+_)
  Ö   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(LEFT)
  !   TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF)  JUST(RIGHT)
)BODY
%------------------------  MANUAL MANAGEMENT FACILITY  -----------------
%COMMAND ===>_ZCMD                                            %SCROLL ==
%
%S%MANUAL NO.  %DESCRIPTION                                       %CATEG
)MODEL CLEAR(SEL) ROWS(&ROWS)
_ZÖMANUALNO    ÖDESCRIPT                                          ÖCATEG
)INIT
  .HELP = LMMPH040
  .ZVARS = '(ZSCBR SEL CURRENCY NOCOPIES)'
)PROC
  VER (&ZCMD,LIST,' ')  /* NO VALID COMMANDS */
)END
