)ATTR DEFAULT(%+_)
)BODY
%TUTORIAL ---------------  MANUAL MANAGEMENT FACILITY  ----------------
%SELECTION ===>_ZCMD
%
%                          --------------------------
                           ×     DISPLAY MANUAL     ×
                           --------------------------
+
   The%SELECT+line command displays details of a manual and its
   distribution information.
)PROC
   &ZUP = LMMPH010
)END
