         TITLE 'AMDPRFXT - FORMAT VERB EXECUTOR                        *
                       '
AMDPRFXT CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'AMDPRFXT  73.230'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @11,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@11                                         0001
         ST    @13,@SA00001+4                                      0001
         LA    @14,@SA00001                                        0001
         ST    @14,8(,@13)                                         0001
         LR    @13,@14                                             0001
*   FXTSAVRG = R13;                 /* SAVE ADDR OF FXT SAVE AREA    */
         ST    R13,FXTSAVRG                                        0039
*   RESPECIFY R13 UNRESTRICTED;                                    0040
*                                                                  0040
*   /*****************************************************************/
*   /*                                                               */
*   /* PRINT HEADER AND BEGIN                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0041
*   GEN REFS(AWRITE) (BRWRITE SKIP); /* SKIP TO A NEW PAGE           */
         BRWRITE SKIP
*   OUTPUT(46:45+LENGTH(FXTITLE)) = FXTITLE; /* PRINT HEADER         */
         L     @10,CURBUF(,COMBASE)                                0042
         MVC   OUTPUT+45(29,@10),FXTITLE                           0042
*   GEN (BRWRITE 3);                                               0043
*                                                                  0043
         BRWRITE 3
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP TO CALL AMDPRUIM - CHECK FOR USER REQUEST              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0044
*   EXITFLAG = CFORMAT;             /* SET FXT FLAG FOR UIM          */
         MVI   EXITFLAG(COMBASE),X'20'                             0044
*   CALL UIM;                                                      0045
*                                                                  0045
         L     @15,AUSREXIT(,COMBASE)                              0045
         BALR  @14,@15                                             0045
*   /*****************************************************************/
*   /*                                                               */
*   /* IF CVT IS NOT LOCATEABLE PRINT MESSAGE AND RETURN TO AMDPRCTL */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0046
*   IF CVTADDR = 0 THEN             /* IS THERE A CVT                */
         ICM   @10,15,CVTADDR(COMBASE)                             0046
         BNZ   @RF00046                                            0046
*     DO;                           /* NO                            */
*       OUTPUT(2:1+LENGTH(FXTMSG1)) = FXTMSG1; /* PRINT UNABLE TO  0048
*                                      ACCESS CVT MSG                */
         L     @10,CURBUF(,COMBASE)                                0048
         MVC   OUTPUT+1(48,@10),FXTMSG1                            0048
*       GEN (BRWRITE 1);                                           0049
         BRWRITE 1
*       GO TO FXTEXIT;              /* RETURN TO CALLER              */
         B     FXTEXIT                                             0050
*     END;                                                         0051
*                                                                  0051
*   /*****************************************************************/
*   /*                                                               */
*   /* CVT FOUND - BEGIN PROCESSING WITH 'GSMQ'                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0052
*   CVTPTR = CVTADDR;               /* ADDR FOR CVT MACRO            */
@RF00046 L     CVTPTR,CVTADDR(,COMBASE)                            0052
*   FXTERSAV = ERRADDR;             /* SAVE ERROR RTN ADDR IN COMMON */
         MVC   FXTERSAV(4),ERRADDR(COMBASE)                        0053
*   ERRADDR = ADDR(FXTERRTN);       /* PUT ADDR OF FXT BRREAD ERROR
*                                      RTN IN COMMON                 */
         LA    @10,FXTERRTN                                        0054
         ST    @10,ERRADDR(,COMBASE)                               0054
*   SPLTYPE = 0;                                                   0055
         MVI   SPLTYPE,X'00'                                       0055
*   QSWITCH = 0;                    /* INDICATE PROCESSING GSMQ      */
         MVI   QSWITCH,X'00'                                       0056
*   OUTPUT(2:1+LENGTH(GSMQTITL)) = GSMQTITL; /* PRINT GSMQ HEADER    */
         L     @10,CURBUF(,COMBASE)                                0057
         MVC   OUTPUT+1(28,@10),GSMQTITL                           0057
*   GEN (BRWRITE 2);                                               0058
         BRWRITE 2
*   RESPECIFY PREG RESTRICTED;                                     0059
*   PREG = ADDR(CVTGSMQ);           /* PTR TO GSMQ                   */
*                                                                  0060
         LA    PREG,CVTGSMQ(,CVTPTR)                               0060
*   /*****************************************************************/
*   /*                                                               */
*   /* FINDING QUEUE HEAD                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0061
*                                                                  0061
*QPTRFIND:                                                         0061
*   GEN REFS(BRRDDATA) FLOWS(FXTERRTN) (BRREAD (PREG));            0061
QPTRFIND BRREAD (PREG)
*   QUEPTR = CURNTQAD;              /* ADDR OF QUEUE CURRENTLY BEING
*                                      REFERENCED                    */
         MVC   QUEPTR(3),CURNTQAD(PREG)                            0062
*   RESPECIFY PREG UNRESTRICTED;                                   0063
*                                                                  0063
*   /*****************************************************************/
*   /*                                                               */
*   /* IF QUEUE PTR IS ZERO PRINT MESSAGE AND CHECK FOR ANOTHER QUEUE*/
*   /* TO PROCESS                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0064
*   IF QUEPTR ^= 0 THEN             /* IS PTR 0                      */
         ICM   @10,7,QUEPTR                                        0064
         BZ    @RF00064                                            0064
*     DO;                           /* NO                            */
*                                                                  0065
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE QUEUE TYPE AND SET SWITCH FOR AMDPRSRB APPROPIATELY */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0066
*       IF QSWITCH = FXTGSPL THEN   /* WAS GSPL PROCESSED            */
         CLI   QSWITCH,2                                           0066
         BNE   @RF00066                                            0066
*         DO;                       /* YES                           */
*           SPLSW = SWITCHON;       /* INDICATE SPL FOR SRB RTN      */
         OI    SPLSW,B'10000000'                                   0068
*           SPLTYPE = 1;            /* INDICATE GSPL FOR SRB RTN     */
         MVI   SPLTYPE,X'01'                                       0069
*         END;                                                     0070
*       ELSE                                                       0071
*         SPLSW = SWITCHOF;         /* NO - INDICATE SMQ FOR SRB RTN */
         B     @RC00066                                            0071
@RF00066 NI    SPLSW,B'01111111'                                   0071
*       CALL SRB(QUEADDR,SPLTYPE);  /* FORMAT SRBS ON THIS QUEUE     */
@RC00066 L     @15,ASRBFMT(,COMBASE)                               0072
         LA    @01,@AL00072                                        0072
         BALR  @14,@15                                             0072
*     END;                                                         0073
*   ELSE                                                           0074
*     DO;                           /* CURRENT QUEUE PTR WAS ZERO    */
         B     @RC00064                                            0074
@RF00064 DS    0H                                                  0075
*       OUTPUT(2:1+LENGTH(FXTMSG3)) = FXTMSG3; /* PRINT QUEUE EMPTY
*                                      MESSAGE                       */
         L     @10,CURBUF(,COMBASE)                                0075
         MVC   OUTPUT+1(14,@10),FXTMSG3                            0075
*       GEN (BRWRITE 2);                                           0076
         BRWRITE 2
*     END;                                                         0077
*                                                                  0077
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE WHICH QUEUE TO PROCESS NEXT, OR IF ALL HAVE BEEN    */
*   /* PROCESSED CALL AMDPRFSR                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0078
*                                                                  0078
*CHKQSW:                                                           0078
*   IF QSWITCH = 0 THEN             /* HAS LSMQ BEEN PROCESSED       */
@RC00064 DS    0H                                                  0078
CHKQSW   CLI   QSWITCH,0                                           0078
         BNE   @RF00078                                            0078
*     DO;                           /* NO                            */
*       QSWITCH = FXTLSMQ;          /* PROCESS LSMQ                  */
         MVI   QSWITCH,X'01'                                       0080
*       OUTPUT(2:1+LENGTH(LSMQTITL)) = LSMQTITL; /* PRINT LSMQ HEADER*/
         L     @10,CURBUF(,COMBASE)                                0081
         MVC   OUTPUT+1(27,@10),LSMQTITL                           0081
*       GEN (BRWRITE 2);                                           0082
         BRWRITE 2
*       RESPECIFY PREG RESTRICTED;                                 0083
*       PREG = ADDR(CVTLSMQ);       /* PTR TO LSMQ                   */
         LA    PREG,CVTLSMQ(,CVTPTR)                               0084
*       GO TO QPTRFIND;             /* GET LSMQ                      */
         B     QPTRFIND                                            0085
*       RESPECIFY PREG UNRESTRICTED;                               0086
*     END;                                                         0087
*   ELSE                                                           0088
*     DO;                           /* LSMQ HAS BEEN PROCESSED       */
@RF00078 DS    0H                                                  0089
*       IF QSWITCH = FXTLSMQ THEN   /* HAS GSPL BEEN PROCESSED       */
         CLI   QSWITCH,1                                           0089
         BNE   @RF00089                                            0089
*         DO;                       /* NO                            */
*           QSWITCH = FXTGSPL;      /* PROCESS GSPL                  */
         MVI   QSWITCH,X'02'                                       0091
*           OUTPUT(2:1+LENGTH(GSPLTITL)) = GSPLTITL; /* PRINT GSPL 0092
*                                      HEADER                        */
         L     @10,CURBUF(,COMBASE)                                0092
         MVC   OUTPUT+1(28,@10),GSPLTITL                           0092
*           GEN (BRWRITE 2);                                       0093
         BRWRITE 2
*           RESPECIFY PREG RESTRICTED;                             0094
*           PREG = ADDR(CVTGSPL);   /* PTR TO GSPL                   */
         LA    PREG,CVTGSPL(,CVTPTR)                               0095
*           GO TO QPTRFIND;         /* GET GSPL                      */
         B     QPTRFIND                                            0096
*         END;                                                     0097
*     END;                                                         0098
@RF00089 DS    0H                                                  0099
*   RESPECIFY PREG UNRESTRICTED;                                   0099
*                                                                  0099
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL AMDPRFSR TO FORMAT TCBS - PARM OF F'S INDICATE TO FORMAT */
*   /* TCBS FOR ALL ASIDS                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0100
*   GEN (BRWRITE SKIP);             /* SKIP TO THE NEXT PAGE FOR FSR */
         BRWRITE SKIP
*   CALL AMDPRFSR (FSRFLAG);        /* FORMAT TCBS                   */
*                                                                  0101
         L     @15,AFORMAT(,COMBASE)                               0101
         LA    @01,@AL00101                                        0101
         BALR  @14,@15                                             0101
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL AMDPRFSR AGAIN - TO PRINT SUMMARY TABLE AND FOR CLEAN-UP */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0102
*   CALL SMRY;                      /* PRINT TCB SUMMARY TABLE AND 0102
*                                      PERFORM CLEAN-UP              */
         L     @15,ATCBSMRY(,COMBASE)                              0102
         BALR  @14,@15                                             0102
*   ERRADDR = FXTERSAV;             /* RESTORE PREVIOUS ERROR RTN  0103
*                                      ADDR IN COMMON                */
*                                                                  0103
         MVC   ERRADDR(4,COMBASE),FXTERSAV                         0103
*FXTEXIT:                                                          0104
*   RETURN;                         /* RETURN TO CALLER              */
*                                                                  0104
@EL00001 L     @13,4(,@13)                                         0104
@EF00001 DS    0H                                                  0104
@ER00001 LM    @14,@12,12(@13)                                     0104
         BR    @14                                                 0104
*   /*****************************************************************/
*   /*                                                               */
*   /* BRREAD ERROR ROUTINE - REESTABLISH ADDRESSABILITY AND PROCESS */
*   /* READ FAILURE                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0105
*                                                                  0105
*FXTERRTN:                          /* ESTABLISH ADDRESSABILITY FOR
*                                      BRREAD ERROR RTN              */
*   GEN;                                                           0105
*                                                                  0105
FXTERRTN DS    0H                                                  0105
         USING *,R15
         L     R13,FXTSAVRG
         LM    R14,R12,12(R13)
         DROP  R15
*   /*****************************************************************/
*   /*                                                               */
*   /* READ FAILED TRYING TO FIND ONE OF THE QUEUES                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0106
*                                                                  0106
*PRTMSG2:                                                          0106
*   OUTPUT(2:1+LENGTH(FXTMSG2)) = FXTMSG2; /* PRINT ERROR FINDING  0106
*                                      QUEUE PTR MSG                 */
PRTMSG2  L     @10,CURBUF(,COMBASE)                                0106
         MVC   OUTPUT+1(46,@10),FXTMSG2                            0106
*   GEN (BRWRITE 2);                                               0107
         BRWRITE 2
*   GO TO CHKQSW;                   /* HAVE ALL QUEUES BEEN PROCESSED*/
         B     CHKQSW                                              0108
*   END AMDPRFXT                                                   0109
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (COMMON  )                                        *
*;                                                                 0109
         B     @EL00001                                            0109
@DATA    DS    0H
         DS    0F
@AL00072 DC    A(QUEADDR)              LIST WITH   2 ARGUMENT(S)
         DC    A(SPLTYPE)
@AL00101 DC    A(@CB01004)             LIST WITH   1 ARGUMENT(S)
         DS    0F
@SA00001 DS    18F
         DS    0F
         DS    0D
FXTSAVRG DC    F'0'
FXTERSAV DC    F'0'
QUEADDR  DS    AL4
         ORG   QUEADDR
SPLSW    DS    BL1
@NM00051 EQU   QUEADDR+0
QUEPTR   DS    AL3
         ORG   QUEADDR+4
SPLTYPE  DS    AL1
@CB01004 DC    X'FFFFFFFF'
QSWITCH  DS    BL1
FXTITLE  DC    CL29'* * * *  F O R M A T  * * * *'
GSMQTITL DC    CL28'GLOBAL SERVICE MANAGER QUEUE'
LSMQTITL DC    CL27'LOCAL SERVICE MANAGER QUEUE'
GSPLTITL DC    CL28'GLOBAL SERVICE PRIORITY LIST'
FXTMSG1  DC    CL48'UNABLE TO ACCESS CVT, FORMAT FUNCTION TERMINATED'
FXTMSG2  DC    CL46'ERROR FINDING QUEUE POINTER, NO SRBS FORMATTED'
FXTMSG3  DC    CL14'QUEUE IS EMPTY'
         DS    CL2
FXTPATCH DC    16F'0'
AMDPRFXT CSECT
DTAE     EQU   32                  DATA EBCDIC BIT
DTAC     EQU   16                  DATA IN CORE BIT
DTAP     EQU   8                   DATA PTR BIT
DTA      EQU   4                   DATA INCLUDED BIT
LBLP     EQU   2                   LABEL PTR BIT
LBL      EQU   1                   LABEL INCLUDED BIT
AMDPRFXT CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
CVTPTR   EQU   @02
R13      EQU   @13
COMBASE  EQU   @12
PREG     EQU   @01
BASE1    EQU   @11
BASE2    EQU   @10
BASE3    EQU   @09
BUFREG   EQU   @06
CNTREG   EQU   @03
LINEREG  EQU   @08
R0       EQU   @00
R1       EQU   @01
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R14      EQU   @14
R15      EQU   @15
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
STOPBASE EQU   @05
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTTSCVT EQU   CVTMAP+228
CVTTSFLG EQU   CVTTSCVT
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTRSV90 EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
COMMON   EQU   0
ERRADDR  EQU   COMMON
CURBUF   EQU   COMMON+48
CVTADDR  EQU   COMMON+56
SWA      EQU   COMMON+122
SWB      EQU   COMMON+123
SWC      EQU   COMMON+124
SWD      EQU   COMMON+125
SWE      EQU   COMMON+126
SWF      EQU   COMMON+127
BUFSW    EQU   COMMON+128
PRSW     EQU   COMMON+129
TABLE    EQU   COMMON+659
HEXTABL  EQU   TABLE+63
AWRITE   EQU   COMMON+1500
AFORMAT  EQU   COMMON+1568
ATCBSMRY EQU   COMMON+1604
DCBADDRS EQU   COMMON+1608
@NM00044 EQU   DCBADDRS+16
@NM00045 EQU   @NM00044
BRRDDATA EQU   COMMON+1984
ASRBFMT  EQU   COMMON+2000
AUSREXIT EQU   COMMON+2008
EXITFLAG EQU   COMMON+2022
AMDPRFSR EQU   0
SMRY     EQU   0
SRB      EQU   0
UIM      EQU   0
CURNTQ   EQU   0
CURNTQAD EQU   CURNTQ+1
OUTPUT   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV100 EQU   CVTS01+116
CVTRV109 EQU   CVTS01+117
CVTRV118 EQU   CVTS01+118
CVTRV127 EQU   CVTS01+119
CVTGSMQ  EQU   CVTS01+264
CVTLSMQ  EQU   CVTS01+268
CVTGSPL  EQU   CVTS01+272
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTRV202 EQU   CVTS01+394
CVTRV201 EQU   CVTS01+392
CVTRV200 EQU   CVTS01+390
CVTRV199 EQU   CVTS01+388
CVTRV198 EQU   CVTS01+386
CVTRV197 EQU   CVTS01+384
CVTRV196 EQU   CVTS01+383
CVTRV195 EQU   CVTS01+382
CVTRV194 EQU   CVTS01+381
CVTRV193 EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTWSAG  EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTRV514 EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTRV146 EQU   CVTS01+134
CVTRV145 EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTRV142 EQU   CVTS01+126
CVTRV141 EQU   CVTS01+125
CVTRV140 EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTRV135 EQU   CVTRV127
CVTRV134 EQU   CVTRV127
CVTRV133 EQU   CVTRV127
CVTRV132 EQU   CVTRV127
CVTRV131 EQU   CVTRV127
CVTRV130 EQU   CVTRV127
CVTRV129 EQU   CVTRV127
CVTRV128 EQU   CVTRV127
CVTRV126 EQU   CVTRV118
CVTRV125 EQU   CVTRV118
CVTRV124 EQU   CVTRV118
CVTRV123 EQU   CVTRV118
CVTRV122 EQU   CVTRV118
CVTRV121 EQU   CVTRV118
CVTRV120 EQU   CVTRV118
CVTRV119 EQU   CVTRV118
CVTRV117 EQU   CVTRV109
CVTRV116 EQU   CVTRV109
CVTRV115 EQU   CVTRV109
CVTRV114 EQU   CVTRV109
CVTRV113 EQU   CVTRV109
CVTRV112 EQU   CVTRV109
CVTRV111 EQU   CVTRV109
CVTRV110 EQU   CVTRV109
CVTRV108 EQU   CVTRV100
CVTRV107 EQU   CVTRV100
CVTRV106 EQU   CVTRV100
CVTRV105 EQU   CVTRV100
CVTRV104 EQU   CVTRV100
CVTRV103 EQU   CVTRV100
CVTRV102 EQU   CVTRV100
CVTRV101 EQU   CVTRV100
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTRSV82 EQU   CVTS01+98
CVTRSV81 EQU   CVTS01+96
CVTSYSWT EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTRSVA2 EQU   CVTS01
@NM00052 EQU   CURNTQ
CSADDR   EQU   COMMON+2072
@NM00050 EQU   COMMON+2070
TOPICHDR EQU   COMMON+2060
DFLTCSA  EQU   COMMON+2056
LPAMAX   EQU   COMMON+2052
DNUCTOP  EQU   COMMON+2048
XLMAX    EQU   COMMON+2044
DQEMAX   EQU   COMMON+2042
ASCBMAX  EQU   COMMON+2040
TCBMAX   EQU   COMMON+2038
SRBMAX   EQU   COMMON+2036
DDMAX    EQU   COMMON+2034
DEBMAX   EQU   COMMON+2032
JPQMAX   EQU   COMMON+2030
LLEMAX   EQU   COMMON+2028
PQEMAX   EQU   COMMON+2026
RBMAX    EQU   COMMON+2024
@NM00049 EQU   COMMON+2023
AUSRASID EQU   COMMON+2020
AUSRTCBA EQU   COMMON+2016
AUSRDEL  EQU   COMMON+2012
AUSRINIT EQU   COMMON+2004
AASCBFMT EQU   COMMON+1996
BRRDADJ  EQU   COMMON+1992
BRRDINIT EQU   COMMON+1988
BUFERMAP EQU   COMMON+1980
ASCBMAP  EQU   COMMON+1976
CPUMAP   EQU   COMMON+1972
ASIDNDX  EQU   COMMON+1968
@NM00048 EQU   COMMON+1964
HDRTITLE EQU   COMMON+1864
HDRREGS  EQU   COMMON+1696
SACSWCAW EQU   COMMON+1684
ASVTADDR EQU   COMMON+1680
PREFXRGV EQU   COMMON+1676
PREFXRGR EQU   COMMON+1672
CURASCB  EQU   COMMON+1668
IPLCPU   EQU   COMMON+1666
QASID    EQU   COMMON+1664
QAPFT    EQU   COMMON+1660
@NM00047 EQU   COMMON+1656
REALMAX  EQU   COMMON+1652
SEGTABOR EQU   COMMON+1648
REALMAP  EQU   COMMON+1644
@NM00046 EQU   COMMON+1641
EDITER   EQU   COMMON+1640
AROOT    EQU   COMMON+1636
AEDITCB  EQU   COMMON+1632
TRCCOUNT EQU   COMMON+1628
ASYSUDCB EQU   @NM00044+1
ENDLIST  EQU   @NM00045
AINDCB   EQU   DCBADDRS+12
ARDRDCB  EQU   DCBADDRS+8
APTRDCB  EQU   DCBADDRS+4
AOUTDCB  EQU   DCBADDRS
ATCBSMFR EQU   COMMON+1600
ONGOPTR  EQU   COMMON+1596
AEND     EQU   COMMON+1592
AERRMSGA EQU   COMMON+1584
BUFREINT EQU   COMMON+1580
BUFSUM   EQU   COMMON+1576
APRTSTG  EQU   COMMON+1572
ASTPROUT EQU   COMMON+1564
APCBENQ  EQU   COMMON+1560
ATCBRTRV EQU   COMMON+1556
ATCBREMV EQU   COMMON+1552
ATCBSAVE EQU   COMMON+1548
QATMERTN EQU   COMMON+1544
ALOADER  EQU   COMMON+1540
AEREXIT  EQU   COMMON+1536
SYNMSGA  EQU   COMMON+1532
STOPEXIT EQU   COMMON+1528
ARGNBND  EQU   COMMON+1524
AWRDCNVT EQU   COMMON+1520
AADRCNVT EQU   COMMON+1516
AFMTLINE EQU   COMMON+1512
ASYNTAX  EQU   COMMON+1508
APRTMSG  EQU   COMMON+1504
NONBLNK  EQU   COMMON+1244
BLNK     EQU   COMMON+988
@NM00043 EQU   COMMON+972
@NM00042 EQU   COMMON+915
EBCTABL  EQU   HEXTABL+10
@NM00041 EQU   HEXTABL
@NM00040 EQU   TABLE
CAPTABL  EQU   COMMON+403
TITLEPGE EQU   COMMON+394
@NM00039 EQU   COMMON+392
TITLETME EQU   COMMON+379
@NM00038 EQU   COMMON+377
TITLEDTE EQU   COMMON+364
@NM00037 EQU   COMMON+362
TITLEMOD EQU   COMMON+347
TITLEMSG EQU   COMMON+283
MSG2     EQU   COMMON+257
MSG1     EQU   COMMON+231
STOP     EQU   COMMON+227
TITLE    EQU   COMMON+222
BLANKS   EQU   COMMON+214
WTORMSG  EQU   COMMON+133
@NM00036 EQU   COMMON+130
@NM00035 EQU   PRSW
@NM00034 EQU   PRSW
PRNTREAL EQU   PRSW
PRNTRL   EQU   PRSW
TTLSW    EQU   PRSW
@NM00033 EQU   PRSW
QSEGTBSW EQU   PRSW
@NM00032 EQU   PRSW
@NM00031 EQU   BUFSW
PREFM    EQU   BUFSW
@NM00030 EQU   BUFSW
@NM00029 EQU   BUFSW
@NM00028 EQU   BUFSW
@NM00027 EQU   BUFSW
@NM00026 EQU   BUFSW
@NM00025 EQU   BUFSW
@NM00024 EQU   SWF
QUT1LOD  EQU   SWF
@NM00023 EQU   SWF
PAGEOK   EQU   SWF
DMPIC    EQU   SWF
QSADMP   EQU   SWF
NUCTFRMC EQU   SWF
QPRDINIT EQU   SWF
@NM00022 EQU   SWE
@NM00021 EQU   SWE
@NM00020 EQU   SWE
BUILDMAP EQU   SWE
TITLESW  EQU   SWE
RESPC    EQU   SWE
@NM00019 EQU   SWE
STOPSW   EQU   SWE
@NM00018 EQU   SWD
GPRSFND  EQU   SWD
CONTSW   EQU   SWD
NOLOADSW EQU   SWD
NOSTDMG  EQU   SWD
@NM00017 EQU   SWD
@NM00016 EQU   SWD
FLSHMODE EQU   SWD
@NM00015 EQU   SWC
@NM00014 EQU   SWC
@NM00013 EQU   SWC
EDITSW   EQU   SWC
TREADIN  EQU   SWC
POSITSW  EQU   SWC
SETFLSH  EQU   SWC
MSTRSW   EQU   SWC
@NM00012 EQU   SWB
@NM00011 EQU   SWB
QSYSUT2  EQU   SWB
ENDSW    EQU   SWB
@NM00010 EQU   SWB
@NM00009 EQU   SWB
FMTERR   EQU   SWB
IOERR    EQU   SWB
RDRSW    EQU   SWA
SETCVTSW EQU   SWA
@NM00008 EQU   SWA
GOSW     EQU   SWA
@NM00007 EQU   SWA
@NM00006 EQU   SWA
@NM00005 EQU   SWA
@NM00004 EQU   SWA
LINENUM  EQU   COMMON+120
LINENUMB EQU   COMMON+118
SIXTEEN  EQU   COMMON+116
TWELVE   EQU   COMMON+114
ELEVEN   EQU   COMMON+112
HTEN     EQU   COMMON+110
EIGHT    EQU   COMMON+108
SEVEN    EQU   COMMON+106
FIVE     EQU   COMMON+104
FOUR     EQU   COMMON+102
THREE    EQU   COMMON+100
TWO      EQU   COMMON+98
ONEA     EQU   COMMON+96
READTM   EQU   COMMON+92
RDERCNT  EQU   COMMON+88
READNO   EQU   COMMON+84
RDENTRY  EQU   COMMON+80
@NM00003 EQU   COMMON+78
FILESEQ  EQU   COMMON+76
INDD     EQU   COMMON+68
STORSIZE EQU   COMMON+64
PCBPTR   EQU   COMMON+60
TCBLIST  EQU   COMMON+52
PAGENUMB EQU   COMMON+44
LINECNT  EQU   COMMON+40
SIX      EQU   COMMON+36
NUCTOP   EQU   COMMON+32
WORK1    EQU   COMMON+24
DELIMCD  EQU   COMMON+20
KYWDEND  EQU   COMMON+16
KYWDBGN  EQU   COMMON+12
VERBEND  EQU   COMMON+8
VERBGN   EQU   COMMON+4
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTRSVA1 EQU   CVTXTNT2+48
CVTRSVA0 EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTRSV90
CVTRSV9G EQU   CVTRSV90
CVTRSV9F EQU   CVTRSV90
CVTRSV9E EQU   CVTRSV90
CVTRSV9D EQU   CVTRSV90
CVTRSV9C EQU   CVTRSV90
CVTRSV9B EQU   CVTRSV90
CVTRSV9A EQU   CVTRSV90
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTRV484 EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTINTLA EQU   CVTMAP+320
CVTERPV  EQU   CVTMAP+316
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTRV319 EQU   CVTUSR
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTTSCVB EQU   CVTTSCVT+1
CVTRSV25 EQU   CVTTSFLG
CVTRSV24 EQU   CVTTSFLG
CVTRSV23 EQU   CVTTSFLG
CVTRSV22 EQU   CVTTSFLG
CVTRSV21 EQU   CVTTSFLG
CVTRSV20 EQU   CVTTSFLG
CVTRSV19 EQU   CVTTSFLG
CVTTSRDY EQU   CVTTSFLG
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTIERLC EQU   CVTMAP+144
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
FXTEXIT  EQU   @EL00001
@ENDDATA EQU   *
         END   AMDPRFXT,(C'PL/S-II',0502,73230)
