         TITLE 'GTF MINIMAL BUILD ROUTINE                              *
                       '
AHLTSYSM CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'AHLTSYSM  74.032'                                 0001
         DROP  @15
@PROLOG  BALR  @11,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@11                                         0001
         EJECT
         B     @PB00002                                            0193
AHLPRECM DS    0H                                                  0194
               USING AHLTSYSM,@11           NEW ADDRESSABILITY
               SETFRR A,FRRAD=(RTCAREG),WRKREGS=(7,9),PARMAD=(R9PARM)
*   SVR14NRM=RTNSAVE;               /* SAVE RETURN ADDR TO MCIH      */
         ST    RTNSAVE,SVR14NRM(,R9PARM)                           0195
*   GENERATE REFS(FLCPOPSW,AHLPSCM2);                              0196
               TM  FLCPOPSW+1,X'81'           PK 0-7 + SUPER STATE
               BNZ  AHLPSCM2                 EXIT
*   MCATRAIL=ZERO;                  /* ZERO FLAG FIELD               */
         MVC   MCATRAIL(8,AWSAPTR),ZERO                            0197
*   PREASCB=PSAAOLD;                /* GATHER ASCB ADDR              */
         L     @12,PSAAOLD                                         0198
         ST    @12,PREASCB(,AWSAPTR)                               0198
*   PRECPUID=PSACPUSA;              /* GATHER CPUID          @YM03489*/
         LH    @12,PSACPUSA                                        0199
         STH   @12,PRECPUID(,AWSAPTR)                              0199
*   RETURN;                                                        0200
@EL00002 DS    0H                                                  0200
@EF00002 DS    0H                                                  0200
@ER00002 BR    @14                                                 0200
*   END;                                                           0201
@PB00002 DS    0H                                                  0201
*   GEN(EJECT);                                                    0202
         EJECT
*AHLPSTCM:                                                         0203
*   MCATRL4='00'X;                  /* CLEAR ANY DEBUG BITS          */
AHLPSTCM MVI   MCATRL4(AWSAPTR),X'00'                              0203
*   IF OPTTRC=ON                    /* TRC?                          */
*     THEN                                                         0204
         TM    OPTTRC(PCTPTR),B'00001000'                          0204
         BO    @RT00204                                            0204
*     GOTO AHLPSCM1;                /* YES, TRACE GTF                */
*   IF PREASCB=GTFASCB              /* NO; IS THIS GTF?              */
*     THEN                                                         0206
         CLC   PREASCB(4,AWSAPTR),GTFASCB(PCTPTR)                  0206
         BE    @RT00206                                            0206
*     GO TO AHLPSCM2;               /* YES, DONT TRACE               */
*AHLPSCM1:                                                         0208
*                                                                  0208
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE STACK MACRO TO CAUSE TRC ENTRY TO BE MOVED TO GTF       */
*   /* BUFFERS                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0208
*   DO;                             /* AHLSTACK DLENGTH(RECLEN)    0208
*                                      AID(255) FID(03)              */
*                                                                  0208
AHLPSCM1 DS    0H                                                  0209
*     /***************************************************************/
*     /*                                                             */
*     /* THE FOLLOWING CODE IS GENERATED BY THE AHLSTACK MACRO. THIS */
*     /* CODE BUILDS THE GTF RECORD PREFIX AND THEN CALLS AHLSBLOK TO*/
*     /* STACK THE RECORD.                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0209
*     DCL                                                          0209
*       1 AHLGREC INT BASED(AHLRECPR)BDY(WORD),/* MAPPING FOR RECORD
*                                      PREFIX                        */
*        2 AHLGLGTH PTR(16),        /* LENGTH OF RECORD PLUS PREFIX  */
*        2 AHLGRES PTR(16),         /* FOR COMPATIBILITY TO QSAM     */
*        2 AHLGAID PTR(8),          /* APPLICATION ID                */
*        2 AHLGFID PTR(8),          /* FORMAT APPENDAGE ID           */
*        2 AHLGTST CHAR(8),         /* TIMESTAMP IF SPECIFIED        */
*         3 AHLGEIDS PTR(16)BDY(BYTE),/* RECORD EVENT IDENTIFIER IF
*                                      NO TIMESTAMP                  */
*        2 AHLGEIDL PTR(16);        /* RECORD EVENT IDENTIFIER WITH
*                                      TIMESTAMP                     */
*     DCL                                                          0210
*       AHLRECPR PTR(31)REG(1),     /* USED AS POINTER TO RECORD   0210
*                                      PREFIX AREA                   */
*       AHLSBREG PTR(31)REG(14),    /* USED TO HOLD A STABLE COPY OF
*                                      THE SBLOKRTN FIELD IN THE   0210
*                                      GTFPCT                        */
*       AHLRETCD PTR(31)REG(15);    /* USED TO PASS RETURN CODE TO 0210
*                                      INVOKER                       */
*     DCL                                                          0211
*       AHLSBLOK ENTRY OPTIONS(NOEXIT,SEQFLOW,REFS(MCAWSA),SETS(   0211
*           AHLRETCD),NOFLOWS)BASED(AHLSBREG)VALRG(0);/* ENTRY FOR 0211
*                                      AHLSBLOK                      */
*     RFY                                                          0212
*      (AHLRECPR,                                                  0212
*       AHLSBREG,                                                  0212
*       AHLRETCD)RSTD;                                             0212
*     IF OPTTIME='1'B THEN          /* CHECK FOR TIMESTAMP REQUESTED */
         TM    OPTTIME(PCTPTR),B'00000001'                         0213
         BNO   @RF00213                                            0213
*       DO;                         /* YES, TIMESTAMP                */
*         AHLRECPR=ADDR(MCARECPR);  /* SETUP ADDRESSIBILITY TO PREFIX
*                                      FOR PREFIX WITH TIMESTAMP     */
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         0215
*         AHLGLGTH=RECLEN+16;       /* SET LENGTH TO INCLUDE ***   0216
*                                      DLENGTH *** PLUS TIMESTAMP  0216
*                                      PREFIX                        */
         LA    @12,16                                              0216
         AR    @12,RECLEN                                          0216
         STH   @12,AHLGLGTH(,AHLRECPR)                             0216
*         GEN(STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX )
*         SETS(AHLGTST)NOEXIT SEQFLOW NOFLOWS;                     0217
         STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX
*         AHLGEIDL=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @12,MCAMCR(,AWSAPTR)                                0218
         SLR   @08,@08                                             0218
         ICM   @08,3,MCREID(@12)                                   0218
         STH   @08,AHLGEIDL(,AHLRECPR)                             0218
*       END;                                                       0219
*     ELSE                          /* NO TIMESTAMP TO BE DONE, BUILD
*                                      SHORT PREFIX                  */
*       DO;                                                        0220
         B     @RC00213                                            0220
@RF00213 DS    0H                                                  0221
*         AHLRECPR=ADDR(MCARECPR)+8;/* SETUP ADDRESSIBILITY TO FOR 0221
*                                      SHORT PREFIX WITHOUT TIMESTAMP*/
         LA    @12,8                                               0221
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         0221
         AR    AHLRECPR,@12                                        0221
*         AHLGLGTH=RECLEN+8;        /* PUT TOTAL RECORD LENGTH INTO
*                                      PREFIX *** DLENGTH *** PLUS 0222
*                                      PREFIX LENGTH                 */
         AR    @12,RECLEN                                          0222
         STH   @12,AHLGLGTH(,AHLRECPR)                             0222
*         AHLGEIDS=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @12,MCAMCR(,AWSAPTR)                                0223
         SLR   @08,@08                                             0223
         ICM   @08,3,MCREID(@12)                                   0223
         STH   @08,AHLGEIDS(,AHLRECPR)                             0223
*       END;                                                       0224
*     AHLGRES=0;                    /* ZERO OUT FOR QSAM           0225
*                                      COMPATIBILITY                 */
@RC00213 SLR   @12,@12                                             0225
         STH   @12,AHLGRES(,AHLRECPR)                              0225
*     AHLGAID=255;                  /* PUT *** AID *** INTO PREFIX   */
         MVI   AHLGAID(AHLRECPR),X'FF'                             0226
*     AHLGFID=03;                   /* PUT *** FID *** INTO PREFIX   */
         MVI   AHLGFID(AHLRECPR),X'03'                             0227
*     AHLRETCD=4;                   /* SET DEFAULT RETURN CODE       */
         LA    AHLRETCD,4                                          0228
*     AHLSBREG=SBLOKRTN;            /* GET A STABLE COPY OF AHLSBLOK
*                                      ADDR                          */
         L     AHLSBREG,SBLOKRTN(,PCTPTR)                          0229
*     IF AHLSBREG^=0 THEN           /* CHECK TO SEE IF AHLSBLOK IS 0230
*                                      AVAILABLE                     */
         CR    AHLSBREG,@12                                        0230
         BE    @RF00230                                            0230
*       CALL AHLSBLOK;              /* YES, SO CALL AHLSBLOK TO BLOCK
*                                      RECORD                        */
         LR    @15,AHLSBREG                                        0231
         BALR  @14,@15                                             0231
*     RFY                                                          0232
*      (AHLRECPR,                                                  0232
*       AHLSBREG,                                                  0232
*       AHLRETCD)UNRSTD;                                           0232
@RF00230 DS    0H                                                  0233
*   END;                                                           0233
*AHLPSCM2:                                                         0234
*   ;                                                              0234
AHLPSCM2 DS    0H                                                  0235
*   GEN(SETFRR D,WRKREGS=(7,9));                                   0235
         SETFRR D,WRKREGS=(7,9)
*   GO TO RTNSAVE;                  /* RESTORE RETURN ADDR AND RETURN
*                                      TO MCIH                       */
         BR    RTNSAVE                                             0236
*   GEN(EJECT);                                                    0237
*                                                                  0237
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD SVC RECORD                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0238
*AHLSVC:                                                           0238
*   ;                                                              0238
AHLSVC   DS    0H                                                  0239
*   GENERATE;                                                      0239
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDRESS           */
         LR    RTNSAVE,RTNADDR                                     0240
*   RTCAREG=ADDR(FRRSVC);           /* ERROR ROUTINE ADDR            */
         LA    RTCAREG,FRRSVC                                      0241
*   CALL AHLPRECM;                  /* COMMON INITIALIZER            */
         BAL   @14,AHLPRECM                                        0242
*   MCASVC=ON;                      /* INDICATE SVC RTN              */
         OI    MCASVC(AWSAPTR),B'10000000'                         0243
*   SVCTCB=PSATOLD;                 /* GATHER TCB@                   */
         L     @12,PSATOLD                                         0244
         ST    @12,SVCTCB(,AWSAPTR)                                0244
*   SVCR15=EVREG15;                 /* GATHER R15                    */
         L     @12,LCCAPTR                                         0245
         MVC   SVCR15(4,AWSAPTR),EVREG15(@12)                      0245
*   SVCR0R1=EVREG01;                /* GATHER R0 + R1                */
         MVC   SVCR0R1(8,AWSAPTR),EVREG01(@12)                     0246
*   SVCPSW=FLCSOPSW;                /* GATHER PSW                    */
         MVC   SVCPSW(8,AWSAPTR),FLCSOPSW                          0247
*   SVCINT=FLCSVCN;                 /* INT CODE LIKE BC MODE PSW     */
         LH    @12,FLCSVCN                                         0248
         STH   @12,SVCINT(,AWSAPTR)                                0248
*   RECLEN=LENGTH(SVCREC);                                         0249
         LA    RECLEN,30                                           0249
*   GOTO AHLPSTCM;                  /* GOTO EXIT CODE                */
         B     AHLPSTCM                                            0250
*   GEN(EJECT);                                                    0251
*                                                                  0251
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD EXT RECORD                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0252
*AHLEXT:                                                           0252
*   ;                                                              0252
AHLEXT   DS    0H                                                  0253
*   GENERATE;                                                      0253
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDRESS           */
         LR    RTNSAVE,RTNADDR                                     0254
*   RTCAREG=ADDR(FRREXT);           /* ERROR ROUTINE ADDR            */
         LA    RTCAREG,FRREXT                                      0255
*   GENERATE;                                                      0256
               SETFRR A,FRRAD=(RTCAREG),WRKREGS=(7,9),PARMAD=(R9PARM)
*   SVR14NRM=RTNSAVE;               /* SAVE RETURN ADDR TO MCIH      */
         ST    RTNSAVE,SVR14NRM(,R9PARM)                           0257
*   RFY                                                            0258
*     MCRWSA BASED(MCAMCR);                                        0258
*   IF MCRBRENT='0'B THEN                                          0259
         L     @12,MCAMCR(,AWSAPTR)                                0259
         TM    MCRBRENT(@12),B'00010000'                           0259
         BZ    @RT00259                                            0259
*     GO TO AHLPSCM2;               /* IF NOT BRANCH ENTRY, USER   0260
*                                      ISSUED THE HOOK. EXIT         */
*   RFY                                                            0261
*     MCRWSA BASED(WSACGTF);                                       0261
*   MCATRAIL=EXTMASK;               /* INDICATE EXT ROUTINE IN     0262
*                                      CONTROL                       */
         MVC   MCATRAIL(8,AWSAPTR),EXTMASK                         0262
*   EXTASCB=PSAAOLD;                /* GATHER ASCB ADDR              */
         L     @12,PSAAOLD                                         0263
         ST    @12,EXTASCB(,AWSAPTR)                               0263
*   EXTCPUID=PSACPUSA;              /* GATHER CPUID          @YM03489*/
         LH    @12,PSACPUSA                                        0264
         STH   @12,EXTCPUID(,AWSAPTR)                              0264
*   EXTPSW=FLCEOPSW;                /* GATHER PSW DATA               */
         MVC   EXTPSW(8,AWSAPTR),FLCEOPSW                          0265
*   EXTINT=FLCEICOD;                /* GATHER INTERRUPT CODE         */
         LH    @12,FLCEICOD                                        0266
         STH   @12,EXTINT(,AWSAPTR)                                0266
*   IF LCCASRBM=ON                  /* SRB MODE ?                    */
*     THEN                                                         0267
         L     @12,LCCAPTR                                         0267
         TM    LCCASRBM(@12),B'10000000'                           0267
         BNO   @RF00267                                            0267
*     EXTTCB=NOTAPP;                /* NO TCB W SRB MODE             */
         MVC   EXTTCB(4,AWSAPTR),@CC02647                          0268
*   ELSE                                                           0269
*     EXTTCB=PSATOLD;               /* GATHER TCB DATA               */
         B     @RC00267                                            0269
@RF00267 L     @12,PSATOLD                                         0269
         ST    @12,EXTTCB(,AWSAPTR)                                0269
*   MCAMEXT=ON;                     /* FOR ERROR RECOVERY            */
@RC00267 OI    MCAMEXT(AWSAPTR),B'10000000'                        0270
*   RECLEN=LENGTH(EXTREC);                                         0271
         LA    RECLEN,22                                           0271
*   IF EICOD=CCINT THEN                                            0272
         CLC   EICOD(2),@CB02655                                   0272
         BNE   @RF00272                                            0272
*     DO;                           /* CLK COMPARATOR INT            */
*       IF PCCATQEP^=0              /* NO TQE ?                      */
*         THEN                                                     0274
         L     @12,PCCAPTR                                         0274
         L     @08,PCCATQEP(,@12)                                  0274
         LTR   @08,@08                                             0274
         BZ    @RF00274                                            0274
*         EXTVAR=TQETCB;            /* TCB W INT                     */
         L     @12,TQEPTR(,@12)                                    0275
         L     @12,TQETCB(,@12)                                    0275
         ST    @12,EXTVAR(,AWSAPTR)                                0275
*       ELSE                                                       0276
*         EXTVAR=UNAVAL;            /* UNAVAILABLE                   */
         B     @RC00274                                            0276
@RF00274 MVC   EXTVAR(4,AWSAPTR),UNAVAL                            0276
*       GOTO AHLPSTCM;              /* EXIT                          */
         B     AHLPSTCM                                            0277
*     END;                                                         0278
*   IF INTTYP=SIGPINT               /* SIGNAL PROCESSOR              */
*     THEN                                                         0279
@RF00272 CLI   INTTYP,X'12'                                        0279
         BNE   @RF00279                                            0279
*     EXTVAR=PSAEEPSW;              /* PROCESSOR ADDR                */
         MVC   EXTVAR(4,AWSAPTR),PSAEEPSW                          0280
*   ELSE                                                           0281
*     EXTVAR=NOTAPP;                /* N/A FOR OTHER INTRPTS         */
         B     @RC00279                                            0281
@RF00279 MVC   EXTVAR(4,AWSAPTR),@CC02647                          0281
*   GOTO AHLPSTCM;                  /* EXIT                          */
         B     AHLPSTCM                                            0282
*   GEN(EJECT);                                                    0283
*                                                                  0283
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD IO TRACE RECORD                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0284
*AHLIO:                                                            0284
*   ;                                                              0284
AHLIO    DS    0H                                                  0285
*   GENERATE;                                                      0285
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDRESS           */
         LR    RTNSAVE,RTNADDR                                     0286
*   RTCAREG=ADDR(FRRIO);            /* ERROR ROUTINE ADDR            */
         LA    RTCAREG,FRRIO                                       0287
*   CALL AHLPRECM;                                                 0288
         BAL   @14,AHLPRECM                                        0288
*   MCAIO=ON;                       /* INDICATE IO RTN               */
         OI    MCAIO(AWSAPTR),B'00100000'                          0289
*   IOCSW=FLCCSW;                   /* GATHER CSW                    */
         MVC   IOCSW(8,AWSAPTR),FLCCSW                             0290
*   IOPSW=FLCIOPSW;                 /* GATHER PSW                    */
         MVC   IOPSW(8,AWSAPTR),FLCIOPSW                           0291
*   IODEV=EVREG6;                   /* GATHER IO DEVICE              */
         L     @12,LCCAPTR                                         0292
         MVC   IODEV(4,AWSAPTR),EVREG6(@12)                        0292
*   RECLEN=LENGTH(IOREC);                                          0293
         LA    RECLEN,30                                           0293
*   IF EVREG2=0                     /* IOSB VALID ?                  */
*     THEN                                                         0294
         L     @12,EVREG2(,@12)                                    0294
         LTR   @12,@12                                             0294
         BNZ   @RF00294                                            0294
*     DO;                           /* PUT U/A IN IOSB DEP FLDS      */
*       IOASCB=UNAVAL;                                             0296
         MVC   IOASCB(4,AWSAPTR),UNAVAL                            0296
*       IOSENSE=UNAVAL(1:2);                                       0297
         MVC   IOSENSE(2,AWSAPTR),UNAVAL                           0297
*       IOTCB=UNAVAL;                                              0298
         MVC   IOTCB(4,AWSAPTR),UNAVAL                             0298
*       GOTO AHLPSTCM;                                             0299
         B     AHLPSTCM                                            0299
*     END;                                                         0300
*   MCAMIOSB=ON;                    /* TURN ON IOSB BIT              */
@RF00294 OI    MCAMIOSB(AWSAPTR),B'00001000'                       0301
*   IF IOSERP=0 THEN                /* NO SENSE AVAILABLE            */
         L     @12,LCCAPTR                                         0302
         L     @12,IOSBPTR(,@12)                                   0302
         L     @12,IOSERP(,@12)                                    0302
         LTR   @12,@12                                             0302
         BNZ   @RF00302                                            0302
*     IOSENSE=NOTAPP;               /* N/ IN SENSE                   */
         MVC   IOSENSE(2,AWSAPTR),@CC02647                         0303
*   ELSE                                                           0304
*     IOSENSE=EWASNS;               /* GATHER SENSE                  */
         B     @RC00302                                            0304
@RF00302 L     @12,LCCAPTR                                         0304
         L     @12,IOSBPTR(,@12)                                   0304
         L     @12,EWAPTR(,@12)                                    0304
         MVC   IOSENSE(2,AWSAPTR),EWASNS(@12)                      0304
*   MCAMASCB=ON;                    /* TURN ON DBUG BIT              */
@RC00302 OI    MCAMASCB(AWSAPTR),B'00100000'                       0305
*   IOASCB=ASVTENTY(IOSASID);       /* GATHER ASCB ADDR              */
         L     @12,LCCAPTR                                         0306
         L     @12,IOSBPTR(,@12)                                   0306
         SLR   @08,@08                                             0306
         ICM   @08,3,IOSASID(@12)                                  0306
         SLA   @08,2                                               0306
         L     @12,CVTPTR                                          0306
         L     @12,ASVTPTR(,@12)                                   0306
         L     @12,ASVTENTY-4(@08,@12)                             0306
         ST    @12,IOASCB(,AWSAPTR)                                0306
*RCOV1:                                                            0307
*   MCAMTCB=ON;                     /* TURN ON DBUG BIT              */
RCOV1    OI    MCAMTCB(AWSAPTR),B'00010000'                        0307
*   IF SRBPTCB=0 THEN               /* NO TCB AVAILABLE              */
         L     @12,LCCAPTR                                         0308
         L     @12,IOSBPTR(,@12)                                   0308
         L     @12,SRBPTR(,@12)                                    0308
         L     @12,SRBPTCB(,@12)                                   0308
         LTR   @12,@12                                             0308
         BNZ   @RF00308                                            0308
*     IOTCB=NOTAPP;                 /* N/A IN TCB                    */
         MVC   IOTCB(4,AWSAPTR),@CC02647                           0309
*   ELSE                                                           0310
*     IOTCB=SRBPTCB;                /* TCB FOR IO INT                */
         B     @RC00308                                            0310
@RF00308 L     @12,LCCAPTR                                         0310
         L     @12,IOSBPTR(,@12)                                   0310
         L     @12,SRBPTR(,@12)                                    0310
         L     @12,SRBPTCB(,@12)                                   0310
         ST    @12,IOTCB(,AWSAPTR)                                 0310
*   GOTO AHLPSTCM;                  /* EXIT                          */
         B     AHLPSTCM                                            0311
*   GEN(EJECT);                                                    0312
*                                                                  0312
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD UIO TRACE RECORD                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0313
*AHLUIO:                                                           0313
*   ;                               /* UIO MIN GATHER RTN            */
AHLUIO   DS    0H                                                  0314
*   GENERATE;                                                      0314
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDRESS           */
         LR    RTNSAVE,RTNADDR                                     0315
*   RTCAREG=ADDR(FRRUIO);           /* ERROR ROUTINE ADDR            */
         LA    RTCAREG,FRRUIO                                      0316
*   CALL AHLPRECM;                  /* COMMON INITIALIZER RTN        */
         BAL   @14,AHLPRECM                                        0317
*   MCAUIO=ON;                      /* INDICATE UIO RTN IN CONTROL   */
         OI    MCAUIO(AWSAPTR),B'00001000'                         0318
*   UIOASCB=NOTAPP;                 /* N/A FOR ASCB                  */
         MVC   UIOASCB(4,AWSAPTR),@CC02647                         0319
*   UIOPSW=FLCIOPSW;                /* GATHER PSW                    */
         MVC   UIOPSW(8,AWSAPTR),FLCIOPSW                          0320
*   UIOCSW=FLCCSW;                  /* GATHER CSW                    */
         MVC   UIOCSW(8,AWSAPTR),FLCCSW                            0321
*   UIODEV=EVREG6;                  /* GATHER DEV. ADDR              */
         L     @12,LCCAPTR                                         0322
         MVC   UIODEV(4,AWSAPTR),EVREG6(@12)                       0322
*   RECLEN=LENGTH(UIOREC);                                         0323
         LA    RECLEN,26                                           0323
*   GOTO AHLPSTCM;                  /* GOTO EXIT RTN                 */
         B     AHLPSTCM                                            0324
*   GEN(EJECT);                                                    0325
*                                                                  0325
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD SIO TRACE RECORD                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0326
*AHLSIO:                                                           0326
*   ;                                                              0326
AHLSIO   DS    0H                                                  0327
*   GENERATE;                                                      0327
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RTN ADDR                 */
         LR    RTNSAVE,RTNADDR                                     0328
*   RTCAREG=ADDR(FRRSIO);           /* ERROR ROUTINE ADDR            */
         LA    RTCAREG,FRRSIO                                      0329
*   CALL AHLPRECM;                  /* COMMON INITIALIZER            */
         BAL   @14,AHLPRECM                                        0330
*   MCASIO=ON;                      /* SIO RTN IN CNTR.              */
         OI    MCASIO(AWSAPTR),B'00010000'                         0331
*   SIOCAW=FLCCAW;                  /* GATHER CAW                    */
         MVC   SIOCAW(4,AWSAPTR),FLCCAW                            0332
*   SIOSTS=FLCCSW(5:6);             /* GATHER CSW STATUS             */
         MVC   SIOSTS(2,AWSAPTR),FLCCSW+4                          0333
*   SIODEV=EVREG6;                  /* GATHER DEV ADDR               */
         L     @12,LCCAPTR                                         0334
         MVC   SIODEV(4,AWSAPTR),EVREG6(@12)                       0334
*   RECLEN=LENGTH(SIOREC);                                         0335
         LA    RECLEN,24                                           0335
*   IF EVREG2=0                     /* IOSB BAD ?                    */
*     THEN                                                         0336
         L     @12,EVREG2(,@12)                                    0336
         LTR   @12,@12                                             0336
         BNZ   @RF00336                                            0336
*     DO;                                                          0337
*       SIOASCB=UNAVAL;             /* NO ASCB ADDR                  */
         MVC   SIOASCB(4,AWSAPTR),UNAVAL                           0338
*       SIOCPA=UNAVAL;              /* NO CPA                        */
         MVC   SIOCPA(8,AWSAPTR),UNAVAL                            0339
*       SIOCC='U';                  /* NO CC , FLAG WITH U           */
         MVI   SIOCC(AWSAPTR),C'U'                                 0340
*       GOTO AHLPSTCM;              /* GOTO EXIT RTN                 */
         B     AHLPSTCM                                            0341
*     END;                                                         0342
*   MCAMIOSB=ON;                    /* IOSB BASED PROCESSING         */
@RF00336 OI    MCAMIOSB(AWSAPTR),B'00001000'                       0343
*   SIOCC=IOSCC;                    /* GATHER CC                     */
         L     @12,LCCAPTR                                         0344
         L     @12,IOSBPTR(,@12)                                   0344
         MVC   SIOCC(1,AWSAPTR),IOSCC(@12)                         0344
*   SIOASCB=ASVTENTY(IOSASID);      /* GATHER ASCB @                 */
         SLR   @08,@08                                             0345
         ICM   @08,3,IOSASID(@12)                                  0345
         SLA   @08,2                                               0345
         L     @15,CVTPTR                                          0345
         L     @15,ASVTPTR(,@15)                                   0345
         L     @08,ASVTENTY-4(@08,@15)                             0345
         ST    @08,SIOASCB(,AWSAPTR)                               0345
*   SIOCPA=IOSCPA;                  /* REAL AND VIRT CCW ADDR VST    */
         MVC   SIOCPA(8,AWSAPTR),IOSCPA(@12)                       0346
*   GOTO AHLPSTCM;                  /* EXIT                          */
         B     AHLPSTCM                                            0347
*   GEN(EJECT);                                                    0348
*                                                                  0348
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD PINT RECORD                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0349
*AHLPINT:                                                          0349
*   ;                                                              0349
AHLPINT  DS    0H                                                  0350
*   GENERATE;                                                      0350
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDR              */
         LR    RTNSAVE,RTNADDR                                     0351
*   RTCAREG=ADDR(FRRPI);            /* GET ERROR ROUTINE ADDR        */
         LA    RTCAREG,FRRPI                                       0352
*   GENERATE;                                                      0353
*                                       /* SET UP ADDRESSIBILITY     */
         SETFRR  A,FRRAD=(RTCAREG),WRKREGS=(7,9),PARMAD=(R9PARM)
*   SVR14NRM=RTNSAVE;               /* SAVE RETURN ADDR TO MCIH      */
         ST    RTNSAVE,SVR14NRM(,R9PARM)                           0354
*   IF LCCPNT4=MCCODE THEN          /* USER ISSUED HOOK?             */
         L     @12,LCCAPTR                                         0355
         CLI   LCCPNT4(@12),X'40'                                  0355
         BE    @RT00355                                            0355
*     GO TO AHLPSCM2;               /* YES, EXIT                     */
*   MCATRAIL=PIMASK;                /* ZERO FLAGS AND SET PI         */
         MVC   MCATRAIL(8,AWSAPTR),PIMASK                          0357
*   PIASCB=PSAAOLD;                 /* GATHER ASCB                   */
         L     @08,PSAAOLD                                         0358
         ST    @08,PIASCB(,AWSAPTR)                                0358
*   PICPUID=PSACPUSA;               /* GATHER CPUID          @YM03489*/
         LH    @08,PSACPUSA                                        0359
         STH   @08,PICPUID(,AWSAPTR)                               0359
*   PIOPSW=LCCAPPSW;                /* GATHER PSW                    */
         MVC   PIOPSW(8,AWSAPTR),LCCAPPSW(@12)                     0360
*   PIR15=EVREG15;                  /* GATHER R15                    */
         MVC   PIR15(4,AWSAPTR),EVREG15(@12)                       0361
*   PIR1=EVREG1;                    /* GATHER R1                     */
         L     @08,EVREG1(,@12)                                    0362
         ST    @08,PIR1(,AWSAPTR)                                  0362
*   PIINT=LCCPNT3;                  /* GATHER INT CODE               */
         MVC   PIINT(2,AWSAPTR),LCCPNT3(@12)                       0363
*   PIVPA=LCCAPVAD;                 /* GATHER VPA                    */
         L     @08,LCCAPVAD(,@12)                                  0364
         ST    @08,PIVPA(,AWSAPTR)                                 0364
*   IF LCCASRBM=ON                  /* SRB MODE                      */
*     THEN                                                         0365
         TM    LCCASRBM(@12),B'10000000'                           0365
         BNO   @RF00365                                            0365
*     PITCB=NOTAPP;                 /* NO TCB W SRB MODE             */
         MVC   PITCB(4,AWSAPTR),@CC02647                           0366
*   ELSE                                                           0367
*     PITCB=PSATOLD;                /* GATHER TCB ADDR               */
         B     @RC00365                                            0367
@RF00365 L     @12,PSATOLD                                         0367
         ST    @12,PITCB(,AWSAPTR)                                 0367
*   RECLEN=LENGTH(PIREC);                                          0368
@RC00365 LA    RECLEN,30                                           0368
*   GOTO AHLPSTCM;                  /* EXIT                          */
         B     AHLPSTCM                                            0369
*   GEN(EJECT);                                                    0370
*                                                                  0370
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD AHLTINT RECORD                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0371
*AHLTINT:                                                          0371
*   ;                                                              0371
AHLTINT  DS    0H                                                  0372
*   GENERATE;                                                      0372
*                                       /* SET UP ADDRESSIBILITY     */
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDR              */
         LR    RTNSAVE,RTNADDR                                     0373
*   RTCAREG=ADDR(FRRPI);            /* GET ERROR ROUTINE ADDR        */
         LA    RTCAREG,FRRPI                                       0374
*   GENERATE;                                                      0375
*                                       /* SET UP ADDRESSIBILITY     */
         SETFRR  A,FRRAD=(RTCAREG),WRKREGS=(7,9),PARMAD=(R9PARM)
*   SVR14NRM=RTNSAVE;               /* SAVE RETURN ADDR TO MCIH      */
         ST    RTNSAVE,SVR14NRM(,R9PARM)                           0376
*   IF LCCPNT4=MCCODE THEN          /* USER ISSUED HOOK?             */
         L     @12,LCCAPTR                                         0377
         CLI   LCCPNT4(@12),X'40'                                  0377
         BE    @RT00377                                            0377
*     GO TO AHLPSCM2;               /* YES, EXIT                     */
*   MCATRAIL=PIMASK;                /* ZERO FLAGS AND SET PI         */
         MVC   MCATRAIL(8,AWSAPTR),PIMASK                          0379
*   PIASCB=PSAAOLD;                 /* GATHER ASCB                   */
         L     @08,PSAAOLD                                         0380
         ST    @08,PIASCB(,AWSAPTR)                                0380
*   PICPUID=PSACPUSA;               /* GATHER CPUID          @YM03489*/
         LH    @08,PSACPUSA                                        0381
         STH   @08,PICPUID(,AWSAPTR)                               0381
*   PIOPSW=FLCPOPSW;                /* GATHER PSW                    */
         MVC   PIOPSW(8,AWSAPTR),FLCPOPSW                          0382
*   PIR15=TEVREG15;                 /* GATHER R15                    */
         MVC   PIR15(4,AWSAPTR),TEVREG15(@12)                      0383
*   PIR1=TEVREG1;                   /* GATHER R1                     */
         MVC   PIR1(4,AWSAPTR),TEVREG1(@12)                        0384
*   PIINT=FLCPICOD;                 /* GATHER INT CODE               */
         LH    @08,FLCPICOD                                        0385
         STH   @08,PIINT(,AWSAPTR)                                 0385
*   PIVPA=FLCTEA;                   /* GATHER VPA                    */
         L     @08,FLCTEA                                          0386
         ST    @08,PIVPA(,AWSAPTR)                                 0386
*   IF LCCASRBM=ON                  /* SRB MODE                      */
*     THEN                                                         0387
         TM    LCCASRBM(@12),B'10000000'                           0387
         BNO   @RF00387                                            0387
*     PITCB=NOTAPP;                 /* NO TCB W SRB MODE             */
         MVC   PITCB(4,AWSAPTR),@CC02647                           0388
*   ELSE                                                           0389
*     PITCB=PSATOLD;                /* GATHER TCB ADDR               */
         B     @RC00387                                            0389
@RF00387 L     @12,PSATOLD                                         0389
         ST    @12,PITCB(,AWSAPTR)                                 0389
*   RECLEN=LENGTH(PIREC);                                          0390
@RC00387 LA    RECLEN,30                                           0390
*   GOTO AHLPSTCM;                  /* EXIT                          */
         B     AHLPSTCM                                            0391
*   GEN(EJECT);                                                    0392
*                                                                  0392
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD FRR RECORD                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0393
*AHLFRR:                                                           0393
*   ;                                                              0393
AHLFRR   DS    0H                                                  0394
*   GENERATE;                                                      0394
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDR              */
         LR    RTNSAVE,RTNADDR                                     0395
*   RTCAREG=ADDR(FRRFRR);           /* GET ERROR ROUTINE ADDR        */
         LA    RTCAREG,FRRFRR                                      0396
*   GENERATE;                                                      0397
         SETFRR A,FRRAD=(RTCAREG),WRKREGS=(7,9),PARMAD=(R9PARM)
*   SVR14NRM=RTNSAVE;               /* SAVE RETURN ADDR TO MCIH      */
         ST    RTNSAVE,SVR14NRM(,R9PARM)                           0398
*   RFY                                                            0399
*     MCRWSA BASED(MCAMCR);                                        0399
*   IF MCRBRENT^='1'B THEN          /* USER ISSUED HOOK              */
         L     @12,MCAMCR(,AWSAPTR)                                0400
         TM    MCRBRENT(@12),B'00010000'                           0400
         BNO   @RT00400                                            0400
*     GO TO AHLPSCM2;               /* YES, EXIT                     */
*   RFY                                                            0402
*     MCRWSA BASED(WSACGTF);                                       0402
*   MCATRAIL=FRRMASK;               /* ZERO FLAGS AND SET FRR        */
         MVC   MCATRAIL(8,AWSAPTR),FRRMASK                         0403
*   FRRCPU=PSACPUSA;                /* GATHER CPU DATA       @YM03489*/
         LH    @12,PSACPUSA                                        0404
         STH   @12,FRRCPU(,AWSAPTR)                                0404
*   RECLEN=LENGTH(FRRREC);                                         0405
         LA    RECLEN,29                                           0405
*   RFY                                                            0406
*     WORKREG RESTRICTED;                                          0406
*   RFY                                                            0407
*     SDWAPTR RESTRICTED;                                          0407
*   SDWAPTR=FRRREG1;                /* ADDRESS RTCA                  */
         L     @12,LCCAPTR                                         0408
         L     @12,LCCACPUS(,@12)                                  0408
         L     @12,WSACGTF(,@12)                                   0408
         L     SDWAPTR,FRRREG1(,@12)                               0408
*   MCAMSDWA=ON;                    /* INDICATE RTCA PROCESSING      */
         OI    MCAMSDWA(AWSAPTR),B'00000010'                       0409
*   WORKREG=SDWAFMID;               /* GET ID INDEX                  */
         SLR   WORKREG,WORKREG                                     0410
         ICM   WORKREG,3,SDWAFMID(SDWAPTR)                         0410
*   IF WORKREG=0 THEN               /* IF INDEX IS ZERO              */
         LTR   WORKREG,WORKREG                                     0411
         BNZ   @RF00411                                            0411
*     FRRASCB=PSAAOLD;              /* GATHER ASCB DATA FROM PSA     */
         L     @12,PSAAOLD                                         0412
         ST    @12,FRRASCB(,AWSAPTR)                               0412
*   ELSE                                                           0413
*     DO;                                                          0413
         B     @RC00411                                            0413
@RF00411 DS    0H                                                  0414
*       FRRASCB=ASVTENTY(WORKREG);  /* GATHER ASCB DATA FROM LIST    */
         LR    @12,WORKREG                                         0414
         SLA   @12,2                                               0414
         L     @08,CVTPTR                                          0414
         L     @08,ASVTPTR(,@08)                                   0414
         L     @12,ASVTENTY-4(@12,@08)                             0414
         ST    @12,FRRASCB(,AWSAPTR)                               0414
*       RFY                                                        0415
*         WORKREG UNRSTD;                                          0415
*     END;                                                         0416
*   FRRPSW=SDWAEC1;                 /* GATHER PSW                    */
@RC00411 MVC   FRRPSW(8,AWSAPTR),SDWAEC1(SDWAPTR)                  0417
*   FRRCC=SDWAABCC;                 /* GATHER COMPLETN CODE          */
         MVC   FRRCC(4,AWSAPTR),SDWAABCC(SDWAPTR)                  0418
*   FRRFLG1=SDWAFLGS;               /* GATHER FLAGS                  */
         MVC   FRRFLG1(4,AWSAPTR),SDWAFLGS(SDWAPTR)                0419
*   FRRMCHD=SDWAMCHD;               /* MACH CHK FLGS                 */
         MVC   FRRMCHD(1,AWSAPTR),SDWAMCHD(SDWAPTR)                0420
*   FRRACF=SDWAACF2;                /* ACTION REQSD FLGS             */
         MVC   FRRACF(1,AWSAPTR),SDWAACF2(SDWAPTR)                 0421
*   FRRRC=SDWARCDE;                 /* RETURN CODE                   */
         MVC   FRRRC(1,AWSAPTR),SDWARCDE(SDWAPTR)                  0422
*   IF SDWARCDE=RCDE                /* TEST RC                       */
*     THEN                                                         0423
         CLI   SDWARCDE(SDWAPTR),X'04'                             0423
         BNE   @RF00423                                            0423
*     FRRETRY=SDWARTYA;             /* RC=4 MEANS RETRY ADDR         */
         L     @12,SDWARTYA(,SDWAPTR)                              0424
         ST    @12,FRRETRY(,AWSAPTR)                               0424
*   ELSE                                                           0425
*     FRRETRY=NOTAPP;               /* RC^=4 MEANS NO RETRY          */
         B     @RC00423                                            0425
@RF00423 MVC   FRRETRY(4,AWSAPTR),@CC02647                         0425
*   RECLEN=LENGTH(FRRREC);                                         0426
@RC00423 LA    RECLEN,29                                           0426
*   GOTO AHLPSTCM;                                                 0427
         B     AHLPSTCM                                            0427
*   GEN(EJECT);                                                    0428
*                                                                  0428
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* GATHER DATA AND BUILD STAE/ESTAE RECORD                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0429
*AHLSTAE:                                                          0429
*   ;                                                              0429
AHLSTAE  DS    0H                                                  0430
*   GENERATE;                                                      0430
         USING *,EPREG
         L BASEREG,BASEADDR
         DROP  EPREG
*   RTNSAVE=RTNADDR;                /* SAVE RETURN ADDRESS           */
         LR    RTNSAVE,RTNADDR                                     0431
*   RTCAREG=ADDR(FRRFRR);           /* ERROR ROUTINE ADDR            */
         LA    RTCAREG,FRRFRR                                      0432
*   CALL AHLPRECM;                  /* CALL COMMON INITIALIZER       */
         BAL   @14,AHLPRECM                                        0433
*   MCASTA=ON;                      /* INDICATE STAE/ESTAE RTN       */
         OI    MCASTA(AWSAPTR),B'00010000'                         0434
*   STARTYCA=EVREG01;               /* GATHER ADDRS                  */
         L     @12,LCCAPTR                                         0435
         MVC   STARTYCA(8,AWSAPTR),EVREG01(@12)                    0435
*   RECLEN=LENGTH(STAEREC);                                        0436
         LA    RECLEN,30                                           0436
*   STARF=EVREG15;                  /* RETURN CODE                   */
         MVC   STARF(4,AWSAPTR),EVREG15(@12)                       0437
*   SDWAPTR=EVREG1;                                                0438
         L     SDWAPTR,EVREG1(,@12)                                0438
*   MCAMSDWA=ON;                    /* INDICATE SDWA PROCESSING      */
         OI    MCAMSDWA(AWSAPTR),B'00000010'                       0439
*   IF SDWAPTR>0 THEN                                              0440
         LTR   SDWAPTR,SDWAPTR                                     0440
         BNP   @RF00440                                            0440
*     DO;                           /* ESTAE REG ADDR                */
*                                                                  0441
*       /*************************************************************/
*       /*                                                           */
*       /* THIS SECTION GATHERS ESTAE DATA                           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0442
*       STAEPSW=SDWAEC1;            /* GATHER ERR PSW                */
         MVC   STAEPSW(8,AWSAPTR),SDWAEC1(SDWAPTR)                 0442
*       STAECC=SDWAABCC;            /* GATHER COMPLETN CODE          */
         MVC   STAECC(4,AWSAPTR),SDWAABCC(SDWAPTR)                 0443
*       STARCDE=SDWARCDE;           /* RETURN CDE FR RTCA            */
         MVC   STARCDE(1,AWSAPTR),SDWARCDE(SDWAPTR)                0444
*       IF SDWARCDE^=RCDE           /* RC ^=4?                       */
*         THEN                                                     0445
         CLI   SDWARCDE(SDWAPTR),X'04'                             0445
         BE    @RF00445                                            0445
*         STARTYA=NOTAPP;           /* NO RETRY                      */
         MVC   STARTYA(4,AWSAPTR),@CC02647                         0446
*       ELSE                                                       0447
*         STARTYA=SDWARTYA;         /* GATHER RETRY ADD FROM RTCA  0447
*                                      @YM04516                      */
         B     @RC00445                                            0447
@RF00445 L     @12,SDWARTYA(,SDWAPTR)                              0447
         ST    @12,STARTYA(,AWSAPTR)                               0447
*       STAERRA=SDWAERRA;           /* GATHER FLAGS                  */
@RC00445 MVC   STAERRA(1,AWSAPTR),SDWAERRA(SDWAPTR)                0448
*       STAMCHD=SDWAMCHD;                                          0449
         MVC   STAMCHD(1,AWSAPTR),SDWAMCHD(SDWAPTR)                0449
*       STAACF2=SDWAACF2;                                          0450
         MVC   STAACF2(1,AWSAPTR),SDWAACF2(SDWAPTR)                0450
*       GOTO AHLPSTCM;              /* EXIT                          */
         B     AHLPSTCM                                            0451
*     END;                                                         0452
*   IF SDWAPTR=0                    /* BAD RTCA ?                    */
*     THEN                                                         0453
@RF00440 LTR   SDWAPTR,SDWAPTR                                     0453
         BNZ   @RF00453                                            0453
*     DO;                                                          0454
*       STAUA=UNAVAL;               /* U/A TO PSW,CC, AND FLGS       */
         MVC   STAUA(15,AWSAPTR),UNAVAL                            0455
*       GO TO AHLPSTCM;             /* RETURN                        */
         B     AHLPSTCM                                            0456
*     END;                                                         0457
*                                                                  0457
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS SECTION GATHERS STAE DATA                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0458
*   SDWAPTR1=ABS(SDWAPTR1);         /* COMPLEMENT ADDRESS            */
@RF00453 LPR   SDWAPTR1,SDWAPTR1                                   0458
*   STAEPSW=SDWAEC1;                /* GATHER ER PSW                 */
         MVC   STAEPSW(8,AWSAPTR),SDWAEC1(SDWAPTR)                 0459
*   STAECC=SDWAABCC;                /* GATHER COMP. CODE             */
         MVC   STAECC(4,AWSAPTR),SDWAABCC(SDWAPTR)                 0460
*   IF STARCDE^=4                   /* RC ^= 4?                      */
*     THEN                                                         0461
         CLI   STARCDE(AWSAPTR),4                                  0461
         BE    @RF00461                                            0461
*     STARTYA=NOTAPP;               /* RC^=4 NO RETRY ADDR           */
         MVC   STARTYA(4,AWSAPTR),@CC02647                         0462
*   STAFLGS=NOTAPP;                 /* NO FLGS FOR STAE              */
@RF00461 MVC   STAFLGS(3,AWSAPTR),@CC02647                         0463
*   GOTO AHLPSTCM;                  /* EXIT                          */
         B     AHLPSTCM                                            0464
*   RFY                                                            0465
*     SDWAPTR UNRSTD;                                              0465
*   GEN(EJECT);                                                    0466
*                                                                  0466
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* AHLTSYSM ERROR ROUTINE                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0467
*AHLERPRE:                                                         0467
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0467
         B     @PB00003                                            0467
AHLERPRE DS    0H                                                  0468
*   RFY                                                            0468
*     R0 RSTD;                                                     0468
*   RFY                                                            0469
*     RTNADDR RSTD;                                                0469
*   RFY                                                            0470
*     MCQE BASED(R0);                                              0470
*   RFY                                                            0471
*     SDWA BASED(SDWAPTR2);         /*                       @YM01891*/
*   RFY                                                            0472
*     MCRWSA BASED(WSACGTF);                                       0472
*   AWSAPTR=MCRMCA;                 /* GET ADDR OF MCAWSA AT ERROR 0473
*                                      FROM MCRWSA                   */
         L     @15,LCCAPTR                                         0473
         L     @15,LCCACPUS(,@15)                                  0473
         L     @15,WSACGTF(,@15)                                   0473
         L     AWSAPTR,MCRMCA(,@15)                                0473
*   RFY                                                            0474
*     MCRWSA BASED(MCAMCR);                                        0474
*   MCAERROR=ON;                    /* FLAG ERROR RECOVERY IN CONTROL*/
         OI    MCAERROR(AWSAPTR),B'00000100'                       0475
*   R0=MCRREG0;                     /* MCQE AT TIME OF ERROR         */
         L     @15,MCAMCR(,AWSAPTR)                                0476
         L     R0,MCRREG0(,@15)                                    0476
*   PCTPTR=MCQEAT;                  /* PCT AT TIME OF ERROR          */
         LR    @15,R0                                              0477
         L     PCTPTR,MCQEAT(,@15)                                 0477
*   DO;                             /* SETRP RECPARM(RECID)          */
*     RESPECIFY                                                    0479
*      (GPR00P,                                                    0479
*       GPR01P,                                                    0479
*       GPR14P,                                                    0479
*       GPR15P)RSTD;                                               0479
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0480
*     GPR15P=ADDR(RECID);           /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,RECID                                        0481
*     GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD PARAMETERS */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0482
*     RESPECIFY                                                    0483
*      (GPR00P,                                                    0483
*       GPR01P,                                                    0483
*       GPR14P,                                                    0483
*       GPR15P)UNRSTD;                                             0483
*   END;                                                           0484
*   WTOLIST=WTONAMES;               /* INITIALIZE WTO LIST           */
         MVC   WTOLIST(16,AWSAPTR),WTONAMES                        0485
*   WTOFUNC=TRAILSAV;               /* INSERT SPECIFIC FUNCTION      */
         MVC   WTOFUNC(4,AWSAPTR),TRAILSAV(R9PARM)                 0486
*   IF SDWAMCHK=ON THEN             /* A MACHINE CHECK OCCURRED      */
         TM    SDWAMCHK(SDWAPTR2),B'10000000'                      0487
         BNO   @RF00487                                            0487
*     IF SDWAINSF=ON&               /* INSTRUCTION FAILURE           */
*         SDWAREGU=OFF&             /* REGISTERS IN SDWA ARE VALID   */
*         SDWAPSWU=OFF THEN         /* PSW IS VALID TOO              */
         TM    SDWAINSF(SDWAPTR2),B'00000100'                      0488
         BNO   @RF00488                                            0488
         TM    SDWAREGU(SDWAPTR2),B'01100000'                      0488
         BNZ   @RF00488                                            0488
*       DO;                         /* RETRY MAY BE ATTEMPTED        */
*         DO;                       /* SETRP RETADDR(MCHKRTY)      0490
*                                      RC(SDWARETY)                  */
*           RESPECIFY                                              0491
*            (GPR00P,                                              0491
*             GPR01P,                                              0491
*             GPR14P,                                              0491
*             GPR15P)RSTD;                                         0491
*           GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA          */
         MVI   SDWARCDE(GPR01P),X'04'                              0492
*           GPR01P->SDWARTYA=ADDR(MCHKRTY);/* SAVE RETRY ADDRESS     */
         L     @12,SDWANXT1(,SDWAPTR2)                             0493
         ST    @12,SDWARTYA(,GPR01P)                               0493
*           RESPECIFY                                              0494
*            (GPR00P,                                              0494
*             GPR01P,                                              0494
*             GPR14P,                                              0494
*             GPR15P)UNRSTD;                                       0494
*         END;                                                     0495
*       END;                                                       0496
*     ELSE                                                         0497
*       DO;                         /* RETRY NOT POSSIBLE            */
         B     @RC00488                                            0497
@RF00488 DS    0H                                                  0498
*         MCQESAV=R0;               /* SAVE R0                       */
         ST    R0,MCQESAV(,AWSAPTR)                                0498
*         SDWASAV=SDWAPTR2;         /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0499
*         R0=ADDR(DMPLIST);         /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0500
*         CALL DMPMOD;              /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0501
         BALR  @14,@15                                             0501
*         WTOUN=R15RC;              /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0502
*         R1PARM=ADDR(WTOLIST);                                    0503
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0503
*         CALL AHLWTO;                                             0504
         L     @15,PCTWTOMD(,PCTPTR)                               0504
         BALR  @14,@15                                             0504
*         R0=MCQESAV;               /* RESTORE R0                    */
         L     R0,MCQESAV(,AWSAPTR)                                0505
*         SDWAPTR2=SDWASAV;         /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0506
*         DO;                       /* SETRP RC(SDWACWT)             */
*           RESPECIFY                                              0508
*            (GPR00P,                                              0508
*             GPR01P,                                              0508
*             GPR14P,                                              0508
*             GPR15P)RSTD;                                         0508
*           GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE                */
         MVI   SDWARCDE(GPR01P),X'00'                              0509
*           RESPECIFY                                              0510
*            (GPR00P,                                              0510
*             GPR01P,                                              0510
*             GPR14P,                                              0510
*             GPR15P)UNRSTD;                                       0510
*         END;                                                     0511
*       END;                                                       0512
*   ELSE                            /* CHECK IF THIS ROUTINE WAS   0513
*                                      PERCOLATED TO                 */
*     IF SDWAPERC=ON THEN           /* YES, PERCOLATED TO            */
         B     @RC00487                                            0513
@RF00487 TM    SDWAPERC(SDWAPTR2),B'00010000'                      0513
         BNO   @RF00513                                            0513
*       IF SDWAEAS=ON THEN          /* PREVIOUS FRR WAS SUCCESSFUL   */
         TM    SDWAEAS(SDWAPTR2),B'00001000'                       0514
         BNO   @RF00514                                            0514
*         DO;                       /* SO CONTINUE PERCOLATION       */
*           DO;                     /* SETRP RC(SDWACWT)             */
*             RESPECIFY                                            0517
*              (GPR00P,                                            0517
*               GPR01P,                                            0517
*               GPR14P,                                            0517
*               GPR15P)RSTD;                                       0517
*             GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE              */
         MVI   SDWARCDE(GPR01P),X'00'                              0518
*             RESPECIFY                                            0519
*              (GPR00P,                                            0519
*               GPR01P,                                            0519
*               GPR14P,                                            0519
*               GPR15P)UNRSTD;                                     0519
*           END;                                                   0520
*         END;                                                     0521
*       ELSE                                                       0522
*         DO;                       /* PREVIOUS FRR HAD A PROBLEM    */
         B     @RC00514                                            0522
@RF00514 DS    0H                                                  0523
*           DO;                     /* SETRP RC(SDWACWT)             */
*             RESPECIFY                                            0524
*              (GPR00P,                                            0524
*               GPR01P,                                            0524
*               GPR14P,                                            0524
*               GPR15P)RSTD;                                       0524
*             GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE              */
         MVI   SDWARCDE(GPR01P),X'00'                              0525
*             RESPECIFY                                            0526
*              (GPR00P,                                            0526
*               GPR01P,                                            0526
*               GPR14P,                                            0526
*               GPR15P)UNRSTD;                                     0526
*           END;                                                   0527
*           MCQESAV=R0;             /* SAVE R0                       */
         ST    R0,MCQESAV(,AWSAPTR)                                0528
*           R0=ADDR(DMPLIST);       /* PARM TO DUMP                  */
         LA    R0,DMPLIST                                          0529
*           CALL DMPMOD;            /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0530
         BALR  @14,@15                                             0530
*           R0=MCQESAV;             /* RESTORE R0                    */
         L     R0,MCQESAV(,AWSAPTR)                                0531
*         END;                                                     0532
*     ELSE                                                         0533
*                                                                  0533
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK FOR DEBUG MODE AND PROHIBIT RETRY FLAGS             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0533
*       IF GTFDEBUG=ON×             /* IMMEDIATE DUMP REQUESTED      */
*           SDWACLUP=ON THEN        /* NO RETRY ALLOWED              */
         B     @RC00513                                            0533
@RF00513 TM    GTFDEBUG(PCTPTR),B'01000000'                        0533
         BO    @RT00533                                            0533
         TM    SDWACLUP(SDWAPTR2),B'10000000'                      0533
         BNO   @RF00533                                            0533
@RT00533 DS    0H                                                  0534
*         DO;                                                      0534
*           MCQESAV=R0;             /* SAVE R0                       */
         ST    R0,MCQESAV(,AWSAPTR)                                0535
*           SDWASAV=SDWAPTR2;       /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0536
*           R0=ADDR(DMPLIST);       /* PARM TO DUMP                  */
         LA    R0,DMPLIST                                          0537
*           CALL DMPMOD;            /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0538
         BALR  @14,@15                                             0538
*           WTOUN=R15RC;            /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0539
*           R1PARM=ADDR(WTOLIST);                                  0540
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0540
*           CALL AHLWTO;                                           0541
         L     @15,PCTWTOMD(,PCTPTR)                               0541
         BALR  @14,@15                                             0541
*           R0=MCQESAV;             /* RESTORE R0                    */
         L     @15,MCQESAV(,AWSAPTR)                               0542
         LR    R0,@15                                              0542
*           SDWAPTR2=SDWASAV;       /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0543
*           R0=MCQESAV;             /* RESTORE R0                    */
         LR    R0,@15                                              0544
*           DO;                     /* SETRP RC(SDWACWT)             */
*             RESPECIFY                                            0546
*              (GPR00P,                                            0546
*               GPR01P,                                            0546
*               GPR14P,                                            0546
*               GPR15P)RSTD;                                       0546
*             GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE              */
         MVI   SDWARCDE(GPR01P),X'00'                              0547
*             RESPECIFY                                            0548
*              (GPR00P,                                            0548
*               GPR01P,                                            0548
*               GPR14P,                                            0548
*               GPR15P)UNRSTD;                                     0548
*           END;                    /* CONTINUE TERMINATION          */
*         END;                                                     0550
*       ELSE                                                       0551
*         RETURN;                   /* RETURN TO CALLER              */
*                                                                  0551
*/*   RETURN TO RTM. SDWA IS SET UP FOR RETURN                       */
*                                                                  0552
*   RTNADDR=SVR14FRR;               /* SET UP RETURN TO RTM          */
@RC00513 DS    0H                                                  0552
@RC00487 L     RTNADDR,SVR14FRR(,R9PARM)                           0552
*   BC(15,RTNADDR);                 /* RETURN                        */
         BCR   15,RTNADDR                                          0553
*   END AHLERPRE;                                                  0554
@EL00003 DS    0H                                                  0554
@EF00003 DS    0H                                                  0554
@ER00003 BR    @14                                                 0554
@PB00003 DS    0H                                                  0554
*   GEN(EJECT);                                                    0555
*                                                                  0555
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* COMMON FRR EXIT ROUTINE FOR NONRECOVERABLR FRRS               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0556
*FRRGEN:                                                           0556
*   ERRSLOT=CATERIND;               /* PLACE 'EEEE' IN RECORD        */
FRRGEN   MVC   ERRSLOT(2,AWSAPTR),@CB02665                         0556
*   SDWASAV=SDWAPTR2;               /* SAVE RTCA ADDR AROUND STACK   */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0557
*   DO;                             /* AHLSTACK DLENGTH(RECLEN)    0558
*                                      AID(255) FID(03)              */
*                                                                  0558
*     /***************************************************************/
*     /*                                                             */
*     /* THE FOLLOWING CODE IS GENERATED BY THE AHLSTACK MACRO. THIS */
*     /* CODE BUILDS THE GTF RECORD PREFIX AND THEN CALLS AHLSBLOK TO*/
*     /* STACK THE RECORD.                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0559
*     RFY                                                          0559
*      (AHLRECPR,                                                  0559
*       AHLSBREG,                                                  0559
*       AHLRETCD)RSTD;                                             0559
*     IF OPTTIME='1'B THEN          /* CHECK FOR TIMESTAMP REQUESTED */
         TM    OPTTIME(PCTPTR),B'00000001'                         0560
         BNO   @RF00560                                            0560
*       DO;                         /* YES, TIMESTAMP                */
*         AHLRECPR=ADDR(MCARECPR);  /* SETUP ADDRESSIBILITY TO PREFIX
*                                      FOR PREFIX WITH TIMESTAMP     */
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         0562
*         AHLGLGTH=RECLEN+16;       /* SET LENGTH TO INCLUDE ***   0563
*                                      DLENGTH *** PLUS TIMESTAMP  0563
*                                      PREFIX                        */
         LA    @12,16                                              0563
         AR    @12,RECLEN                                          0563
         STH   @12,AHLGLGTH(,AHLRECPR)                             0563
*         GEN(STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX )
*         SETS(AHLGTST)NOEXIT SEQFLOW NOFLOWS;                     0564
         STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX
*         AHLGEIDL=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @12,MCAMCR(,AWSAPTR)                                0565
         SLR   @08,@08                                             0565
         ICM   @08,3,MCREID(@12)                                   0565
         STH   @08,AHLGEIDL(,AHLRECPR)                             0565
*       END;                                                       0566
*     ELSE                          /* NO TIMESTAMP TO BE DONE, BUILD
*                                      SHORT PREFIX                  */
*       DO;                                                        0567
         B     @RC00560                                            0567
@RF00560 DS    0H                                                  0568
*         AHLRECPR=ADDR(MCARECPR)+8;/* SETUP ADDRESSIBILITY TO FOR 0568
*                                      SHORT PREFIX WITHOUT TIMESTAMP*/
         LA    @12,8                                               0568
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         0568
         AR    AHLRECPR,@12                                        0568
*         AHLGLGTH=RECLEN+8;        /* PUT TOTAL RECORD LENGTH INTO
*                                      PREFIX *** DLENGTH *** PLUS 0569
*                                      PREFIX LENGTH                 */
         AR    @12,RECLEN                                          0569
         STH   @12,AHLGLGTH(,AHLRECPR)                             0569
*         AHLGEIDS=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @12,MCAMCR(,AWSAPTR)                                0570
         SLR   @08,@08                                             0570
         ICM   @08,3,MCREID(@12)                                   0570
         STH   @08,AHLGEIDS(,AHLRECPR)                             0570
*       END;                                                       0571
*     AHLGRES=0;                    /* ZERO OUT FOR QSAM           0572
*                                      COMPATIBILITY                 */
@RC00560 SLR   @12,@12                                             0572
         STH   @12,AHLGRES(,AHLRECPR)                              0572
*     AHLGAID=255;                  /* PUT *** AID *** INTO PREFIX   */
         MVI   AHLGAID(AHLRECPR),X'FF'                             0573
*     AHLGFID=03;                   /* PUT *** FID *** INTO PREFIX   */
         MVI   AHLGFID(AHLRECPR),X'03'                             0574
*     AHLRETCD=4;                   /* SET DEFAULT RETURN CODE       */
         LA    AHLRETCD,4                                          0575
*     AHLSBREG=SBLOKRTN;            /* GET A STABLE COPY OF AHLSBLOK
*                                      ADDR                          */
         L     AHLSBREG,SBLOKRTN(,PCTPTR)                          0576
*     IF AHLSBREG^=0 THEN           /* CHECK TO SEE IF AHLSBLOK IS 0577
*                                      AVAILABLE                     */
         CR    AHLSBREG,@12                                        0577
         BE    @RF00577                                            0577
*       CALL AHLSBLOK;              /* YES, SO CALL AHLSBLOK TO BLOCK
*                                      RECORD                        */
         LR    @15,AHLSBREG                                        0578
         BALR  @14,@15                                             0578
*     RFY                                                          0579
*      (AHLRECPR,                                                  0579
*       AHLSBREG,                                                  0579
*       AHLRETCD)UNRSTD;                                           0579
@RF00577 DS    0H                                                  0580
*   END;                                                           0580
*   SDWAPTR2=SDWASAV;               /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0581
*   IF PCTCATF=0 THEN               /* ALL FUNCTION ARE DISABLED     */
         L     @15,PCTCATF(,PCTPTR)                                0582
         LTR   @15,@15                                             0582
         BNZ   @RF00582                                            0582
*     DO;                           /* SETRP RC(SDWACWT)             */
*       RESPECIFY                                                  0584
*        (GPR00P,                                                  0584
*         GPR01P,                                                  0584
*         GPR14P,                                                  0584
*         GPR15P)RSTD;                                             0584
*       GPR01P->SDWARCDE=SDWACWT;   /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0585
*       RESPECIFY                                                  0586
*        (GPR00P,                                                  0586
*         GPR01P,                                                  0586
*         GPR14P,                                                  0586
*         GPR15P)UNRSTD;                                           0586
*     END;                          /* TERMINATE                     */
*   ELSE                                                           0588
*     DO;                           /* STILL SOME FUNCTIONS RUNNING  */
         B     @RC00582                                            0588
@RF00582 DS    0H                                                  0589
*       DO;                         /* SETRP RETADDR(SVR14RTN)     0589
*                                      RC(SDWARETY)                  */
*         RESPECIFY                                                0590
*          (GPR00P,                                                0590
*           GPR01P,                                                0590
*           GPR14P,                                                0590
*           GPR15P)RSTD;                                           0590
*         GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0591
*         GPR01P->SDWARTYA=ADDR(SVR14RTN);/* SAVE RETRY ADDRESS      */
         L     @12,SVR14NRM(,R9PARM)                               0592
         ST    @12,SDWARTYA(,GPR01P)                               0592
*         RESPECIFY                                                0593
*          (GPR00P,                                                0593
*           GPR01P,                                                0593
*           GPR14P,                                                0593
*           GPR15P)UNRSTD;                                         0593
*       END;                        /* RETRY TO MCIH                 */
*       RTNADDR=SVR14FRR;           /* GET RTM RETURN ADDR           */
         L     RTNADDR,SVR14FRR(,R9PARM)                           0595
*       GEN(SETFRR D,WRKREGS=(R9PARM,R10WORK));                    0596
         SETFRR D,WRKREGS=(R9PARM,R10WORK)
*       BC(15,RTNADDR);             /* RETURN                        */
         BCR   15,RTNADDR                                          0597
*     END;                                                         0598
*   RTNADDR=SVR14FRR;               /* GET RTM RETURN ADDR           */
@RC00582 L     RTNADDR,SVR14FRR(,R9PARM)                           0599
*   BC(15,RTNADDR);                 /* RETURN                        */
         BCR   15,RTNADDR                                          0600
*   GEN(EJECT);                                                    0601
*                                                                  0601
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR PI ERRORS                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0602
*FRRPI:                                                            0602
*   ;                                                              0602
FRRPI    DS    0H                                                  0603
*   GENERATE;                                                      0603
         USING FRRPI,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0604
*    (SDWAPTR2,                                                    0604
*     RTNADDR)RSTD;                                                0604
*   RFY                                                            0605
*     SDWA BASED(SDWAPTR2);                                        0605
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0606
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0607
*   RFY                                                            0608
*     RTNADDR UNRSTD;                                              0608
*   TRAILSAV=' PI ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02947                         0609
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
*                                                                  0610
         BAL   @14,AHLERPRE                                        0610
*   /*****************************************************************/
*   /*                                                               */
*   /* DISABLE FUNCTION AND TAKE DUMP IF NECESSARY                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0611
*PICHK:                                                            0611
*   IF PCTPI=ON THEN                                               0611
PICHK    TM    PCTPI(PCTPTR),B'00000010'                           0611
         BNO   @RF00611                                            0611
*     DO;                           /* FUNCTION NOT YET DISABLED     */
*       RFY                                                        0613
*        (R10WORK,                                                 0613
*         R8FRRWRK)RSTD;                                           0613
*       R10WORK=PCTCATF;            /* GET CURRENT PICTURE OF FLAGS  */
         L     R10WORK,PCTCATF(,PCTPTR)                            0614
*       R8FRRWRK=R10WORK&PIOFF;     /* FLAGS WITH THIS FUNCTION OFF  */
         LR    R8FRRWRK,R10WORK                                    0615
         N     R8FRRWRK,@CF02641                                   0615
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* SET FLAGS TO THIS FUNCTION 0616
*                                      OFF                           */
         CS    R10WORK,R8FRRWRK,PCTCATF(PCTPTR)                    0616
*       BC(4,PICHK);                /* SOMEONE ELSE BEAT US TO FLAGS.
*                                      CHECK AGAIN                   */
         BC    4,PICHK                                             0617
*       SDWASAV=SDWAPTR2;           /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0618
*       MCQESAV=R0;                 /* SAVE R0 ACROSS CALLS          */
         ST    R0,MCQESAV(,AWSAPTR)                                0619
*       R0=ADDR(DMPLIST);           /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0620
*       CALL DMPMOD;                /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0621
         BALR  @14,@15                                             0621
*       WTOUN=R15RC;                /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0622
*       R1PARM=ADDR(WTOLIST);                                      0623
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0623
*       CALL AHLWTO;                                               0624
         L     @15,PCTWTOMD(,PCTPTR)                               0624
         BALR  @14,@15                                             0624
*       R0=MCQESAV;                 /* RESTORE R0                    */
*                                                                  0625
         L     R0,MCQESAV(,AWSAPTR)                                0625
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE SETEVENT TO DISABLE THIS FUNCTION                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0626
*       DO;                         /* SETEVENT NAME('GTF ')       0626
*                                      MCQE(MCQE) ACTION(DISABLE)  0626
*                                      EIDAD(PIEIDS)               0626
*                                      MF(E,MCAWTO,COMPLETE) EIDNO(2)*/
*                                                                  0626
*         /***********************************************************/
*         /*                                                         */
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/
*         /* AHLSETD                                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0627
*         DCL                                                      0627
*           AHLPPTR REG(1)PTR(31)RSTD;/* PARAMETER LIST ADDRESS      */
*         DCL                                                      0628
*           AHLSETEV ENTRY OPTIONS(EXIT,SEQFLOW)BASED(MCHSETE)VALRG(0);
*                                   /* ENTRY FOR ADD ACTIVAT,FREE    */
*         DCL                                                      0629
*           AHLSETD ENTRY OPTIONS(EXIT,SEQFLOW)BASED(MCHSETD)VALRG(0);
*                                   /* ENTRY FOR DISABLE AND CHANGE  */
*         DCL                                                      0630
*           1 SEPL BASED(AHLPPTR)BDY(WORD),/* DSECT PARAMETER LIST   */
*            2 SEFG PTR(8),         /* ACTION GLAGS                  */
*            2 * PTR(8),                                           0630
*            2 SEEN PTR(8),         /* EID COUNT                     */
*            2 SECN PTR(8),         /* CLASS COUNT                   */
*            2 SENM CHAR(8),        /* APPLICATION NMAE              */
*            2 SEEL PTR(31),        /* ADDRESS OF LIST OF EIDS       */
*            2 SECL PTR(31),        /* ADDRESS OF LIST OF CLASSES    */
*            2 SEMC PTR(31);        /* MCQE ADDRESS                  */
*         AHLPPTR=ADDR(MCAWTO);     /* SET UP PLIST PTR              */
         LA    AHLPPTR,MCAWTO(,AWSAPTR)                            0631
*         SEPL=SEPL&&SEPL;          /* INIT PLIST TO ZERO            */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      0632
*         SEMC=ADDR(MCQE);          /* SET UP MCQE ADDRESS           */
         ST    R0,SEMC(,AHLPPTR)                                   0633
*         SENM='GTF     ';          /* MOVE NAME INTO PLIST          */
         MVC   SENM(8,AHLPPTR),@CC02963                            0634
*         SEFG=32;                  /* MOVE FLAGS INTO PLIST         */
         MVI   SEFG(AHLPPTR),X'20'                                 0635
*         SEEN=2;                   /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'02'                                 0636
*         SEEL=ADDR(PIEIDS);        /* SET TO VALUE SPECIFIED        */
         LA    @12,PIEIDS                                          0637
         ST    @12,SEEL(,AHLPPTR)                                  0637
*         IF SEFG=32×SEFG=8 THEN    /* CHECK FOR DISABLE OR * CHANGE */
         CLI   SEFG(AHLPPTR),32                                    0638
         BE    @RT00638                                            0638
         CLI   SEFG(AHLPPTR),8                                     0638
         BNE   @RF00638                                            0638
@RT00638 DS    0H                                                  0639
*           CALL AHLSETD;           /* YES                           */
         L     @12,CVTPTR                                          0639
         L     @12,CVTGTF(,@12)                                    0639
         L     @15,MCHSETD(,@12)                                   0639
         BALR  @14,@15                                             0639
*         ELSE                      /* NO                            */
*           CALL AHLSETEV;                                         0640
         B     @RC00638                                            0640
@RF00638 L     @12,CVTPTR                                          0640
         L     @12,CVTGTF(,@12)                                    0640
         L     @15,MCHSETE(,@12)                                   0640
         BALR  @14,@15                                             0640
*       END;                                                       0641
@RC00638 DS    0H                                                  0642
*       SDWAPTR2=SDWASAV;           /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0642
*     END;                                                         0643
*   RECLEN=LENGTH(PIREC);           /* LENGTH OF RECORD FOR STACK    */
@RF00611 LA    RECLEN,30                                           0644
*   GO TO FRRGEN;                   /* COMMON EXIT ROUTINE           */
         B     FRRGEN                                              0645
*   GEN(EJECT);                                                    0646
*                                                                  0646
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR SVC ERRORS                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0647
*FRRSVC:                                                           0647
*   ;                                                              0647
FRRSVC   DS    0H                                                  0648
*   GENERATE;                                                      0648
         USING FRRSVC,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0649
*    (SDWAPTR2,                                                    0649
*     RTNADDR)RSTD;                                                0649
*   RFY                                                            0650
*     SDWA BASED(SDWAPTR2);                                        0650
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0651
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0652
*   RFY                                                            0653
*     RTNADDR UNRSTD;                                              0653
*   TRAILSAV='SVC ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02966                         0654
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
*                                                                  0655
         BAL   @14,AHLERPRE                                        0655
*   /*****************************************************************/
*   /*                                                               */
*   /* DISABLE FUNCTION AND TAKE DUMP IF NECESSARY                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0656
*SVCCHK:                                                           0656
*   IF PCTSVC=ON THEN                                              0656
SVCCHK   TM    PCTSVC(PCTPTR),B'10000000'                          0656
         BNO   @RF00656                                            0656
*     DO;                           /* FUNCTION NOT YET DISABLED     */
*       RFY                                                        0658
*        (R10WORK,                                                 0658
*         R8FRRWRK)RSTD;                                           0658
*       R10WORK=PCTCATF;            /* GET CURRENT PICTURE OF FLAGS  */
         L     R10WORK,PCTCATF(,PCTPTR)                            0659
*       R8FRRWRK=R10WORK&SVCOFF;    /* FLAGS WITH THIS FUNCTION OFF  */
         LR    R8FRRWRK,R10WORK                                    0660
         N     R8FRRWRK,@CF02633                                   0660
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* SET FLAGS TO THIS FUNCTION 0661
*                                      OFF                           */
         CS    R10WORK,R8FRRWRK,PCTCATF(PCTPTR)                    0661
*       BC(4,SVCCHK);               /* SOMEONE ELSE BEAT US TO FLAGS.
*                                      CHECK AGAIN                   */
         BC    4,SVCCHK                                            0662
*       SDWASAV=SDWAPTR2;           /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0663
*       MCQESAV=R0;                 /* SAVE R0 ACROSS CALLS          */
         ST    R0,MCQESAV(,AWSAPTR)                                0664
*       R0=ADDR(DMPLIST);           /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0665
*       CALL DMPMOD;                /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0666
         BALR  @14,@15                                             0666
*       WTOUN=R15RC;                /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0667
*       R1PARM=ADDR(WTOLIST);                                      0668
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0668
*       CALL AHLWTO;                                               0669
         L     @15,PCTWTOMD(,PCTPTR)                               0669
         BALR  @14,@15                                             0669
*       R0=MCQESAV;                 /* RESTORE R0                    */
*                                                                  0670
         L     R0,MCQESAV(,AWSAPTR)                                0670
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE SETEVENT TO DISABLE THIS FUNCTION                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0671
*       DO;                         /* SETEVENT NAME('GTF ')       0671
*                                      MCQE(MCQE) ACTION(DISABLE)  0671
*                                      EIDAD(SVCEID)               0671
*                                      MF(E,MCAWTO,COMPLETE) EIDNO(1)*/
*                                                                  0671
*         /***********************************************************/
*         /*                                                         */
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/
*         /* AHLSETD                                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0672
*         AHLPPTR=ADDR(MCAWTO);     /* SET UP PLIST PTR              */
         LA    AHLPPTR,MCAWTO(,AWSAPTR)                            0672
*         SEPL=SEPL&&SEPL;          /* INIT PLIST TO ZERO            */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      0673
*         SEMC=ADDR(MCQE);          /* SET UP MCQE ADDRESS           */
         ST    R0,SEMC(,AHLPPTR)                                   0674
*         SENM='GTF     ';          /* MOVE NAME INTO PLIST          */
         MVC   SENM(8,AHLPPTR),@CC02963                            0675
*         SEFG=32;                  /* MOVE FLAGS INTO PLIST         */
         MVI   SEFG(AHLPPTR),X'20'                                 0676
*         SEEN=1;                   /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'01'                                 0677
*         SEEL=ADDR(SVCEID);        /* SET TO VALUE SPECIFIED        */
         LA    @12,SVCEID                                          0678
         ST    @12,SEEL(,AHLPPTR)                                  0678
*         IF SEFG=32×SEFG=8 THEN    /* CHECK FOR DISABLE OR * CHANGE */
         CLI   SEFG(AHLPPTR),32                                    0679
         BE    @RT00679                                            0679
         CLI   SEFG(AHLPPTR),8                                     0679
         BNE   @RF00679                                            0679
@RT00679 DS    0H                                                  0680
*           CALL AHLSETD;           /* YES                           */
         L     @12,CVTPTR                                          0680
         L     @12,CVTGTF(,@12)                                    0680
         L     @15,MCHSETD(,@12)                                   0680
         BALR  @14,@15                                             0680
*         ELSE                      /* NO                            */
*           CALL AHLSETEV;                                         0681
         B     @RC00679                                            0681
@RF00679 L     @12,CVTPTR                                          0681
         L     @12,CVTGTF(,@12)                                    0681
         L     @15,MCHSETE(,@12)                                   0681
         BALR  @14,@15                                             0681
*       END;                                                       0682
@RC00679 DS    0H                                                  0683
*       SDWAPTR2=SDWASAV;           /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0683
*     END;                                                         0684
*   RECLEN=LENGTH(SVCREC);          /* LENGTH OF RECORD FOR STACK    */
@RF00656 LA    RECLEN,30                                           0685
*   GO TO FRRGEN;                   /* COMMON EXIT ROUTINE           */
         B     FRRGEN                                              0686
*   GEN(EJECT);                                                    0687
*                                                                  0687
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR UIO ERRORS                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0688
*FRRUIO:                                                           0688
*   ;                                                              0688
FRRUIO   DS    0H                                                  0689
*   GENERATE;                                                      0689
         USING FRRUIO,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0690
*    (SDWAPTR2,                                                    0690
*     RTNADDR)RSTD;                                                0690
*   RFY                                                            0691
*     SDWA BASED(SDWAPTR2);                                        0691
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0692
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0693
*   RFY                                                            0694
*     RTNADDR UNRSTD;                                              0694
*   TRAILSAV=' IO ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02971                         0695
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
         BAL   @14,AHLERPRE                                        0696
*   RECLEN=LENGTH(UIOREC);          /* LENGTH OF RECORD FOR STACK    */
*                                                                  0697
         LA    RECLEN,26                                           0697
*   /*****************************************************************/
*   /*                                                               */
*   /* DISABLE FUNCTION AND TAKE DUMP IF NECESSARY                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0698
*UIOCHK:                                                           0698
*   IF PCTIO=ON THEN                                               0698
UIOCHK   TM    PCTIO(PCTPTR),B'00100000'                           0698
         BNO   @RF00698                                            0698
*     DO;                           /* FUNCTION NOT YET DISABLED     */
*       RFY                                                        0700
*        (R10WORK,                                                 0700
*         R8FRRWRK)RSTD;                                           0700
*       R10WORK=PCTCATF;            /* GET CURRENT PICTURE OF FLAGS  */
         L     R10WORK,PCTCATF(,PCTPTR)                            0701
*       R8FRRWRK=R10WORK&IOOFF;     /* FLAGS WITH THIS FUNCTION OFF  */
         LR    R8FRRWRK,R10WORK                                    0702
         N     R8FRRWRK,@CF02637                                   0702
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* SET FLAGS TO THIS FUNCTION 0703
*                                      OFF                           */
         CS    R10WORK,R8FRRWRK,PCTCATF(PCTPTR)                    0703
*       BC(4,UIOCHK);               /* SOMEONE ELSE BEAT US TO FLAGS.
*                                      CHECK AGAIN                   */
         BC    4,UIOCHK                                            0704
*       SDWASAV=SDWAPTR2;           /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0705
*       MCQESAV=R0;                 /* SAVE R0 ACROSS CALLS          */
         ST    R0,MCQESAV(,AWSAPTR)                                0706
*       R0=ADDR(DMPLIST);           /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0707
*       CALL DMPMOD;                /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0708
         BALR  @14,@15                                             0708
*       WTOUN=R15RC;                /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0709
*       R1PARM=ADDR(WTOLIST);                                      0710
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0710
*       CALL AHLWTO;                                               0711
         L     @15,PCTWTOMD(,PCTPTR)                               0711
         BALR  @14,@15                                             0711
*       R0=MCQESAV;                 /* RESTORE R0                    */
*                                                                  0712
         L     R0,MCQESAV(,AWSAPTR)                                0712
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE SETEVENT TO DISABLE THIS FUNCTION                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0713
*       DO;                         /* SETEVENT NAME('GTF ')       0713
*                                      MCQE(MCQE) ACTION(DISABLE)  0713
*                                      EIDAD(IOEIDS)               0713
*                                      MF(E,MCAWTO,COMPLETE) EIDNO(4)*/
*                                                                  0713
*         /***********************************************************/
*         /*                                                         */
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/
*         /* AHLSETD                                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0714
*         AHLPPTR=ADDR(MCAWTO);     /* SET UP PLIST PTR              */
         LA    AHLPPTR,MCAWTO(,AWSAPTR)                            0714
*         SEPL=SEPL&&SEPL;          /* INIT PLIST TO ZERO            */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      0715
*         SEMC=ADDR(MCQE);          /* SET UP MCQE ADDRESS           */
         ST    R0,SEMC(,AHLPPTR)                                   0716
*         SENM='GTF     ';          /* MOVE NAME INTO PLIST          */
         MVC   SENM(8,AHLPPTR),@CC02963                            0717
*         SEFG=32;                  /* MOVE FLAGS INTO PLIST         */
         MVI   SEFG(AHLPPTR),X'20'                                 0718
*         SEEN=4;                   /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'04'                                 0719
*         SEEL=ADDR(IOEIDS);        /* SET TO VALUE SPECIFIED        */
         LA    @12,IOEIDS                                          0720
         ST    @12,SEEL(,AHLPPTR)                                  0720
*         IF SEFG=32×SEFG=8 THEN    /* CHECK FOR DISABLE OR * CHANGE */
         CLI   SEFG(AHLPPTR),32                                    0721
         BE    @RT00721                                            0721
         CLI   SEFG(AHLPPTR),8                                     0721
         BNE   @RF00721                                            0721
@RT00721 DS    0H                                                  0722
*           CALL AHLSETD;           /* YES                           */
         L     @12,CVTPTR                                          0722
         L     @12,CVTGTF(,@12)                                    0722
         L     @15,MCHSETD(,@12)                                   0722
         BALR  @14,@15                                             0722
*         ELSE                      /* NO                            */
*           CALL AHLSETEV;                                         0723
         B     @RC00721                                            0723
@RF00721 L     @12,CVTPTR                                          0723
         L     @12,CVTGTF(,@12)                                    0723
         L     @15,MCHSETE(,@12)                                   0723
         BALR  @14,@15                                             0723
*       END;                                                       0724
@RC00721 DS    0H                                                  0725
*       SDWAPTR2=SDWASAV;           /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0725
*     END;                                                         0726
*   GO TO FRRGEN;                   /* COMMON EXIT ROUTINE           */
         B     FRRGEN                                              0727
*   GEN(EJECT);                                                    0728
*                                                                  0728
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR IO ERRORS                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0729
*FRRIO:                                                            0729
*   ;                                                              0729
FRRIO    DS    0H                                                  0730
*   GENERATE;                                                      0730
         USING FRRIO,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0731
*    (SDWAPTR2,                                                    0731
*     RTNADDR)RSTD;                                                0731
*   RFY                                                            0732
*     SDWA BASED(SDWAPTR2);                                        0732
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0733
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0734
*   RFY                                                            0735
*     RTNADDR UNRSTD;                                              0735
*   TRAILSAV=' IO ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02971                         0736
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
         BAL   @14,AHLERPRE                                        0737
*   IF MCAMTCB=ON THEN              /* ERROR GATHERING TCB           */
         TM    MCAMTCB(AWSAPTR),B'00010000'                        0738
         BNO   @RF00738                                            0738
*     DO;                                                          0739
*       IOTCB=ERRIND;               /* **** IN TCB FIELD             */
         MVC   IOTCB(4,AWSAPTR),@CC02662                           0740
*RETRYP:                                                           0741
*       DO;                         /* SETRP RETADDR(AHLPSTCM)     0741
*                                      RC(SDWARETY)                  */
RETRYP   DS    0H                                                  0742
*         RESPECIFY                                                0742
*          (GPR00P,                                                0742
*           GPR01P,                                                0742
*           GPR14P,                                                0742
*           GPR15P)RSTD;                                           0742
*         GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0743
*         GPR01P->SDWARTYA=ADDR(AHLPSTCM);/* SAVE RETRY ADDRESS      */
         LA    @12,AHLPSTCM                                        0744
         ST    @12,SDWARTYA(,GPR01P)                               0744
*         RESPECIFY                                                0745
*          (GPR00P,                                                0745
*           GPR01P,                                                0745
*           GPR14P,                                                0745
*           GPR15P)UNRSTD;                                         0745
*       END;                        /* RETRY TO PSTCOM               */
*                                                                  0746
*/*   RETURN TO RTM. SDWA IS SET UP FOR RETURN                       */
*                                                                  0747
*       RTNADDR=SVR14FRR;           /* SET UP RETURN TO RTM          */
         L     RTNADDR,SVR14FRR(,R9PARM)                           0747
*       BC(15,RTNADDR);             /* RETURN                        */
         BCR   15,RTNADDR                                          0748
*     END;                                                         0749
*   IF MCAMASCB=ON THEN             /* ERROR GATHERING ASCB          */
@RF00738 TM    MCAMASCB(AWSAPTR),B'00100000'                       0750
         BNO   @RF00750                                            0750
*     DO;                                                          0751
*       IOASCB=ERRIND;              /* **** IN ASCB FIELD            */
         MVC   IOASCB(4,AWSAPTR),@CC02662                          0752
*       DO;                         /* SETRP RETADDR(RCOV1)        0753
*                                      RC(SDWARETY)                  */
*         RESPECIFY                                                0754
*          (GPR00P,                                                0754
*           GPR01P,                                                0754
*           GPR14P,                                                0754
*           GPR15P)RSTD;                                           0754
*         GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0755
*         GPR01P->SDWARTYA=ADDR(RCOV1);/* SAVE RETRY ADDRESS         */
         LA    @12,RCOV1                                           0756
         ST    @12,SDWARTYA(,GPR01P)                               0756
*         RESPECIFY                                                0757
*          (GPR00P,                                                0757
*           GPR01P,                                                0757
*           GPR14P,                                                0757
*           GPR15P)UNRSTD;                                         0757
*       END;                        /* RETRY TO RCOV1                */
*                                                                  0758
*/*   RETURN TO RTM. SDWA IS SET UP FOR RETURN                       */
*                                                                  0759
*       RTNADDR=SVR14FRR;           /* SET UP RETURN TO RTM          */
         L     RTNADDR,SVR14FRR(,R9PARM)                           0759
*       BC(15,RTNADDR);             /* RETURN                        */
         BCR   15,RTNADDR                                          0760
*     END;                                                         0761
*   IF MCAMIOSB=ON THEN             /* ERROR GATHERING IOSB          */
@RF00750 TM    MCAMIOSB(AWSAPTR),B'00001000'                       0762
         BNO   @RF00762                                            0762
*     DO;                                                          0763
*       IOTCB=ERRIND;               /* **** IN TCB FIELD             */
         MVC   IOTCB(4,AWSAPTR),@CC02662                           0764
*       IOASCB=ERRIND;              /* **** IN ASCB FIELD            */
         MVC   IOASCB(4,AWSAPTR),@CC02662                          0765
*       IOSENSE=ERRIND;             /* **** IN SENSE FIELD           */
         MVC   IOSENSE(2,AWSAPTR),@CC02662                         0766
*       GO TO RETRYP;               /* RETRY TO PSTCOM               */
         B     RETRYP                                              0767
*     END;                                                         0768
*   RECLEN=LENGTH(IOREC);           /* LENGTH OF RECORD FOR STACK    */
@RF00762 LA    RECLEN,30                                           0769
*   GO TO UIOCHK;                   /* DISABLE FUNCTION AND TAKE DUMP
*                                      IF NECESSARY                  */
         B     UIOCHK                                              0770
*   GEN(EJECT);                                                    0771
*                                                                  0771
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR SIO ERRORS                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0772
*FRRSIO:                                                           0772
*   ;                                                              0772
FRRSIO   DS    0H                                                  0773
*   GENERATE;                                                      0773
         USING FRRSIO,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0774
*    (SDWAPTR2,                                                    0774
*     RTNADDR)RSTD;                                                0774
*   RFY                                                            0775
*     SDWA BASED(SDWAPTR2);                                        0775
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0776
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0777
*   RFY                                                            0778
*     RTNADDR UNRSTD;                                              0778
*   TRAILSAV='SIO ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02980                         0779
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
         BAL   @14,AHLERPRE                                        0780
*   IF MCAMASCB=ON THEN             /* ERROR GATHERING ASCB          */
         TM    MCAMASCB(AWSAPTR),B'00100000'                       0781
         BNO   @RF00781                                            0781
*     DO;                                                          0782
*       SIOASCB=ERRIND;             /* **** IN ASCB FIELD            */
         MVC   SIOASCB(4,AWSAPTR),@CC02662                         0783
*       GO TO RETRYP;               /* RETRY TO PSTCOM               */
         B     RETRYP                                              0784
*     END;                                                         0785
*   IF MCAMIOSB=ON THEN             /* ERROR GATHERING IOSB          */
@RF00781 TM    MCAMIOSB(AWSAPTR),B'00001000'                       0786
         BNO   @RF00786                                            0786
*     DO;                                                          0787
*       SIOCPA=ERRIND;              /* **** IN CPA FIELD             */
         MVC   SIOCPA(8,AWSAPTR),@CC02662                          0788
*       SIOASCB=ERRIND;             /* **** IN ASCB FIELD            */
         MVC   SIOASCB(4,AWSAPTR),@CC02662                         0789
*       SIOCC=ERRIND;               /* **** IN SENSE FIELD           */
         MVI   SIOCC(AWSAPTR),C'*'                                 0790
*       GO TO RETRYP;               /* RETRY TO PSTCOM               */
         B     RETRYP                                              0791
*     END;                                                         0792
*                                                                  0792
*   /*****************************************************************/
*   /*                                                               */
*   /* DISABLE FUNCTION AND TAKE DUMP IF NECESSARY                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0793
*SIOCHK:                                                           0793
*   IF PCTSIO=ON THEN                                              0793
@RF00786 DS    0H                                                  0793
SIOCHK   TM    PCTSIO(PCTPTR),B'00010000'                          0793
         BNO   @RF00793                                            0793
*     DO;                           /* FUNCTION NOT YET DISABLED     */
*       RFY                                                        0795
*        (R10WORK,                                                 0795
*         R8FRRWRK)RSTD;                                           0795
*       R10WORK=PCTCATF;            /* GET CURRENT PICTURE OF FLAGS  */
         L     R10WORK,PCTCATF(,PCTPTR)                            0796
*       R8FRRWRK=R10WORK&SIOOFF;    /* FLAGS WITH THIS FUNCTION OFF  */
         LR    R8FRRWRK,R10WORK                                    0797
         N     R8FRRWRK,@CF02639                                   0797
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* SET FLAGS TO THIS FUNCTION 0798
*                                      OFF                           */
         CS    R10WORK,R8FRRWRK,PCTCATF(PCTPTR)                    0798
*       BC(4,SIOCHK);               /* SOMEONE ELSE BEAT US TO FLAGS.
*                                      CHECK AGAIN                   */
         BC    4,SIOCHK                                            0799
*       SDWASAV=SDWAPTR2;           /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0800
*       MCQESAV=R0;                 /* SAVE R0 ACROSS CALLS          */
         ST    R0,MCQESAV(,AWSAPTR)                                0801
*       R0=ADDR(DMPLIST);           /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0802
*       CALL DMPMOD;                /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0803
         BALR  @14,@15                                             0803
*       WTOUN=R15RC;                /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0804
*       R1PARM=ADDR(WTOLIST);                                      0805
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0805
*       CALL AHLWTO;                                               0806
         L     @15,PCTWTOMD(,PCTPTR)                               0806
         BALR  @14,@15                                             0806
*       R0=MCQESAV;                 /* RESTORE R0                    */
*                                                                  0807
         L     R0,MCQESAV(,AWSAPTR)                                0807
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE SETEVENT TO DISABLE THIS FUNCTION                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0808
*       DO;                         /* SETEVENT NAME('GTF ')       0808
*                                      MCQE(MCQE) ACTION(DISABLE)  0808
*                                      EIDAD(SIOEID)               0808
*                                      MF(E,MCAWTO,COMPLETE) EIDNO(1)*/
*                                                                  0808
*         /***********************************************************/
*         /*                                                         */
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/
*         /* AHLSETD                                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0809
*         AHLPPTR=ADDR(MCAWTO);     /* SET UP PLIST PTR              */
         LA    AHLPPTR,MCAWTO(,AWSAPTR)                            0809
*         SEPL=SEPL&&SEPL;          /* INIT PLIST TO ZERO            */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      0810
*         SEMC=ADDR(MCQE);          /* SET UP MCQE ADDRESS           */
         ST    R0,SEMC(,AHLPPTR)                                   0811
*         SENM='GTF     ';          /* MOVE NAME INTO PLIST          */
         MVC   SENM(8,AHLPPTR),@CC02963                            0812
*         SEFG=32;                  /* MOVE FLAGS INTO PLIST         */
         MVI   SEFG(AHLPPTR),X'20'                                 0813
*         SEEN=1;                   /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'01'                                 0814
*         SEEL=ADDR(SIOEID);        /* SET TO VALUE SPECIFIED        */
         LA    @12,SIOEID                                          0815
         ST    @12,SEEL(,AHLPPTR)                                  0815
*         IF SEFG=32×SEFG=8 THEN    /* CHECK FOR DISABLE OR * CHANGE */
         CLI   SEFG(AHLPPTR),32                                    0816
         BE    @RT00816                                            0816
         CLI   SEFG(AHLPPTR),8                                     0816
         BNE   @RF00816                                            0816
@RT00816 DS    0H                                                  0817
*           CALL AHLSETD;           /* YES                           */
         L     @12,CVTPTR                                          0817
         L     @12,CVTGTF(,@12)                                    0817
         L     @15,MCHSETD(,@12)                                   0817
         BALR  @14,@15                                             0817
*         ELSE                      /* NO                            */
*           CALL AHLSETEV;                                         0818
         B     @RC00816                                            0818
@RF00816 L     @12,CVTPTR                                          0818
         L     @12,CVTGTF(,@12)                                    0818
         L     @15,MCHSETE(,@12)                                   0818
         BALR  @14,@15                                             0818
*       END;                                                       0819
@RC00816 DS    0H                                                  0820
*       SDWAPTR2=SDWASAV;           /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0820
*     END;                                                         0821
*   RECLEN=LENGTH(SIOREC);          /* LENGTH OF RECORD FOR STACK    */
@RF00793 LA    RECLEN,24                                           0822
*   GO TO FRRGEN;                   /* COMMON EXIT ROUTINE           */
         B     FRRGEN                                              0823
*   GEN(EJECT);                                                    0824
*                                                                  0824
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR FRR ERRORS                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0825
*FRRFRR:                                                           0825
*   ;                                                              0825
FRRFRR   DS    0H                                                  0826
*   GENERATE;                                                      0826
         USING FRRFRR,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0827
*    (SDWAPTR2,                                                    0827
*     RTNADDR)RSTD;                                                0827
*   RFY                                                            0828
*     SDWA BASED(SDWAPTR2);                                        0828
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0829
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0830
*   RFY                                                            0831
*     RTNADDR UNRSTD;                                              0831
*   TRAILSAV=' RR ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02985                         0832
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
         BAL   @14,AHLERPRE                                        0833
*   RECLEN=LENGTH(FRRREC);          /* LENGTH OF RECORD FOR STACK    */
         LA    RECLEN,29                                           0834
*   IF MCAMSDWA=ON THEN             /* ERROR GATHERING SDWA          */
         TM    MCAMSDWA(AWSAPTR),B'00000010'                       0835
         BNO   @RF00835                                            0835
*     DO;                                                          0836
*       IF MCREID=IMDMFRR THEN                                     0837
         L     @12,MCAMCR(,AWSAPTR)                                0837
         CLC   MCREID(2,@12),@CH01232                              0837
         BNE   @RF00837                                            0837
*         DO;                       /* FRR ERROR ?           @YM01892*/
*           FRRASCB=ERRIND;         /* **** IN ASCB FIELD            */
         MVC   FRRASCB(4,AWSAPTR),@CC02662                         0839
*           FRRPSW=ERRIND;          /* **** IN PSW FIELD             */
         MVC   FRRPSW(8,AWSAPTR),@CC02662                          0840
*           FRRASTER=ERRIND;        /* **** IN OTHER FIELD           */
         MVC   FRRASTER(15,AWSAPTR),@CC02662                       0841
*         END;                      /*                       @YM01892*/
*       ELSE                                                       0843
*         DO;                       /*                       @YM01892*/
         B     @RC00837                                            0843
@RF00837 DS    0H                                                  0844
*           IF SDWADDR<0 THEN       /* STAE REQUEST          @YM01892*/
         L     @12,LCCAPTR                                         0844
         L     @12,SDWADDR(,@12)                                   0844
         LTR   @12,@12                                             0844
         BNM   @RF00844                                            0844
*             STASTER1=ERRIND;      /* FLAG STAE             @YM01892*/
         MVC   STASTER1(15,AWSAPTR),@CC02662                       0845
*           ELSE                                                   0846
*             STASTER2=ERRIND;      /* FLAG ESTAE            @YM01892*/
         B     @RC00844                                            0846
@RF00844 MVC   STASTER2(20,AWSAPTR),@CC02662                       0846
*         END;                      /*                       @YM01892*/
*       GO TO RETRYP;               /* RETRY TO PSTCOM               */
         B     RETRYP                                              0848
*     END;                                                         0849
*                                                                  0849
*   /*****************************************************************/
*   /*                                                               */
*   /* DISABLE FUNCTION AND TAKE DUMP IF NECESSARY                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0850
*FRRCHK:                                                           0850
*   IF PCTRR=ON THEN                                               0850
@RF00835 DS    0H                                                  0850
FRRCHK   TM    PCTRR(PCTPTR),B'00100000'                           0850
         BNO   @RF00850                                            0850
*     DO;                           /* FUNCTION NOT YET DISABLED     */
*       RFY                                                        0852
*        (R10WORK,                                                 0852
*         R8FRRWRK)RSTD;                                           0852
*       R10WORK=PCTCATF;            /* GET CURRENT PICTURE OF FLAGS  */
         L     R10WORK,PCTCATF(,PCTPTR)                            0853
*       R8FRRWRK=R10WORK&RROFF;     /* FLAGS WITH THIS FUNCTION OFF  */
         LR    R8FRRWRK,R10WORK                                    0854
         N     R8FRRWRK,@CF02643                                   0854
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* SET FLAGS TO THIS FUNCTION 0855
*                                      OFF                           */
         CS    R10WORK,R8FRRWRK,PCTCATF(PCTPTR)                    0855
*       BC(4,FRRCHK);               /* SOMEONE ELSE BEAT US TO FLAGS.
*                                      CHECK AGAIN                   */
         BC    4,FRRCHK                                            0856
*       SDWASAV=SDWAPTR2;           /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0857
*       MCQESAV=R0;                 /* SAVE R0 ACROSS CALLS          */
         ST    R0,MCQESAV(,AWSAPTR)                                0858
*       R0=ADDR(DMPLIST);           /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0859
*       CALL DMPMOD;                /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0860
         BALR  @14,@15                                             0860
*       WTOUN=R15RC;                /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0861
*       R1PARM=ADDR(WTOLIST);                                      0862
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0862
*       CALL AHLWTO;                                               0863
         L     @15,PCTWTOMD(,PCTPTR)                               0863
         BALR  @14,@15                                             0863
*       R0=MCQESAV;                 /* RESTORE R0                    */
*                                                                  0864
         L     R0,MCQESAV(,AWSAPTR)                                0864
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE SETEVENT TO DISABLE THIS FUNCTION                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0865
*       DO;                         /* SETEVENT NAME('GTF ')       0865
*                                      MCQE(MCQE) ACTION(DISABLE)  0865
*                                      EIDAD(RREIDS)               0865
*                                      MF(E,MCAWTO,COMPLETE) EIDNO(2)*/
*                                                                  0865
*         /***********************************************************/
*         /*                                                         */
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/
*         /* AHLSETD                                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0866
*         AHLPPTR=ADDR(MCAWTO);     /* SET UP PLIST PTR              */
         LA    AHLPPTR,MCAWTO(,AWSAPTR)                            0866
*         SEPL=SEPL&&SEPL;          /* INIT PLIST TO ZERO            */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      0867
*         SEMC=ADDR(MCQE);          /* SET UP MCQE ADDRESS           */
         ST    R0,SEMC(,AHLPPTR)                                   0868
*         SENM='GTF     ';          /* MOVE NAME INTO PLIST          */
         MVC   SENM(8,AHLPPTR),@CC02963                            0869
*         SEFG=32;                  /* MOVE FLAGS INTO PLIST         */
         MVI   SEFG(AHLPPTR),X'20'                                 0870
*         SEEN=2;                   /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'02'                                 0871
*         SEEL=ADDR(RREIDS);        /* SET TO VALUE SPECIFIED        */
         LA    @12,RREIDS                                          0872
         ST    @12,SEEL(,AHLPPTR)                                  0872
*         IF SEFG=32×SEFG=8 THEN    /* CHECK FOR DISABLE OR * CHANGE */
         CLI   SEFG(AHLPPTR),32                                    0873
         BE    @RT00873                                            0873
         CLI   SEFG(AHLPPTR),8                                     0873
         BNE   @RF00873                                            0873
@RT00873 DS    0H                                                  0874
*           CALL AHLSETD;           /* YES                           */
         L     @12,CVTPTR                                          0874
         L     @12,CVTGTF(,@12)                                    0874
         L     @15,MCHSETD(,@12)                                   0874
         BALR  @14,@15                                             0874
*         ELSE                      /* NO                            */
*           CALL AHLSETEV;                                         0875
         B     @RC00873                                            0875
@RF00873 L     @12,CVTPTR                                          0875
         L     @12,CVTGTF(,@12)                                    0875
         L     @15,MCHSETE(,@12)                                   0875
         BALR  @14,@15                                             0875
*       END;                                                       0876
@RC00873 DS    0H                                                  0877
*       SDWAPTR2=SDWASAV;           /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0877
*     END;                                                         0878
*   GO TO FRRGEN;                   /* COMMON EXIT ROUTINE           */
         B     FRRGEN                                              0879
*   GEN(EJECT);                                                    0880
*                                                                  0880
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR FOR EXT ERRORS                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0881
*FRREXT:                                                           0881
*   ;                                                              0881
FRREXT   DS    0H                                                  0882
*   GENERATE;                                                      0882
         USING FRREXT,EPREG
         L     BASEREG,BASEADDR      PICK UP OLD BASE ADDR
         DROP  EPREG
*   RFY                                                            0883
*    (SDWAPTR2,                                                    0883
*     RTNADDR)RSTD;                                                0883
*   RFY                                                            0884
*     SDWA BASED(SDWAPTR2);                                        0884
*   R9PARM=SDWAPARM;                /* PTR TO USER PARM AREA         */
         L     R9PARM,SDWAPARM(,SDWAPTR2)                          0885
*   SVR14FRR=RTNADDR;               /* SAVE RETURN ADDR TO RTM       */
         ST    RTNADDR,SVR14FRR(,R9PARM)                           0886
*   RFY                                                            0887
*     RTNADDR UNRSTD;                                              0887
*   TRAILSAV='EXT ';                /* FLAG FUNCTION                 */
         MVC   TRAILSAV(4,R9PARM),@CC02990                         0888
*   CALL AHLERPRE;                  /* CALL COMMON INITIALIZER       */
         BAL   @14,AHLERPRE                                        0889
*   IF MCAMEXT=ON THEN              /* ERROR GATHERING VAR           */
         TM    MCAMEXT(AWSAPTR),B'10000000'                        0890
         BNO   @RF00890                                            0890
*     DO;                                                          0891
*       EXTVAR=ERRIND;              /* **** IN VAR FIELD             */
         MVC   EXTVAR(4,AWSAPTR),@CC02662                          0892
*       GO TO RETRYP;               /* RETRY TO PSTCOM               */
         B     RETRYP                                              0893
*     END;                                                         0894
*                                                                  0894
*   /*****************************************************************/
*   /*                                                               */
*   /* DISABLE FUNCTION AND TAKE DUMP IF NECESSARY                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0895
*EXTCHK:                                                           0895
*   IF PCTEXT=ON THEN                                              0895
@RF00890 DS    0H                                                  0895
EXTCHK   TM    PCTEXT(PCTPTR),B'01000000'                          0895
         BNO   @RF00895                                            0895
*     DO;                           /* FUNCTION NOT YET DISABLED     */
*       RFY                                                        0897
*        (R10WORK,                                                 0897
*         R8FRRWRK)RSTD;                                           0897
*       R10WORK=PCTCATF;            /* GET CURRENT PICTURE OF FLAGS  */
         L     R10WORK,PCTCATF(,PCTPTR)                            0898
*       R8FRRWRK=R10WORK&EXTOFF;    /* FLAGS WITH THIS FUNCTION OFF  */
         LR    R8FRRWRK,R10WORK                                    0899
         N     R8FRRWRK,@CF02635                                   0899
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* SET FLAGS TO THIS FUNCTION 0900
*                                      OFF                           */
         CS    R10WORK,R8FRRWRK,PCTCATF(PCTPTR)                    0900
*       BC(4,EXTCHK);               /* SOMEONE ELSE BEAT US TO FLAGS.
*                                      CHECK AGAIN                   */
         BC    4,EXTCHK                                            0901
*       SDWASAV=SDWAPTR2;           /* SAVE R1 ACR0SS CALLS          */
         ST    SDWAPTR2,SDWASAV(,AWSAPTR)                          0902
*       MCQESAV=R0;                 /* SAVE R0 ACROSS CALLS          */
         ST    R0,MCQESAV(,AWSAPTR)                                0903
*       R0=ADDR(DMPLIST);           /* PARMS FOR DUMP                */
         LA    R0,DMPLIST                                          0904
*       CALL DMPMOD;                /* TAKE A DUMP                   */
         L     @15,PCTDMPMD(,PCTPTR)                               0905
         BALR  @14,@15                                             0905
*       WTOUN=R15RC;                /* SET TO BLANKS OR UN           */
         STH   R15RC,WTOUN(,AWSAPTR)                               0906
*       R1PARM=ADDR(WTOLIST);                                      0907
         LA    R1PARM,WTOLIST(,AWSAPTR)                            0907
*       CALL AHLWTO;                                               0908
         L     @15,PCTWTOMD(,PCTPTR)                               0908
         BALR  @14,@15                                             0908
*       R0=MCQESAV;                 /* RESTORE R0                    */
*                                                                  0909
         L     R0,MCQESAV(,AWSAPTR)                                0909
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE SETEVENT TO DISABLE THIS FUNCTION                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0910
*       DO;                         /* SETEVENT NAME('GTF ')       0910
*                                      MCQE(MCQE) ACTION(DISABLE)  0910
*                                      EIDAD(EXTEID)               0910
*                                      MF(E,MCAWTO,COMPLETE) EIDNO(1)*/
*                                                                  0910
*         /***********************************************************/
*         /*                                                         */
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/
*         /* AHLSETD                                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0911
*         AHLPPTR=ADDR(MCAWTO);     /* SET UP PLIST PTR              */
         LA    AHLPPTR,MCAWTO(,AWSAPTR)                            0911
*         SEPL=SEPL&&SEPL;          /* INIT PLIST TO ZERO            */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      0912
*         SEMC=ADDR(MCQE);          /* SET UP MCQE ADDRESS           */
         ST    R0,SEMC(,AHLPPTR)                                   0913
*         SENM='GTF     ';          /* MOVE NAME INTO PLIST          */
         MVC   SENM(8,AHLPPTR),@CC02963                            0914
*         SEFG=32;                  /* MOVE FLAGS INTO PLIST         */
         MVI   SEFG(AHLPPTR),X'20'                                 0915
*         SEEN=1;                   /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'01'                                 0916
*         SEEL=ADDR(EXTEID);        /* SET TO VALUE SPECIFIED        */
         LA    @12,EXTEID                                          0917
         ST    @12,SEEL(,AHLPPTR)                                  0917
*         IF SEFG=32×SEFG=8 THEN    /* CHECK FOR DISABLE OR * CHANGE */
         CLI   SEFG(AHLPPTR),32                                    0918
         BE    @RT00918                                            0918
         CLI   SEFG(AHLPPTR),8                                     0918
         BNE   @RF00918                                            0918
@RT00918 DS    0H                                                  0919
*           CALL AHLSETD;           /* YES                           */
         L     @12,CVTPTR                                          0919
         L     @12,CVTGTF(,@12)                                    0919
         L     @15,MCHSETD(,@12)                                   0919
         BALR  @14,@15                                             0919
*         ELSE                      /* NO                            */
*           CALL AHLSETEV;                                         0920
         B     @RC00918                                            0920
@RF00918 L     @12,CVTPTR                                          0920
         L     @12,CVTGTF(,@12)                                    0920
         L     @15,MCHSETE(,@12)                                   0920
         BALR  @14,@15                                             0920
*       END;                                                       0921
@RC00918 DS    0H                                                  0922
*       SDWAPTR2=SDWASAV;           /* RESTORE SDWA ADDR             */
         L     SDWAPTR2,SDWASAV(,AWSAPTR)                          0922
*     END;                                                         0923
*   RECLEN=LENGTH(EXTREC);          /* LENGTH OF RECORD FOR STACK    */
@RF00895 LA    RECLEN,22                                           0924
*   GO TO FRRGEN;                   /* COMMON EXIT ROUTINE           */
         B     FRRGEN                                              0925
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00P PTR(31)REG(0),                                        0926
*     GPR01P PTR(31)REG(1),                                        0926
*     GPR14P PTR(31)REG(14),                                       0926
*     GPR15P PTR(31)REG(15);                                       0926
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256)BASED,                                        0927
*     I031F FIXED(31)BASED,                                        0927
*     I031P PTR(31)BASED,                                          0927
*     I015F FIXED(15)BASED,                                        0927
*     I015P PTR(15)BASED,                                          0927
*     I008P PTR(8)BASED,                                           0927
*     I001C CHAR(1)BASED;                                          0927
*AHLTEND:                                                          0928
*   END AHLTSYSM                                                   0928
*                                                                  0928
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (MCHEAD  )                                       */
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHATQE  )                                       */
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */
*/*%INCLUDE SYSLIB  (MCQE    )                                       */
*/*%INCLUDE SYSLIB  (IMDMEDIT)                                       */
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (EWAMAP  )                                       */
*/*%INCLUDE SYSLIB  (GTFPCT  )                                       */
*/*%INCLUDE SYSLIB  (MCAWSA  )                                       */
*/*%INCLUDE SYSLIB  (MCRWSA  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  0928
*       ;                                                          0928
AHLTEND  DS    0H                                                  0928
@DATA    DS    0H
@CH01232 DC    XL2'4003'
@DATD    DSECT
         DS    0F
AHLTSYSM CSECT
         DS    0F
@CF02633 DC    XL4'7FFFFFFF'
@CF02635 DC    XL4'BFFFFFFF'
@CF02637 DC    XL4'DFFFFFFF'
@CF02639 DC    XL4'EFFFFFFF'
@CF02641 DC    XL4'FDFFFFFF'
@CF02643 DC    XL4'FFDFFFFF'
@DATD    DSECT
         DS    0D
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
AHLTSYSM CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
BASEADDR DC    AL4(AHLTSYSM)
@CC02647 DC    C'N/A '
@CC02947 DC    C' PI '
@CC02966 DC    C'SVC '
@CC02971 DC    C' IO '
@CC02980 DC    C'SIO '
@CC02985 DC    C' RR '
@CC02990 DC    C'EXT '
@CC02963 DC    C'GTF     '
@CC02662 DC    C'********************'
@CB02655 DC    X'1004'
@CB02665 DC    X'EEEE'
ZERO     DC    X'0000000000000000'
UNAVAL   DC    CL20'U/A     U/A U/A     '
PIMASK   DC    X'0200000000000000'
FRRMASK  DC    X'0020000000000000'
EXTMASK  DC    X'4000000000000000'
RECID    DC    CL24'ahltsysmahltsysmahltsysm'
DMPHDR   DS    CL28
         ORG   DMPHDR
@NM00113 DC    AL1(27)
@NM00114 DC    CL27'DUMP OF GTF MODULE AHLTSYSM'
         ORG   DMPHDR+28
WTONAMES DC    CL16'SYSM      TRAC  '
DMPLIST  DS    CL12
         ORG   DMPLIST
HDRPTR   DC    AL4(DMPHDR)
SYSMSTRT DC    AL4(AHLTSYSM)
SYSMEND  DC    AL4(AHLTEND)
         ORG   SYSMEND
EOL      DC    X'80'
         ORG   DMPLIST+12
EIDLIST  DS    CL66
         ORG   EIDLIST
IOEIDS   DS    CL6
         ORG   IOEIDS+0
@NM00121 DC    X'5200'
@NM00122 DS    CL4
         ORG   IOEIDS+6
         ORG   IOEIDS+6
         DC    X'5101'
         ORG   IOEIDS+12
         ORG   IOEIDS+12
         DC    X'2100'
         ORG   IOEIDS+18
         ORG   IOEIDS+18
         DC    X'5201'
         ORG   EIDLIST+24
SIOEID   DC    X'5100'
@NM00123 DS    CL4
SVCEID   DC    X'1000'
@NM00124 DS    CL4
PIEIDS   DS    CL6
         ORG   PIEIDS+0
@NM00125 DC    X'6101'
@NM00126 DS    CL4
         ORG   PIEIDS+6
         ORG   PIEIDS+6
         DC    X'6200'
         ORG   EIDLIST+48
RREIDS   DS    CL6
         ORG   RREIDS+0
@NM00127 DC    X'4002'
@NM00128 DS    CL4
         ORG   RREIDS+6
         ORG   RREIDS+6
         DC    X'4003'
         ORG   EIDLIST+60
EXTEID   DC    X'6201'
@NM00129 DS    CL4
         ORG   EIDLIST+66
SYSMPTCH DC    100X'00'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SDWAPTR  EQU   @06
PCTPTR   EQU   @02
AWSAPTR  EQU   @03
R9PARM   EQU   @09
R8FRRWRK EQU   @08
R10WORK  EQU   @10
SDWAPTR1 EQU   @06
RTNADDR  EQU   @14
RTNSAVE  EQU   @10
BASEREG  EQU   @11
RTCAREG  EQU   @04
R15RC    EQU   @15
SDWAPTR2 EQU   @01
R1PARM   EQU   @01
R0       EQU   @00
WORKREG  EQU   @07
RECLEN   EQU   @05
AHLRECPR EQU   @01
AHLSBREG EQU   @14
AHLRETCD EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
AHLPPTR  EQU   @01
EPREG    EQU   @15
R10MOVE  EQU   @10
R11MOVE  EQU   @11
R14      EQU   @14
R4MOVE   EQU   @04
R5MOVE   EQU   @05
         ENTRY SYSMPTCH
         ENTRY AHLSVC
         ENTRY AHLEXT
         ENTRY AHLIO
         ENTRY AHLUIO
         ENTRY AHLSIO
         ENTRY AHLFRR
         ENTRY AHLPINT
         ENTRY AHLTINT
         ENTRY AHLSTAE
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCEOPSW EQU   PSA+24
FLCSOPSW EQU   PSA+32
FLCPOPSW EQU   PSA+40
FLCIOPSW EQU   PSA+56
FLCCSW   EQU   PSA+64
FLCCAW   EQU   PSA+72
PSAEEPSW EQU   PSA+132
FLCEICOD EQU   PSAEEPSW+2
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
FLCSVCN  EQU   PSAESPSW+2
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAPCCAV EQU   PSA+520
PSALCCAV EQU   PSA+528
PSATOLD  EQU   PSA+540
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSACPUSA EQU   PSA+794
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
CVTPTR   EQU   16
SRBSECT  EQU   0
SRB      EQU   SRBSECT
SRBFLC   EQU   SRB+12
SRBPTCB  EQU   SRBFLC+4
ASVT     EQU   0
ASVTFRST EQU   ASVT+524
ASVTENTY EQU   ASVT+528
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSASID  EQU   IOSB+6
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00005 EQU   IOSB+20
IOSCC    EQU   @NM00005
IOSCSW   EQU   @NM00005+1
IOSTATUS EQU   IOSCSW+3
IOSSRB   EQU   IOSB+28
IOSIPIB  EQU   IOSB+44
IOSERP   EQU   IOSB+52
IOSRST   EQU   IOSB+72
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
LCCA     EQU   0
LCCAPGR1 EQU   LCCA+8
LCCAPGR2 EQU   LCCA+72
LCCAPPSW EQU   LCCA+136
LCCAPINT EQU   LCCA+144
LCCAPVAD EQU   LCCA+148
LCCAIHRC EQU   LCCA+520
LCCAIHR1 EQU   LCCAIHRC
LCCAIHR2 EQU   LCCAIHRC+1
LCCAIHR3 EQU   LCCAIHRC+2
LCCAIHR4 EQU   LCCAIHRC+3
LCCASPIN EQU   LCCA+524
LCCASPN1 EQU   LCCASPIN
LCCASPN2 EQU   LCCASPIN+1
LCCASPN3 EQU   LCCASPIN+2
LCCASPN4 EQU   LCCASPIN+3
LCCACPUS EQU   LCCA+536
LCCADSF1 EQU   LCCA+540
LCCADSF2 EQU   LCCA+541
LCCASRBM EQU   LCCADSF2
LCCASPSA EQU   LCCA+544
LCCACRFL EQU   LCCA+692
LCCACREX EQU   LCCA+693
LCCALKFG EQU   LCCA+694
LCCASRBF EQU   LCCA+720
ASCB     EQU   0
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
MCHEAD   EQU   0
MCHFLGS  EQU   MCHEAD+24
MCHFLG1  EQU   MCHFLGS
MCHSETE  EQU   MCHEAD+28
MCHSETD  EQU   MCHEAD+32
PCCA     EQU   0
PCCATQEP EQU   PCCA+20
PCCATMST EQU   PCCA+128
PCCATMFL EQU   PCCATMST
PCCATODE EQU   PCCATMST+1
PCCACCE  EQU   PCCATMST+2
PCCAINTE EQU   PCCATMST+3
PCCAEMSB EQU   PCCA+136
PCCAEMSI EQU   PCCAEMSB
PCCARISP EQU   PCCAEMSI
PCCAEMS2 EQU   PCCAEMSI+1
PCCAEMS3 EQU   PCCAEMSI+2
PCCARMSB EQU   PCCAEMSI+3
PCCAWERP EQU   PCCA+280
PCCACHPF EQU   PCCAWERP+4
PCCACHBL EQU   PCCAWERP+5
PCCACHVA EQU   PCCAWERP+6
PCCACHTS EQU   PCCAWERP+7
PCCACHS1 EQU   PCCA+288
PCCACHS2 EQU   PCCA+289
PCCACHRB EQU   PCCA+290
PCCACHF1 EQU   PCCA+308
PCCACHF2 EQU   PCCA+309
PCCACHF3 EQU   PCCA+310
PCCACHF4 EQU   PCCA+311
TQE      EQU   0
TQEFLGS  EQU   TQE+14
TQEFLGS2 EQU   TQE+15
TQEVAL   EQU   TQE+16
TQEEXIT  EQU   TQE+28
TQETCB   EQU   TQE+32
WSAG     EQU   0
WSAC     EQU   0
WSACGTF  EQU   WSAC+4
MCQE     EQU   0
MCQEASCB EQU   MCQE+16
MCQEAT   EQU   MCQE+32
MCQEFLGS EQU   MCQE+41
FRRS     EQU   0
FRRSHEAD EQU   FRRS
FRRSCURR EQU   FRRSHEAD+12
FRRSENTR EQU   0
FRRSFLGS EQU   FRRSENTR+4
FRRSFLG1 EQU   FRRSFLGS
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWAREGU EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAMCHK EQU   SDWAERRA
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAPERC EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAERRD EQU   SDWAFLGS+3
SDWACLUP EQU   SDWAERRD
SDWAFMID EQU   SDWA+236
SDWAIOFS EQU   SDWA+238
SDWARTYA EQU   SDWA+240
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
EWA      EQU   0
EWAHDR   EQU   EWA
EWAFLAGS EQU   EWA+4
EWAFLG1  EQU   EWAFLAGS
EWASCCD  EQU   EWAFLG1
EWASCC3  EQU   EWASCCD
EWAFLG2  EQU   EWAFLAGS+1
EWASNSCT EQU   EWAFLAGS+3
EWACNTRS EQU   EWA+10
EWAERPIB EQU   EWA+16
EWARGFG1 EQU   EWAERPIB+4
EWARGFG2 EQU   EWAERPIB+5
EWAXCSW1 EQU   EWAERPIB+6
EWAXCSW2 EQU   EWAERPIB+7
EWAIERP  EQU   EWA+32
GTFPCT   EQU   0
GTFSTAT  EQU   GTFPCT+8
GTFDEBUG EQU   GTFSTAT
GTFOPTS  EQU   GTFPCT+12
GTFOPTS1 EQU   GTFOPTS
OPTTRC   EQU   GTFOPTS1
GTFOPTS2 EQU   GTFOPTS+1
GTFOPTS3 EQU   GTFOPTS+2
GTFOPTS4 EQU   GTFOPTS+3
OPTTIME  EQU   GTFOPTS4
PCTCATF  EQU   GTFPCT+16
PCTSVC   EQU   PCTCATF
PCTEXT   EQU   PCTCATF
PCTIO    EQU   PCTCATF
PCTSIO   EQU   PCTCATF
PCTPI    EQU   PCTCATF
PCTRR    EQU   PCTCATF+1
NEXTBLOK EQU   GTFPCT+180
SBLOKRTN EQU   GTFPCT+188
WRTRCOM  EQU   GTFPCT+204
TRMWRIT  EQU   GTFPCT+212
WRTRERR  EQU   GTFPCT+216
GTFSSRB  EQU   GTFPCT+220
QLOCKWRD EQU   GTFPCT+236
QLOCKECB EQU   GTFPCT+240
AUDITFLG EQU   GTFPCT+296
GTFASCB  EQU   GTFPCT+300
PCTDMPMD EQU   GTFPCT+308
PCTWTOMD EQU   GTFPCT+312
MCAWSA   EQU   0
MCATRAIL EQU   MCAWSA+256
MCATRL1  EQU   MCATRAIL
MCASVC   EQU   MCATRL1
MCAIO    EQU   MCATRL1
MCASIO   EQU   MCATRL1
MCATRL2  EQU   MCATRAIL+1
MCASTA   EQU   MCATRL2
MCAUIO   EQU   MCATRL2
MCAERROR EQU   MCATRL2
MCATRL3  EQU   MCATRAIL+2
MCATRL4  EQU   MCATRAIL+3
MCAMEXT  EQU   MCATRL4
MCAMASCB EQU   MCATRL4
MCAMTCB  EQU   MCATRL4
MCAMIOSB EQU   MCATRL4
MCAMSDWA EQU   MCATRL4
MCATRL5  EQU   MCATRAIL+4
MCATRL6  EQU   MCATRAIL+5
MCATRL7  EQU   MCATRAIL+6
MCAMCR   EQU   MCAWSA+264
MCARECPR EQU   MCAWSA+268
MCAREC   EQU   MCAWSA+284
MCAWORK  EQU   MCAWSA+584
MCRWSA   EQU   0
MCRMCIH  EQU   MCRWSA
MCROUTSA EQU   MCRWSA+64
MCRMCA   EQU   MCRWSA+128
MCRWSAF  EQU   MCRWSA+132
MCRBRENT EQU   MCRWSAF
MCREID   EQU   MCRWSA+134
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTRSV90 EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
MCHKRTY  EQU   0
FRRPARM  EQU   0
TRAILSAV EQU   FRRPARM+4
SVR14NRM EQU   FRRPARM+8
SVR14FRR EQU   FRRPARM+12
DMPMOD   EQU   0
AHLWTO   EQU   0
SVR14RTN EQU   0
AHLGREC  EQU   0
AHLGLGTH EQU   AHLGREC
AHLGRES  EQU   AHLGREC+2
AHLGAID  EQU   AHLGREC+4
AHLGFID  EQU   AHLGREC+5
AHLGTST  EQU   AHLGREC+6
AHLGEIDS EQU   AHLGTST
AHLGEIDL EQU   AHLGREC+14
AHLSBLOK EQU   0
I256C    EQU   0
AHLSETEV EQU   0
AHLSETD  EQU   0
SEPL     EQU   0
SEFG     EQU   SEPL
SEEN     EQU   SEPL+2
SENM     EQU   SEPL+4
SEEL     EQU   SEPL+12
SEMC     EQU   SEPL+20
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
SRBPTR   EQU   IOSSRB
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTASVT  EQU   CVTS01+208
CVTSDBF  EQU   CVTS01+240
CVTSPSA  EQU   CVTS01+336
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
ASVTPTR  EQU   CVTASVT
EVREGS   EQU   LCCAPGR2
EVREG01  EQU   EVREGS
EVREG0   EQU   EVREG01
EVREG1   EQU   EVREG01+4
EVREG2   EQU   EVREGS+8
EVREG6   EQU   EVREGS+24
EVREG15  EQU   EVREGS+60
IOSBPTR  EQU   EVREG2
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
LCCAPTR  EQU   PSALCCAV
ASCBPTR  EQU   MCQEASCB
PCCAPTR  EQU   PSAPCCAV
PSARSVTE EQU   PSARSVT
PSACSTK  EQU   PSARSVTE
TQEPTR   EQU   PCCATQEP
FRRSPTR  EQU   PSACSTK
FRREPTR  EQU   FRRSCURR
EWAPTR   EQU   IOSERP
EWADDIOS EQU   EWAIERP
EWASNS   EQU   EWADDIOS
TEVREGS  EQU   LCCAPGR1
TEVREG1  EQU   TEVREGS+4
TEVREG15 EQU   TEVREGS+60
WORKAREA EQU   MCAWORK
MCQESAV  EQU   WORKAREA
SDWASAV  EQU   WORKAREA+4
MCAWTO   EQU   WORKAREA+8
WTOLIST  EQU   MCAWTO
WTOFUNC  EQU   WTOLIST+4
WTOUN    EQU   WTOLIST+14
ERRSLOT  EQU   MCAREC
EICOD    EQU   FLCEICOD
LCCPNT4  EQU   LCCAPINT+3
LCCPNT3  EQU   LCCAPINT+2
IOSCPA   EQU   IOSRST
MCRREGS  EQU   MCROUTSA
MCRREG0  EQU   MCRREGS
EXTINTCD EQU   FLCEICOD
INTTYP   EQU   EXTINTCD
FRRREG1  EQU   MCRMCIH+4
SDWADDR  EQU   EVREG1
PIREC    EQU   MCAREC
PIASCB   EQU   PIREC
PICPUID  EQU   PIREC+4
PIOPSW   EQU   PIREC+6
PIINT    EQU   PIOPSW+2
PITCB    EQU   PIREC+14
PIVPA    EQU   PIREC+18
PIR15    EQU   PIREC+22
PIR1     EQU   PIREC+26
EXTREC   EQU   MCAREC
EXTASCB  EQU   EXTREC
EXTCPUID EQU   EXTREC+4
EXTPSW   EQU   EXTREC+6
EXTINT   EQU   EXTPSW+2
EXTTCB   EQU   EXTREC+14
EXTVAR   EQU   EXTREC+18
SVCREC   EQU   MCAREC
SVCPSW   EQU   SVCREC+6
SVCINT   EQU   SVCPSW+2
SVCTCB   EQU   SVCREC+14
SVCR15   EQU   SVCREC+18
SVCR0R1  EQU   SVCREC+22
IOREC    EQU   MCAREC
IOASCB   EQU   IOREC
IOPSW    EQU   IOREC+6
IOUA     EQU   IOREC+14
IOTCB    EQU   IOUA
IOCSW    EQU   IOUA+4
IODEV    EQU   IOREC+26
IOSENSE  EQU   IODEV
SIOREC   EQU   MCAREC
SIOASCB  EQU   SIOREC
SIOCPA   EQU   SIOREC+6
SIODEV   EQU   SIOREC+14
SIOCC    EQU   SIODEV
SIOCAW   EQU   SIOREC+18
SIOSTS   EQU   SIOREC+22
UIOREC   EQU   MCAREC
UIOASCB  EQU   UIOREC
UIOPSW   EQU   UIOREC+6
UIOCSW   EQU   UIOREC+14
UIODEV   EQU   UIOREC+22
FRRREC   EQU   MCAREC
FRRASCB  EQU   FRRREC
FRRCPU   EQU   FRRREC+4
FRRPSW   EQU   FRRREC+6
FRRCC    EQU   FRRREC+14
FRRFLG1  EQU   FRRREC+18
FRRFLG2  EQU   FRRREC+22
FRRMCHD  EQU   FRRFLG2
FRRACF   EQU   FRRFLG2+1
FRRRC    EQU   FRRFLG2+2
FRRETRY  EQU   FRRREC+25
STAEREC  EQU   MCAREC
STAEPSW  EQU   STAEREC+6
STAECC   EQU   STAEREC+14
STARF    EQU   STAEREC+18
STAFLGS  EQU   STARF
STAERRA  EQU   STAFLGS
STAMCHD  EQU   STAFLGS+1
STAACF2  EQU   STAFLGS+2
STARCDE  EQU   STARF+3
STARTYCA EQU   STAEREC+22
STARTYA  EQU   STARTYCA
STAUA    EQU   STAEPSW
PRECM    EQU   MCAREC
PREASCB  EQU   PRECM
PRECPUID EQU   PRECM+4
FRRASTER EQU   FRRCC
STASTER1 EQU   STAEPSW
STASTER2 EQU   STAEPSW
ASIDX    EQU   EVREG0
FLC      EQU   PSA
SDMPBIT  EQU   CVTSDBF
TQEECB   EQU   TQEEXIT
*                                      START UNREFERENCED COMPONENTS
STARTCA  EQU   STARTYCA+4
@NM00137 EQU   STAEREC
UIOCPUID EQU   UIOREC+4
SIOCPUID EQU   SIOREC+4
IOCPUID  EQU   IOREC+4
@NM00136 EQU   SVCPSW+4
@NM00135 EQU   SVCPSW
@NM00134 EQU   SVCREC
@NM00133 EQU   EXTPSW+4
@NM00132 EQU   EXTPSW
@NM00131 EQU   PIOPSW+4
@NM00130 EQU   PIOPSW
INTCDE   EQU   EXTINTCD+1
MCRREG1  EQU   MCRREGS+4
WTOMODE  EQU   WTOLIST+8
WTOMOD   EQU   WTOLIST
@NM00119 EQU   TEVREGS+8
@NM00118 EQU   TEVREGS
EWAEND   EQU   EWADDIOS+71
EWASCSW  EQU   EWADDIOS+64
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00010 EQU   IOSPCISC+4
@NM00009 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00008 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
@NM00117 EQU   EVREGS+28
@NM00116 EQU   EVREGS+12
@NM00115 EQU   EVREG0+2
EVREG0ID EQU   EVREG0
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTWSAG  EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTSYSWT EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
SECL     EQU   SEPL+16
SECN     EQU   SEPL+3
@NM00138 EQU   SEPL+1
SVR14CAL EQU   FRRPARM+16
@NM00120 EQU   FRRPARM+2
RECURCTR EQU   FRRPARM
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00112 EQU   CVTFIX+248
@NM00111 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTRSVA1 EQU   CVTXTNT2+48
CVTRSVA0 EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTRSV90
CVTRSV9G EQU   CVTRSV90
CVTRSV9F EQU   CVTRSV90
CVTRSV9E EQU   CVTRSV90
CVTRSV9D EQU   CVTRSV90
CVTRSV9C EQU   CVTRSV90
CVTRSV9B EQU   CVTRSV90
CVTRSV9A EQU   CVTRSV90
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTRV484 EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTINTLA EQU   CVTMAP+320
CVTERPV  EQU   CVTMAP+316
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTRV319 EQU   CVTUSR
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTIERLC EQU   CVTMAP+144
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
MCRRESV  EQU   MCRWSAF
MCERROR  EQU   MCRWSAF
MCINFGBR EQU   MCRWSAF
MCINCTL  EQU   MCRWSAF
MCASWORK EQU   MCAWSA+644
MCATRL8  EQU   MCATRAIL+7
MCAFRECT EQU   MCATRL7
MCAFRECC EQU   MCATRL7
MCAFRESP EQU   MCATRL7
MCAFREXJ EQU   MCATRL7
MCAFRSBR EQU   MCATRL6
MCAFRDMJ EQU   MCATRL6
MCAFRDPC EQU   MCATRL6
MCAFRPIC EQU   MCATRL6
MCAFRPIJ EQU   MCATRL6
@NM00110 EQU   MCATRL5
MCADREGS EQU   MCATRL5
MCAFRRB  EQU   MCATRL5
MCAFRRJ  EQU   MCATRL5
MCAFRRA  EQU   MCATRL5
MCAFRERT EQU   MCATRL5
MCAFREPC EQU   MCATRL5
MCAMJOBN EQU   MCATRL4
MCAMBTU  EQU   MCATRL4
MCAMUCB  EQU   MCATRL4
MCAFRFRT EQU   MCATRL3
MCAFRFA  EQU   MCATRL3
MCAFRSJ  EQU   MCATRL3
MCAFRSA  EQU   MCATRL3
MCAPIF   EQU   MCATRL3
MCASIOF  EQU   MCATRL3
MCAIOF   EQU   MCATRL3
MCASVCF  EQU   MCATRL3
MCATDIR  EQU   MCATRL2
MCALSR   EQU   MCATRL2
MCAFRR   EQU   MCATRL2
MCASRM   EQU   MCATRL2
MCARNIO  EQU   MCATRL2
MCAUSR   EQU   MCATRL1
MCAPI    EQU   MCATRL1
MCASRB   EQU   MCATRL1
MCADSP   EQU   MCATRL1
MCAEXT   EQU   MCATRL1
MCAMSG   EQU   MCAWSA+192
MCASETEV EQU   MCAWSA+128
MCAFWORK EQU   MCAWSA+112
MCASFEOB EQU   MCAWSA+56
MCASBLOK EQU   MCAWSA
TRANSMAX EQU   GTFPCT+304
@NM00109 EQU   AUDITFLG+3
AFSLEBLD EQU   AUDITFLG+3
WSERFG06 EQU   AUDITFLG+3
WSERFG05 EQU   AUDITFLG+3
WSERFG04 EQU   AUDITFLG+3
WSERFG03 EQU   AUDITFLG+3
WSERFG02 EQU   AUDITFLG+2
WSERFLAG EQU   AUDITFLG+2
TERMFLAG EQU   AUDITFLG+2
AFXWRIT  EQU   AUDITFLG+2
AFQLWAIT EQU   AUDITFLG+2
AFSLEGET EQU   AUDITFLG+2
AFBUFGET EQU   AUDITFLG+2
AFFEOB   EQU   AUDITFLG+2
AFBLKFIX EQU   AUDITFLG+1
AFEQFIX  EQU   AUDITFLG+1
AFPGRLSE EQU   AUDITFLG+1
AFWRAP   EQU   AUDITFLG+1
AFBUFOFF EQU   AUDITFLG+1
AFLDFX   EQU   AUDITFLG+1
AFCLOSE  EQU   AUDITFLG+1
AFOPEN   EQU   AUDITFLG+1
AFGMBLOK EQU   AUDITFLG
AFGMSRB  EQU   AUDITFLG
AFWAIT   EQU   AUDITFLG
AFTERM   EQU   AUDITFLG
AFINIT   EQU   AUDITFLG
AFWWRIT  EQU   AUDITFLG
AFCWRIT  EQU   AUDITFLG
AFIWRIT  EQU   AUDITFLG
EQSHORT  EQU   GTFPCT+292
SLEMAX   EQU   GTFPCT+288
SLECNT   EQU   GTFPCT+284
RQPURGE  EQU   GTFPCT+280
RQTOTAL  EQU   GTFPCT+276
WRTDLST  EQU   GTFPCT+272
NUMOFBUF EQU   GTFPCT+268
SBUFDISA EQU   GTFPCT+264
SLESUSED EQU   GTFPCT+260
EQMIN    EQU   GTFPCT+256
EQLENGTH EQU   GTFPCT+252
WQMAX    EQU   GTFPCT+248
WQLENGTH EQU   GTFPCT+244
QLECBP   EQU   QLOCKECB
@NM00108 EQU   QLOCKECB
@NM00107 EQU   QLOCKWRD+3
SCHEDBUF EQU   QLOCKWRD+2
POSTWRIT EQU   QLOCKWRD+1
QLOCK    EQU   QLOCKWRD
WRITERDD EQU   GTFPCT+228
GTFLOSTR EQU   GTFPCT+224
SRBAVAIL EQU   GTFSSRB
WRTRERRP EQU   WRTRERR
@NM00106 EQU   WRTRERR
TRMWRITP EQU   TRMWRIT
@NM00105 EQU   TRMWRIT
GTFCMECB EQU   GTFPCT+208
WRTRCOMP EQU   WRTRCOM
@NM00104 EQU   WRTRCOM
TRANSCNT EQU   GTFPCT+200
AHLRDPLQ EQU   GTFPCT+196
SFEOBRTN EQU   GTFPCT+192
CURRBLOK EQU   GTFPCT+184
GBCDS    EQU   NEXTBLOK
WSMODEND EQU   GTFPCT+176
WSMODBEG EQU   GTFPCT+172
BCBPAGE  EQU   GTFPCT+156
SLEPAGE  EQU   GTFPCT+152
SAVECNT  EQU   GTFPCT+148
SLQHEAD  EQU   GTFPCT+144
HQLENGTH EQU   GTFPCT+140
QTAIL    EQU   GTFPCT+136
HQHEAD   EQU   GTFPCT+132
WQHEAD   EQU   GTFPCT+128
RQHEAD   EQU   GTFPCT+124
EQHEAD   EQU   GTFPCT+120
WPOSTSRB EQU   GTFPCT+116
WTSKTCBA EQU   GTFPCT+112
WRTRTCBA EQU   GTFPCT+108
TRMWTASK EQU   GTFPCT+104
WTSKATTH EQU   GTFPCT+100
WTSKINIT EQU   GTFPCT+96
WTASKECB EQU   GTFPCT+92
WMTABPTR EQU   GTFPCT+88
ATTCHECB EQU   GTFPCT+84
AHLECB   EQU   GTFPCT+80
STOPECBA EQU   GTFPCT+76
ECBADRLT EQU   GTFPCT+72
FIXLEN   EQU   GTFPCT+68
FIXPTR   EQU   GTFPCT+64
INITPTR  EQU   GTFPCT+60
MCQEPTR  EQU   GTFPCT+56
GTFEIDL  EQU   GTFPCT+52
GTFPIBL  EQU   GTFPCT+48
GTFPIFT  EQU   GTFPCT+44
GTFSVCBL EQU   GTFPCT+40
GTFSVCFT EQU   GTFPCT+36
GTFIOBL  EQU   GTFPCT+32
GTFIOFT  EQU   GTFPCT+28
GTFSIOBL EQU   GTFPCT+24
GTFSIOFT EQU   GTFPCT+20
@NM00103 EQU   PCTCATF+1
PCTPIF   EQU   PCTCATF+1
PCTSIOF  EQU   PCTCATF+1
PCTIOF   EQU   PCTCATF+1
PCTSVCF  EQU   PCTCATF+1
PCTSRM   EQU   PCTCATF+1
PCTRNIO  EQU   PCTCATF+1
PCTUSR   EQU   PCTCATF
@NM00102 EQU   PCTCATF
PCTDSP   EQU   PCTCATF
OPTRES3  EQU   GTFOPTS4
OPTIOSIO EQU   GTFOPTS3
OPTRES2  EQU   GTFOPTS3
OPTRR    EQU   GTFOPTS3
OPTSRM   EQU   GTFOPTS3
OPTRNIO  EQU   GTFOPTS3
OPTEXT   EQU   GTFOPTS3
OPTIOP   EQU   GTFOPTS2
OPTIO    EQU   GTFOPTS2
OPTPIP   EQU   GTFOPTS2
OPTPI    EQU   GTFOPTS2
OPTSIOP  EQU   GTFOPTS2
OPTSIO   EQU   GTFOPTS2
OPTSVCP  EQU   GTFOPTS2
OPTSVC   EQU   GTFOPTS2
OPTPCI   EQU   GTFOPTS1
OPTRES1  EQU   GTFOPTS1
OPTDSP   EQU   GTFOPTS1
OPTUSR   EQU   GTFOPTS1
OPTSYS   EQU   GTFOPTS1
OPTSYSP  EQU   GTFOPTS1
OPTSYSM  EQU   GTFOPTS1
GTFRESV  EQU   GTFSTAT
GTFMODE  EQU   GTFSTAT
GTFPCTID EQU   GTFPCT
EWADDISP EQU   EWA+29
EWADCNT  EQU   EWA+28
EWACPU   EQU   EWA+27
@NM00101 EQU   EWA+26
EWACHA   EQU   EWA+24
EWACSEQ  EQU   EWAXCSW2
EWACDIN  EQU   EWAXCSW2
@NM00100 EQU   EWAXCSW2
EWACTEC  EQU   EWAXCSW2
EWACDAV  EQU   EWAXCSW1
EWACCHV  EQU   EWAXCSW1
EWACCMD  EQU   EWAXCSW1
EWACUNS  EQU   EWAXCSW1
EWACSQV  EQU   EWAXCSW1
@NM00099 EQU   EWAXCSW1
EWACITF  EQU   EWAXCSW1
@NM00098 EQU   EWARGFG2
EWACCUE  EQU   EWARGFG2
EWACSTG  EQU   EWARGFG2
EWACSCU  EQU   EWARGFG2
EWACCHA  EQU   EWARGFG2
EWACCPU  EQU   EWARGFG2
EWANORTY EQU   EWARGFG1
EWACCNT  EQU   EWARGFG1
EWACSNS  EQU   EWARGFG1
@NM00097 EQU   EWARGFG1
EWACHIO  EQU   EWARGFG1
EWACTIO  EQU   EWARGFG1
EWACINT  EQU   EWARGFG1
EWACSIO  EQU   EWARGFG1
EWAUCB   EQU   EWAERPIB+1
@NM00096 EQU   EWAERPIB
EWASTUP  EQU   EWA+14
EWACNTR4 EQU   EWACNTRS+3
EWACNTR3 EQU   EWACNTRS+2
EWACNTR2 EQU   EWACNTRS+1
EWACNTR1 EQU   EWACNTRS
EWASSTAT EQU   EWA+8
EWASCTMX EQU   EWASNSCT
@NM00095 EQU   EWASNSCT
EWAFLG3  EQU   EWAFLAGS+2
@NM00094 EQU   EWAFLG2
EWADIR   EQU   EWAFLG2
EWACOVF  EQU   EWAFLG2
EWAWTEMP EQU   EWAFLG2
EWAMDR   EQU   EWAFLG2
EWABDSNS EQU   EWAFLG1
EWADDMSG EQU   EWAFLG1
EWASCC1  EQU   EWASCC3
EWASCC2  EQU   EWASCC3
@NM00093 EQU   EWAFLG1
EWASLIS  EQU   EWAFLG1
EWAEXT   EQU   EWAHDR
@NM00092 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00091 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00090 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00089 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00088 EQU   SDWADDAT+3
@NM00087 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00086 EQU   SDWADDAT+1
@NM00085 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00084 EQU   SDWADUMP+2
@NM00083 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00082 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00081 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00080 EQU   SDWAACF3
@NM00079 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00078 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00077 EQU   SDWAACF2
SDWARCRD EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00076 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
@NM00075 EQU   SDWA+239
@NM00074 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
@NM00073 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
@NM00072 EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00071 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00070 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00069 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00068 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00067 EQU   SDWAINC2
@NM00066 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00065 EQU   SDWAILC2
@NM00064 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00063 EQU   SDWANXT2
@NM00062 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00061 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00060 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00059 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00058 EQU   SDWAINC1
@NM00057 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00056 EQU   SDWAILC1
@NM00055 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00054 EQU   SDWANXT1
@NM00053 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00052 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00051 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00050 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00049 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00048 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00047 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00046 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00045 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
FRRSPARM EQU   FRRSENTR+8
@NM00044 EQU   FRRSFLGS+1
@NM00043 EQU   FRRSFLG1
FRRSNEST EQU   FRRSFLG1
FRRSRCUR EQU   FRRSFLG1
FRRSFRRA EQU   FRRSENTR
FRRSENTS EQU   FRRS+84
FRRSRTMW EQU   FRRS+16
FRRSELEN EQU   FRRSHEAD+8
FRRSLAST EQU   FRRSHEAD+4
FRRSEMP  EQU   FRRSHEAD
MCQESRB  EQU   MCQE+44
@NM00042 EQU   MCQE+42
@NM00041 EQU   MCQEFLGS
MCQEACT  EQU   MCQEFLGS
MCQESCHE EQU   MCQE+40
MCQETECB EQU   MCQE+36
MCQEMCCL EQU   MCQE+28
MCQEMCEE EQU   MCQE+24
MCQEMCQE EQU   MCQE+20
MCQENAME EQU   MCQE+8
MCQEIDEN EQU   MCQE
WSACCCH  EQU   WSAC+52
WSACRRSA EQU   WSAC+48
WSACREST EQU   WSAC+44
WSACRSTI EQU   WSAC+40
WSACABTM EQU   WSAC+36
WSACMF1  EQU   WSAC+32
WSACEDS0 EQU   WSAC+28
WSACIOS  EQU   WSAC+24
WSACRTMK EQU   WSAC+20
WSACACR  EQU   WSAC+16
WSACTIME EQU   WSAC+12
WSACOPTM EQU   WSAC+8
WSACCWSA EQU   WSAC
WSAGSCHE EQU   WSAG+40
WSAGREST EQU   WSAG+36
WSAGNQDQ EQU   WSAG+32
WSAGMEMT EQU   WSAG+28
WSAGOPTM EQU   WSAG+24
WSAGSTAT EQU   WSAG+20
WSAGEMS0 EQU   WSAG+16
WSAGSSRS EQU   WSAG+12
WSAGRSM  EQU   WSAG+8
WSAGGMFM EQU   WSAG+4
WSAGPGIO EQU   WSAG
@NM00040 EQU   TQE+88
TQESRB   EQU   TQE+44
TQELHPSW EQU   TQE+40
TQEASCB  EQU   TQE+36
TQESADDR EQU   TQE+24
TQEVALRH EQU   TQEVAL+4
TQEVALLH EQU   TQEVAL
TQEMIDN  EQU   TQEFLGS2
TQEMF1   EQU   TQEFLGS2
TQEOPT   EQU   TQEFLGS2
TQELM    EQU   TQEFLGS2
TQEDUM   EQU   TQEFLGS2
@NM00039 EQU   TQEFLGS2
TQEUSER  EQU   TQEFLGS2
TQECOMP  EQU   TQEFLGS2
TQETYPE  EQU   TQEFLGS
TQEXITSP EQU   TQEFLGS
TQEINCOM EQU   TQEFLGS
TQEWLIM  EQU   TQEFLGS
@NM00038 EQU   TQEFLGS
TQETOD   EQU   TQEFLGS
TQEOFF   EQU   TQEFLGS
TQEAID   EQU   TQE+12
TQEBLNK  EQU   TQE+8
TQEFLNK  EQU   TQE+4
TQETQE   EQU   TQE
@NM00013 EQU   PCCA+512
PCCACAT  EQU   PCCA+384
PCCARV36 EQU   PCCA+380
PCCARV35 EQU   PCCA+378
PCCARV01 EQU   PCCA+377
PCCACPUM EQU   PCCA+376
PCCARV63 EQU   PCCA+372
PCCARV62 EQU   PCCA+368
PCCARV61 EQU   PCCA+364
PCCARV60 EQU   PCCA+360
PCCARV59 EQU   PCCA+356
PCCARV58 EQU   PCCA+352
PCCARV57 EQU   PCCA+348
PCCARV56 EQU   PCCA+344
PCCARV55 EQU   PCCA+340
PCCARV54 EQU   PCCA+336
PCCALOGA EQU   PCCA+332
PCCACHID EQU   PCCA+324
PCCACHSV EQU   PCCA+312
PCCARV79 EQU   PCCACHF4
PCCARV78 EQU   PCCACHF4
PCCARV77 EQU   PCCACHF4
PCCARV76 EQU   PCCACHF4
PCCARV75 EQU   PCCACHF4
PCCARV74 EQU   PCCACHF4
PCCARV73 EQU   PCCACHF4
PCCARV72 EQU   PCCACHF4
PCCARV71 EQU   PCCACHF3
PCCARV70 EQU   PCCACHF3
PCCARV69 EQU   PCCACHF3
PCCARV68 EQU   PCCACHF3
PCCARV67 EQU   PCCACHF3
PCCARV66 EQU   PCCACHF3
PCCARV65 EQU   PCCACHF3
PCCARV64 EQU   PCCACHF3
PCCACF28 EQU   PCCACHF2
PCCACF27 EQU   PCCACHF2
PCCACF26 EQU   PCCACHF2
PCCACF25 EQU   PCCACHF2
PCCACF24 EQU   PCCACHF2
PCCACF23 EQU   PCCACHF2
PCCACF22 EQU   PCCACHF2
PCCACF21 EQU   PCCACHF2
PCCACF18 EQU   PCCACHF1
PCCACF17 EQU   PCCACHF1
PCCACF16 EQU   PCCACHF1
PCCACF15 EQU   PCCACHF1
PCCACF14 EQU   PCCACHF1
PCCACF13 EQU   PCCACHF1
PCCACF12 EQU   PCCACHF1
PCCACF11 EQU   PCCACHF1
PCCARV05 EQU   PCCA+306
PCCACHPB EQU   PCCA+305
PCCALGP2 EQU   PCCA+304
PCCALGP1 EQU   PCCA+303
PCCALOGL EQU   PCCA+302
PCCARV80 EQU   PCCA+300
PCCACHW2 EQU   PCCA+296
PCCACHW1 EQU   PCCA+292
PCCAIOSI EQU   PCCA+291
PCCACNRB EQU   PCCACHRB
PCCACCVB EQU   PCCACHRB
PCCACSNB EQU   PCCACHRB
PCCARV52 EQU   PCCACHRB
PCCACHIB EQU   PCCACHRB
PCCACTIB EQU   PCCACHRB
PCCACINB EQU   PCCACHRB
PCCACSIB EQU   PCCACHRB
PCCARV51 EQU   PCCACHS2
PCCARV50 EQU   PCCACHS2
PCCARV49 EQU   PCCACHS2
PCCACURC EQU   PCCACHS2
PCCACNLG EQU   PCCACHS2
PCCACMOD EQU   PCCACHS2
PCCACALT EQU   PCCACHS2
PCCACIOR EQU   PCCACHS2
PCCARV47 EQU   PCCACHS1
PCCACUCB EQU   PCCACHS1
PCCACIBC EQU   PCCACHS1
PCCACAND EQU   PCCACHS1
PCCACNLS EQU   PCCACHS1
PCCACFRR EQU   PCCACHS1
PCCACNRE EQU   PCCACHS1
PCCACCMP EQU   PCCACHS1
PCCACSEQ EQU   PCCACHTS
PCCACDIN EQU   PCCACHTS
PCCARV44 EQU   PCCACHTS
PCCARV43 EQU   PCCACHTS
PCCACTEC EQU   PCCACHTS
PCCACDAV EQU   PCCACHVA
PCCACCHV EQU   PCCACHVA
PCCACCMD EQU   PCCACHVA
PCCACUNS EQU   PCCACHVA
PCCACSQV EQU   PCCACHVA
PCCARV42 EQU   PCCACHVA
PCCARV41 EQU   PCCACHVA
PCCACITF EQU   PCCACHVA
PCCARV40 EQU   PCCACHBL
PCCARV39 EQU   PCCACHBL
PCCARV38 EQU   PCCACHBL
PCCACCUE EQU   PCCACHBL
PCCACSTG EQU   PCCACHBL
PCCACSCU EQU   PCCACHBL
PCCACCHA EQU   PCCACHBL
PCCACCPU EQU   PCCACHBL
PCCACNOR EQU   PCCACHPF
PCCACCNT EQU   PCCACHPF
PCCACSNS EQU   PCCACHPF
PCCARV37 EQU   PCCACHPF
PCCACHIO EQU   PCCACHPF
PCCACTIO EQU   PCCACHPF
PCCACINT EQU   PCCACHPF
PCCACSIO EQU   PCCACHPF
PCCACHUB EQU   PCCAWERP
PCCACHEL EQU   PCCA+168
PCCALRBR EQU   PCCA+164
PCCALRBV EQU   PCCA+160
PCCAPWAR EQU   PCCA+156
PCCAPWAV EQU   PCCA+152
PCCAEMSA EQU   PCCAEMSB+12
PCCAEMSE EQU   PCCAEMSB+8
PCCAEMSP EQU   PCCAEMSB+4
PCCARMS  EQU   PCCARMSB
PCCARV34 EQU   PCCARMSB
PCCARV33 EQU   PCCARMSB
PCCARV32 EQU   PCCARMSB
PCCARV31 EQU   PCCARMSB
PCCARV30 EQU   PCCARMSB
PCCARV29 EQU   PCCARMSB
PCCARV28 EQU   PCCARMSB
PCCARV27 EQU   PCCAEMS3
PCCARV26 EQU   PCCAEMS3
PCCARV25 EQU   PCCAEMS3
PCCARV24 EQU   PCCAEMS3
PCCARV23 EQU   PCCAEMS3
PCCARV22 EQU   PCCAEMS3
PCCARV21 EQU   PCCAEMS3
PCCARV20 EQU   PCCAEMS3
PCCARV19 EQU   PCCAEMS2
PCCARV18 EQU   PCCAEMS2
PCCARV17 EQU   PCCAEMS2
PCCARV16 EQU   PCCAEMS2
PCCARV15 EQU   PCCAEMS2
PCCARV14 EQU   PCCAEMS2
PCCARV13 EQU   PCCAEMS2
PCCARV12 EQU   PCCAEMS2
PCCARV11 EQU   PCCARISP
PCCARV10 EQU   PCCARISP
PCCARV09 EQU   PCCARISP
PCCARV08 EQU   PCCARISP
PCCARV07 EQU   PCCARISP
PCCARV06 EQU   PCCARISP
PCCASERL EQU   PCCARISP
PCCAPARL EQU   PCCARISP
PCCARPB  EQU   PCCA+132
PCCACTIN EQU   PCCAINTE
PCCANFIN EQU   PCCAINTE
PCCANUIN EQU   PCCAINTE
PCCACTCC EQU   PCCACCE
PCCANFCC EQU   PCCACCE
PCCANUCC EQU   PCCACCE
PCCACTTD EQU   PCCATODE
PCCANFTD EQU   PCCATODE
PCCANUTD EQU   PCCATODE
PCCARV04 EQU   PCCATMFL
PCCARV03 EQU   PCCATMFL
PCCARV02 EQU   PCCATMFL
PCCAMINT EQU   PCCATMFL
PCCAMCC  EQU   PCCATMFL
PCCAVKIL EQU   PCCATMFL
PCCASYNC EQU   PCCATMFL
PCCAINIT EQU   PCCATMFL
PCCARV9E EQU   PCCA+124
PCCARV9D EQU   PCCA+120
PCCARV9C EQU   PCCA+116
PCCARV9B EQU   PCCA+112
PCCARV9A EQU   PCCA+108
PCCARV99 EQU   PCCA+104
PCCARV98 EQU   PCCA+100
PCCARV97 EQU   PCCA+96
PCCARV96 EQU   PCCA+92
PCCARV95 EQU   PCCA+88
PCCARV94 EQU   PCCA+84
PCCARV93 EQU   PCCA+80
PCCARV92 EQU   PCCA+76
PCCARV91 EQU   PCCA+72
PCCARV90 EQU   PCCA+68
PCCARV89 EQU   PCCA+64
PCCARV88 EQU   PCCA+60
PCCARV87 EQU   PCCA+56
PCCARV86 EQU   PCCA+52
PCCARV85 EQU   PCCA+48
PCCARV84 EQU   PCCA+44
PCCARV83 EQU   PCCA+40
PCCARV82 EQU   PCCA+36
PCCARV81 EQU   PCCA+32
PCCAPSAR EQU   PCCA+28
PCCAPSAV EQU   PCCA+24
PCCACAFM EQU   PCCA+18
PCCACPUA EQU   PCCA+16
PCCACPID EQU   PCCA+4
PCCAPCCA EQU   PCCA
MCHEADTR EQU   MCHEAD+48
MCHEADRD EQU   MCHEAD+44
MCHFRRAD EQU   MCHEAD+40
MCHMCER  EQU   MCHEAD+36
@NM00012 EQU   MCHFLGS+1
@NM00011 EQU   MCHFLG1
MCHTERM  EQU   MCHFLG1
MCHACT   EQU   MCHFLG1
MCHDIS   EQU   MCHEAD+20
MCHCTL   EQU   MCHEAD+16
MCHCNT   EQU   MCHEAD+12
MCHCUR   EQU   MCHEAD+8
MCHIDEN  EQU   MCHEAD
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
LCCAR125 EQU   LCCA+964
LCCAR124 EQU   LCCA+960
LCCAR123 EQU   LCCA+956
LCCAR122 EQU   LCCA+952
LCCAR121 EQU   LCCA+948
LCCAR120 EQU   LCCA+944
LCCAR119 EQU   LCCA+940
LCCAR118 EQU   LCCA+936
LCCAR117 EQU   LCCA+932
LCCAR116 EQU   LCCA+928
LCCAR115 EQU   LCCA+924
LCCAR114 EQU   LCCA+920
LCCAR113 EQU   LCCA+916
LCCAR112 EQU   LCCA+912
LCCAR111 EQU   LCCA+908
LCCAR110 EQU   LCCA+904
LCCAR109 EQU   LCCA+900
LCCAR108 EQU   LCCA+896
LCCADRT2 EQU   LCCA+888
LCCADRT1 EQU   LCCA+880
LCCAR103 EQU   LCCA+876
LCCAESS2 EQU   LCCA+872
LCCASPLJ EQU   LCCA+868
LCCASMQJ EQU   LCCA+864
LCCAIRT  EQU   LCCA+736
LCCARV90 EQU   LCCA+732
LCCARV89 EQU   LCCA+728
LCCAPGTA EQU   LCCASRBF+2
LCCASAFN EQU   LCCASRBF
LCCAECSA EQU   LCCA+716
LCCAICR0 EQU   LCCA+712
LCCALWTM EQU   LCCA+704
LCCARV78 EQU   LCCA+700
LCCAPINV EQU   LCCA+696
LCCARV88 EQU   LCCA+695
LCCARV87 EQU   LCCALKFG
LCCARV86 EQU   LCCALKFG
LCCARV85 EQU   LCCALKFG
LCCARV84 EQU   LCCALKFG
LCCALKRD EQU   LCCALKFG
LCCALKAQ EQU   LCCALKFG
LCCALKSA EQU   LCCALKFG
LCCALKDP EQU   LCCALKFG
LCCACRST EQU   LCCACREX
LCCACRDP EQU   LCCACREX
LCCACRLM EQU   LCCACREX
LCCACRIN EQU   LCCACREX
LCCACRRT EQU   LCCACREX
LCCACRLE EQU   LCCACREX
LCCACRRM EQU   LCCACREX
LCCACREF EQU   LCCACREX
LCCAVARY EQU   LCCACRFL
LCCARV73 EQU   LCCACRFL
LCCARV72 EQU   LCCACRFL
LCCARV71 EQU   LCCACRFL
LCCARV70 EQU   LCCACRFL
LCCARV69 EQU   LCCACRFL
LCCACLMS EQU   LCCACRFL
LCCACRTM EQU   LCCACRFL
LCCALCR0 EQU   LCCA+688
LCCACRLC EQU   LCCA+684
LCCARCPU EQU   LCCA+680
LCCADCPU EQU   LCCA+676
LCCASRBJ EQU   LCCA+672
LCCADSSR EQU   LCCA+668
LCCADSSC EQU   LCCA+660
LCCADSS3 EQU   LCCA+648
LCCADSS2 EQU   LCCA+636
LCCADSS1 EQU   LCCA+624
LCCAWTIM EQU   LCCA+616
LCCAITOD EQU   LCCA+608
LCCADTOD EQU   LCCA+600
LCCASTOD EQU   LCCA+592
LCCARIR5 EQU   LCCASPSA+44
LCCARIR4 EQU   LCCASPSA+40
LCCARIR3 EQU   LCCASPSA+36
LCCARIR2 EQU   LCCASPSA+32
LCCARPR5 EQU   LCCASPSA+28
LCCARPR4 EQU   LCCASPSA+24
LCCARPR3 EQU   LCCASPSA+20
LCCARPR2 EQU   LCCASPSA+16
LCCADSR5 EQU   LCCASPSA+12
LCCADSR4 EQU   LCCASPSA+8
LCCADSR3 EQU   LCCASPSA+4
LCCADSR2 EQU   LCCASPSA
LCCARV68 EQU   LCCA+543
LCCAPSMK EQU   LCCA+542
LCCARV67 EQU   LCCADSF2
LCCARV66 EQU   LCCADSF2
LCCARV65 EQU   LCCADSF2
LCCARV64 EQU   LCCADSF2
LCCADSRW EQU   LCCADSF2
LCCADSPL EQU   LCCADSF2
LCCAGSRB EQU   LCCADSF2
LCCARV61 EQU   LCCADSF1
LCCARV60 EQU   LCCADSF1
LCCARV59 EQU   LCCADSF1
LCCARV58 EQU   LCCADSF1
LCCATIMR EQU   LCCADSF1
LCCADSS  EQU   LCCADSF1
LCCAVCPU EQU   LCCADSF1
LCCAACR  EQU   LCCADSF1
LCCAASCP EQU   LCCA+532
LCCAESSA EQU   LCCA+528
LCCARV55 EQU   LCCASPN4
LCCARV54 EQU   LCCASPN4
LCCARV53 EQU   LCCASPN4
LCCARV52 EQU   LCCASPN4
LCCARV51 EQU   LCCASPN4
LCCARV50 EQU   LCCASPN4
LCCARV49 EQU   LCCASPN4
LCCARV48 EQU   LCCASPN4
LCCARV47 EQU   LCCASPN3
LCCARV46 EQU   LCCASPN3
LCCARV45 EQU   LCCASPN3
LCCARV44 EQU   LCCASPN3
LCCARV43 EQU   LCCASPN3
LCCARV42 EQU   LCCASPN3
LCCARV41 EQU   LCCASPN3
LCCARV40 EQU   LCCASPN3
LCCARV39 EQU   LCCASPN2
LCCARV38 EQU   LCCASPN2
LCCARV37 EQU   LCCASPN2
LCCARV36 EQU   LCCASPN2
LCCARV35 EQU   LCCASPN2
LCCARV34 EQU   LCCASPN2
LCCARV33 EQU   LCCASPN2
LCCARV32 EQU   LCCASPN2
LCCARV31 EQU   LCCASPN1
LCCARV30 EQU   LCCASPN1
LCCAMFIO EQU   LCCASPN1
LCCARSTR EQU   LCCASPN1
LCCATSPN EQU   LCCASPN1
LCCALOCK EQU   LCCASPN1
LCCASIGP EQU   LCCASPN1
LCCAPTLB EQU   LCCASPN1
LCCARV27 EQU   LCCAIHR4
LCCARV26 EQU   LCCAIHR4
LCCARV25 EQU   LCCAIHR4
LCCARV24 EQU   LCCAIHR4
LCCARV23 EQU   LCCAIHR4
LCCARV22 EQU   LCCAIHR4
LCCARV21 EQU   LCCAIHR4
LCCARV20 EQU   LCCAIHR4
LCCARV19 EQU   LCCAIHR3
LCCARV18 EQU   LCCAIHR3
LCCARV17 EQU   LCCAIHR3
LCCARV16 EQU   LCCAIHR3
LCCARV15 EQU   LCCAIHR3
LCCARV14 EQU   LCCAIHR3
LCCARV13 EQU   LCCAIHR3
LCCARV12 EQU   LCCAIHR3
LCCARV11 EQU   LCCAIHR2
LCCARV10 EQU   LCCAIHR2
LCCARV09 EQU   LCCAIHR2
LCCARV08 EQU   LCCAIHR2
LCCARV07 EQU   LCCAIHR2
LCCARV06 EQU   LCCAIHR2
LCCARV05 EQU   LCCAIHR2
LCCARV04 EQU   LCCAIHR2
LCCARV03 EQU   LCCAIHR1
LCCARV02 EQU   LCCAIHR1
LCCARV01 EQU   LCCAIHR1
LCCAPPIE EQU   LCCAIHR1
LCCAPSG1 EQU   LCCAIHR1
LCCAPDAT EQU   LCCAIHR1
LCCAXRC2 EQU   LCCAIHR1
LCCAXRC1 EQU   LCCAIHR1
LCCAIOPS EQU   LCCA+512
LCCAGPGR EQU   LCCA+448
LCCARSFP EQU   LCCA+416
LCCARSGR EQU   LCCA+352
LCCAXGR3 EQU   LCCA+288
LCCAXGR2 EQU   LCCA+224
LCCAXGR1 EQU   LCCA+160
LCCACR0  EQU   LCCA+156
LCCAMCR1 EQU   LCCA+152
LCCARV77 EQU   LCCA+6
LCCACPUA EQU   LCCA+4
LCCALCCA EQU   LCCA
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00007 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00006 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00004 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSGLC5  EQU   IOSFLC
IOSFLC4  EQU   IOSFLC
IOSFLC3  EQU   IOSFLC
IOSFLC2  EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSFLB1  EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSFLA6  EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
ASVTEND  EQU   ASVT+528
ASVTAVAL EQU   ASVTENTY
ASVTAVAI EQU   ASVTFRST
ASVTRS00 EQU   ASVT+520
ASVTMAXU EQU   ASVT+516
ASVTASVT EQU   ASVT+512
ASVTBEGN EQU   ASVT+512
@NM00003 EQU   ASVT
@NM00002 EQU   SRB+40
@NM00001 EQU   SRB+38
SRBPRIOR EQU   SRB+37
SRBPKF   EQU   SRB+36
SRBSAVE  EQU   SRB+32
SRBPARM  EQU   SRB+28
SRBRMTR  EQU   SRB+24
SRBEP    EQU   SRB+20
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRB+8
SRBFLNK  EQU   SRB+4
SRBID    EQU   SRB
@NM00037 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00036 EQU   PSA+1032
PSAUSEND EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSARV054 EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00035 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00034 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSAPCCAR EQU   PSA+524
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00033 EQU   FLCFSA
@NM00032 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00031 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00030 EQU   FLCIOA
@NM00029 EQU   FLCMCLA+15
@NM00028 EQU   FLCMCLA+14
@NM00027 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00026 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00025 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00024 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00023 EQU   FLCPER
@NM00022 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00021 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00020 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00019 EQU   FLCPIILC
@NM00018 EQU   PSAEPPSW
FLCSILCB EQU   FLCSVILC
@NM00017 EQU   FLCSVILC
@NM00016 EQU   PSAESPSW
PSASPAD  EQU   PSAEEPSW
@NM00015 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCMOPSW EQU   PSA+48
@NM00014 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RT00204 EQU   AHLPSCM1
@RT00206 EQU   AHLPSCM2
@RT00259 EQU   AHLPSCM2
@RC00274 EQU   AHLPSTCM
@RC00279 EQU   AHLPSTCM
@RC00308 EQU   AHLPSTCM
@RT00355 EQU   AHLPSCM2
@RT00377 EQU   AHLPSCM2
@RT00400 EQU   AHLPSCM2
@RC00488 EQU   @RC00487
@RC00514 EQU   @RC00513
@RF00533 EQU   @EL00003
@RF00698 EQU   FRRGEN
@RC00837 EQU   RETRYP
@RC00844 EQU   RETRYP
@RF00850 EQU   FRRGEN
@ENDDATA EQU   *
         END   AHLTSYSM,(C'PL/S-II',0502,74032)
