//GREGZ030 JOB SYS,'USERMOD ZP60030',CLASS=A,REGION=4096K,
//             MSGLEVEL=(1,1),MSGCLASS=X,COND=(0,NE),NOTIFY=GREG
//*
//*  CORRECT MF/1 CHANNEL MEASUREMENT AND LOGGING TO SMF (TYPE 73).
//*
//STEP01  EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  *
++USERMOD(ZP60030)       /* FIX MF/1 CHANNEL MEASUREMENT */  .
++VER(Z038) FMID(EMF1102)
 /*
   PROBLEM DESCRIPTION:
     MF/1 DOES NOT CORRECTLY ACCESS THE CHANNEL AVAILABILITY TABLE.
       THE CHANNEL AVAILABILITY TABLE (CAT) HAS MOVED FROM THE
       PCCA (WHERE THERE WAS ONE FOR EACH ACTIVE CPU) TO COMMON
       STORAGE (SQA).  FURTHER, CAT ENTRIES HAVE BEEN EXTENDED
       FROM EIGHT BYTES IN LENGTH TO SIXTEEN BYTES IN LENGTH.

       THIS USERMOD UPDATES THE MF/1 CHANNEL SAMPLING MODULE
       IRBMFECH AND THE MF/1 CHANNEL INITIALIZATION MODULE
       IRBMFIHA TO CORRECT ACCESS CAT ENTRIES.

       A CONSEQUENCE OF THIS IS THAT TYPE 73 SMF RECORDS WILL
       NOW CONTAIN NON-ZERO CHANNEL DATA.

   SPECIAL CONDITIONS:
     ACTION:
       A "CLPA" MUST BE PERFORMED AT IPL TIME FOR THIS SYSMOD TO
       BECOME ACTIVE.

   COMMENTS:
     PRYCROFT SIX P/L PUBLIC DOMAIN USERMOD FOR MVS 3.8 NUMBER 30.

     REWORK HISTORY:
       2011-01-30: INITIAL VERSION.

     THE FOLLOWING MODULES AND/OR MACROS ARE AFFECTED BY THIS USERMOD:
     MODULES:
       IRBMFECH
       IRBMFIHA
 */.
++MOD(IRBMFECH) DISTLIB(ALPALIB).
/*
//SYSUT2   DD  DSN=&&SMPMCS,DISP=(NEW,PASS),UNIT=VIO,SPACE=(CYL,3),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=4080)
//SYSIN    DD  DUMMY
//STEP02  EXEC PGM=IFOX00,PARM='OBJECT,NODECK,NOTERM,XREF(SHORT)'
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.SMPMTS,DISP=SHR
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1   DD  UNIT=VIO,SPACE=(CYL,10)
//SYSUT2   DD  UNIT=VIO,SPACE=(CYL,10)
//SYSUT3   DD  UNIT=VIO,SPACE=(CYL,10)
//SYSGO    DD  DSN=&&SMPMCS,DISP=(MOD,PASS)
//SYSIN    DD  *
         TITLE '*/* IRBMFECH - CHANNEL SAMPLING MODULE                 *
                       '
IRBMFECH CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IRBMFECH  74.086'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @09,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@09                                         0001
*                                                                  0022
*/* BEGIN MAINLINE PROCESSING                                        */
*                                                                  0022
*   ECCESAMP=ECCESAMP+1;            /* INCREMENT SAMPLES             */
*                                                                  0022
         LA    @12,1                                               0022
         AL    @12,ECCESAMP(,ECCEDPTR)                             0022
         ST    @12,ECCESAMP(,ECCEDPTR)                             0022
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP THROUGH ALL CDBS FOR VALID CPES AND SAMPLE SIOS. IF CPU  */
*   /* IS THIS ONE, ALSO SAMPLE BUSY AND CPU OVERLAP. IF NOT, SIGNAL */
*   /* THAT CPU TO COLLECT THAT INFORMATION MACDATE Y-2 73018        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0023
*   RESPECIFY                                                      0023
*    (ECCPEPTR,                                                    0023
*     ECCDBPTR)RESTRICTED;                                         0023
*                                                                  0023
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP THROUGH CPES                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0024
*   DO ECCPEPTR=ECCECPEQ BY LENGTH(ECCPE)TO ECCECPEQ+(ECCECPUS-1)* 0024
*         LENGTH(ECCPE);                                           0024
         L     ECCPEPTR,ECCECPEQ(,ECCEDPTR)                        0024
         B     @DE00024                                            0024
@DL00024 DS    0H                                                  0025
*     IF ECCPVALD='0'B THEN                                        0025
         TM    ECCPVALD(ECCPEPTR),B'00000001'                      0025
         BZ    @RT00025                                            0025
*       GO TO ECLAB4;               /* SKIP DATA COLLECTION IF     0026
*                                      INVALID CPU ENTRY             */
*                                                                  0026
*     /***************************************************************/
*     /*                                                             */
*     /* ESTABLISH ADDRESSABILITY TO PCCA MACDATE Y-2 73018          */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0027
*     RESPECIFY                                                    0027
*      (PCCAPTR)RESTRICTED;                                        0027
*     PCCAPTR=PCCAT00P(((ECCPEPTR-ECCECPEQ)/LENGTH(ECCPE))+1);     0028
         LA    @12,8                                               0028
         LR    @08,ECCPEPTR                                        0028
         S     @08,ECCECPEQ(,ECCEDPTR)                             0028
         LR    PCCAPTR,@08                                         0028
         SRDA  PCCAPTR,32                                          0028
         DR    PCCAPTR,@12                                         0028
         SLA   @05,2                                               0028
         L     @15,CVTPTR                                          0028
         L     @15,CVTPCCAT(,@15)                                  0028
         L     PCCAPTR,PCCAT00P(@05,@15)                           0028
*     IF((ECCPEPTR-ECCECPEQ)/LENGTH(ECCPE))=PSACPUSA THEN          0029
*                                                                  0029
         LR    @06,@08                                             0029
         SRDA  @06,32                                              0029
         DR    @06,@12                                             0029
         CH    @07,PSACPUSA                                        0029
         BNE   @RF00029                                            0029
*       /*************************************************************/
*       /*                                                           */
*       /* THIS CPE REPRESENTS THE CURRENT CPU                       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0030
*       DO;                                                        0030
*                                                                  0030
*         /***********************************************************/
*         /*                                                         */
*         /* LOOP THROUGH CDBS                                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0031
*         DO ECCDBPTR=ECCPCDBQ BY LENGTH(ECCDB)TO ECCPCDBQ+(ECCPCNUM-1)
*               *LENGTH(ECCDB);                                    0031
         L     ECCDBPTR,ECCPCDBQ(,ECCPEPTR)                        0031
         B     @DE00031                                            0031
@DL00031 DS    0H                                                  0032
*           IF ECCDVALD='0'B THEN                                  0032
         TM    ECCDVALD(ECCDBPTR),B'00000100'                      0032
         BZ    @RT00032                                            0032
*             GO TO ECLAB2;         /* SKIP DATA COLLECTION IF     0033
*                                      INVALID CHANNEL ENTRY         */
*                                                                  0033
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0034
*           RESPECIFY                                              0034
*            (ECWRKRG1,                                            0034
*             ECWRKRG2,                                            0034
*             CATPTR)RESTRICTED;                                   0034
*                                                                  0034
*           /*********************************************************/
*           /*                                                       */
*           /* ESTABLISH ADDRESSABILITY TO CAT ENTRY                 */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0035
*           CATPTR=ADDR(PCCACAT)+((ECCDBPTR-ECCPCDBQ)/LENGTH(ECCDB))*
*               LENGTH(CAT);                                       0035
**       LA    CATPTR,PCCACAT(,PCCAPTR)                        @ZP60030
         L     CATPTR,CVTPTR                                   @ZP60030
         L     CATPTR,1052(,CATPTR) <=CVTCST                   @ZP60030
         L     CATPTR,0(,CATPTR)                               @ZP60030
         LR    @10,ECCDBPTR                                        0035
         S     @10,ECCPCDBQ(,ECCPEPTR)                             0035
         SRDA  @10,32                                              0035
         D     @10,@CF01349                                        0035
         SLA   @11,4                   WAS 3                   @ZP60030
         AR    CATPTR,@11                                          0035
*           ECWRKRG1=CATSIOCT;      /* GET CURRENT SIO READING       */
*                                                                  0036
         SR    ECWRKRG1,ECWRKRG1                                   0036
         ICM   ECWRKRG1,3,CATSIOCT(CATPTR)                         0036
*           /*********************************************************/
*           /*                                                       */
*           /* GET LAST SIO READING                                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0037
*           ECWRKRG2=ECCDLSIO;                                     0037
*                                                                  0037
         SR    ECWRKRG2,ECWRKRG2                                   0037
         ICM   ECWRKRG2,3,ECCDLSIO(ECCDBPTR)                       0037
*           /*********************************************************/
*           /*                                                       */
*           /* SAVE NEW READING                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0038
*           ECCDLSIO=ECWRKRG1;                                     0038
*                                                                  0038
         STH   ECWRKRG1,ECCDLSIO(,ECCDBPTR)                        0038
*           /*********************************************************/
*           /*                                                       */
*           /* SUBTRACT OLD SIO COUNT FROM NEW OBSERVATION           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0039
*           ECWRKRG1=ECWRKRG1-ECWRKRG2;                            0039
*                                                                  0039
         SR    ECWRKRG1,ECWRKRG2                                   0039
*           /*********************************************************/
*           /*                                                       */
*           /* COMPENSATE FOR POSSIBLE WRAPAROUND                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0040
*           ECWRKRG1=ECWRKRG1&ECKILLHI;                            0040
*                                                                  0040
         N     ECWRKRG1,@CF01329                                   0040
*           /*********************************************************/
*           /*                                                       */
*           /* ADD ACCUMULATOR TO SIOS SINCE LAST SAMPLE             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0041
*           ECWRKRG1=ECWRKRG1+ECCDSIOS;                            0041
*                                                                  0041
         AL    ECWRKRG1,ECCDSIOS(,ECCDBPTR)                        0041
*           /*********************************************************/
*           /*                                                       */
*           /* STORE NEW ACCUMULATED SIOS                            */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0042
*           ECCDSIOS=ECWRKRG1;                                     0042
*                                                                  0042
         ST    ECWRKRG1,ECCDSIOS(,ECCDBPTR)                        0042
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0043
*           RESPECIFY                                              0043
*            (ECWRKRG1,                                            0043
*             ECWRKRG2,                                            0043
*             CATPTR)UNRESTRICTED;                                 0043
*           IF ECCDALIV='0'B×ECCDCTYP=MULTPLEX THEN                0044
         TM    ECCDALIV(ECCDBPTR),B'00000001'                      0044
         BZ    @RT00044                                            0044
         TM    ECCDCTYP(ECCDBPTR),B'00010000'                      0044
         BNO   @RF00044                                            0044
         TM    ECCDCTYP(ECCDBPTR),B'11100000'                      0044
         BZ    @RT00044                                            0044
*             GO TO ECLAB2;         /* DONT COLLECT IF OFFLINE OR  0045
*                                      BYTE MULTIPLEXOR              */
*                                                                  0045
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0046
*           RESPECIFY                                              0046
*            (ECWRKRG1)RESTRICTED;                                 0046
*                                                                  0046
@RF00044 DS    0H                                                  0047
*           /*********************************************************/
*           /*                                                       */
*           /* CHANNEL ADDRESS TO WORK REGISTER                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0047
*           ECWRKRG1=(ECCDBPTR-ECCPCDBQ)/LENGTH(ECCDB);            0047
         LR    ECWRKRG1,ECCDBPTR                                   0047
         S     ECWRKRG1,ECCPCDBQ(,ECCPEPTR)                        0047
         SRDA  ECWRKRG1,32                                         0047
         D     ECWRKRG1,@CF01349                                   0047
         LR    ECWRKRG1,@07                                        0047
*           ECWRKRG1=ECWRKRG1*256;  /* SHIFT LEFT 8 TO PUT ADDRESS 0048
*                                      INTO BIT POSITIONS 16 - 23    */
         SLL   ECWRKRG1,8                                          0048
*           TCH(ECWRKRG1);          /* ISSUE TCH INSTRUCTION         */
         TCH   0(ECWRKRG1)                                         0049
*           BC(13,ECLAB2);          /* BRANCH IF NOT BUSY            */
*                                                                  0050
         BC    13,ECLAB2                                           0050
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0051
*           RESPECIFY                                              0051
*            (ECWRKRG1)UNRESTRICTED;                               0051
*                                                                  0051
*           /*********************************************************/
*           /*                                                       */
*           /* INCREMENT BUSY SAMPLES FOR THIS CHANNEL               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0052
*           ECCDBUSY=ECCDBUSY+1;                                   0052
         LA    @12,1                                               0052
         L     @08,ECCDBUSY(,ECCDBPTR)                             0052
         ALR   @08,@12                                             0052
         ST    @08,ECCDBUSY(,ECCDBPTR)                             0052
*           IF PSATOLD=CVTWTCB THEN                                0053
*                                                                  0053
         L     @08,CVTPTR                                          0053
         CLC   PSATOLD(4),CVTWTCB(@08)                             0053
         BNE   @RF00053                                            0053
*             /*******************************************************/
*             /*                                                     */
*             /* THE CPU WAS WAITING WHEN IT TOOK THE INTERRUPT.     */
*             /* INCREMENT OVERLAP SAMPLES                           */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0054
*             ECCDOLAP=ECCDOLAP+1;                                 0054
         AL    @12,ECCDOLAP(,ECCDBPTR)                             0054
         ST    @12,ECCDOLAP(,ECCDBPTR)                             0054
*ECLAB2:                            /* END OF ALL DATA COLLECTION FOR
*                                      A CHANNEL ON CURRENT CPU      */
*         END;                                                     0055
@RF00053 DS    0H                                                  0055
ECLAB2   AH    ECCDBPTR,@CH01349                                   0055
@DE00031 LH    @12,ECCPCNUM(,ECCPEPTR)                             0055
         BCTR  @12,0                                               0055
         MH    @12,@CH01349                                        0055
         A     @12,ECCPCDBQ(,ECCPEPTR)                             0055
         CR    ECCDBPTR,@12                                        0055
         BNH   @DL00031                                            0055
*       END;                                                       0056
*     ELSE                          /* THIS CPU IS NOT THE CURRENT 0057
*                                      CPU                           */
*       DO;                                                        0057
*                                                                  0057
         B     @RC00029                                            0057
@RF00029 DS    0H                                                  0058
*         /***********************************************************/
*         /*                                                         */
*         /* SIGNAL THAT PROCESSOR WITH REMOTE PENDING INTERRUPT     */
*         /* MACDATE Y-2 73018                                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0058
*         RESPECIFY                                                0058
*          (ECWRKRG1,                                              0058
*           GPR00P,                                                0058
*           GPR14P,                                                0058
*           GPR15P)RESTRICTED;                                     0058
*         ECWRKRG1=GPR01P;          /* SAVE CEDT ADDRESS ACROSS    0059
*                                      INTERFACE                     */
*                                                                  0059
         LR    ECWRKRG1,GPR01P                                     0059
*         /***********************************************************/
*         /*                                                         */
*         /* PCCA ADDRESS TO REGISTER                                */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0060
*         GPR01P=PCCAPTR;                                          0060
         LR    GPR01P,PCCAPTR                                      0060
*         GENERATE(RPSGNL MF1TCH,CPU=(1));                         0061
         RPSGNL MF1TCH,CPU=(1)
*         GPR01P=ECWRKRG1;          /* RESTORE REG 1                 */
*                                                                  0062
         LR    GPR01P,ECWRKRG1                                     0062
*         /***********************************************************/
*         /*                                                         */
*         /* MACDATE Y-2 73018                                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0063
*         RESPECIFY                                                0063
*          (ECWRKRG1,                                              0063
*           GPR00P,                                                0063
*           GPR14P,                                                0063
*           GPR15P)UNRESTRICTED;                                   0063
*                                                                  0063
*         /***********************************************************/
*         /*                                                         */
*         /* LOOP THROUGH CDBS                                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0064
*         DO ECCDBPTR=ECCPCDBQ BY LENGTH(ECCDB)TO ECCPCDBQ+(ECCPCNUM-1)
*               *LENGTH(ECCDB);                                    0064
         L     ECCDBPTR,ECCPCDBQ(,ECCPEPTR)                        0064
         B     @DE00064                                            0064
@DL00064 DS    0H                                                  0065
*           IF ECCDVALD='0'B THEN                                  0065
         TM    ECCDVALD(ECCDBPTR),B'00000100'                      0065
         BZ    @RT00065                                            0065
*             GO TO ECLAB3;         /* SKIP DATA COLLECTION IF     0066
*                                      INVALID CHANNEL ENTRY         */
*                                                                  0066
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0067
*           RESPECIFY                                              0067
*            (ECWRKRG1,                                            0067
*             ECWRKRG2,                                            0067
*             CATPTR)RESTRICTED;                                   0067
*                                                                  0067
*           /*********************************************************/
*           /*                                                       */
*           /* ESTABLISH ADDRESSABILITY TO CAT ENTRY                 */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0068
*           CATPTR=ADDR(PCCACAT)+((ECCDBPTR-ECCPCDBQ)/LENGTH(ECCDB))*
*               LENGTH(CAT);                                       0068
**       LA    CATPTR,PCCACAT(,PCCAPTR)                        @ZP60030
         L     CATPTR,CVTPTR                                   @ZP60030
         L     CATPTR,1052(,CATPTR) <=CVTCST                   @ZP60030
         L     CATPTR,0(,CATPTR)                               @ZP60030
         LR    @10,ECCDBPTR                                        0068
         S     @10,ECCPCDBQ(,ECCPEPTR)                             0068
         SRDA  @10,32                                              0068
         D     @10,@CF01349                                        0068
         SLA   @11,4                   WAS 3                   @ZP60068
         AR    CATPTR,@11                                          0068
*           ECWRKRG1=CATSIOCT;      /* GET CURRENT SIO READING       */
*                                                                  0069
         SR    ECWRKRG1,ECWRKRG1                                   0069
         ICM   ECWRKRG1,3,CATSIOCT(CATPTR)                         0069
*           /*********************************************************/
*           /*                                                       */
*           /* GET LAST SIO READING                                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0070
*           ECWRKRG2=ECCDLSIO;                                     0070
*                                                                  0070
         SR    ECWRKRG2,ECWRKRG2                                   0070
         ICM   ECWRKRG2,3,ECCDLSIO(ECCDBPTR)                       0070
*           /*********************************************************/
*           /*                                                       */
*           /* SAVE NEW READING                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0071
*           ECCDLSIO=ECWRKRG1;                                     0071
*                                                                  0071
         STH   ECWRKRG1,ECCDLSIO(,ECCDBPTR)                        0071
*           /*********************************************************/
*           /*                                                       */
*           /* SUBTRACT OLD SIO COUNT FROM NEW OBSERVATION           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0072
*           ECWRKRG1=ECWRKRG1-ECWRKRG2;                            0072
*                                                                  0072
         SR    ECWRKRG1,ECWRKRG2                                   0072
*           /*********************************************************/
*           /*                                                       */
*           /* COMPENSATE FOR POSSIBLE WRAPAROUND                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0073
*           ECWRKRG1=ECWRKRG1&ECKILLHI;                            0073
*                                                                  0073
         N     ECWRKRG1,@CF01329                                   0073
*           /*********************************************************/
*           /*                                                       */
*           /* ADD ACCUMULATOR TO SIOS SINCE LAST SAMPLE             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0074
*           ECWRKRG1=ECWRKRG1+ECCDSIOS;                            0074
*                                                                  0074
         AL    ECWRKRG1,ECCDSIOS(,ECCDBPTR)                        0074
*           /*********************************************************/
*           /*                                                       */
*           /* STORE NEW ACCUMULATED SIOS                            */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0075
*           ECCDSIOS=ECWRKRG1;                                     0075
*                                                                  0075
         ST    ECWRKRG1,ECCDSIOS(,ECCDBPTR)                        0075
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0076
*           RESPECIFY                                              0076
*            (ECWRKRG1,                                            0076
*             ECWRKRG2,                                            0076
*             CATPTR)UNRESTRICTED;                                 0076
*ECLAB3:                            /* END OF SIO DATA COLLECTION FOR
*                                      A CHANNEL ON NOT - CURRENT CPU*/
*         END;                                                     0077
ECLAB3   AH    ECCDBPTR,@CH01349                                   0077
@DE00064 LH    @12,ECCPCNUM(,ECCPEPTR)                             0077
         BCTR  @12,0                                               0077
         MH    @12,@CH01349                                        0077
         A     @12,ECCPCDBQ(,ECCPEPTR)                             0077
         CR    ECCDBPTR,@12                                        0077
         BNH   @DL00064                                            0077
*       END;                                                       0078
*                                                                  0078
*     /***************************************************************/
*     /*                                                             */
*     /* MACDATE Y-2 73018                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0079
*     RESPECIFY                                                    0079
*      (PCCAPTR)UNRESTRICTED;                                      0079
@RC00029 DS    0H                                                  0080
*ECLAB4:                            /* END OF ALL DATA COLLECTION FOR
*                                      ANY CPU                       */
*   END;                                                           0080
*                                                                  0080
ECLAB4   AH    ECCPEPTR,@CH00040                                   0080
@DE00024 SR    @12,@12                                             0080
         IC    @12,ECCECPUS(,ECCEDPTR)                             0080
         BCTR  @12,0                                               0080
         SLA   @12,3                                               0080
         A     @12,ECCECPEQ(,ECCEDPTR)                             0080
         CR    ECCPEPTR,@12                                        0080
         BNH   @DL00024                                            0080
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0081
*   RESPECIFY                                                      0081
*    (ECCPEPTR,                                                    0081
*     ECCDBPTR)UNRESTRICTED;                                       0081
*                                                                  0081
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK TO SEE IF IT IS TIME FOR A CONFIGURATION CHECK. IF SO,  */
*   /* CHECK EACH CHANNELS CONFIGURATION. IF ANOTHER CPU HAS COME    */
*   /* ONLINE, INITIALIZE ITS CHANNEL DATA BLOCK. LOOP THRU CPES     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0082
*   IF ECCESAMP//ECCECCHK^=0 THEN   /* IF NOT TIME FOR CONFIGURATION
*                                      CHECK                         */
         L     @03,ECCESAMP(,ECCEDPTR)                             0082
         SR    @02,@02                                             0082
         D     @02,ECCECCHK(,ECCEDPTR)                             0082
         LTR   @02,@02                                             0082
         BNZ   @RT00082                                            0082
*     RETURN;                       /* RETURN TO IRBMFEVT, MF/1 EVENT
*                                      ROUTER PROGRAM                */
*                                                                  0083
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0084
*   RESPECIFY                                                      0084
*    (ECCPEPTR,                                                    0084
*     ECCPUMSK)RESTRICTED;                                         0084
*   ECCPUMSK=ECCPUZER;              /* MASK FOR CPU 0                */
         L     ECCPUMSK,@CF01327                                   0085
*   DO ECCPEPTR=ECCECPEQ BY LENGTH(ECCPE)TO ECCECPEQ+(ECCECPUS-1)* 0086
*         LENGTH(ECCPE);                                           0086
*                                                                  0086
         L     ECCPEPTR,ECCECPEQ(,ECCEDPTR)                        0086
         B     @DE00086                                            0086
@DL00086 DS    0H                                                  0087
*     /***************************************************************/
*     /*                                                             */
*     /* PROVIDE ADDRESSABILITY TO PCCA MACDATE Y-2 73018            */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0087
*     RESPECIFY                                                    0087
*      (PCCAPTR)RESTRICTED;                                        0087
*     PCCAPTR=PCCAT00P(((ECCPEPTR-ECCECPEQ)/LENGTH(ECCPE))+1);     0088
*                                                                  0088
         LR    PCCAPTR,ECCPEPTR                                    0088
         S     PCCAPTR,ECCECPEQ(,ECCEDPTR)                         0088
         SRDA  PCCAPTR,32                                          0088
         D     PCCAPTR,@CF00040                                    0088
         SLA   @05,2                                               0088
         L     @12,CVTPTR                                          0088
         L     @03,CVTPCCAT(,@12)                                  0088
         L     PCCAPTR,PCCAT00P(@05,@03)                           0088
*     /***************************************************************/
*     /*                                                             */
*     /* IF THIS CPU IS ONLINE AND THE MF/1 CONTROL BLOCK IS NOT     */
*     /* INITIALIZED                                                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0089
*     IF(CSDCPUAL&ECCPUMSK)^=0&ECCPVALD='0'B THEN                  0089
         L     @12,CVTCSD(,@12)                                    0089
         LR    @05,ECCPUMSK                                        0089
         SR    @03,@03                                             0089
         ICM   @03,3,CSDCPUAL(@12)                                 0089
         NR    @05,@03                                             0089
         LTR   @05,@05                                             0089
         BZ    @RF00089                                            0089
         TM    ECCPVALD(ECCPEPTR),B'00000001'                      0089
         BNZ   @RF00089                                            0089
*       ECCPVALD='1'B;              /* MARK CPU VALID                */
         OI    ECCPVALD(ECCPEPTR),B'00000001'                      0090
*     IF ECCPVALD='0'B THEN                                        0091
@RF00089 TM    ECCPVALD(ECCPEPTR),B'00000001'                      0091
         BZ    @RT00091                                            0091
*       GO TO ECLAB8;               /* IF CPU ENTRY IS INVALID       */
*                                                                  0092
*     /***************************************************************/
*     /*                                                             */
*     /* LOOP THROUGH CDB ENTRIES FOR THIS CPE MACDATE Y-2 73018     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0093
*     RESPECIFY                                                    0093
*      (ECCDBPTR)RESTRICTED;                                       0093
*     DO ECCDBPTR=ECCPCDBQ BY LENGTH(ECCDB)TO ECCPCDBQ+(ECCPCNUM-1)*
*           LENGTH(ECCDB);                                         0094
*                                                                  0094
         L     ECCDBPTR,ECCPCDBQ(,ECCPEPTR)                        0094
         B     @DE00094                                            0094
@DL00094 DS    0H                                                  0095
*       /*************************************************************/
*       /*                                                           */
*       /* PROVIDE ADDRESSABILITY TO CAT ENTRY MACDATE Y-2 73018     */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0095
*       RESPECIFY                                                  0095
*        (CATPTR)RESTRICTED;                                       0095
*       CATPTR=ECCDBPTR-ECCPCDBQ;                                  0096
         LR    CATPTR,ECCDBPTR                                     0096
         S     CATPTR,ECCPCDBQ(,ECCPEPTR)                          0096
*       CATPTR=CATPTR/LENGTH(ECCDB);                               0097
         LR    @07,CATPTR                                          0097
         SR    @06,@06                                             0097
         D     @06,@CF01349                                        0097
         LR    CATPTR,@07                                          0097
*       CATPTR=CATPTR*LENGTH(CAT);                                 0098
         SLL   CATPTR,4                WAS 3                   @ZP60030
*       CATPTR=CATPTR+ADDR(PCCACAT);                               0099
*                                                                  0099
**       LA    @12,PCCACAT(,PCCAPTR)                           @ZP60030
         L     @12,CVTPTR                                      @ZP60030
         L     @12,1052(,@12) <=CVTCST                         @ZP60030
         L     @12,0(,@12)                                     @ZP60030
         AR    CATPTR,@12                                          0099
*       /*************************************************************/
*       /*                                                           */
*       /* IF ONLINE FLAGS IN THE CAT AND CDB DO NOT MATCH THEN      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0100
*       IF CATNOP='1'B&ECCDALIV='1'B×CATNOP='0'B&ECCDALIV='0'B THEN
         TM    CATNOP(CATPTR),B'01000000'                          0100
         BNO   @GL00003                                            0100
         TM    ECCDALIV(ECCDBPTR),B'00000001'                      0100
         BO    @RT00100                                            0100
@GL00003 TM    CATNOP(CATPTR),B'01000000'                          0100
         BNZ   @RF00100                                            0100
         TM    ECCDALIV(ECCDBPTR),B'00000001'                      0100
         BNZ   @RF00100                                            0100
@RT00100 DS    0H                                                  0101
*         DO;                                                      0101
*ECLAB6:                            /* START RECOGNITION OF CPU    0102
*                                      CONFIGURATION CHANGE          */
*                                                                  0102
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0102
*           RESPECIFY                                              0102
*            (ECWRKRG1,                                            0102
*             ECWRKRG2)RESTRICTED;                                 0102
ECLAB6   DS    0H                                                  0103
*           ECWRKRG1=ECCMPSWP;      /* FLAG BYTE TO REGISTER         */
         L     ECWRKRG1,ECCMPSWP(,ECCDBPTR)                        0103
*           ECWRKRG2=ECWRKRG1;      /* COPY TO WORK REGISTER         */
*                                                                  0104
         LR    ECWRKRG2,ECWRKRG1                                   0104
*           /*********************************************************/
*           /*                                                       */
*           /* INDICATE CONFIGURATION CHANGED                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0105
*           ECWRKRG2=ECWRKRG2×ECCDCCON;                            0105
*                                                                  0105
         O     ECWRKRG2,@CF00079                                   0105
*           /*********************************************************/
*           /*                                                       */
*           /* SET CURRENT STATUS INTO CDB                           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0106
*           IF CATNOP='1'B THEN                                    0106
*                                                                  0106
         TM    CATNOP(CATPTR),B'01000000'                          0106
         BNO   @RF00106                                            0106
*             /*******************************************************/
*             /*                                                     */
*             /* OFFLINE                                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0107
*             ECWRKRG2=ECWRKRG2&ECCDALOF;                          0107
         N     ECWRKRG2,@CF00085                                   0107
*           ELSE                                                   0108
*             DO;                                                  0108
*                                                                  0108
         B     @RC00106                                            0108
@RF00106 DS    0H                                                  0109
*               /*****************************************************/
*               /*                                                   */
*               /* ONLINE                                            */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0109
*               ECWRKRG2=ECWRKRG2×ECCDALON;                        0109
*                                                                  0109
         O     ECWRKRG2,@CF00083                                   0109
*               /*****************************************************/
*               /*                                                   */
*               /* NEW SIO COUNT                                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0110
*               ECCDLSIO=CATSIOCT;                                 0110
*                                                                  0110
         MVC   ECCDLSIO(2,ECCDBPTR),CATSIOCT(CATPTR)               0110
*               /*****************************************************/
*               /*                                                   */
*               /* SET CHANNEL TYPE                                  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0111
*               ECCDCHID=CATCHID(1:2);                             0111
*                                                                  0111
         MVC   ECCDCHID(2,ECCDBPTR),CATCHID(CATPTR)                0111
*               /*****************************************************/
*               /*                                                   */
*               /* SET CHANNEL TYPE INVALID FLAG, IF NECESSARY       */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0112
*               IF CATNID='1'B THEN                                0112
         TM    CATNID(CATPTR),B'00001000'                          0112
         BNO   @RF00112                                            0112
*                 ECCDIVID='1'B;    /* THIS WILL CAUSE RECURSION ON
*                                      THE COMPARE AND SWAP          */
*                                                                  0113
         OI    ECCDIVID(ECCDBPTR),B'00001000'                      0113
*               /*****************************************************/
*               /*                                                   */
*               /* MARK VALID                                        */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0114
*               ECWRKRG2=ECWRKRG2×ECCDVAON;                        0114
@RF00112 O     ECWRKRG2,@CF00075                                   0114
*             END;                                                 0115
*           CS(ECWRKRG1,ECWRKRG2,ECCMPSWP);                        0116
@RC00106 CS    ECWRKRG1,ECWRKRG2,ECCMPSWP(ECCDBPTR)                0116
*           BC(7,ECLAB6);           /* BRANCH IF UNSUCCESSFUL        */
*                                                                  0117
         BC    7,ECLAB6                                            0117
*           /*********************************************************/
*           /*                                                       */
*           /* MACDATE Y-2 73018                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0118
*           RESPECIFY                                              0118
*            (ECWRKRG1,                                            0118
*             ECWRKRG2)UNRESTRICTED;                               0118
*         END;                                                     0119
*                                                                  0119
*       /*************************************************************/
*       /*                                                           */
*       /* MACDATE Y-2 73018                                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0120
*       RESPECIFY                                                  0120
*        (CATPTR)UNRESTRICTED;                                     0120
@RF00100 DS    0H                                                  0121
*     END;                                                         0121
*                                                                  0121
         AH    ECCDBPTR,@CH01349                                   0121
@DE00094 LH    @12,ECCPCNUM(,ECCPEPTR)                             0121
         BCTR  @12,0                                               0121
         MH    @12,@CH01349                                        0121
         A     @12,ECCPCDBQ(,ECCPEPTR)                             0121
         CR    ECCDBPTR,@12                                        0121
         BNH   @DL00094                                            0121
*     /***************************************************************/
*     /*                                                             */
*     /* MACDATE Y-2 73018                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0122
*     RESPECIFY                                                    0122
*      (ECCDBPTR,                                                  0122
*       PCCAPTR)UNRESTRICTED;                                      0122
*ECLAB8:                                                           0123
*     ECCPUMSK=ECCPUMSK/2;          /* SHIFT MASK RIGHT FOR NEXT CPU */
ECLAB8   SRL   ECCPUMSK,1                                          0123
*   END;                                                           0124
*                                                                  0124
         AH    ECCPEPTR,@CH00040                                   0124
@DE00086 SR    @12,@12                                             0124
         IC    @12,ECCECPUS(,ECCEDPTR)                             0124
         BCTR  @12,0                                               0124
         SLA   @12,3                                               0124
         A     @12,ECCECPEQ(,ECCEDPTR)                             0124
         CR    ECCPEPTR,@12                                        0124
         BNH   @DL00086                                            0124
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0125
*   RESPECIFY                                                      0125
*    (ECCPEPTR,                                                    0125
*     ECCPUMSK)UNRESTRICTED;                                       0125
*   RETURN;                         /* RETURN TO MFROUTER, IRBMFEVT  */
@EL00001 DS    0H                                                  0126
@EF00001 DS    0H                                                  0126
@ER00001 LM    @14,@12,12(@13)                                     0126
         BR    @14                                                 0126
*   END                                                            0127
*                                                                  0127
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHAPCCAT)                                       */
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */
*/*%INCLUDE SYSLIB  (IECDCAT )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHACSD  )                                       */
*                                                                  0127
*       ;                                                          0127
         B     @EL00001                                            0127
@DATA    DS    0H
@DATD    DSECT
         DS    0F
IRBMFECH CSECT
         DS    0F
@CF00040 DC    F'8'
@CH00040 EQU   @CF00040+2
@CF01349 DC    F'20'
@CH01349 EQU   @CF01349+2
@CF01327 DC    XL4'8000'
@CF00075 DC    XL4'04000000'
@CF00079 DC    XL4'02000000'
@CF00083 DC    XL4'01000000'
@CF00085 DC    XL4'FEFFFFFF'
@CF01329 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
@ENDDATD EQU   *
IRBMFECH CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
ECPATCH  DS    CL100
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR09P   EQU   @09
ECCEDPTR EQU   @01
ECCPEPTR EQU   @02
ECCDBPTR EQU   @03
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
PCCAPTR  EQU   @04
CATPTR   EQU   @05
ECCPUMSK EQU   @08
ECWRKRG1 EQU   @06
ECWRKRG2 EQU   @07
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR14F   EQU   @14
GPR15F   EQU   @15
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSATOLD  EQU   PSA+540
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSACPUSA EQU   PSA+794
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ECCEDT   EQU   0
ECCECPEQ EQU   ECCEDT
ECCECPUS EQU   ECCEDT+7
ECCESAMP EQU   ECCEDT+8
ECCECCHK EQU   ECCEDT+12
ECCPE    EQU   0
ECCPFLGS EQU   ECCPE
ECCPVALD EQU   ECCPFLGS
ECCPCNUM EQU   ECCPE+2
ECCPCDBQ EQU   ECCPE+4
ECCDB    EQU   0
ECCDFLGS EQU   ECCDB
ECCDIVID EQU   ECCDFLGS
ECCDVALD EQU   ECCDFLGS
ECCDALIV EQU   ECCDFLGS
ECCDCHID EQU   ECCDB+4
ECCDCTYP EQU   ECCDCHID
ECCDLSIO EQU   ECCDB+6
ECCDSIOS EQU   ECCDB+8
ECCDBUSY EQU   ECCDB+12
ECCDOLAP EQU   ECCDB+16
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTRSV90 EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
PCCAVT   EQU   0
PCCAT00P EQU   PCCAVT
PCCA     EQU   0
PCCATMST EQU   PCCA+128
PCCATMFL EQU   PCCATMST
PCCATODE EQU   PCCATMST+1
PCCACCE  EQU   PCCATMST+2
PCCAINTE EQU   PCCATMST+3
PCCAEMSB EQU   PCCA+136
PCCAEMSI EQU   PCCAEMSB
PCCARISP EQU   PCCAEMSI
PCCAEMS2 EQU   PCCAEMSI+1
PCCAEMS3 EQU   PCCAEMSI+2
PCCARMSB EQU   PCCAEMSI+3
PCCAWERP EQU   PCCA+280
PCCACHPF EQU   PCCAWERP+4
PCCACHBL EQU   PCCAWERP+5
PCCACHVA EQU   PCCAWERP+6
PCCACHTS EQU   PCCAWERP+7
PCCACHS1 EQU   PCCA+288
PCCACHS2 EQU   PCCA+289
PCCACHRB EQU   PCCA+290
PCCACHF1 EQU   PCCA+308
PCCACHF2 EQU   PCCA+309
PCCACHF3 EQU   PCCA+310
PCCACHF4 EQU   PCCA+311
PCCACAT  EQU   PCCA+384
CAT      EQU   0
CATENTRY EQU   CAT
CATFLG   EQU   CATENTRY
CATNOP   EQU   CATFLG
CATNID   EQU   CATFLG
CATFLA   EQU   CAT+1
CATSIOCT EQU   CAT+2
CATCHID  EQU   CAT+4
CSD      EQU   0
CSDCPUAL EQU   CSD+8
CSDSCWRD EQU   CSD+12
CSDSCFL1 EQU   CSDSCWRD
CSDSCFL2 EQU   CSDSCWRD+1
CSDSCFL3 EQU   CSDSCWRD+2
CSDSCFL4 EQU   CSDSCWRD+3
CSDFLAGS EQU   CSD+23
IKEBC    EQU   0
IKEBF15  EQU   0
IKEBF31  EQU   0
IKEBP15  EQU   0
IKEBP31  EQU   0
IKEBP8   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTCSD   EQU   CVTS01+312
CVTPCCAT EQU   CVTS01+416
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTWTCB  EQU   CVTS01+540
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
ECCMPSWP EQU   ECCDFLGS
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
@NM00028 EQU   CSD+160
CSDMASK  EQU   CSD+128
CSDUCNT  EQU   CSD+124
CSDTCNT  EQU   CSD+120
CSDGDTOD EQU   CSD+116
CSDGDINT EQU   CSD+112
CSDGDCC  EQU   CSD+108
CSDDDRCT EQU   CSD+106
CSDRV044 EQU   CSD+104
CSDMAFF  EQU   CSD+24
CSDRV038 EQU   CSDFLAGS
CSDRV037 EQU   CSDFLAGS
CSDRV036 EQU   CSDFLAGS
CSDRV035 EQU   CSDFLAGS
CSDRV034 EQU   CSDFLAGS
CSDRV033 EQU   CSDFLAGS
CSDRV032 EQU   CSDFLAGS
CSDMP    EQU   CSDFLAGS
CSDACR   EQU   CSD+22
CSDMF1CP EQU   CSD+20
CSDRV043 EQU   CSD+16
CSDRV030 EQU   CSDSCFL4
CSDRV029 EQU   CSDSCFL4
CSDRV028 EQU   CSDSCFL4
CSDRV027 EQU   CSDSCFL4
CSDRV026 EQU   CSDSCFL4
CSDRV025 EQU   CSDSCFL4
CSDRV024 EQU   CSDSCFL4
CSDRV023 EQU   CSDSCFL4
CSDRV022 EQU   CSDSCFL3
CSDRV021 EQU   CSDSCFL3
CSDRV020 EQU   CSDSCFL3
CSDRV019 EQU   CSDSCFL3
CSDRV018 EQU   CSDSCFL3
CSDRV017 EQU   CSDSCFL3
CSDRV016 EQU   CSDSCFL3
CSDRV015 EQU   CSDSCFL3
CSDRV014 EQU   CSDSCFL2
CSDRV013 EQU   CSDSCFL2
CSDRV012 EQU   CSDSCFL2
CSDRV011 EQU   CSDSCFL2
CSDRV010 EQU   CSDSCFL2
CSDRV009 EQU   CSDSCFL2
CSDRV008 EQU   CSDSCFL2
CSDRV007 EQU   CSDSCFL2
CSDRV006 EQU   CSDSCFL1
CSDRV005 EQU   CSDSCFL1
CSDRV004 EQU   CSDSCFL1
CSDRV003 EQU   CSDSCFL1
CSDRV002 EQU   CSDSCFL1
CSDRV001 EQU   CSDSCFL1
CSDSYSND EQU   CSDSCFL1
CSDRV042 EQU   CSDSCFL1
CSDCPUOL EQU   CSD+10
CSDSAFF  EQU   CSDCPUAL
CSDCHAD  EQU   CSD+6
CSDCPUJS EQU   CSD+4
CSDCSD   EQU   CSD
CATEND   EQU   CAT+8
CASFLARS EQU   CATFLA
CATBSY   EQU   CATFLA
CATFLG7  EQU   CATFLG
CATFLG6  EQU   CATFLG
CATFLG5  EQU   CATFLG
CATNCPU  EQU   CATFLG
CATNGEN  EQU   CATFLG
CATRES1  EQU   CATFLG
@NM00003 EQU   PCCA+512
PCCARV36 EQU   PCCA+380
PCCARV35 EQU   PCCA+378
PCCARV01 EQU   PCCA+377
PCCACPUM EQU   PCCA+376
PCCARV63 EQU   PCCA+372
PCCARV62 EQU   PCCA+368
PCCARV61 EQU   PCCA+364
PCCARV60 EQU   PCCA+360
PCCARV59 EQU   PCCA+356
PCCARV58 EQU   PCCA+352
PCCARV57 EQU   PCCA+348
PCCARV56 EQU   PCCA+344
PCCARV55 EQU   PCCA+340
PCCARV54 EQU   PCCA+336
PCCALOGA EQU   PCCA+332
PCCACHID EQU   PCCA+324
PCCACHSV EQU   PCCA+312
PCCARV79 EQU   PCCACHF4
PCCARV78 EQU   PCCACHF4
PCCARV77 EQU   PCCACHF4
PCCARV76 EQU   PCCACHF4
PCCARV75 EQU   PCCACHF4
PCCARV74 EQU   PCCACHF4
PCCARV73 EQU   PCCACHF4
PCCARV72 EQU   PCCACHF4
PCCARV71 EQU   PCCACHF3
PCCARV70 EQU   PCCACHF3
PCCARV69 EQU   PCCACHF3
PCCARV68 EQU   PCCACHF3
PCCARV67 EQU   PCCACHF3
PCCARV66 EQU   PCCACHF3
PCCARV65 EQU   PCCACHF3
PCCARV64 EQU   PCCACHF3
PCCACF28 EQU   PCCACHF2
PCCACF27 EQU   PCCACHF2
PCCACF26 EQU   PCCACHF2
PCCACF25 EQU   PCCACHF2
PCCACF24 EQU   PCCACHF2
PCCACF23 EQU   PCCACHF2
PCCACF22 EQU   PCCACHF2
PCCACF21 EQU   PCCACHF2
PCCACF18 EQU   PCCACHF1
PCCACF17 EQU   PCCACHF1
PCCACF16 EQU   PCCACHF1
PCCACF15 EQU   PCCACHF1
PCCACF14 EQU   PCCACHF1
PCCACF13 EQU   PCCACHF1
PCCACF12 EQU   PCCACHF1
PCCACF11 EQU   PCCACHF1
PCCARV05 EQU   PCCA+306
PCCACHPB EQU   PCCA+305
PCCALGP2 EQU   PCCA+304
PCCALGP1 EQU   PCCA+303
PCCALOGL EQU   PCCA+302
PCCARV80 EQU   PCCA+300
PCCACHW2 EQU   PCCA+296
PCCACHW1 EQU   PCCA+292
PCCAIOSI EQU   PCCA+291
PCCACNRB EQU   PCCACHRB
PCCACCVB EQU   PCCACHRB
PCCACSNB EQU   PCCACHRB
PCCARV52 EQU   PCCACHRB
PCCACHIB EQU   PCCACHRB
PCCACTIB EQU   PCCACHRB
PCCACINB EQU   PCCACHRB
PCCACSIB EQU   PCCACHRB
PCCARV51 EQU   PCCACHS2
PCCARV50 EQU   PCCACHS2
PCCARV49 EQU   PCCACHS2
PCCACURC EQU   PCCACHS2
PCCACNLG EQU   PCCACHS2
PCCACMOD EQU   PCCACHS2
PCCACALT EQU   PCCACHS2
PCCACIOR EQU   PCCACHS2
PCCARV47 EQU   PCCACHS1
PCCACUCB EQU   PCCACHS1
PCCACIBC EQU   PCCACHS1
PCCACAND EQU   PCCACHS1
PCCACNLS EQU   PCCACHS1
PCCACFRR EQU   PCCACHS1
PCCACNRE EQU   PCCACHS1
PCCACCMP EQU   PCCACHS1
PCCACSEQ EQU   PCCACHTS
PCCACDIN EQU   PCCACHTS
PCCARV44 EQU   PCCACHTS
PCCARV43 EQU   PCCACHTS
PCCACTEC EQU   PCCACHTS
PCCACDAV EQU   PCCACHVA
PCCACCHV EQU   PCCACHVA
PCCACCMD EQU   PCCACHVA
PCCACUNS EQU   PCCACHVA
PCCACSQV EQU   PCCACHVA
PCCARV42 EQU   PCCACHVA
PCCARV41 EQU   PCCACHVA
PCCACITF EQU   PCCACHVA
PCCARV40 EQU   PCCACHBL
PCCARV39 EQU   PCCACHBL
PCCARV38 EQU   PCCACHBL
PCCACCUE EQU   PCCACHBL
PCCACSTG EQU   PCCACHBL
PCCACSCU EQU   PCCACHBL
PCCACCHA EQU   PCCACHBL
PCCACCPU EQU   PCCACHBL
PCCACNOR EQU   PCCACHPF
PCCACCNT EQU   PCCACHPF
PCCACSNS EQU   PCCACHPF
PCCARV37 EQU   PCCACHPF
PCCACHIO EQU   PCCACHPF
PCCACTIO EQU   PCCACHPF
PCCACINT EQU   PCCACHPF
PCCACSIO EQU   PCCACHPF
PCCACHUB EQU   PCCAWERP
PCCACHEL EQU   PCCA+168
PCCALRBR EQU   PCCA+164
PCCALRBV EQU   PCCA+160
PCCAPWAR EQU   PCCA+156
PCCAPWAV EQU   PCCA+152
PCCAEMSA EQU   PCCAEMSB+12
PCCAEMSE EQU   PCCAEMSB+8
PCCAEMSP EQU   PCCAEMSB+4
PCCARMS  EQU   PCCARMSB
PCCARV34 EQU   PCCARMSB
PCCARV33 EQU   PCCARMSB
PCCARV32 EQU   PCCARMSB
PCCARV31 EQU   PCCARMSB
PCCARV30 EQU   PCCARMSB
PCCARV29 EQU   PCCARMSB
PCCARV28 EQU   PCCARMSB
PCCARV27 EQU   PCCAEMS3
PCCARV26 EQU   PCCAEMS3
PCCARV25 EQU   PCCAEMS3
PCCARV24 EQU   PCCAEMS3
PCCARV23 EQU   PCCAEMS3
PCCARV22 EQU   PCCAEMS3
PCCARV21 EQU   PCCAEMS3
PCCARV20 EQU   PCCAEMS3
PCCARV19 EQU   PCCAEMS2
PCCARV18 EQU   PCCAEMS2
PCCARV17 EQU   PCCAEMS2
PCCARV16 EQU   PCCAEMS2
PCCARV15 EQU   PCCAEMS2
PCCARV14 EQU   PCCAEMS2
PCCARV13 EQU   PCCAEMS2
PCCARV12 EQU   PCCAEMS2
PCCARV11 EQU   PCCARISP
PCCARV10 EQU   PCCARISP
PCCARV09 EQU   PCCARISP
PCCARV08 EQU   PCCARISP
PCCARV07 EQU   PCCARISP
PCCARV06 EQU   PCCARISP
PCCASERL EQU   PCCARISP
PCCAPARL EQU   PCCARISP
PCCARPB  EQU   PCCA+132
PCCACTIN EQU   PCCAINTE
PCCANFIN EQU   PCCAINTE
PCCANUIN EQU   PCCAINTE
PCCACTCC EQU   PCCACCE
PCCANFCC EQU   PCCACCE
PCCANUCC EQU   PCCACCE
PCCACTTD EQU   PCCATODE
PCCANFTD EQU   PCCATODE
PCCANUTD EQU   PCCATODE
PCCARV04 EQU   PCCATMFL
PCCARV03 EQU   PCCATMFL
PCCARV02 EQU   PCCATMFL
PCCAMINT EQU   PCCATMFL
PCCAMCC  EQU   PCCATMFL
PCCAVKIL EQU   PCCATMFL
PCCASYNC EQU   PCCATMFL
PCCAINIT EQU   PCCATMFL
PCCARV9E EQU   PCCA+124
PCCARV9D EQU   PCCA+120
PCCARV9C EQU   PCCA+116
PCCARV9B EQU   PCCA+112
PCCARV9A EQU   PCCA+108
PCCARV99 EQU   PCCA+104
PCCARV98 EQU   PCCA+100
PCCARV97 EQU   PCCA+96
PCCARV96 EQU   PCCA+92
PCCARV95 EQU   PCCA+88
PCCARV94 EQU   PCCA+84
PCCARV93 EQU   PCCA+80
PCCARV92 EQU   PCCA+76
PCCARV91 EQU   PCCA+72
PCCARV90 EQU   PCCA+68
PCCARV89 EQU   PCCA+64
PCCARV88 EQU   PCCA+60
PCCARV87 EQU   PCCA+56
PCCARV86 EQU   PCCA+52
PCCARV85 EQU   PCCA+48
PCCARV84 EQU   PCCA+44
PCCARV83 EQU   PCCA+40
PCCARV82 EQU   PCCA+36
PCCARV81 EQU   PCCA+32
PCCAPSAR EQU   PCCA+28
PCCAPSAV EQU   PCCA+24
PCCATQEP EQU   PCCA+20
PCCACAFM EQU   PCCA+18
PCCACPUA EQU   PCCA+16
PCCACPID EQU   PCCA+4
PCCAPCCA EQU   PCCA
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTRSVA1 EQU   CVTXTNT2+48
CVTRSVA0 EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTRSV90
CVTRSV9G EQU   CVTRSV90
CVTRSV9F EQU   CVTRSV90
CVTRSV9E EQU   CVTRSV90
CVTRSV9D EQU   CVTRSV90
CVTRSV9C EQU   CVTRSV90
CVTRSV9B EQU   CVTRSV90
CVTRSV9A EQU   CVTRSV90
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTRV484 EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTRV319 EQU   CVTUSR
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
ECCDCMOD EQU   ECCDCHID
ECCDRS02 EQU   ECCDB+1
ECCDCCHG EQU   ECCDFLGS
ECCDRS01 EQU   ECCDFLGS
ECCPRS02 EQU   ECCPE+1
ECCPRS01 EQU   ECCPFLGS
ECCERS01 EQU   ECCEDT+4
@NM00027 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00026 EQU   PSA+1032
PSAUSEND EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSARV054 EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00025 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00024 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00023 EQU   FLCFSA
@NM00022 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00021 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00020 EQU   FLCIOA
@NM00019 EQU   FLCMCLA+15
@NM00018 EQU   FLCMCLA+14
@NM00017 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00016 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00015 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00014 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00013 EQU   FLCPER
@NM00012 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00011 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00010 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00009 EQU   FLCPIILC
@NM00008 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00007 EQU   FLCSVILC
@NM00006 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00005 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00004 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RT00025 EQU   ECLAB4
@RT00032 EQU   ECLAB2
@RT00044 EQU   ECLAB2
@RT00065 EQU   ECLAB3
@RT00082 EQU   @EL00001
@RT00091 EQU   ECLAB8
@ENDDATA EQU   *
         END   IRBMFECH,(C'PL/S-II',0502,74086)
/*
//STEP03  EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  *
  IDENTIFY IRBMFECH('ZP60030')
++MOD(IRBMFIHA) DISTLIB(AOSC5).
/*
//SYSUT2   DD  DSN=&&SMPMCS,DISP=(MOD,PASS)
//SYSIN    DD  DUMMY
//STEP04  EXEC PGM=IFOX00,PARM='OBJECT,NODECK,NOTERM,XREF(SHORT)'
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.SMPMTS,DISP=SHR
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1   DD  UNIT=VIO,SPACE=(CYL,10)
//SYSUT2   DD  UNIT=VIO,SPACE=(CYL,10)
//SYSUT3   DD  UNIT=VIO,SPACE=(CYL,10)
//SYSGO    DD  DSN=&&SMPMCS,DISP=(MOD,PASS)
//SYSIN    DD  *
         TITLE '*/* IRBMFIHA - CHANNEL INITIALIZATION MODULE           *
                       '
IRBMFIHA CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IRBMFIHA  74.086'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @10,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@10                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN R,LV=(0)
         LR    @09,@01                                             0001
         USING @DATD,@09                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @09,8(,@13)                                         0001
         LR    @13,@09                                             0001
         MVC   @PC00001(12),0(@01)                                 0001
*                                                                  0032
*/* BEGIN MAINLINE PROCESSING                                        */
*                                                                  0032
*   IF STSMSTA='0'B THEN            /* IF THE CHANNEL OPTION FLAG IS
*                                      NOT SET                       */
         L     @12,@PC00001                                        0032
         L     @12,IHSMAPTR(,@12)                                  0032
         TM    STSMSTA(@12),B'00000001'                            0032
         BNZ   @RF00032                                            0032
*     DO;                                                          0033
*       STSMOPT=0;                  /* CLEAR OPTION WORD             */
         SR    @11,@11                                             0034
         ST    @11,STSMOPT(,@12)                                   0034
*       RETURN CODE(0);             /* RETURN TO INITIALIZATION    0035
*                                      MAINLINE-MFIMAINL IN IGX00013.*/
         L     @13,4(,@13)                                         0035
         L     @00,@SIZDATD                                        0035
         LR    @01,@09                                             0035
         FREEMAIN R,LV=(0),A=(1)
         SR    @15,@15                                             0035
         L     @14,12(,@13)                                        0035
         LM    @00,@12,20(@13)                                     0035
         BR    @14                                                 0035
*     END;                                                         0036
*                                                                  0036
*   /*****************************************************************/
*   /*                                                               */
*   /* ALLOCATE STORAGE FOR THE STORAGE RESOURCE TABLE. CONNECT IT TO*/
*   /* THE RESOURCE VECTOR TABLE MACDATE Y-2 73018                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0037
*   RESPECIFY                                                      0037
*    (GPR00P,                                                      0037
*     GPR01P,                                                      0037
*     GPR14P,                                                      0037
*     GPR15P)RESTRICTED;                                           0037
@RF00032 DS    0H                                                  0038
*   GPR00P=IHSGTGMC;                /* GETMAIN CONTROL WORD TO REG   */
         L     GPR00P,IHSGTGMC                                     0038
*   GENERATE;                                                      0039
IHGETMN1 GETMAIN R,LV=(0),RELATED=(MFIHSGGM,IRBMFTRM(TR0250))
*   GPR01P->IHGMCWRD=IHSGTGMC;      /* SUBPOOL AND LENGTH TO FIRST 0040
*                                      WORD OF GOTTEN AREA           */
         MVC   IHGMCWRD(4,GPR01P),IHSGTGMC                         0040
*   STRVSSGT=GPR01P+LENGTH(IHGMCWRD);/* ADDRESS TO RVT               */
*                                                                  0041
         L     @12,@PC00001                                        0041
         L     @12,IHSMAPTR(,@12)                                  0041
         L     @12,STSMRVT(,@12)                                   0041
         LA    @11,4                                               0041
         AR    @11,GPR01P                                          0041
         ST    @11,STRVSSGT(,@12)                                  0041
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0042
*   RESPECIFY                                                      0042
*    (GPR00P,                                                      0042
*     GPR01P,                                                      0042
*     GPR14P,                                                      0042
*     GPR15P)UNRESTRICTED;                                         0042
*   STRVNSGT=1;                     /* FIRST ENTRY IS NEXT AVAILABLE */
*                                                                  0043
         MVC   STRVNSGT(4,@12),@CF00048                            0043
*   /*****************************************************************/
*   /*                                                               */
*   /* ALLOCATE STORAGE FOR THE PROGRAM RESOURCE TABLE. CONNECT IT TO*/
*   /* THE RESOURCE VECTOR TABLE MACDATE Y-2 73018                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0044
*   RESPECIFY                                                      0044
*    (GPR00P,                                                      0044
*     GPR01P,                                                      0044
*     GPR14P,                                                      0044
*     GPR15P)RESTRICTED;                                           0044
*   GPR00P=IHPRTGMC;                /* GETMAIN CONTROL WORD TO REG   */
         L     GPR00P,IHPRTGMC                                     0045
*   GENERATE;                                                      0046
IHGETMN2 GETMAIN R,LV=(0),RELATED=(MFIHPRGM,IRBMFTRM(TR0150))
*   GPR01P->IHGMCWRD=IHPRTGMC;      /* SUBPOOL AND LENGTH TO FIRST 0047
*                                      WORD OF GOTTEN STORAGE        */
         MVC   IHGMCWRD(4,GPR01P),IHPRTGMC                         0047
*   STRVSPRT=GPR01P+LENGTH(IHGMCWRD);/* ADDRESS TO RVT               */
*                                                                  0048
         L     @12,@PC00001                                        0048
         L     @12,IHSMAPTR(,@12)                                  0048
         L     @12,STSMRVT(,@12)                                   0048
         LA    @11,4                                               0048
         AR    @11,GPR01P                                          0048
         ST    @11,STRVSPRT(,@12)                                  0048
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0049
*   RESPECIFY                                                      0049
*    (GPR00P,                                                      0049
*     GPR01P,                                                      0049
*     GPR14P,                                                      0049
*     GPR15P)UNRESTRICTED;                                         0049
*   STRVNPRT=1;                     /* FIRST ENTRY IS NEXT AVAILABLE */
*                                                                  0050
         MVC   STRVNPRT(4,@12),@CF00048                            0050
*   /*****************************************************************/
*   /*                                                               */
*   /* THE CHANNEL OPTION WAS SELECTED. LOAD MODULE IRBMFEVT, FIX IT,*/
*   /* AND STORE ITS NAME INTO THE RESOURCE LIST. ITS ADDRESS IS     */
*   /* PLACED INTO THE CVT MACDATE Y-2 73018                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0051
*   RESPECIFY                                                      0051
*    (GPR00P,                                                      0051
*     GPR01P,                                                      0051
*     GPR14P,                                                      0051
*     GPR15P)RESTRICTED;                                           0051
*   GENERATE;                                                      0052
IHLOADM1 LOAD  EP=IRBMFEVT,RELATED=(MFIHLEVT,IRBMFTRM(TR0120))
         LA    @01,0(,@01)          CLEAR HIGH ORDER BYTE
         SLL   @01,3                GET LENGTH IN BYTES
*   CVTMFRTR=GPR00P;                /* MFROUTER SERVICE MODULE     0053
*                                      ADDRESS TO CVT                */
         L     @12,CVTPTR                                          0053
         ST    GPR00P,CVTMFRTR(,@12)                               0053
*   STPRNAME(STRVNPRT)='IRBMFEVT';  /* MODULE NAME TO PRT            */
         L     @12,@PC00001                                        0054
         L     @12,IHSMAPTR(,@12)                                  0054
         L     @12,STSMRVT(,@12)                                   0054
         L     @11,STRVNPRT(,@12)                                  0054
         LR    @08,@11                                             0054
         SLA   @08,4                                               0054
         L     @07,STRVSPRT(,@12)                                  0054
         ST    @08,@TF00001                                        0054
         ALR   @08,@07                                             0054
         AL    @08,@CF01569                                        0054
         MVC   STPRNAME(8,@08),@CC01549                            0054
*   STPRADDR(STRVNPRT)=GPR00P;      /* MODULE ADDRESS TO PRT         */
         L     @08,@TF00001                                        0055
         AL    @08,@CF01570                                        0055
         ST    GPR00P,STPRADDR-8(@08,@07)                          0055
*   STPRLGTH(STRVNPRT)=-(GPR01P);   /* SAVE NEGATIVE LENGTH TO FLAG
*                                      NEED FOR BRANCH TO PGFREE     */
         LCR   @08,GPR01P                                          0056
         L     @06,@TF00001                                        0056
         AL    @07,@CF01571                                        0056
         ST    @08,STPRLGTH-12(@06,@07)                            0056
*   STRVNPRT=STRVNPRT+1;            /* POINT TO NEXT SLOT IN PRT     */
*                                                                  0057
         AH    @11,@CH00048                                        0057
         ST    @11,STRVNPRT(,@12)                                  0057
*   /*****************************************************************/
*   /*                                                               */
*   /* GET LOCAL LOCK BEFORE PGFIX BRANCH ENTRY                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0058
*   RFY                                                            0058
*    (GPR11P,                                                      0058
*     GPR12P,                                                      0058
*     GPR13P)RSTD;                                                 0058
*   GEN REFS(PSALITA);                                             0059
         LR    GPR15P,GPR13P        SAVE SAVE AREA ADDRESS
IHSTLCK1 SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        X
               RELATED=(LOCAL,IRBMFIHA(IHSTLCK2))
         LR    GPR13P,GPR15P        RESTORE SAVE AREA ADDRESS
*   RFY                                                            0060
*    (GPR11P,                                                      0060
*     GPR12P,                                                      0060
*     GPR13P)UNRSTD;                                               0060
*                                                                  0060
*   /*****************************************************************/
*   /*                                                               */
*   /* SET NON SWPA BIT IN ASCB TO FORCE FIX IN PREF AREA    @YM8211P*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0061
*   ASCBNSWP=IHNSWPON;              /*                       @YM8211P*/
*                                                                  0061
         L     @12,ASCBPTR                                         0061
         OI    ASCBNSWP(@12),B'00000001'                           0061
*   /*****************************************************************/
*   /*                                                               */
*   /* FIX MODULE IRBMFEVT PAGE FIX WITH BRANCH ENTRY, TCB=0 TO KEEP */
*   /* FIXED WHILE MF1 SWAPPED OUT                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0062
*   RFY                                                            0062
*    (GPR02P,                                                      0062
*     GPR04P)RSTD;                                                 0062
*   GPR02P=GPR00P+GPR01P;           /* END ADDRESS                   */
         LR    GPR02P,GPR00P                                       0063
         AR    GPR02P,GPR01P                                       0063
*   GPR01P=GPR00P×IHCPGFIX;         /* START ADDRESS                 */
         LR    GPR01P,GPR00P                                       0064
         O     GPR01P,@CF01540                                     0064
*   GPR00P=ADDR(IHPAGECB);          /* ECB ADDRESS                   */
         LA    GPR00P,IHPAGECB                                     0065
*   GPR04P=0;                       /* TCB ADDRESS - ZERO TO KEEP  0066
*                                      FIXED WHILE MEMORY SWAPPED    */
         SR    @12,@12                                             0066
         LR    GPR04P,@12                                          0066
*   IHPAGECB=0;                                                    0067
         ST    @12,IHPAGECB                                        0067
*   CALL IEAVPSIB;                  /* CALL PAGE FIX ROUTINE         */
         L     @12,CVTPTR                                          0068
         L     @15,CVTVPSIB(,@12)                                  0068
         BALR  @14,@15                                             0068
*   RFY                                                            0069
*    (GPR02P,                                                      0069
*     GPR04P)UNRSTD;                                               0069
*                                                                  0069
*   /*****************************************************************/
*   /*                                                               */
*   /* RESET ASCB NON SWAP BIT                               @YM8211P*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0070
*   ASCBNSWP=IHNSWPOF;              /*                       @YM8211P*/
*                                                                  0070
         L     @12,ASCBPTR                                         0070
         NI    ASCBNSWP(@12),B'11111110'                           0070
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE LOCAL LOCK                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0071
*   RFY                                                            0071
*    (GPR11P,                                                      0071
*     GPR12P,                                                      0071
*     GPR13P)RSTD;                                                 0071
*   GEN REFS(PSALITA);                                             0072
         LR    GPR00P,GPR13P         SAVE SAVE AREA ADDRESS
IHSTLCK2 SETLOCK RELEASE,TYPE=LOCAL,                                   X
               RELATED=(LOCAL,IRBMFIHA(IHSTLCK1))
         LR    GPR13P,GPR00P
*   RFY                                                            0073
*    (GPR11P,                                                      0073
*     GPR12P,                                                      0073
*     GPR13P)UNRSTD;                                               0073
*   GEN SETS(IHPAGECB)(WAIT ECB=IHPAGECB);                         0074
*                                                                  0074
         WAIT ECB=IHPAGECB
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD EVENT MG MODULE IRBMFECH, FIX, AND STORE NAME INTO THE   */
*   /* RESOURCE LIST AND INTO THE MMV                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0075
*   GENERATE;                                                      0075
IHLOADM2 LOAD  EP=IRBMFECH,RELATED=(MFIHLECH,IRBMFTRM(TR0120))
         LA    @01,0(,@01)          CLEAR HIGH ORDER BYTE
         SLL   @01,3                GET LENGTH IN BYTES
*   STPRNAME(STRVNPRT)='IRBMFECH';  /* MODULE NAME TO PRT            */
         L     @12,@PC00001                                        0076
         L     @12,IHSMAPTR(,@12)                                  0076
         L     @12,STSMRVT(,@12)                                   0076
         L     @11,STRVNPRT(,@12)                                  0076
         LR    @08,@11                                             0076
         SLA   @08,4                                               0076
         L     @07,STRVSPRT(,@12)                                  0076
         ST    @08,@TF00001                                        0076
         ALR   @08,@07                                             0076
         AL    @08,@CF01569                                        0076
         MVC   STPRNAME(8,@08),@CC01550                            0076
*   STPRADDR(STRVNPRT)=GPR00P;      /* MODULE ADDRESS TO PRT         */
         L     @08,@TF00001                                        0077
         AL    @08,@CF01570                                        0077
         ST    GPR00P,STPRADDR-8(@08,@07)                          0077
*   STPRLGTH(STRVNPRT)=-(GPR01P);   /* SAVE NEGATIVE LENGTH TO FLAG
*                                      NEED FOR BRANCH TO PAGE FREE  */
         LCR   @08,GPR01P                                          0078
         L     @06,@TF00001                                        0078
         AL    @07,@CF01571                                        0078
         ST    @08,STPRLGTH-12(@06,@07)                            0078
*   STRVNPRT=STRVNPRT+1;            /* POINT TO NEXT PRT SLOT        */
*                                                                  0079
         AH    @11,@CH00048                                        0079
         ST    @11,STRVNPRT(,@12)                                  0079
*   /*****************************************************************/
*   /*                                                               */
*   /* GET LOCAL LOCK BEFORE PGFIX BRANCH ENTRY                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0080
*   RFY                                                            0080
*    (GPR11P,                                                      0080
*     GPR12P,                                                      0080
*     GPR13P)RSTD;                                                 0080
*   GEN REFS(PSALITA);                                             0081
         LR    GPR15P,GPR13P        SAVE SAVE AREA ADDRESS
IHSTLCK3 SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        X
               RELATED=(LOCAL,IRBMFIHA(IHSTLCK4))
         LR    GPR13P,GPR15P        RESTORE SAVE AREA ADDRESS
*   RFY                                                            0082
*    (GPR11P,                                                      0082
*     GPR12P,                                                      0082
*     GPR13P)UNRSTD;                                               0082
*                                                                  0082
*   /*****************************************************************/
*   /*                                                               */
*   /* SET NON SWPA BIT IN ASCB TO FORCE FIX IN PREF AREA    @YM8211P*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0083
*   ASCBNSWP=IHNSWPON;              /*                       @YM8211P*/
*                                                                  0083
         L     @12,ASCBPTR                                         0083
         OI    ASCBNSWP(@12),B'00000001'                           0083
*   /*****************************************************************/
*   /*                                                               */
*   /* FIX MODULE IRBMFECH PAGE FIX WITH BRANCH ENTRY, TCB=0 TO KEEP */
*   /* FIXED WHILE MF1 SWAPPED OUT                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0084
*   RFY                                                            0084
*    (GPR02P,                                                      0084
*     GPR04P)RSTD;                                                 0084
*   GPR02P=GPR00P+GPR01P;           /* END ADDRESS                   */
         LR    GPR02P,GPR00P                                       0085
         AR    GPR02P,GPR01P                                       0085
*   GPR01P=GPR00P×IHCPGFIX;         /* START ADDRESS                 */
         LR    GPR01P,GPR00P                                       0086
         O     GPR01P,@CF01540                                     0086
*   GPR00P=ADDR(IHPAGECB);          /* ECB ADDRESS                   */
         LA    GPR00P,IHPAGECB                                     0087
*   GPR04P=0;                       /* TCB ADDRESS ZERO TO KEEP FIXED
*                                      WHILE SWAPPED OUT             */
         SR    @12,@12                                             0088
         LR    GPR04P,@12                                          0088
*   IHPAGECB=0;                                                    0089
         ST    @12,IHPAGECB                                        0089
*   CALL IEAVPSIB;                  /* CALL PAGE FIX ROUTINE         */
         L     @12,CVTPTR                                          0090
         L     @15,CVTVPSIB(,@12)                                  0090
         BALR  @14,@15                                             0090
*   RFY                                                            0091
*    (GPR02P,                                                      0091
*     GPR04P)UNRSTD;                                               0091
*                                                                  0091
*   /*****************************************************************/
*   /*                                                               */
*   /* RESET ASCB NON SWAP BIT                               @YM8211P*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0092
*   ASCBNSWP=IHNSWPOF;              /*                       @YM8211P*/
*                                                                  0092
         L     @12,ASCBPTR                                         0092
         NI    ASCBNSWP(@12),B'11111110'                           0092
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE LOCAL LOCK                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0093
*   RFY                                                            0093
*    (GPR11P,                                                      0093
*     GPR12P,                                                      0093
*     GPR13P)RSTD;                                                 0093
*   GEN REFS(PSALITA);                                             0094
         LR    GPR00P,GPR13P        SAVE SAVE AREA ADDRESS
IHSTLCK4 SETLOCK RELEASE,TYPE=LOCAL,                                   X
               RELATED=(LOCAL,IRBMFIHA(IHSTLCK3))
         LR    GPR13P,GPR00P        RESTORE SAVE AREA ADDRESS
*   RFY                                                            0095
*    (GPR11P,                                                      0095
*     GPR12P,                                                      0095
*     GPR13P)UNRSTD;                                               0095
*   GEN SETS(IHPAGECB)(WAIT ECB=IHPAGECB);                         0096
*                                                                  0096
         WAIT ECB=IHPAGECB
*   /*****************************************************************/
*   /*                                                               */
*   /* STORE ADDRESS OF MODULE INTO MFROUTER VECTOR TABLES FOR TIMER */
*   /* EVENT. FIRST ESTABLISH ADDRESSABILITY TO MMV TIMER MG ROUTINE */
*   /* LIST                                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0097
*   RESPECIFY                                                      0097
*     STMMMGRL BASED(STMMEVNT(STMMTIME));                          0097
*                                                                  0097
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE IN ADDRESS OF MODULE                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0098
*   STMMMGAD(STMMNXMG(STMMTIME))=STPRADDR(STRVNPRT-1);             0098
*                                                                  0098
         L     @12,@PC00001+4                                      0098
         L     @12,IHMMVPTR(,@12)                                  0098
         L     @11,STMMNXMG(,@12)                                  0098
         SLA   @11,3                                               0098
         L     @12,STMMEVNT(,@12)                                  0098
         L     @08,@PC00001                                        0098
         L     @08,IHSMAPTR(,@08)                                  0098
         L     @08,STSMRVT(,@08)                                   0098
         L     @07,STRVNPRT(,@08)                                  0098
         SLA   @07,4                                               0098
         L     @08,STRVSPRT(,@08)                                  0098
         AL    @08,@CF01574                                        0098
         L     @08,STPRADDR-8(@07,@08)                             0098
         AL    @12,@CF01570                                        0098
         ST    @08,STMMMGAD(@11,@12)                               0098
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD EVENT MG MODULE IRBMFTCH, FIX AND STORE NAME INTO        */
*   /* RESOURCE LIST AND INTO THE MMV                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0099
*   GENERATE;                                                      0099
IHLOADM3 LOAD  EP=IRBMFTCH,RELATED=(MFIHLTCH,IRBMFTRM(TR0120))
         LA    @01,0(,@01)          CLEAR HIGH ORDER BYTE
         SLL   @01,3                GET LENGTH IN BYTES
*   STPRNAME(STRVNPRT)='IRBMFTCH';  /* NAME TO PRT                   */
         L     @12,@PC00001                                        0100
         L     @12,IHSMAPTR(,@12)                                  0100
         L     @12,STSMRVT(,@12)                                   0100
         L     @11,STRVNPRT(,@12)                                  0100
         LR    @08,@11                                             0100
         SLA   @08,4                                               0100
         L     @07,STRVSPRT(,@12)                                  0100
         ST    @08,@TF00001                                        0100
         ALR   @08,@07                                             0100
         AL    @08,@CF01569                                        0100
         MVC   STPRNAME(8,@08),@CC01553                            0100
*   STPRADDR(STRVNPRT)=GPR00P;      /* ADDRESS TO PRT                */
         L     @08,@TF00001                                        0101
         AL    @08,@CF01570                                        0101
         ST    GPR00P,STPRADDR-8(@08,@07)                          0101
*   STPRLGTH(STRVNPRT)=-(GPR01P);   /* SAVE NEGATIVE LENGTH TO FLAG
*                                      NEED FOR BRANCH TO PAGE FREE  */
         LCR   @08,GPR01P                                          0102
         L     @06,@TF00001                                        0102
         AL    @07,@CF01571                                        0102
         ST    @08,STPRLGTH-12(@06,@07)                            0102
*   STRVNPRT=STRVNPRT+1;            /* POINT TO NEXT PRT SLOT        */
*                                                                  0103
         AH    @11,@CH00048                                        0103
         ST    @11,STRVNPRT(,@12)                                  0103
*   /*****************************************************************/
*   /*                                                               */
*   /* GET LOCAL LOCK BEFORE PGFIX BRANCH ENTRY                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0104
*   RFY                                                            0104
*    (GPR11P,                                                      0104
*     GPR12P,                                                      0104
*     GPR13P)RSTD;                                                 0104
*   GEN REFS(PSALITA);                                             0105
         LR    GPR15P,GPR13P        SAVE SAVE AREA ADDRESS
IHSTLCK5 SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        X
               RELATED=(LOCAL,IRBMFIHA(IHSTLCK6))
         LR    GPR13P,GPR15P        RESTORE SAVE AREA ADDRESS
*   RFY                                                            0106
*    (GPR11P,                                                      0106
*     GPR12P,                                                      0106
*     GPR13P)UNRSTD;                                               0106
*                                                                  0106
*   /*****************************************************************/
*   /*                                                               */
*   /* SET NON SWPA BIT IN ASCB TO FORCE FIX IN PREF AREA    @YM8211P*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0107
*   ASCBNSWP=IHNSWPON;              /*                       @YM8211P*/
*                                                                  0107
         L     @12,ASCBPTR                                         0107
         OI    ASCBNSWP(@12),B'00000001'                           0107
*   /*****************************************************************/
*   /*                                                               */
*   /* FIX MODULE IRBMFTCH PAGE FIX WITH BRANCH ENTRY, TCB=0 TO KEEP */
*   /* FIXED WHILE MF1 SWAPPED OUT                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0108
*   RFY                                                            0108
*    (GPR02P,                                                      0108
*     GPR04P)RSTD;                                                 0108
*   GPR02P=GPR00P+GPR01P;           /* END ADDRESS                   */
         LR    GPR02P,GPR00P                                       0109
         AR    GPR02P,GPR01P                                       0109
*   GPR01P=GPR00P×IHCPGFIX;         /* STRT ADDRESS                  */
         LR    GPR01P,GPR00P                                       0110
         O     GPR01P,@CF01540                                     0110
*   GPR00P=ADDR(IHPAGECB);          /* ECB ADDRESS                   */
         LA    GPR00P,IHPAGECB                                     0111
*   GPR04P=0;                       /* TCB ADDR ZERO TO KEEP FIXED   */
         SR    @12,@12                                             0112
         LR    GPR04P,@12                                          0112
*   IHPAGECB=0;                                                    0113
         ST    @12,IHPAGECB                                        0113
*   CALL IEAVPSIB;                  /* CALL PAGE FIX ROUTINE         */
         L     @12,CVTPTR                                          0114
         L     @15,CVTVPSIB(,@12)                                  0114
         BALR  @14,@15                                             0114
*   RFY                                                            0115
*    (GPR02P,                                                      0115
*     GPR04P)UNRSTD;                                               0115
*                                                                  0115
*   /*****************************************************************/
*   /*                                                               */
*   /* RESET ASCB NON SWAP BIT                               @YM8211P*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0116
*   ASCBNSWP=IHNSWPOF;              /*                       @YM8211P*/
*                                                                  0116
         L     @12,ASCBPTR                                         0116
         NI    ASCBNSWP(@12),B'11111110'                           0116
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE LOCAL LOCK                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0117
*   RFY                                                            0117
*    (GPR11P,                                                      0117
*     GPR12P,                                                      0117
*     GPR13P)RSTD;                                                 0117
*   GEN REFS(PSALITA);                                             0118
         LR    GPR00P,GPR13P        SAVE SAVE AREA ADDRESS
IHSTLCK6 SETLOCK   RELEASE,TYPE=LOCAL,                                 X
               RELATED=(LOCAL,IRBMFIHA(IHSTLCK5))
         LR    GPR13P,GPR00P        RESTORE SAVE AREA ADDRESS
*   RFY                                                            0119
*    (GPR11P,                                                      0119
*     GPR12P,                                                      0119
*     GPR13P)UNRSTD;                                               0119
*   GEN SETS(IHPAGECB)(WAIT ECB=IHPAGECB);                         0120
*                                                                  0120
         WAIT ECB=IHPAGECB
*   /*****************************************************************/
*   /*                                                               */
*   /* STORE ADDRESS OF THE MODULE INTO MFROUTER VECTOR TABLE FOR THE*/
*   /* TEST CHANNEL SIGP EVENT                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0121
*   RESPECIFY                                                      0121
*     STMMMGRL BASED(STMMEVNT(STMMTCH));                           0121
*                                                                  0121
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE IN ADDRESS                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0122
*   STMMMGAD(STMMNXMG(STMMTCH))=STPRADDR(STRVNPRT-1);              0122
*                                                                  0122
         L     @12,@PC00001+4                                      0122
         L     @12,IHMMVPTR(,@12)                                  0122
         L     @11,STMMNXMG+8(,@12)                                0122
         SLA   @11,3                                               0122
         L     @12,STMMEVNT+8(,@12)                                0122
         L     @08,@PC00001                                        0122
         L     @08,IHSMAPTR(,@08)                                  0122
         L     @08,STSMRVT(,@08)                                   0122
         L     @07,STRVNPRT(,@08)                                  0122
         SLA   @07,4                                               0122
         L     @08,STRVSPRT(,@08)                                  0122
         AL    @08,@CF01574                                        0122
         L     @08,STPRADDR-8(@07,@08)                             0122
         AL    @12,@CF01570                                        0122
         ST    @08,STMMMGAD(@11,@12)                               0122
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD THE INTERVAL-DRIVEN MG ROUTINE (IRBMFDHP)                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0123
*   GENERATE;                                                      0123
*                                                                  0123
IHLOADM4 LOAD  EP=IRBMFDHP,RELATED=(MFIHLDHP,IRBMFTRM(TR0120))
         LA    @01,0(,@01)          CLEAR HIGH ORDER BYTE
         SLL   @01,3                GET LENGTH IN BYTES
*   /*****************************************************************/
*   /*                                                               */
*   /* STORE NAME, ADDRESS, AND LENGTH INTO PROGRAM RESOURCE TABLE   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0124
*   STPRNAME(STRVNPRT)='IRBMFDHP';  /* NAME TO PRT                   */
         L     @12,@PC00001                                        0124
         L     @12,IHSMAPTR(,@12)                                  0124
         L     @11,STSMRVT(,@12)                                   0124
         L     @08,STRVNPRT(,@11)                                  0124
         LR    @07,@08                                             0124
         SLA   @07,4                                               0124
         L     @06,STRVSPRT(,@11)                                  0124
         ST    @07,@TF00001                                        0124
         ALR   @07,@06                                             0124
         AL    @07,@CF01569                                        0124
         MVC   STPRNAME(8,@07),@CC01556                            0124
*   STPRADDR(STRVNPRT)=GPR00P;      /* ADDRESS TO PRT                */
         L     @07,@TF00001                                        0125
         AL    @07,@CF01570                                        0125
         ST    GPR00P,STPRADDR-8(@07,@06)                          0125
*   STPRLGTH(STRVNPRT)=GPR01P;      /* LENGTH TO PRT                 */
         L     @07,@TF00001                                        0126
         AL    @06,@CF01571                                        0126
         ST    GPR01P,STPRLGTH-12(@07,@06)                         0126
*   STRVNPRT=STRVNPRT+1;            /* POINT TO NEXT PRT SLOT        */
         LA    @07,1                                               0127
         AR    @08,@07                                             0127
         ST    @08,STRVNPRT(,@11)                                  0127
*   STSMINTP=GPR00P;                /* ADDRESS TO SMA                */
*                                                                  0128
         ST    GPR00P,STSMINTP(,@12)                               0128
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0129
*   RESPECIFY                                                      0129
*    (GPR00P,                                                      0129
*     GPR01P,                                                      0129
*     GPR14P,                                                      0129
*     GPR15P)UNRESTRICTED;                                         0129
*                                                                  0129
*   /*****************************************************************/
*   /*                                                               */
*   /* ALLOCATE GLOBAL KEY ZERO FIXED STORAGE FOR THE CHANNEL EVENT  */
*   /* DATA TABLES                                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0130
*   IHEVTSBP=IHSQASBP;              /* SUBPOOL                       */
*                                                                  0130
         MVI   IHEVTSBP,X'F5'                                      0130
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH                                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0131
*   IHEVTLEN=LENGTH(ECCEDT)+(CVTMAXMP+1)*(LENGTH(ECCPE)+(CSDCHAD+1)*
*       LENGTH(ECCDB));                                            0131
*                                                                  0131
         L     @12,CVTPTR                                          0131
         LH    @01,CVTMAXMP(,@12)                                  0131
         AR    @01,@07                                             0131
         L     @12,CVTCSD(,@12)                                    0131
         AH    @07,CSDCHAD(,@12)                                   0131
         MH    @07,@CH01564                                        0131
         AH    @07,@CH00044                                        0131
         MR    @00,@07                                             0131
         AH    @01,@CH00187                                        0131
         STCM  @01,7,IHEVTLEN                                      0131
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0132
*   RESPECIFY                                                      0132
*    (GPR00P,                                                      0132
*     GPR01P,                                                      0132
*     GPR14P,                                                      0132
*     GPR15P)RESTRICTED;                                           0132
*   GPR00P=IHEVTGMC;                /* GETMAIN CONTROL WORD TO REG   */
         L     GPR00P,IHEVTGMC                                     0133
*   GENERATE;                                                      0134
IHGETMN3 GETMAIN R,LV=(0),RELATED=(MFIHEVGM,IRBMFTRM(TR0220))
*   STSMEDAD=GPR01P;                /* ADDRESS TO SMA                */
*                                                                  0135
         L     @12,@PC00001                                        0135
         L     @12,IHSMAPTR(,@12)                                  0135
         ST    GPR01P,STSMEDAD(,@12)                               0135
*   /*****************************************************************/
*   /*                                                               */
*   /* MACDATE Y-2 73018                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0136
*   RESPECIFY                                                      0136
*    (GPR00P,                                                      0136
*     GPR01P,                                                      0136
*     GPR14P,                                                      0136
*     GPR15P)UNRESTRICTED;                                         0136
*                                                                  0136
*   /*****************************************************************/
*   /*                                                               */
*   /* STORE ADDRESS INTO STORAGE RESOURCE TABLE                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0137
*   STSGFREE(STRVNSGT)=IHEVTGMC;    /* SUBPOOL AND LENGTH            */
         L     @12,STSMRVT(,@12)                                   0137
         L     @11,STRVNSGT(,@12)                                  0137
         LR    @08,@11                                             0137
         SLA   @08,3                                               0137
         L     @15,STRVSSGT(,@12)                                  0137
         ST    @08,@TF00001                                        0137
         ALR   @08,@15                                             0137
         AL    @08,@CF01570                                        0137
         MVC   STSGFREE(4,@08),IHEVTGMC                            0137
*   STSGADD(STRVNSGT)=STSMEDAD;     /* ADDRESS                       */
         L     @08,@PC00001                                        0138
         L     @08,IHSMAPTR(,@08)                                  0138
         L     @08,STSMEDAD(,@08)                                  0138
         L     @14,@TF00001                                        0138
         AL    @15,@CF01571                                        0138
         ST    @08,STSGADD-4(@14,@15)                              0138
*   STRVNSGT=STRVNSGT+1;            /* POINT TO NEXT SGT SLOT        */
*                                                                  0139
         LA    @15,1                                               0139
         AR    @11,@15                                             0139
         ST    @11,STRVNSGT(,@12)                                  0139
*   /*****************************************************************/
*   /*                                                               */
*   /* STORE ADDRESS OF CHANNEL EVENT DATA TABLE INTO THE MFROUTER   */
*   /* TABLE TIMER AND TEST CHANNEL LISTS ESTABLISH ADDRESSABILITY TO*/
*   /* MMV TIMER MG ROUTINE LIST                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0140
*   RESPECIFY                                                      0140
*     STMMMGRL BASED(STMMEVNT(STMMTIME));                          0140
*                                                                  0140
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE IN ADDRESS                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0141
*   STMMMGDA(STMMNXMG(STMMTIME))=STSMEDAD;                         0141
*                                                                  0141
         L     @12,@PC00001+4                                      0141
         L     @12,IHMMVPTR(,@12)                                  0141
         L     @11,STMMNXMG(,@12)                                  0141
         LR    @14,@11                                             0141
         SLA   @14,3                                               0141
         L     @01,STMMEVNT(,@12)                                  0141
         AL    @01,@CF01571                                        0141
         ST    @08,STMMMGDA-4(@14,@01)                             0141
*   /*****************************************************************/
*   /*                                                               */
*   /* INDEX TO NEXT SAMPLING MG ROUTINE SLOT                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0142
*   STMMNXMG(STMMTIME)=STMMNXMG(STMMTIME)+1;                       0142
*                                                                  0142
         AR    @11,@15                                             0142
         ST    @11,STMMNXMG(,@12)                                  0142
*   /*****************************************************************/
*   /*                                                               */
*   /* ESTABLISH ADDRESSABILITY TO THE TEST CHANNEL MG ROUTINE LIST  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0143
*   RESPECIFY                                                      0143
*     STMMMGRL BASED(STMMEVNT(STMMTCH));                           0143
*                                                                  0143
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE IN DATA AREA ADDRESS                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0144
*   STMMMGDA(STMMNXMG(STMMTCH))=STSMEDAD;                          0144
*                                                                  0144
         L     @11,STMMNXMG+8(,@12)                                0144
         LR    @14,@11                                             0144
         SLA   @14,3                                               0144
         L     @01,STMMEVNT+8(,@12)                                0144
         AL    @01,@CF01571                                        0144
         ST    @08,STMMMGDA-4(@14,@01)                             0144
*   /*****************************************************************/
*   /*                                                               */
*   /* POINT TO NEXT MG ROUTINE SLOT ON TEST CHANNEL LIST            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0145
*   STMMNXMG(STMMTCH)=STMMNXMG(STMMTCH)+1;                         0145
*                                                                  0145
         AR    @11,@15                                             0145
         ST    @11,STMMNXMG+8(,@12)                                0145
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE CHANNEL EVENT DATA STRUCTURE. FIRST ZERO CHANNEL   */
*   /* EVENT DATA TABLE                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0146
*   ECCEDT=ECCEDT&&ECCEDT;                                         0146
*                                                                  0146
         XC    ECCEDT(16,@08),ECCEDT(@08)                          0146
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE CHANNEL EVENT DATA TABLE. FIRST SET POINTER TO CPE */
*   /* TABLE                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0147
*   ECCECPEQ=ADDR(ECCEDT)+LENGTH(ECCEDT);                          0147
         LA    @12,16                                              0147
         AR    @12,@08                                             0147
         ST    @12,ECCECPEQ(,@08)                                  0147
*   ECCECPUS=CVTMAXMP+1;            /* MAXIMUM NUMBER OF CPUS        */
         L     @11,CVTPTR                                          0148
         LH    @11,CVTMAXMP(,@11)                                  0148
         AR    @11,@15                                             0148
         STC   @11,ECCECPUS(,@08)                                  0148
*   ECCECCHK=IHSAMPCC;              /* NUMBER OF SAMPLES BETWEEN   0149
*                                      CONFIGURATION CHECKS          */
*                                                                  0149
         L     @14,@PC00001+8                                      0149
         MVC   ECCECCHK(4,@08),IHSAMPCC(@14)                       0149
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE CPE AND CDB TABLE STRUCTURES. FIRST POINT TO FIRST */
*   /* DDB SLOT                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0150
*   IHCDBPTR=ECCECPEQ+ECCECPUS*LENGTH(ECCPE);                      0150
         SLA   @11,3                                               0150
         AR    @12,@11                                             0150
         ST    @12,IHCDBPTR                                        0150
*   DO IHCPEIDX=1 TO ECCECPUS;      /* LOOP THROUGH CPU ENTRIES      */
*                                                                  0151
         LR    IHCPEIDX,@15                                        0151
         B     @DE00151                                            0151
@DL00151 DS    0H                                                  0152
*     /***************************************************************/
*     /*                                                             */
*     /* ZERO CPE ENTRY                                              */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0152
*     ECCPE(IHCPEIDX)=ECCPE(IHCPEIDX)&&ECCPE(IHCPEIDX);            0152
         LR    @12,IHCPEIDX                                        0152
         SLA   @12,3                                               0152
         L     @11,@PC00001                                        0152
         L     @11,IHSMAPTR(,@11)                                  0152
         L     @11,STSMEDAD(,@11)                                  0152
         L     @11,ECCECPEQ(,@11)                                  0152
         ST    @12,@TF00001                                        0152
         ALR   @12,@11                                             0152
         AL    @12,@CF01570                                        0152
         XC    ECCPE(8,@12),ECCPE(@12)                             0152
*     ECCPCDBQ(IHCPEIDX)=IHCDBPTR;  /* POINT TO NEXT CDB TABLE SLOT  */
*                                                                  0153
         L     @12,IHCDBPTR                                        0153
         L     @08,@TF00001                                        0153
         AL    @08,@CF01571                                        0153
         ST    @12,ECCPCDBQ-4(@08,@11)                             0153
*     /***************************************************************/
*     /*                                                             */
*     /* NUMBER OF CDB ENTRIES                                       */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0154
*     ECCPCNUM(IHCPEIDX)=CSDCHAD+1;                                0154
*                                                                  0154
         LA    @08,1                                               0154
         L     @02,CVTPTR                                          0154
         L     @02,CVTCSD(,@02)                                    0154
         LH    @02,CSDCHAD(,@02)                                   0154
         AR    @02,@08                                             0154
         L     @01,@TF00001                                        0154
         AL    @11,@CF01575                                        0154
         STH   @02,ECCPCNUM-2(@01,@11)                             0154
*     /***************************************************************/
*     /*                                                             */
*     /* POINT TO NEXT CDB TABLE SLOT                                */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0155
*     IHCDBPTR=IHCDBPTR+ECCPCNUM(IHCPEIDX)*LENGTH(ECCDB);          0155
*                                                                  0155
         MH    @02,@CH01564                                        0155
         AR    @12,@02                                             0155
         ST    @12,IHCDBPTR                                        0155
*     /***************************************************************/
*     /*                                                             */
*     /* ZERO ALL CDB ENTRIES                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0156
*     DO IHCDBIDX=1 TO ECCPCNUM(IHCPEIDX);                         0156
         B     @DE00156                                            0156
@DL00156 DS    0H                                                  0157
*       ECCDB(IHCDBIDX)=ECCDB(IHCDBIDX)&&ECCDB(IHCDBIDX);          0157
         LR    @12,@08                                             0157
         MH    @12,@CH01564                                        0157
         LR    @11,IHCPEIDX                                        0157
         SLA   @11,3                                               0157
         L     @02,@PC00001                                        0157
         L     @02,IHSMAPTR(,@02)                                  0157
         L     @02,STSMEDAD(,@02)                                  0157
         L     @02,ECCECPEQ(,@02)                                  0157
         AL    @02,@CF01571                                        0157
         L     @11,ECCPCDBQ-4(@11,@02)                             0157
         ALR   @11,@12                                             0157
         AL    @11,@CF01576                                        0157
         XC    ECCDB(20,@11),ECCDB(@11)                            0157
*     END;                                                         0158
         AH    @08,@CH00048                                        0158
@DE00156 ST    @08,IHCDBIDX                                        0158
         LR    @12,IHCPEIDX                                        0158
         SLA   @12,3                                               0158
         L     @11,@PC00001                                        0158
         L     @11,IHSMAPTR(,@11)                                  0158
         L     @11,STSMEDAD(,@11)                                  0158
         L     @11,ECCECPEQ(,@11)                                  0158
         AL    @11,@CF01575                                        0158
         CH    @08,ECCPCNUM-2(@12,@11)                             0158
         BNH   @DL00156                                            0158
*   END;                                                           0159
*                                                                  0159
         AH    IHCPEIDX,@CH00048                                   0159
@DE00151 L     @12,@PC00001                                        0159
         L     @12,IHSMAPTR(,@12)                                  0159
         L     @12,STSMEDAD(,@12)                                  0159
         SR    @11,@11                                             0159
         IC    @11,ECCECPUS(,@12)                                  0159
         CR    IHCPEIDX,@11                                        0159
         BNH   @DL00151                                            0159
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE CPE ENTRIES AND CDBS FOR VALID ONLINE CPUS         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0160
*   IHCPUMSK=IHCPUZER;              /* MASK FOR CPU ZERO             */
         MVC   IHCPUMSK(2),@CH01548                                0160
*   DO IHCPEIDX=1 TO ECCECPUS;      /* LOOP THROUGH CPU ADDRESSES    */
         LA    IHCPEIDX,1                                          0161
         B     @DE00161                                            0161
@DL00161 DS    0H                                                  0162
*     IF(CSDCPUAL&IHCPUMSK)^=0 THEN                                0162
         L     @12,CVTPTR                                          0162
         L     @11,CVTCSD(,@12)                                    0162
         SR    @08,@08                                             0162
         ICM   @08,3,IHCPUMSK                                      0162
         SR    @02,@02                                             0162
         ICM   @02,3,CSDCPUAL(@11)                                 0162
         NR    @08,@02                                             0162
         LTR   @08,@08                                             0162
         BZ    @RF00162                                            0162
*       DO;                         /* CPU WITH THIS ADDRESS IS    0163
*                                      ONLINE                        */
*                                                                  0163
*         /***********************************************************/
*         /*                                                         */
*         /* INITIALIZE CPE AND CDBS FOR THIS CPU. PROVIDE           */
*         /* ADDRESSABILITY TO PCCA                                  */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0164
*         PCCAPTR=PCCAT00P(IHCPEIDX);                              0164
*                                                                  0164
         LR    @11,IHCPEIDX                                        0164
         SLA   @11,2                                               0164
         L     @12,CVTPCCAT(,@12)                                  0164
         AL    @12,@CF01571                                        0164
         L     @12,PCCAT00P(@11,@12)                               0164
         ST    @12,PCCAPTR                                         0164
*         /***********************************************************/
*         /*                                                         */
*         /* INITIALIZE CDBS                                         */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0165
*         DO IHCDBIDX=1 TO ECCPCNUM(IHCPEIDX);                     0165
*                                                                  0165
         LA    @12,1                                               0165
         B     @DE00165                                            0165
@DL00165 DS    0H                                                  0166
*           /*********************************************************/
*           /*                                                       */
*           /* PROVIDE ADDRESSABILITY FOR CAT ENTRY                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0166
*           CATPTR=ADDR(PCCACAT)+(IHCDBIDX-1)*LENGTH(CAT);         0166
         L     @11,CVTPTR                                     3@ZP60030
         L     @11,1052(,@11) <=CVTCST   L     @11,PCCAPTR         0166
         L     @11,0(,@11)               LA    @11,PCCACAT(,@11)   0166
         LR    @08,@12                                             0166
         BCTR  @08,0                                               0166
         SLA   @08,4                     SLA   @08,3           @ZP60030
         AR    @11,@08                                             0166
         ST    @11,CATPTR                                          0166
*           /*********************************************************/
*           /*                                                       */
*           /* BYPASS IF CHANNEL IS NOT ONLINE                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0167
*           IF CATNOP='1'B THEN                                    0167
         TM    CATNOP(@11),B'01000000'                             0167
         BO    @RT00167                                            0167
*             GO TO IHLAB1;         /* GO TO NEXT CPU ADDRESS        */
*                                                                  0168
*           /*********************************************************/
*           /*                                                       */
*           /* SET CHANNEL TYPE AND MODEL NUMBER                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0169
*           ECCDCHID(IHCDBIDX)=CATCHID(1:2);                       0169
*                                                                  0169
         MH    @12,@CH01564                                        0169
         LR    @08,IHCPEIDX                                        0169
         SLA   @08,3                                               0169
         L     @02,@PC00001                                        0169
         L     @02,IHSMAPTR(,@02)                                  0169
         L     @02,STSMEDAD(,@02)                                  0169
         L     @02,ECCECPEQ(,@02)                                  0169
         AL    @02,@CF01571                                        0169
         L     @08,ECCPCDBQ-4(@08,@02)                             0169
         ST    @12,@TF00001                                        0169
         ALR   @12,@08                                             0169
         AL    @12,@CF01569                                        0169
         MVC   ECCDCHID-4(2,@12),CATCHID(@11)                      0169
*           /*********************************************************/
*           /*                                                       */
*           /* SET CHANNEL TYPE FIELD VALIDITY FLAG                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0170
*           IF CATNID='1'B THEN                                    0170
*                                                                  0170
         TM    CATNID(@11),B'00001000'                             0170
         BNO   @RF00170                                            0170
*             /*******************************************************/
*             /*                                                     */
*             /* INVALID CHANNEL TYPE FIELD                          */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0171
*             ECCDIVID(IHCDBIDX)='1'B;                             0171
*                                                                  0171
         AL    @08,@TF00001                                        0171
         AL    @08,@CF01576                                        0171
         OI    ECCDIVID(@08),B'00001000'                           0171
*           /*********************************************************/
*           /*                                                       */
*           /* SET CURRENT SIO COUNT                                 */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0172
*           ECCDLSIO(IHCDBIDX)=CATSIOCT;                           0172
*                                                                  0172
@RF00170 L     @12,IHCDBIDX                                        0172
         MH    @12,@CH01564                                        0172
         LR    @11,IHCPEIDX                                        0172
         SLA   @11,3                                               0172
         L     @08,@PC00001                                        0172
         L     @08,IHSMAPTR(,@08)                                  0172
         L     @08,STSMEDAD(,@08)                                  0172
         L     @08,ECCECPEQ(,@08)                                  0172
         AL    @08,@CF01571                                        0172
         L     @11,ECCPCDBQ-4(@11,@08)                             0172
         ST    @12,@TF00001                                        0172
         ALR   @12,@11                                             0172
         AL    @12,@CF01578                                        0172
         L     @08,CATPTR                                          0172
         MVC   ECCDLSIO-6(2,@12),CATSIOCT(@08)                     0172
*           /*********************************************************/
*           /*                                                       */
*           /* VALID CHANNEL ENTRY NOW                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0173
*           ECCDVALD(IHCDBIDX)='1'B;                               0173
*                                                                  0173
*           /*********************************************************/
*           /*                                                       */
*           /* ONLINE                                                */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0174
*           ECCDALIV(IHCDBIDX)='1'B;                               0174
         AL    @11,@TF00001                                        0174
         AL    @11,@CF01576                                        0174
         OI    ECCDVALD(@11),B'00000101'                           0174
*IHLAB1:                            /* END OF CHANNEL INITIALIZATION
*                                      PER CPU ADDRESS               */
*         END;                                                     0175
IHLAB1   LA    @12,1                                               0175
         A     @12,IHCDBIDX                                        0175
@DE00165 ST    @12,IHCDBIDX                                        0175
         LR    @11,IHCPEIDX                                        0175
         SLA   @11,3                                               0175
         L     @08,@PC00001                                        0175
         L     @08,IHSMAPTR(,@08)                                  0175
         L     @08,STSMEDAD(,@08)                                  0175
         L     @08,ECCECPEQ(,@08)                                  0175
         AL    @08,@CF01575                                        0175
         CH    @12,ECCPCNUM-2(@11,@08)                             0175
         BNH   @DL00165                                            0175
*         ECCPVALD(IHCPEIDX)='1'B;  /* MARK CPU ENTRY VALID NOW      */
         LR    @12,IHCPEIDX                                        0176
         SLA   @12,3                                               0176
         L     @11,@PC00001                                        0176
         L     @11,IHSMAPTR(,@11)                                  0176
         L     @11,STSMEDAD(,@11)                                  0176
         L     @11,ECCECPEQ(,@11)                                  0176
         ALR   @11,@12                                             0176
         AL    @11,@CF01570                                        0176
         OI    ECCPVALD(@11),B'00000001'                           0176
*       END;                                                       0177
*     IHCPUMSK=IHCPUMSK/2;          /* SHIFT CPU MASK BIT TO RIGHT 0178
*                                      ONE POSITION FOR NEXT CPU     */
@RF00162 SR    @12,@12                                             0178
         ICM   @12,3,IHCPUMSK                                      0178
         SRL   @12,1                                               0178
         STH   @12,IHCPUMSK                                        0178
*   END;                                                           0179
*                                                                  0179
         AH    IHCPEIDX,@CH00048                                   0179
@DE00161 L     @12,@PC00001                                        0179
         L     @12,IHSMAPTR(,@12)                                  0179
         L     @12,STSMEDAD(,@12)                                  0179
         SR    @11,@11                                             0179
         IC    @11,ECCECPUS(,@12)                                  0179
         CR    IHCPEIDX,@11                                        0179
         BNH   @DL00161                                            0179
*   /*****************************************************************/
*   /*                                                               */
*   /* CALCULATE LENGTH AND SUBPOOL OF INTERVAL DATA AREA AND STORE  */
*   /* INTO THE SMA LENGTH                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0180
*   STSMILEN=LENGTH(STSMIGMC)+LENGTH(SMFRCD73)+LENGTH(SMF73A)+(CVTMAXMP
*       +1)*(CSDCHAD+1)*LENGTH(SMF73B);                            0180
         L     @12,@PC00001                                        0180
         L     @12,IHSMAPTR(,@12)                                  0180
         LA    @11,1                                               0180
         L     @08,CVTPTR                                          0180
         LH    @01,CVTMAXMP(,@08)                                  0180
         AR    @01,@11                                             0180
         L     @08,CVTCSD(,@08)                                    0180
         AH    @11,CSDCHAD(,@08)                                   0180
         MR    @00,@11                                             0180
         SLA   @01,4                                               0180
         AH    @01,@CH01567                                        0180
         STCM  @01,7,STSMILEN(@12)                                 0180
*   RETURN CODE('2C'X);             /* INDICATE THAT CALLER MUST   0181
*                                      ENABLE THE MFROUTER,        0181
*                                      INITIALIZE IOS AND ENQ THE  0181
*                                      SYSTEM TQE                    */
         LA    @12,44                                              0181
         L     @13,4(,@13)                                         0181
         L     @00,@SIZDATD                                        0181
         LR    @01,@09                                             0181
         FREEMAIN R,LV=(0),A=(1)
         LR    @15,@12                                             0181
         L     @14,12(,@13)                                        0181
         LM    @00,@12,20(@13)                                     0181
         BR    @14                                                 0181
*   END                                                            0182
*                                                                  0182
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IFASMFR )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHACSD  )                                       */
*/*%INCLUDE SYSLIB  (IHAPCCAT)                                       */
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */
*/*%INCLUDE SYSLIB  (IECDCAT )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*                                                                  0182
*       ;                                                          0182
@DATA    DS    0H
@CH00044 DC    H'8'
@CH00187 DC    H'16'
@CH01564 DC    H'20'
@CH01567 DC    H'60'
@CH01548 DC    XL2'8000'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    3F
@TF00001 DS    F
IRBMFIHA CSECT
         DS    0F
@CF01574 DC    F'-24'
@CF01576 DC    F'-20'
@CF01569 DC    F'-16'
@CF01578 DC    F'-14'
@CF01570 DC    F'-8'
@CF01575 DC    F'-6'
@CF01571 DC    F'-4'
@CF00048 DC    F'1'
@CH00048 EQU   @CF00048+2
@CF01540 DC    XL4'42000000'
@DATD    DSECT
         DS    0D
PCCAPTR  DS    A
CATPTR   DS    A
IHCDBIDX DS    F
IHCDBPTR DS    A
IHPAGECB DS    F
IHCPUMSK DS    H
         DS    CL2
IHEVTGMC DS    CL4
         ORG   IHEVTGMC
IHEVTSBP DS    FL1
IHEVTLEN DS    FL3
         ORG   IHEVTGMC+4
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IRBMFIHA CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC01549 DC    C'IRBMFEVT'
@CC01550 DC    C'IRBMFECH'
@CC01553 DC    C'IRBMFTCH'
@CC01556 DC    C'IRBMFDHP'
IHSGTGMC DS    CL4
         ORG   IHSGTGMC
IHSGTSBP DC    AL1(0)
IHSGTLEN DC    AL3(4+8+8)
         ORG   IHSGTGMC+4
IHPRTGMC DS    CL4
         ORG   IHPRTGMC
IHPRTSBP DC    AL1(0)
IHPRTLEN DC    AL3(4+16+16+16+16)
         ORG   IHPRTGMC+4
IHPATCH  DS    CL100
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IHCPEIDX EQU   @03
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR02P   EQU   @02
GPR04P   EQU   @04
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR14F   EQU   @14
GPR15F   EQU   @15
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
STSMA    EQU   0
STSMOPT  EQU   STSMA
STSMOFLG EQU   STSMOPT+3
STSMSTA  EQU   STSMOFLG
STSMINTP EQU   STSMA+20
STSMEDAD EQU   STSMA+32
STSMIGMC EQU   STSMA+36
STSMILEN EQU   STSMIGMC+1
STSMRVT  EQU   STSMA+44
STMMEVTL EQU   0
STMMEVNT EQU   STMMEVTL
STMMNXMG EQU   STMMEVTL+4
STMMMGRL EQU   0
STMMMGAD EQU   STMMMGRL
STMMMGDA EQU   STMMMGRL+4
STRVT    EQU   0
STRVSPRT EQU   STRVT
STRVNPRT EQU   STRVT+4
STRVSSGT EQU   STRVT+8
STRVNSGT EQU   STRVT+12
STPRT    EQU   0
STPRNAME EQU   STPRT
STPRADDR EQU   STPRT+8
STPRLGTH EQU   STPRT+12
STSGT    EQU   0
STSGFREE EQU   STSGT
STSGADD  EQU   STSGT+4
SMFRCD73 EQU   0
SMF73SIZ EQU   SMFRCD73+18
SMF73PTR EQU   0
SMF73A   EQU   0
SMF73SHC EQU   SMF73A
SMF73B   EQU   0
SMF73FG2 EQU   SMF73B+3
ECCEDT   EQU   0
ECCECPEQ EQU   ECCEDT
ECCECPUS EQU   ECCEDT+7
ECCECCHK EQU   ECCEDT+12
ECCPE    EQU   0
ECCPFLGS EQU   ECCPE
ECCPVALD EQU   ECCPFLGS
ECCPCNUM EQU   ECCPE+2
ECCPCDBQ EQU   ECCPE+4
ECCDB    EQU   0
ECCDFLGS EQU   ECCDB
ECCDIVID EQU   ECCDFLGS
ECCDVALD EQU   ECCDFLGS
ECCDALIV EQU   ECCDFLGS
ECCDCHID EQU   ECCDB+4
ECCDLSIO EQU   ECCDB+6
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTRSV90 EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ASCB     EQU   0
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBNSWP EQU   ASCBFLG1
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
CSD      EQU   0
CSDCHAD  EQU   CSD+6
CSDCPUAL EQU   CSD+8
CSDSCWRD EQU   CSD+12
CSDSCFL1 EQU   CSDSCWRD
CSDSCFL2 EQU   CSDSCWRD+1
CSDSCFL3 EQU   CSDSCWRD+2
CSDSCFL4 EQU   CSDSCWRD+3
CSDFLAGS EQU   CSD+23
PCCAVT   EQU   0
PCCAT00P EQU   PCCAVT
PCCA     EQU   0
PCCATMST EQU   PCCA+128
PCCATMFL EQU   PCCATMST
PCCATODE EQU   PCCATMST+1
PCCACCE  EQU   PCCATMST+2
PCCAINTE EQU   PCCATMST+3
PCCAEMSB EQU   PCCA+136
PCCAEMSI EQU   PCCAEMSB
PCCARISP EQU   PCCAEMSI
PCCAEMS2 EQU   PCCAEMSI+1
PCCAEMS3 EQU   PCCAEMSI+2
PCCARMSB EQU   PCCAEMSI+3
PCCAWERP EQU   PCCA+280
PCCACHPF EQU   PCCAWERP+4
PCCACHBL EQU   PCCAWERP+5
PCCACHVA EQU   PCCAWERP+6
PCCACHTS EQU   PCCAWERP+7
PCCACHS1 EQU   PCCA+288
PCCACHS2 EQU   PCCA+289
PCCACHRB EQU   PCCA+290
PCCACHF1 EQU   PCCA+308
PCCACHF2 EQU   PCCA+309
PCCACHF3 EQU   PCCA+310
PCCACHF4 EQU   PCCA+311
PCCACAT  EQU   PCCA+384
CAT      EQU   0
CATENTRY EQU   CAT
CATFLG   EQU   CATENTRY
CATNOP   EQU   CATFLG
CATNID   EQU   CATFLG
CATFLA   EQU   CAT+1
CATSIOCT EQU   CAT+2
CATCHID  EQU   CAT+4
IHGMCWRD EQU   0
IEAVPSIB EQU   0
IKEBC    EQU   0
IKEBF15  EQU   0
IKEBF31  EQU   0
IKEBP15  EQU   0
IKEBP31  EQU   0
IKEBP8   EQU   0
IHSMAPTR EQU   0
IHMMVPTR EQU   0
IHSAMPCC EQU   0
STSMB    EQU   STSMOPT
@NM00004 EQU   STSMB+3
STSMDEVF EQU   @NM00004
STSMC    EQU   STSMOPT
@NM00006 EQU   STSMC+3
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTMAXMP EQU   CVTS01+128
CVTCSD   EQU   CVTS01+312
CVTPCCAT EQU   CVTS01+416
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTVPSIB EQU   CVTS01+456
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
ASCBPTR  EQU   PSAAOLD
PSARSVTE EQU   PSARSVT
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
STSMWKLD EQU   @NM00006
@NM00007 EQU   @NM00006
@NM00005 EQU   STSMC
STSMCRDR EQU   STSMDEVF
STSMUNIT EQU   STSMDEVF
STSMGRAP EQU   STSMDEVF
STSMDA   EQU   STSMDEVF
STSMTP   EQU   STSMDEVF
STSMTAPE EQU   STSMDEVF
@NM00003 EQU   STSMB
CATEND   EQU   CAT+8
CASFLARS EQU   CATFLA
CATBSY   EQU   CATFLA
CATFLG7  EQU   CATFLG
CATFLG6  EQU   CATFLG
CATFLG5  EQU   CATFLG
CATNCPU  EQU   CATFLG
CATNGEN  EQU   CATFLG
CATRES1  EQU   CATFLG
@NM00012 EQU   PCCA+512
PCCARV36 EQU   PCCA+380
PCCARV35 EQU   PCCA+378
PCCARV01 EQU   PCCA+377
PCCACPUM EQU   PCCA+376
PCCARV63 EQU   PCCA+372
PCCARV62 EQU   PCCA+368
PCCARV61 EQU   PCCA+364
PCCARV60 EQU   PCCA+360
PCCARV59 EQU   PCCA+356
PCCARV58 EQU   PCCA+352
PCCARV57 EQU   PCCA+348
PCCARV56 EQU   PCCA+344
PCCARV55 EQU   PCCA+340
PCCARV54 EQU   PCCA+336
PCCALOGA EQU   PCCA+332
PCCACHID EQU   PCCA+324
PCCACHSV EQU   PCCA+312
PCCARV79 EQU   PCCACHF4
PCCARV78 EQU   PCCACHF4
PCCARV77 EQU   PCCACHF4
PCCARV76 EQU   PCCACHF4
PCCARV75 EQU   PCCACHF4
PCCARV74 EQU   PCCACHF4
PCCARV73 EQU   PCCACHF4
PCCARV72 EQU   PCCACHF4
PCCARV71 EQU   PCCACHF3
PCCARV70 EQU   PCCACHF3
PCCARV69 EQU   PCCACHF3
PCCARV68 EQU   PCCACHF3
PCCARV67 EQU   PCCACHF3
PCCARV66 EQU   PCCACHF3
PCCARV65 EQU   PCCACHF3
PCCARV64 EQU   PCCACHF3
PCCACF28 EQU   PCCACHF2
PCCACF27 EQU   PCCACHF2
PCCACF26 EQU   PCCACHF2
PCCACF25 EQU   PCCACHF2
PCCACF24 EQU   PCCACHF2
PCCACF23 EQU   PCCACHF2
PCCACF22 EQU   PCCACHF2
PCCACF21 EQU   PCCACHF2
PCCACF18 EQU   PCCACHF1
PCCACF17 EQU   PCCACHF1
PCCACF16 EQU   PCCACHF1
PCCACF15 EQU   PCCACHF1
PCCACF14 EQU   PCCACHF1
PCCACF13 EQU   PCCACHF1
PCCACF12 EQU   PCCACHF1
PCCACF11 EQU   PCCACHF1
PCCARV05 EQU   PCCA+306
PCCACHPB EQU   PCCA+305
PCCALGP2 EQU   PCCA+304
PCCALGP1 EQU   PCCA+303
PCCALOGL EQU   PCCA+302
PCCARV80 EQU   PCCA+300
PCCACHW2 EQU   PCCA+296
PCCACHW1 EQU   PCCA+292
PCCAIOSI EQU   PCCA+291
PCCACNRB EQU   PCCACHRB
PCCACCVB EQU   PCCACHRB
PCCACSNB EQU   PCCACHRB
PCCARV52 EQU   PCCACHRB
PCCACHIB EQU   PCCACHRB
PCCACTIB EQU   PCCACHRB
PCCACINB EQU   PCCACHRB
PCCACSIB EQU   PCCACHRB
PCCARV51 EQU   PCCACHS2
PCCARV50 EQU   PCCACHS2
PCCARV49 EQU   PCCACHS2
PCCACURC EQU   PCCACHS2
PCCACNLG EQU   PCCACHS2
PCCACMOD EQU   PCCACHS2
PCCACALT EQU   PCCACHS2
PCCACIOR EQU   PCCACHS2
PCCARV47 EQU   PCCACHS1
PCCACUCB EQU   PCCACHS1
PCCACIBC EQU   PCCACHS1
PCCACAND EQU   PCCACHS1
PCCACNLS EQU   PCCACHS1
PCCACFRR EQU   PCCACHS1
PCCACNRE EQU   PCCACHS1
PCCACCMP EQU   PCCACHS1
PCCACSEQ EQU   PCCACHTS
PCCACDIN EQU   PCCACHTS
PCCARV44 EQU   PCCACHTS
PCCARV43 EQU   PCCACHTS
PCCACTEC EQU   PCCACHTS
PCCACDAV EQU   PCCACHVA
PCCACCHV EQU   PCCACHVA
PCCACCMD EQU   PCCACHVA
PCCACUNS EQU   PCCACHVA
PCCACSQV EQU   PCCACHVA
PCCARV42 EQU   PCCACHVA
PCCARV41 EQU   PCCACHVA
PCCACITF EQU   PCCACHVA
PCCARV40 EQU   PCCACHBL
PCCARV39 EQU   PCCACHBL
PCCARV38 EQU   PCCACHBL
PCCACCUE EQU   PCCACHBL
PCCACSTG EQU   PCCACHBL
PCCACSCU EQU   PCCACHBL
PCCACCHA EQU   PCCACHBL
PCCACCPU EQU   PCCACHBL
PCCACNOR EQU   PCCACHPF
PCCACCNT EQU   PCCACHPF
PCCACSNS EQU   PCCACHPF
PCCARV37 EQU   PCCACHPF
PCCACHIO EQU   PCCACHPF
PCCACTIO EQU   PCCACHPF
PCCACINT EQU   PCCACHPF
PCCACSIO EQU   PCCACHPF
PCCACHUB EQU   PCCAWERP
PCCACHEL EQU   PCCA+168
PCCALRBR EQU   PCCA+164
PCCALRBV EQU   PCCA+160
PCCAPWAR EQU   PCCA+156
PCCAPWAV EQU   PCCA+152
PCCAEMSA EQU   PCCAEMSB+12
PCCAEMSE EQU   PCCAEMSB+8
PCCAEMSP EQU   PCCAEMSB+4
PCCARMS  EQU   PCCARMSB
PCCARV34 EQU   PCCARMSB
PCCARV33 EQU   PCCARMSB
PCCARV32 EQU   PCCARMSB
PCCARV31 EQU   PCCARMSB
PCCARV30 EQU   PCCARMSB
PCCARV29 EQU   PCCARMSB
PCCARV28 EQU   PCCARMSB
PCCARV27 EQU   PCCAEMS3
PCCARV26 EQU   PCCAEMS3
PCCARV25 EQU   PCCAEMS3
PCCARV24 EQU   PCCAEMS3
PCCARV23 EQU   PCCAEMS3
PCCARV22 EQU   PCCAEMS3
PCCARV21 EQU   PCCAEMS3
PCCARV20 EQU   PCCAEMS3
PCCARV19 EQU   PCCAEMS2
PCCARV18 EQU   PCCAEMS2
PCCARV17 EQU   PCCAEMS2
PCCARV16 EQU   PCCAEMS2
PCCARV15 EQU   PCCAEMS2
PCCARV14 EQU   PCCAEMS2
PCCARV13 EQU   PCCAEMS2
PCCARV12 EQU   PCCAEMS2
PCCARV11 EQU   PCCARISP
PCCARV10 EQU   PCCARISP
PCCARV09 EQU   PCCARISP
PCCARV08 EQU   PCCARISP
PCCARV07 EQU   PCCARISP
PCCARV06 EQU   PCCARISP
PCCASERL EQU   PCCARISP
PCCAPARL EQU   PCCARISP
PCCARPB  EQU   PCCA+132
PCCACTIN EQU   PCCAINTE
PCCANFIN EQU   PCCAINTE
PCCANUIN EQU   PCCAINTE
PCCACTCC EQU   PCCACCE
PCCANFCC EQU   PCCACCE
PCCANUCC EQU   PCCACCE
PCCACTTD EQU   PCCATODE
PCCANFTD EQU   PCCATODE
PCCANUTD EQU   PCCATODE
PCCARV04 EQU   PCCATMFL
PCCARV03 EQU   PCCATMFL
PCCARV02 EQU   PCCATMFL
PCCAMINT EQU   PCCATMFL
PCCAMCC  EQU   PCCATMFL
PCCAVKIL EQU   PCCATMFL
PCCASYNC EQU   PCCATMFL
PCCAINIT EQU   PCCATMFL
PCCARV9E EQU   PCCA+124
PCCARV9D EQU   PCCA+120
PCCARV9C EQU   PCCA+116
PCCARV9B EQU   PCCA+112
PCCARV9A EQU   PCCA+108
PCCARV99 EQU   PCCA+104
PCCARV98 EQU   PCCA+100
PCCARV97 EQU   PCCA+96
PCCARV96 EQU   PCCA+92
PCCARV95 EQU   PCCA+88
PCCARV94 EQU   PCCA+84
PCCARV93 EQU   PCCA+80
PCCARV92 EQU   PCCA+76
PCCARV91 EQU   PCCA+72
PCCARV90 EQU   PCCA+68
PCCARV89 EQU   PCCA+64
PCCARV88 EQU   PCCA+60
PCCARV87 EQU   PCCA+56
PCCARV86 EQU   PCCA+52
PCCARV85 EQU   PCCA+48
PCCARV84 EQU   PCCA+44
PCCARV83 EQU   PCCA+40
PCCARV82 EQU   PCCA+36
PCCARV81 EQU   PCCA+32
PCCAPSAR EQU   PCCA+28
PCCAPSAV EQU   PCCA+24
PCCATQEP EQU   PCCA+20
PCCACAFM EQU   PCCA+18
PCCACPUA EQU   PCCA+16
PCCACPID EQU   PCCA+4
PCCAPCCA EQU   PCCA
@NM00011 EQU   CSD+160
CSDMASK  EQU   CSD+128
CSDUCNT  EQU   CSD+124
CSDTCNT  EQU   CSD+120
CSDGDTOD EQU   CSD+116
CSDGDINT EQU   CSD+112
CSDGDCC  EQU   CSD+108
CSDDDRCT EQU   CSD+106
CSDRV044 EQU   CSD+104
CSDMAFF  EQU   CSD+24
CSDRV038 EQU   CSDFLAGS
CSDRV037 EQU   CSDFLAGS
CSDRV036 EQU   CSDFLAGS
CSDRV035 EQU   CSDFLAGS
CSDRV034 EQU   CSDFLAGS
CSDRV033 EQU   CSDFLAGS
CSDRV032 EQU   CSDFLAGS
CSDMP    EQU   CSDFLAGS
CSDACR   EQU   CSD+22
CSDMF1CP EQU   CSD+20
CSDRV043 EQU   CSD+16
CSDRV030 EQU   CSDSCFL4
CSDRV029 EQU   CSDSCFL4
CSDRV028 EQU   CSDSCFL4
CSDRV027 EQU   CSDSCFL4
CSDRV026 EQU   CSDSCFL4
CSDRV025 EQU   CSDSCFL4
CSDRV024 EQU   CSDSCFL4
CSDRV023 EQU   CSDSCFL4
CSDRV022 EQU   CSDSCFL3
CSDRV021 EQU   CSDSCFL3
CSDRV020 EQU   CSDSCFL3
CSDRV019 EQU   CSDSCFL3
CSDRV018 EQU   CSDSCFL3
CSDRV017 EQU   CSDSCFL3
CSDRV016 EQU   CSDSCFL3
CSDRV015 EQU   CSDSCFL3
CSDRV014 EQU   CSDSCFL2
CSDRV013 EQU   CSDSCFL2
CSDRV012 EQU   CSDSCFL2
CSDRV011 EQU   CSDSCFL2
CSDRV010 EQU   CSDSCFL2
CSDRV009 EQU   CSDSCFL2
CSDRV008 EQU   CSDSCFL2
CSDRV007 EQU   CSDSCFL2
CSDRV006 EQU   CSDSCFL1
CSDRV005 EQU   CSDSCFL1
CSDRV004 EQU   CSDSCFL1
CSDRV003 EQU   CSDSCFL1
CSDRV002 EQU   CSDSCFL1
CSDRV001 EQU   CSDSCFL1
CSDSYSND EQU   CSDSCFL1
CSDRV042 EQU   CSDSCFL1
CSDCPUOL EQU   CSD+10
CSDSAFF  EQU   CSDCPUAL
CSDCPUJS EQU   CSD+4
CSDCSD   EQU   CSD
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00010 EQU   CVTFIX+248
@NM00009 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTRSVA1 EQU   CVTXTNT2+48
CVTRSVA0 EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTRSV90
CVTRSV9G EQU   CVTRSV90
CVTRSV9F EQU   CVTRSV90
CVTRSV9E EQU   CVTRSV90
CVTRSV9D EQU   CVTRSV90
CVTRSV9C EQU   CVTRSV90
CVTRSV9B EQU   CVTRSV90
CVTRSV9A EQU   CVTRSV90
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTRV484 EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTRV319 EQU   CVTUSR
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
ECCDOLAP EQU   ECCDB+16
ECCDBUSY EQU   ECCDB+12
ECCDSIOS EQU   ECCDB+8
ECCDCMOD EQU   ECCDCHID
ECCDCTYP EQU   ECCDCHID
ECCDRS02 EQU   ECCDB+1
ECCDCCHG EQU   ECCDFLGS
ECCDRS01 EQU   ECCDFLGS
ECCPRS02 EQU   ECCPE+1
ECCPRS01 EQU   ECCPFLGS
ECCESAMP EQU   ECCEDT+8
ECCERS01 EQU   ECCEDT+4
SMF73OLP EQU   SMF73B+12
SMF73BSY EQU   SMF73B+8
SMF73CNT EQU   SMF73B+4
SMF73STA EQU   SMF73FG2
SMF73VAC EQU   SMF73FG2
SMF73IID EQU   SMF73FG2
@NM00008 EQU   SMF73FG2
SMF73TYP EQU   SMF73FG2
SMF73HID EQU   SMF73B+2
SMF73CID EQU   SMF73B
SMF73RV2 EQU   SMF73A+6
SMF73SHD EQU   SMF73A+4
SMF73CHA EQU   SMF73A+2
SMF73RLS EQU   SMFRCD73+44
SMF73RV1 EQU   SMFRCD73+42
SMF73MFV EQU   SMFRCD73+40
SMF73SAM EQU   SMFRCD73+36
SMF73SUB EQU   SMFRCD73+34
SMF73CYC EQU   SMFRCD73+32
SMF73INT EQU   SMFRCD73+28
SMF73DAT EQU   SMFRCD73+24
SMF73IST EQU   SMFRCD73+20
SMF73SID EQU   SMFRCD73+14
SMF73DTE EQU   SMFRCD73+10
SMF73TME EQU   SMFRCD73+6
SMF73RTY EQU   SMFRCD73+5
SMF73FLG EQU   SMFRCD73+4
SMF73SEG EQU   SMFRCD73+2
SMF73LEN EQU   SMFRCD73
STSGLEN  EQU   STSGFREE+1
STSGSP   EQU   STSGFREE
STSMRSV1 EQU   STSMA+53
STSMSSP  EQU   STSMA+52
STSMLCOM EQU   STSMA+48
STSMIADD EQU   STSMA+40
STSMISP  EQU   STSMIGMC
STSMENTR EQU   STSMA+28
STSMSAVE EQU   STSMA+24
STSMTERM EQU   STSMA+12
STSMINIT EQU   STSMA+4
@NM00002 EQU   STSMOFLG
@NM00001 EQU   STSMOPT
@NM00036 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00035 EQU   PSA+1032
PSAUSEND EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSARV054 EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00034 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00033 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00032 EQU   FLCFSA
@NM00031 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00030 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00029 EQU   FLCIOA
@NM00028 EQU   FLCMCLA+15
@NM00027 EQU   FLCMCLA+14
@NM00026 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00025 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00024 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00023 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00022 EQU   FLCPER
@NM00021 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00020 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00019 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00018 EQU   FLCPIILC
@NM00017 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00016 EQU   FLCSVILC
@NM00015 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00014 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00013 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00167 EQU   IHLAB1
@ENDDATA EQU   *
         END   IRBMFIHA,(C'PL/S-II',0502,74086)
/*
//STEP05  EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  *
  IDENTIFY IRBMFIHA('ZP60030')
/*
//SYSUT2   DD  DSN=&&SMPMCS,DISP=(MOD,PASS)
//SYSIN    DD  DUMMY
//STEP06  EXEC SMPREC
//SMPPTFIN DD  DSN=&&SMPMCS,DISP=(OLD,DELETE)
//SMPCNTL  DD  *
  RECEIVE SELECT(ZP60030).
/*
//STEP07  EXEC SMPAPP
//SMPCNTL  DD  *
  APPLY SELECT(ZP60030) DIS(WRITE).
/*
//
