)ATTR
^ TYPE(TEXT) INTENS(LOW) SKIP(ON)
÷ TYPE(TEXT) INTENS(HIGH) SKIP(ON)
` TYPE(TEXT) COLOR(YELLOW) SKIP(ON)
{ TYPE(TEXT) COLOR(GREEN) SKIP(ON)
} TYPE(TEXT) COLOR(RED) SKIP(ON)
! TYPE(TEXT) COLOR(PINK) SKIP(ON)
| TYPE(TEXT) COLOR(TURQ) SKIP(ON)
~ TYPE(TEXT) COLOR(GREEN) HILITE(REVERSE) SKIP(ON)
@ TYPE(TEXT) COLOR(TURQ) HILITE(REVERSE) SKIP(ON)
? TYPE(TEXT) COLOR(YELLOW) HILITE(REVERSE) SKIP(ON)
)BODY
÷TUTORIAL?             `<| SHOWMVS Batch, TSO or ISPF `>?             ÷T
_Y^
~
~  ^  |Purpose :{program/command`SHOWMVS{displays various information ab
~  ^          {the÷MVS{system you're running on.`SHOWMVS{can run in Batc
~  ^          {or as a TSO command and write the output to a÷QSAM{data-s
~  ^          {instead of displaying the data via the ISPF browse servic
~  ^  `Options selection :
~  ^  !1.|Environment :{just say how to÷execute{SHOWMVS (BATCH = submite
~  ^          `job{or TSO =`command{or ISPF =`browse{service).
~  ^  !2.|CAPS :}ON{to force÷uppercase{output.^Default is OFF.
~  ^  !3.|Page heading :}YES{to have or}NO{to not have the heading at to
~  ^          {of all pages.^Default is YES.
~  ^  !4.|Lines per page :{set the desired number.^Acceptable range is 2
~  ^           up to 200, default is 60.
~  ^  !5.|Starting page number :{this is the desired initial page count.
~  ^           Acceptable range is 1-90000, default is 1.
~  ^                                               ?(continued on next p
~  @
~  ^Hit÷END key^to exit help.
~
^
)PROC
  &ZUP = PAJTSHW0
  &ZCONT = PAJTSHW1
)END
