)ATTR DEFAULT(%$_)
)BODY
%Tutorial --------------------------  EDIT  ---------------------------
%COMMAND ===>_ZCMD
$
%                     ------------------------------------
                      ×      Edit Macro  "MOVECOLS"      ×
                      ------------------------------------
$
         %2.$Mark the range of lines containing the columns to be exchan
             with the "X" range command on the line numbers, then type o
             COMMAND line%MOVECOLS$with START, STOP and TO operands, as
            %COMMAND ===> MOVECOLS 11 20 31
            %Before$********************** TOP OF DATA *****************
            $=COLS> ----+----1----+----2----+----3----+----4----+----5--
            %X3$001 AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEE..
            $000002 AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEE..
            $000003 AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEE..
            %After$*********************** TOP OF DATA *****************
            $=COLS> ----+----1----+----2----+----3----+----4----+----5--
            $000001 AAAAAAAAADDDDDDDDDDDCCCCCCCCCCBBBBBBBBBBEEEEEEEEEE..
            $000002 AAAAAAAAADDDDDDDDDDDCCCCCCCCCCBBBBBBBBBBEEEEEEEEEE..
            $000003 AAAAAAAAADDDDDDDDDDDCCCCCCCCCCBBBBBBBBBBEEEEEEEEEE..
)PROC
  &ZUP = PAJTMVC1
  &ZCONT = PAJTMVC
)END
