)ATTR
` TYPE(TEXT) COLOR(YELLOW) SKIP(ON)
{ TYPE(TEXT) COLOR(GREEN) SKIP(ON)
} TYPE(TEXT) COLOR(RED) SKIP(ON)
! TYPE(TEXT) COLOR(PINK) SKIP(ON)
| TYPE(TEXT) COLOR(TURQ) SKIP(ON)
@ TYPE(TEXT) COLOR(YELLOW) HILITE(REVERSE) SKIP(ON)
× TYPE(TEXT) COLOR(GREEN) HILITE(REVERSE) SKIP(ON)
# TYPE(TEXT) COLOR(RED) HILITE(REVERSE) SKIP(ON)
~ TYPE(TEXT) COLOR(PINK) HILITE(REVERSE) SKIP(ON)
Ö TYPE(TEXT) COLOR(TURQ) HILITE(REVERSE) SKIP(ON)
\ TYPE(TEXT) COLOR(BLUE) HILITE(REVERSE) SKIP(ON)
? TYPE(TEXT) COLOR(WHITE) HILITE(REVERSE) SKIP(ON)
)BODY
`-------------------------<| Various ... Option Menu `>-----------------
{Select OPTION%===>_ZCMD
+
\ % D{DHC     +- Hex/Decimal calculator               ×
\ % S{SEE     +- See current ISPF panel               ×  |Userid -!&ZUSE
Ö ! V{T3270FS +- IBM 3270 full-screen terminal test   ×  |Prefix -!&ZPRE
× ` T|SEIKO   +- Clock-watcher                        ×  |Today  -!&ZDAT
+                                                     ×  |Julian -!&ZJDA
? } X%EXIT     - Return to SPF+                       ×  |Time   -?  &ZT
+                                                     ×
@            |G A M E S - Various games@             +%-----------------
Ö %N1 `Blackjack   Ö %N4 `Lunar       Ö %N7 `Klingon     Ö %   `
Ö %N2 `Kalah       Ö %N5 `Decider     Ö %N8 `Strek       Ö %   `
Ö %N3 `Life        Ö %N6 `Jotto       Ö %   `            Ö %   `
%----~  {Only on a terminal with}PS{and}GE{:~  %- - - - - - - - - - - -
# %G1 `Diver       # %G3 Snake        # %   `            # %   `
# %G2 `Poker       # %G4 `Worm        # %   `            # %   `
%----~  {Only on a}graphic{terminal :~         %- - - - - - - - - - - -
# %R1 `GDDM-demo   # %R2 `ANIM-demo   # %   `            # %   `
%-----------------------------------------------------------------------
+
+Press%END KEY+to return to the PRIMARY OPTION MENU
+
)INIT
  &ZPRIM = YES
  .CURSOR = ZCMD
)PROC
  &ZSEL = TRANS (TRUNC (&ZCMD,'.')
                D,'CMD(DHC)'
                S,'CMD(SEE)'
                V,'PANEL(PAJ3270)'
                T,'CMD(SEIKO)'
                N1,'CMD(%BLACKJK)'
                N2,'CMD(KALAH)'
                N3,'PANEL(PAJLIFE)'
                N4,'CMD(LUNAR)'
                N5,'CMD(%DECIDER)'
                N6,'CMD(%JOTTO)'
                N7,'CMD(%KLPROC)'
                N8,'CMD(STREK)'
                G1,'CMD(DIVER)'
                G2,'CMD(POKER)'
                G3,'PANEL(PAJSNK)'
                G4,'PANEL(PAJWRM)'
                R1,'CMD(%PAJCGDDM)'
                R2,'CMD(%PAJCANIM)'
              BIRD,'CMD(%PAJCBIRD)'
                X,'EXIT'
              ' ',' '
                *,'?' )
)END
<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
