//RMFPPDSP PROC SID=,              SYSTEM IDENTIFIER                   X
//             DATE=,                   RECORD SELECTION DATE          X
//             DATE1=,                  RECORD SELECTION BEGIN DATE    X
//             DATE2=,                  RECORD SELECTION END   DATE    X
//             DISP=KEEP,          INPUT DATASET DISPOSITION           X
//             LINKVOL=SYSPKB,     MVS/370 SYS1.LINKLIB VOLUME         X
//             PPPGM=ERBRMFPP,     RMF POST PROCESSING PROGRAM         X
//             REGN=2048K          EXECUTION REGION SIZE
//*************************************************************
//*                                                           *
//*                                                           *
//*            THIS PROCEDURE CONTAINS THE EXECUTION JCL      *
//*            FOR DAILY RMF REPORTS USING THE SORTED RMF     *
//*            DATA FILE CREATED BY PROCEDURE RMFPPXSP.       *
//*                                                           *
//*            TO DELETE THE WORK FILES AS THE LAST STEP      *
//*            OF THE REPORTING JOBSTREAM, EXECUTE THIS       *
//*            PROCEDURE SPECIFYING                           *
//*            "DISP=DELETE,PPPGM=IEFBR14" ALONG WITH THE     *
//*            OTHER PARAMETERS.                              *
//*                                                           *
//*                                               04/06/84 TJA*
//*************************************************************
//*                                                         ***
//*>>>>>>>>>>>>>>C U I C   D I S C L A I M E R<<<<<<<<<<<<<<***
//*                                                         ***
//*************************************************************
//*            THE INFORMATION OR MATERIAL BEING PROVIDED   ***
//*      BY COMMERCIAL UNION INSURANCE COMPANY (CUIC),      ***
//*      WHETHER IN HARD COPY OR MACHINE READABLE FORM,     ***
//*      HAS BEEN DEVELOPED BY CUIC FOR ITS OWN PURPOSE     ***
//*      AND FOR USE ON ITS OWN EQUIPMENT AND WITHIN ITS    ***
//*      OWN DATA PROCESSING SYSTEM.  CUIC MAKES NO         ***
//*      REPRESENTATIONS OR WARRANTIES WHATSOEVER WITH      ***
//*      RESPECT TO THE INFORMATION OR MATERIAL FURNISHED   ***
//*      HEREUNDER, EXPRESSED OR IMPLIED, INCLUDING BUT     ***
//*      NOT LIMITED TO ANY REPRESENTATION OR WARRANTY OF   ***
//*      MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR USE  ***
//*      OR PURPOSE OR THAT THE USE OF THE INFORMATION OR   ***
//*      MATERIAL WILL NOT INFRINGE ANY PATENT, COPYRIGHT,  ***
//*      TRADEMARK, OR OTHER PROPRIETARY INTEREST.  YOU     ***
//*      ARE, THEREFORE, ACCEPTING THIS INFORMATION OR      ***
//*      MATERIAL ON AN "AS IS" BASIS AND WILL BE USING IT  ***
//*      AT YOUR OWN RISK.  NEITHER CUIC NOR ANY OF ITS     ***
//*      AFFILIATES SHALL BE LIABLE WITH RESPECT TO ANY     ***
//*      CLAIM, ACTION, OR DEMAND BY ANY USER OR OTHER      ***
//*      PARTY (INCLUDING ANY CLAIM, ACTION, OR DEMAND FOR  ***
//*      CONSEQUENTIAL DAMAGES EVEN IF CUIC HAS BEEN        ***
//*      ADVISED OF THE POSSIBILITY OF SUCH DAMAGES)        ***
//*      ARISING FROM THE USE OF THE INFORMATION OR THE     ***
//*      MATERIALS AND CONCEPTS RELATED THERETO.            ***
//*      FURTHERMORE, CUIC WILL NOT MAINTAIN, CORRECT, OR   ***
//*      UPDATE THIS INFORMATION OR MATERIAL IN THE         ***
//*      FUTURE.                                            ***
//*                                              01/26/83   ***
//*************************************************************
//PP      EXEC PGM=&PPPGM,REGION=(&REGN)
//*
//*            EXECUTE THE MVS/SP1.3.2 RMF POST PROCESSOR.
//*
//STEPLIB  DD  DISP=SHR,UNIT=ALLDA,VOL=SER=&LINKVOL,DSN=SYS1.LINKLIB
//RMFDATE  DD  DISP=(SHR,&DISP),                                       X
//     DSN=TECH.SM.D.RMF&SID..BD&DATE&DATE1..ED&DATE&DATE2..DATE
//RMFDAACT DD  DISP=(SHR,&DISP),                                       X
//     DSN=TECH.SM.D.RMF&SID..BD&DATE&DATE1..ED&DATE&DATE2..RMFDAACT
//RMFDABSY DD  DISP=(SHR,&DISP),                                       X
//     DSN=TECH.SM.D.RMF&SID..BD&DATE&DATE1..ED&DATE&DATE2..RMFDABSY
//RMFDAPLT DD  DISP=(SHR,&DISP),                                       X
//     DSN=TECH.SM.D.RMF&SID..BD&DATE&DATE1..ED&DATE&DATE2..RMFDAPLT
//RMFDAQUE DD  DISP=(SHR,&DISP),                                       X
//     DSN=TECH.SM.D.RMF&SID..BD&DATE&DATE1..ED&DATE&DATE2..RMFDAQUE
//MFPINPUT DD  DISP=(SHR,&DISP),DCB=BUFNO=02,                          X
//     DSN=TECH.SM.D.RMF&SID..BD&DATE&DATE1..ED&DATE&DATE2..DATA
//MFPMSGDS DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
