++USERMOD(SR00108).
++VER(Z038) FMID(EBB1102) PRE(UZ30335).
++ZAP(IEECVETC).
NAME IEECVETC
VER 00F8 92E8                      VER : DEL1 = 'Y'
VER 0106 92E8                      VER : CON  = 'Y'
VER 010A 92E0                      VER : DCMOPTST
VER 0180 9610                      VER : DCMIOCM2
VER 0184 5810,4024,1211,4780,C190  VER : ???
VER 01AC 96E0,9122                 VER : DCMCMSG3
VER 01B0 58F0,9134                 VER : EXIT ADDRESS
REP 00F8 92D9                      REP : DEL1 = 'R'
REP 0106 92D5                      REP : CON  = 'N'
REP 010A 9230                      REP : DCMOPTST
REP 0180 96F0                      REP : DCMIOCM2
REP 0184 9650,9018,0700,47F0,C190  REP : ???
REP 01AC 9680,912D                 REP : DCMCMSG3
REP 01B0 58F0,918C                 REP : EXIT ADDRESS
++ZAP(DCMXXX)           /*REPLACE XXX BY CONSOLE ADDRESS*/.
NAME DCMXXX               REPLACE XXX BY CONSOLE ADDRESS
VER 0112 0913,002E                 VER : SEG(09),RNUM(19),RTME(46)
REP 0112 0913,0001                 REP : SEG(09),RNUM(19),RTME(01)
++ZAP(DCMXXX)           /*REPLACE XXX BY CONSOLE ADDRESS*/.
NAME DCMXXX               REPLACE XXX BY CONSOLE ADDRESS
VER 0112 141E,003C                 VER : SEG(20),RNUM(30),RTME(60)
REP 0112 0913,0001                 REP : SEG(09),RNUM(19),RTME(01)
