         TITLE 'I F C E T 0 0 C --- ARGONAUT MDR RECORD SUPPORT'
* THIS MODULE SUPPORTS ARGONAUT DEVICE --- SUPPORT CODE =
         GBLC  &DSECT,&CSECT
&DSECT   SETC  'RECORD'
&CSECT   SETC  'IFCET00C'
IFCET00C CSECT
*****       D S E C T   G E N E R A T I O N  E N T R I E S        *****
RECORD   DSECT
         DS    0F
         DSGEN (CLASRC,8),              RECORD TYPE                    X
               (SYSREL,8),              SYSTEM & RELEASE LEVEL         X
               (SWITCH,8,0,3),          SWITCHES (4 BYTES OF EM)       X
               (RCDCNT,8),              COUNT & MULTI PART INDICATION  X
               (SPARE1,8),              SPACE (1 BYTE)                 X
               (DATE,32),               DATE                           X
               (TIME,32),               TIME                           X
               (VERNO,8),               MACHINE VERSION                X
               (CPUSER,24),             C P U SERIAL NO.               X
               (CPUID,16),              C P U IDENTIFICATION           X
               (SPACE2,16),             SPARE (2 BYTES)                X
               (DEVCUA,16),             DEVICE CHANNEL UNIT ADDR       X
               (CNT,8),                 COUNT                          X
               (SPARE,8),               SPACE (1 BYTE)                 X
               (SENSE01,64),            SENSE AREA  1                  X
               (SENSE02,64),            SENSE AREA  2                  X
               (SENSE03,64),            SENSE AREA  3                  X
               (SENSE04,64),            SENSE AREA  4                  X
               (SENSE05,64),            SENSE AREA  5                  X
               (SENSE06,64),            SENSE AREA  6                  X
               (SENSE07,64),            SENSE AREA  7                  X
               (SENSE08,64),            SENSE AREA  8                  X
               (SENSE09,64),            SENSE AREA  9                  X
               (SENSE10,64),            SENSE AREA 10                  X
               (SENSE11,64),            SENSE AREA 11                  X
               (SENSE12,64),            SENSE AREA 12                  X
               (SENSE13,64),            SENSE AREA 13                  X
               (SENSE14,64),            SENSE AREA 14                  X
               (SENSE15,64),            SENSE AREA 15                  X
               (SENSE16,64)             SENSE AREA 16
         DSGEN (BTSSHTS,16),            BTSS SHEETS                    X
               (CFSFOLDS,16),           CFS FOLDS                      X
               (PAPERPRS,16),           PAPER PROCESSED                X
               (SERIALNO,16),           SERIAL NUMBER          @Y17CSWTX
               (RECORDWK,72)            RECORD WORK AREA
         ORG   RECORDWK
         DSGEN (ERRCODE,8)              SENSE BYTE 4
         DSGEN (SNS05,1,0,7),           SENSE BYTE 5                   X
               (SNS06,1,0,7),           SENSE BYTE 6                   X
               (SNS07,1,0,7),           SENSE BYTE 7                   X
               (SNS08,1,0,7),           SENSE BYTE 8                   X
               (SNS09,1,0,7),           SENSE BYTE 9                   X
               (SNS10,1,0,7),           SENSE BYTE 10                  X
               (SNS11,1,0,7),           SENSE BYTE 11                  X
               (SENSECNT,8)             COUNT OF SENSE AREAS
         DSGEN (SNS05,8,EQU,SNS050),                                   X
               (SNS06,8,EQU,SNS060),                                   X
               (SNS07,8,EQU,SNS070),                                   X
               (SNS08,8,EQU,SNS080),                                   X
               (SNS09,8,EQU,SNS090),                                   X
               (SNS10,8,EQU,SNS100),                                   X
               (SNS11,8,EQU,SNS110)
IFCET00C CSECT
         USING *,R9                     SET UP BASE REG
         USING RECORD,R2                SET UP DSECT PTR
         DC    A(ENTRY)                 LINE/LABEL SET ADDR
         DC    CL8'IFCET00C'            MODULE NAME
R9PTR    DC    F'0'
LABELPTR DC    F'0'
         DS    0F
CNTSAVE  DC    F'0'                     ENTRY COUNT SAVE AREA
ENTRYNO  DC    F'0'                     COUNTER SAVE
WORK     DC    D'0'                     WORK SPACE
ENTRYCNT DC    F'0'
REGSAVE  DC    4F'0'
LOOP21   DC    A(LOOP2-4)               LINE
ENTRYLB2 DC    A(ENTRYLB-1)             LABEL
LINEXIT1 DC    A(LINEXIT-4)             LINE FOR EXIT
LBLEXIT1 DC    A(LBLEXIT-1)             LABEL FOR EXIT
FMT5ALN1 DC    A(FMT5ALN-4)             LINE FOR FORMAT 5A
FMT6ALN1 DC    A(FMT6ALN-4)             LINE FOR FORMAT 6A
FMT3ALN1 DC    A(FMT3ALN-4)             LINE FOR FORMAT 3A
FMT7ALN1 DC    A(FMT7ALN-4)             LINE FOR FORMAT 7A
FMT5ALB1 DC    A(FMT5ALB-1)             LABEL FOR FORMAT 5A
FMT6ALB1 DC    A(FMT6ALB-1)             LABEL FOR FORMAT 6A
FMT3ALB1 DC    A(FMT3ALB-1)             LABEL FOR FORMAT 3A
FMT7ALB1 DC    A(FMT7ALB-1)             LABEL FOR FORMAT 7A
GETOUTLN DC    A(EXITLN-4)              TO MDR MODULE
GETOUTLB DC    A(EXITLB-1)              TO MDR MODULE
DEVTYPE  EQU   SWITCH2
SUPPORT  EQU   1                        COUNT OF XDEVTBL ENTRIES
XDEVTBL  EQU   *
         DC    X'0C',C'3800'       ARGONAUT CLASS/TYPE CVT
R0       EQU   0
R1       EQU   1
R2       EQU   2                        DSECT PTR
R3       EQU   3                        PRINT BUFFR PTR
R4       EQU   4                        RECORD POINTER
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9                        MODULE BASE REG
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
L0       EQU   0                        ZERO
L1       EQU   1                        ONE
L2       EQU   2                        TWO
L3       EQU   3                        THREE
L4       EQU   4                        FOUR
L5       EQU   5                        FIVE
L6       EQU   6                        SIX
L7       EQU   7                        SEVEN
L8       EQU   8                        EIGHT
L9       EQU   9
L23      EQU   23                       TWENTY THREE
L46      EQU   46                       FOURTY SIX
ZERO     EQU   0
HW01     DC    H'1'
EIGHT    DC    H'8'                     EIGHT
HW16     DC    H'16'
NONE     DC    C'NONE  '
UNIV     DC    C'UNIVERSAL'
F3       DC    C'FORMAT 3A'
F5       DC    C'FORMAT 5A'
F6       DC    C'FORMAT 6A'
F7       DC    C'FORMAT 7A'
X80      EQU   X'80'
X81      EQU   X'81'
X89      EQU   X'89'
X8A      EQU   X'8A'
X8B      EQU   X'8B'
X8C      EQU   X'8C'
X90      EQU   X'90'
X9F      EQU   X'9F'
X50      EQU   X'50'
ENTRYNO1 EQU   ENTRYNO+2
         EJECT
         DS    0F
COUNTEM  EQU   *
         STM   R5,R8,REGSAVE            SAVE REGS
         XC    ENTRYNO(4),ENTRYNO       INITIALIZE ENTRY NO.
         XC    SENSECNT(L8),SENSECNT    INTLZE SENSE COUNT AREA
         LR    R6,R4                    GET RECORD POINTER
         SR    R5,R5                    ZERO R5
COUNTEM1 EQU   *
         OC    L0(L8,R6),L0(R6)         ANY SENSE INFO?
         BZ    RETURN                   NO, BRANCH
         LA    R5,L1(R5)                YES, BUMP COUNTER
         STC   R5,SENSECNT              STORE COUNTER
         CH    R5,HW16                  REACHED MAX ?
         BE    RETURN                   YES, BRANCH
         LA    R6,L8(R6)                NO, BUMP POINTER
         B     COUNTEM1                 AND GO BACK TO TOP
SETCPUNO EQU   *
         STM   R5,R8,REGSAVE            SAVE REGS
         SR    R5,R5                    CLEAR R5
         IC    R5,L0(R4)                GET CPU TYPE
         SLL   R5,L8
         IC    R5,L1(R4)
         LTR   R5,R5                    IS IT ZERO ?
         BNZ   RETURN                   NO, RETURN
         LA    R6,L46                   BACK UP POINTER 46 BYTES
         SR    R3,R6
         MVC   L0(L9,R3),UNIV           SAY MODEL=UNIVERSAL
         MVC   L23(L6,R3),NONE          SAY SERIAL=NONE
         B     RETURN
NEXT     EQU   *
         STM   R5,R8,REGSAVE            SAVE REGS
         L     R5,LOOP21                SET UP POINTERS
         ST    R5,R9PTR                  V
         L     R5,ENTRYLB2               V
         ST    R5,LABELPTR               V
         B     RETURN                   RETURN
SKIP     SR    R15,R15                  SUPRESS PRINT OF LINE
RETURN   LM    R5,R8,REGSAVE            RESTORE REGS
SKIPIT   BR    R14                      RETURN
TOPOLOOP EQU   *
         STM   R5,R8,REGSAVE            SAVE REGS
         L     R6,ENTRYNO               GET ENTRY NO.
         LA    R6,L1(R6)                INCREMENT BY 1
         ST    R6,ENTRYNO               SAVE ENTRY NO.
         CH    R6,HW16                  FINISHED W/SENSE INFO ?
         BH    EXIT                     YES, BRANCH
         MH    R6,EIGHT                 CALC OFFSET(ENTRYNO X 8)
         SH    R6,EIGHT                 AND BACK-UP EIGHT
         AR    R6,R4                    ADD RECORD POINTER TO IT
         MVC   RECORDWK(L8),L0(R6)      MOVE SENSE INFO TO WORK
         OC    RECORDWK(L8),RECORDWK    ANY SENSE INFO ?
         BZ    EXIT                     NO, BRANCH
         L     R6,ENTRYNO               GET ENTRY NO.
         CVD   R6,WORK                  CONVERT ENTRYNO TO DEC
         UNPK  WORK(L4),WORK+6(L2)      UNPACK IT
         MVZ   WORK+3(L1),WORK+2         FIX ZONE BITS
         MVC   ENTRYLB1(L2),WORK+2      MOVE TO PRINT LINE
         B     RETURN
EXIT     EQU   *
         L     R5,LINEXIT1              NO, SET UP POINTERS
         ST    R5,R9PTR                  V
         L     R5,LBLEXIT1                   V
         ST    R5,LABELPTR               V
         B     RETURN                   BRANCH
TYPE1    EQU   *
         SR    R15,R15                  INDICATE NO PRINT
         STM   R5,R8,REGSAVE            SAVE REGISTERS
         TM    L0(R2),X90               RECORD TYPE = MDR ?
         BO    RETURN                   YES, BRANCH
*                                       NO
         L     R5,GETOUTLN              SET UP POINTERS
         ST    R5,R9PTR                      V
         L     R5,GETOUTLB               V
         ST    R5,LABELPTR                   V
         B     RETURN
TYPELBL  EQU   *
         STM   R5,R8,REGSAVE            SAVE REGS
         L     R6,ENTRYNO               ENTRY NUMBER IN R6
         MH    R6,EIGHT                 MULT ENTRY NO BY 8
         AR    R6,R4                    ADD DSECT PTR TO R6
         SH    R6,EIGHT                 R6 NOW POINTS TO CURRENT SNS
         CLI   L0(R6),X81               FMT 5 REQD ?
         BL    TLBL2                    NO, GO TO NEXT CHECK
         CLI   L0(R6),X8A               FMT 6A REQD ?
         BE    MVCLBL6                  YES, BRANCH
         CLI   L0(R6),X89               FMT 5A REQD ?
         BNH   MVCLBL5                  YES, BRANCH
TLBL2    EQU   *
         CLI   L0(R6),X50               FMT 3A REQD ?
         BL    MVCLBL7                  NO, BRANCH
         CLI   L0(R6),X9F               FMT 3A REQD ?
         BH    MVCLBL7                  NO, BRANCH
         MVC   ERRLBL+33(L8),F3         YES, MOVE IN FORMAT 3
         B     RETURN                   RETURN
MVCLBL6  EQU   *
         MVC   ERRLBL+33(L8),F6         MOVE IN FORMAT 6
         B     RETURN                   RETURN
MVCLBL5  EQU   *
         MVC   ERRLBL+33(L8),F5         MOVE IN FORMAT 5
         B     RETURN                   RETURN
MVCLBL7  EQU   *
         MVC   ERRLBL+33(L8),F7         MOVE IN UNKNOWN(FORMAT 7A)
         B     RETURN                   RETURN
*        THE FOLLOWING CHECKS ARE MADE TO DETERMINE THE FORMATS
*          TO USE WHEN PRINTING MDR RECORDS. THE FOLLOWING LIST
*          GIVES THE FORMAT USED FOR SPECIFIC ERROR CODES:
*
*              FORMAT    ERROR CODES
*
*                3A        5X-7F WHERE X = 0-F
*                3A        8B
*                3A        9X
*                5A        81-89
*                6A        8A
********
TYPE     EQU   *
         STM   R5,R8,REGSAVE            SAVE REGISTERS
         L     R6,ENTRYNO               ENTRY NUM IN R6
         MH    R6,EIGHT                 MULT ENTRY NUM BY 8
         AR    R6,R4                    ADD DSECT PTR TO R6
         SH    R6,EIGHT                 R6 NOW POINTS TO CURRENT SNS
         CLI   L0(R6),X81               FMT 5A REQD ?
         BL    TYPE2                    NO, BRANCH TO NEXT CHECK
         CLI   L0(R6),X8A               FMT 6A REQD ?
         BE    FMT6A                    YES, BRANCH TO SET-UP
         CLI   L0(R6),X89               FMT 5A REQD ?
         BNH   FMT5A                    YES, BRANCH TO SET-UP
TYPE2    EQU   *
         CLI   L0(R6),X50               FMT 3A REQD ?
         BL    FMT7A                    NO, UNKNOWN ERR CODE, BR
         CLI   L0(R6),X9F               FMT 3A REQD ?
         BH    FMT7A                    NO, UNKNOWN ERR CODE, BR
*                                       YES, DROP THRU & GO
FMT3A    EQU   *
         L     R5,FMT3ALN1              SET UP POINTERS
         ST    R5,R9PTR                   V
         L     R5,FMT3ALB1               V
         ST    R5,LABELPTR                V
         B     RETURN                    RETURN
FMT5A    EQU   *                        ASSUME FORMAT 5A REQD
         L     R5,FMT5ALN1              SET UP POINTERS
         ST    R5,R9PTR                   V
         L     R5,FMT5ALB1               V
         ST    R5,LABELPTR                V
         B     RETURN                    RETURN
FMT6A    EQU   *
         L     R5,FMT6ALN1              SET UP POINTERS
         ST    R5,R9PTR                   V
         L     R5,FMT6ALB1               V
         ST    R5,LABELPTR                V
         B     RETURN                    RETURN
FMT7A    EQU   *
         L     R5,FMT7ALN1              SET UP POINTERS
         ST    R5,R9PTR                  V
         L     R5,FMT7ALB1               V
         ST    R5,LABELPTR               V
         B     RETURN                   RETURN
CONVTYPE EQU   *
         STM   R5,R8,REGSAVE            SAVE REGS
         LA    R5,SUPPORT               BCT COUNT, CONV DEV TYPE TBL
*        LA    R4,L2(R4)                R4 POINTS TO CLASS/TYPE 2 BYTES
         LA    R6,XDEVTBL               ADDR OF CLASS/TYPE XLATE TABLE
NEXT2     EQU   *
         CLC   L0(L1,R4),L0(R6)         IS THIS CLASS/TYPE WE LOOKIN FO
         BNE   BUMP                     NO, BRANCH
         MVC   L0(L4,R3),L1(R6)         YES, MOVE CLASS/TYPE TO BUFF
         B     RETURN                   RETURN
BUMP     DS    0H
         LA    R6,L5(R6)                BUMP CONVERT TBL PTR
         BCT   R5,NEXT2                KEEP LOOKING
         MVC   L0(L7,R3),F7
         B     RETURN                  RETURN FROM WENCE YOU CAME
DATESET  EQU   *
         UNPK  WORK(L8),L1(L3,R4)       UNPACK THE DATE
         MVC   L0(L3,R3),WORK+L5        MOVE DAY
         MVC   L5(L2,R3),WORK+L3        MOVE YEAR
         B     RETURN                   RETURN
         EJECT
         DS    0F
ENTRY    EQU   *
         DC    XL4'0'
         DC    XL4'0'
         DC    A(LABELS)
         DC    H'0'
         LINE  (1,1),(1,1),SKIP=1
         ROUTINE SPARE1,TYPE1
         LABEL ''
         LINE  SKIP=E                   EJECT
         LABEL ''
         LINE  (78,23),(1,89),SKIP=1
         HEX   CPUID,0,2B
         HEX   CPUSER,0,3B
         ROUTINE CPUID,SETCPUNO
         LABEL '---RECORD ENTRY TYPE - MDR              SOURCE - MISC  X
                         CPU MODEL','SERIAL NO.'
         LINE  (17,1),(4,1),SKIP=1
         SYSRELN SYSREL,4                                      @D35UGFD
         LABEL ''                                              @D35UGFD
         LINE  ,(25,23),SKIP=1
         LABEL 'DAY YEAR','HH.MM.SS.TH'
         LINE  (25,23),(18,23),SKIP=2
         ROUTINE DATE,DATESET
         HEX   TIME,1,4B
         LABEL 'DATE -','TIME -'
         LINE  (24),(2),SKIP=1
         ROUTINE DEVTYPE,CONVTYPE
         LABEL 'DEVICE TYPE'
         LINE  (24),(2),SKIP=2
         HEX   DEVCUA,0,2B
         LABEL 'CHANNEL UNIT ADDRESS'
         LINE  (45,1),(1),SKIP=1
         ROUTINE SENSE01,COUNTEM
         CONVT SENSECNT,1,2
         LABEL 'NUMBER OF ENTRIES IN THIS RECORD (DECIMAL) -'
         LINE  (45,1),(1),SKIP=2
         LABEL 'INTERNAL LOG ENTRY BYTES 0-7 ARE SAME AS SENSE BYTES 4-X
               11'
LOOP2    LINE  (11),(1),SKIP=1
         ROUTINE SENSE01,TOPOLOOP
ENTRYLB  LABEL 'ENTRY NO.    '
         LINE  ,(1),SKIP=1
         LABEL '×---------------------------------------×'
         LINE  (31),(1,40),SKIP=1
         HEX   ERRCODE,0,1B
         ROUTINE SENSE01,TYPELBL
ERRLBL   LABEL '× STATUS CODE (SENSE BYTE 4) -','× XXXXXXXX'
         LINE  ,(1),SKIP=2
         LABEL '×---------------------------------------×'
         LINE  ,(3,17),SKIP=1
         LABEL 'SENSE','SENSE','SENSE','SENSE','SENSE','SENSE','SENSE'
         LINE  (12,17),(3,17),SKIP=0
         HEX   SNS05,0,1B
         HEX   SNS06,0,1B
         HEX   SNS07,0,1B
         HEX   SNS08,0,1B
         HEX   SNS09,0,1B
         HEX   SNS10,0,1B
         HEX   SNS11,0,1B
         LABEL 'BYTE 5 -','BYTE 6 -','BYTE 7 -','BYTE 8 -','BYTE 9 -','X
               BYTE 10 -','BYTE 11 -'
         LINE  (14,17),(1),SKIP=1
         ROUTINE SENSE01,TYPE
         LABEL ''
FMT3ALN  LINE  ,(2,17),SKIP=2
FMT3ALB  LABEL 'RETRY COUNT','FO STAT(6-3)','CORNA STAT(6-8)','PRCS STAX
               T(6-9)','CGEN STAT1(4-0)','CGEN STAT2(4-1)','CGEN STAT3(X
               4-2)'
         LINE  (14,17),(1,17),SKIP=1
         BIN   (SNS050,0,1),                                           X
               (SNS060,0,1),                                           X
               (SNS070,0,1),                                           X
               (SNS080,0,1),                                           X
               (SNS090,0,1),                                           X
               (SNS100,0,1),                                           X
               (SNS110,0,1)
         LABEL 'RETRY CT 8','FOF OCCURRED','ERAS LMP OFF',             X
               'CONTR BIT 4','DRUM/MIRR TH','SSYS CLK ER','UPGM AHEAD'
         LINE
         BIN   (SNS051,0,1),                                           X
               (SNS061,0,1),                                           X
               (SNS071,0,1),                                           X
               (SNS081,0,1),                                           X
               (SNS091,0,1),                                           X
               (SNS101,0,1),                                           X
               (SNS111,0,1)
         LABEL 'RETRY CT 4','FO INT HI','CLNR NOT RUN','CONTR BIT 2',  X
               'MIRR MTR TH','BIT TIME CLK','PRT LIN SYNC'
         LINE
         BIN   (SNS052,0,1),                                           X
               (SNS062,0,1),                                           X
               (SNS072,0,1),                                           X
               (SNS082,0,1),                                           X
               (SNS092,0,1),                                           X
               (SNS102,0,1),                                           X
               (SNS112,0,1)
         LABEL 'RETRY CT 2','FO INT LO','PRECLN COR','CONTR BIT 1',    X
               'MIRR DRV AMP','WCGM INP PE','LIN BUF INTF'
         LINE
         BIN   (SNS053,0,1),                                           X
               (SNS063,0,1),                                           X
               (SNS073,0,1),                                           X
               (SNS083,0,1),                                           X
               (SNS093,0,1),                                           X
               (SNS103,0,1),                                           X
               (SNS113,0,1)
         LABEL 'RETRY CT 1','FO HLD INTLK','CHG COR CK','DVLPR INTLK', X
               'MIRR CURR HI','LIN BUF PE','LIN BUF ORUN'
         LINE
         BIN   (SNS054,0,1),                                           X
               (SNS064,0,1),                                           X
               (SNS074,0,1),                                           X
               (SNS084,0,1),                                           X
               (SNS094,0,1),                                           X
               (SNS104,0,1),                                           X
               (SNS114,0,1)
         LABEL 'RESERVED','RESERVED','XFR COR CK','TNR HPR EMPT',      X
               'MIRR SYNC','SERIALZR PE','UNDSCORE PE'
         LINE
         BIN   (SNS055,0,1),                                           X
               (SNS065,0,1),                                           X
               (SNS075,0,1),                                           X
               (SNS085,0,1),                                           X
               (SNS095,0,1),                                           X
               (SNS105,0,1),                                           X
               (SNS115,0,1)
         LABEL 'RESERVED','RESERVED','POSXFR COR ','TNR COL FULL','LASRX
                SYNC','ANY WCGM PE','UNDSCORE BIT'
         LINE
         BIN   (SNS056,0,1),                                           X
               (SNS066,0,1),                                           X
               (SNS076,0,1),                                           X
               (SNS086,0,1),                                           X
               (SNS096,0,1),                                           X
               (SNS106,0,1),                                           X
               (SNS116,0,1)
         LABEL 'RESERVED','RESERVED','DRUM SVO ER','CYCLONE VAC','LASR X
               LOW PWR','CAR BIT 0','BIT CTR OFLO'
         LINE
         BIN   (SNS057,0,1),                                           X
               (SNS067,0,1),                                           X
               (SNS077,0,1),                                           X
               (SNS087,0,1),                                           X
               (SNS097,0,1),                                           X
               (SNS107,0,1),                                           X
               (SNS117,0,1)
         LABEL 'RESERVED','RESERVED','DVLPR BIAS','COL HANDL CK',      X
               'RESERVED','CAR BIT 1','PRT/HOR CT=0'
******                                  FORMAT 3A COMPLETE ******
FMT3AEND LINE  (11),(1),SKIP=1
         ROUTINE SPARE1,NEXT
         LABEL ''
FMT5ALN  LINE  (14,17),(2,17),SKIP=2
FMT5ALB  LABEL 'INTRPT REQ','MAR HI','MAR LO','IEU REG 1(0-2)','IEU REGX
                2(0-3)','INST/SOREG HI','INST/SOREG LO'
         LINE  (14,17),(1,17),SKIP=1
         BIN   (SNS050,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS080,0,1),                                           X
               (SNS090,0,1)
         LABEL 'SO REG',' ',' ','MIRH PE','SAR PE'
         LINE
         BIN   (SNS051,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS081,0,1),                                           X
               (SNS091,0,1)
         LABEL 'LEVEL 1',' ',' ','MIRL PE','LSR PE'
         LINE
         BIN   (SNS052,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS082,0,1),                                           X
               (SNS092,0,1)
         LABEL 'LEVEL 2',' ',' ','MDR PE','INBUS PE'
               LINE
         BIN   (SNS053,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS083,0,1),                                           X
               (SNS093,0,1)
         LABEL 'LEVEL 3',' ',' ','WCS DBL BIT','NO DEV RSP'
         LINE
         BIN   (SNS054,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS084,0,1),                                           X
               (SNS094,0,1)
         LABEL 'LEVEL 4',' ',' ','ALUA PE','I-CYCLE'
         LINE
         BIN   (SNS055,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS085,0,1),                                           X
               (SNS095,0,1)
         LABEL 'LEVEL 5',' ',' ','ALUB PE','E-CYCLE'
         LINE
         BIN   (SNS056,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS086,0,1),                                           X
               (SNS096,0,1)
         LABEL 'LEVEL 6',' ',' ','SDRH PE','ROS HSL'
         LINE
         BIN   (SNS057,0,1)
         ROUTINE SPARE1,SKIPIT
         ROUTINE SPARE1,SKIPIT
         BIN   (SNS087,0,1),                                           X
               (SNS097,0,1)
         LABEL 'RESERVED',' ',' ','SDRL PE','ANY ERROR'
******                                  FORMAT 5A COMPLETE ******
FMT5AEND LINE
         ROUTINE SPARE1,NEXT
         LABEL ''
FMT6ALN  LINE  ,(2,17),SKIP=2
FMT6ALB  LABEL 'RETRY COUNT','CNTRL FLAGS','TRACK ADDR','RESERVED','RESX
               ERVED','RESERVED','RESERVED'
         LINE  (31),(18),SKIP=1
         BIN   (SNS070,0,1)
         LABEL 'INTF RTN RQD'
         LINE
         BIN   (SNS071,0,1)
         LABEL 'RESERVED'
         LINE
         BIN   (SNS072,0,1)
         LABEL 'ALT TRK USED'
         LINE
         BIN   (SNS073,0,1)
         LABEL 'PERMANENT'
         LINE
         BIN   (SNS074,0,1)
         LABEL 'NO ALT AVAIL'
         LINE
         BIN   (SNS075,0,1)
         LABEL 'RETAIN PWR'
         LINE
         BIN   (SNS076,0,1)
         LABEL 'DIAG LD MODE'
         LINE
         BIN   (SNS077,0,1)
         LABEL 'IMPL MODE'
******                                  FORMAT 6A COMPLETE ******
FMT6AEND LINE  (11),(1),SKIP=1
         ROUTINE SPARE1,NEXT
         LABEL ''
FMT7ALN  LINE  (14,17),(2,17),SKIP=2
FMT7ALB  LABEL 'RESERVED','RESERVED','RESERVED','RESERVED','RESERVED','X
               RESERVED','RESERVED'
FMT7AEND LINE  (11),(1),SKIP=1
         ROUTINE SPARE1,NEXT
         LABEL ''
LINEXIT  LINE  (40,1),(1,45),SKIP=1
         CONVT BTSSHTS,2,6
LBLEXIT  LABEL 'BTS COUNT                    (DECIMAL)','00'
         LINE  (40,1),(1,45),SKIP=1
         CONVT CFSFOLDS,2,6
         LABEL 'CFS COUNT                    (DECIMAL)','00'
         LINE  (40,1),(1,45),SKIP=2
         CONVT PAPERPRS,2,6
         LABEL 'PAPER COUNT                  (DECIMAL)','00'
         LINE  (40,1),(1,1),SKIP=3
         CONVT SERIALNO,2,4
         LABEL 'DEVICE SERIAL NO.'
         LINE  SKIP=1
         LABEL ''
         DC    X'FF'                    BAIL OUT
         DC    X'00A4'
         DC    X'0018'                  OFFSET IN THE RECORD
         DC    X'0018'
EXITLN   LINE
EXITLB   LABEL ''
         DC    X'FE'
         DC    C'IFCEXXXF'
LABELS   DS    0F
         LSTART
ENTRYLB1 EQU   ENTRYLB+10               LABEL FOR MOVE (MVC)
         END
