         MACRO
&LABEL   BLSRDT &PFX
*---------------------------------------------------------------------*
* BLSRDT--DEFINE DATA TYPE PROCESSING TABLE HEADER FIELDS             *
*---------------------------------------------------------------------*
         GBLA  &DTDIM
         GBLC  &GP
&DTDIM   SETA  0
&GP      SETC  '&PFX'
&LABEL   DS    0F                      DATA TYPE PROCESSING TABLE
&PFX.ID  DC    CL8'&LABEL'             IDENTIFIER
         MEND
