         MACRO
&N       BLSRRA &ROW,&COL,&BYTE
         GBLC  &B1,&B2
         BLSRCVTA &ROW,&COL
&N       DC    AL1(ORDERRA),XL2'&B1&B2',AL1(&BYTE) RA ORD, ADDR, DATA
         SPACE 2
         MEND
