         TITLE 'ISTZCF1A/A1A-VS1/M1A-VS2: 3270 LOCAL DIALOG SCHEDULER  *
                        '
ISTZCF1A CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZCF1A  77.277'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         EJECT
*                                                                  0550
*/* TPZENTER  SAVES(6)AC(CC1A)                                       */
*                                                                  0550
*   DO;                                                            0550
*                                                                  0550
*/* ATBUILD (ISTZSAVE,ISTZCRR)                                       */
*/* END OF ATBUILD                                                   */
*/* ATBUILD (ISTRPH,ISTCRA)                                          */
*/* END OF ATBUILD                                                   */
*                                                                  0551
*     RFY                                                          0551
*      (GPR00P,                                                    0551
*       GPR01P,                                                    0551
*       GPR02P,                                                    0551
*       GPR03P,                                                    0551
*       GPR04P,                                                    0551
*       GPR05P,                                                    0551
*       GPR06P,                                                    0551
*       GPR07P,                                                    0551
*       GPR12P,                                                    0551
*       GPR13P,                                                    0551
*       GPR15P) RSTD;                                              0551
*     GEN SETS(GPR12P);                                            0552
*                     /* ESTABLISH BASE */
          BALR  GPR12P,0
          USING *,GPR12P
*     DO;                           /* LISATCVT                    0553
*                                      CVTBASE(PAGEABLE,(GPR02P))    */
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR02P,ATCLCPTR                                     0554
*     END;                          /* LISATCVT                      */
*     GPR03P=GPR01P->RPHCRR;        /* ADDRESS CRA                   */
         L     GPR03P,RPHCRR(,GPR01P)                              0556
*     GPR04P=ADDR(GPR03P->CRAPROCR);/* ADDRESS ZCRR                  */
         LA    GPR04P,CRAPROCR(,GPR03P)                            0557
*     GPR06P=GPR04P;                /* INITIALIZE ZCR POINTER        */
         LR    GPR06P,GPR04P                                       0558
*     GPR05P=LENGTH(ISTZCRR);       /* SETUP ZCRR LENGTH             */
         LA    GPR05P,536                                          0559
*     GPR07P=0;                     /* ZERO REG 7                    */
         SLR   GPR07P,GPR07P                                       0560
*     MVCL(GPR04P,GPR06P);          /* CLEAR ZCRR                    */
         MVCL  GPR04P,GPR06P                                       0561
*     GPR04P=ADDR(GPR03P->CRAPROCR);/* ADDRESS ZCRR                  */
         LA    GPR04P,CRAPROCR(,GPR03P)                            0562
*     GPR04P->ZCRFRRA=GPR03P->CRAFRR;/* SAVE CURRENT FRR POINTER     */
         L     @14,CRAFRR(,GPR03P)                                 0563
         ST    @14,ZCRFRRA(,GPR04P)                                0563
*     GPR03P->CRAFRR=0;             /* CLEAR FRR POINTER             */
         SLR   @14,@14                                             0564
         ST    @14,CRAFRR(,GPR03P)                                 0564
*     GPR04P->ZCRCHAIN=GPR03P->CRACRR;/* SAVE CURRENT CRR            */
         L     @11,CRACRR(,GPR03P)                                 0565
         ST    @11,ZCRCHAIN(,GPR04P)                               0565
*     GPR03P->CRACRR=GPR04P;        /* SET ZCRR AS CURRENT CRR       */
         ST    GPR04P,CRACRR(,GPR03P)                              0566
*     GPR04P->ZCRID=ZCTYPE;         /* INDICATE CRR AS ZCRR          */
         MVI   ZCRID(GPR04P),X'00'                                 0567
*     GPR04P->ZCRLEN=ZCLNG;         /* SET ZCRR LENGTH               */
         MVC   ZCRLEN(2,GPR04P),@CH01690                           0568
*     GPR04P->ZCRTID=ZCRTCC1A;      /* SET THREAD ID                 */
         MVI   ZCRTID(GPR04P),X'03'                                0569
*     GPR04P->ZCRECC1A='1'B;        /* SET MODULE ENTERED            */
         OI    ZCRECC1A(GPR04P),B'10000000'                        0570
*     GPR04P->ZCRTNAME='CC1A';      /* SET THREAD NAME               */
         MVC   ZCRTNAME(4,GPR04P),@CC04402                         0571
*     GPR05P=ADDR(GPR04P->ZCRSAVEZ);/* ADDR 1ST BUFF                 */
         LA    GPR05P,ZCRSAVEZ(,GPR04P)                            0572
*     GPR06P=0;                     /* ADDRESS PREVIOUS BUFFER       */
         LR    GPR06P,@14                                          0573
*     DO GPR00P=6 TO 1 BY-1;        /* INITIALIZE SAVE AREAS         */
         LA    GPR00P,6                                            0574
@DL00574 DS    0H                                                  0575
*       GPR05P->ZSAZSVBC=GPR06P;    /* SET BACK POINTER              */
         ST    GPR06P,ZSAZSVBC(,GPR05P)                            0575
*       GPR05P->ZSAZSVFC=GPR05P+ZSAZSVSZ;/* SET FWRD PTR             */
         LA    @14,40                                              0576
         LR    @11,GPR05P                                          0576
         ALR   @11,@14                                             0576
         ST    @11,ZSAZSVFC(,GPR05P)                               0576
*       GPR06P=GPR05P;              /* PREV. BUFF = CURRENT BUFF     */
         LR    GPR06P,GPR05P                                       0577
*       GPR05P=GPR05P+ZSAZSVSZ;     /* POINT TO NEXT BUFF            */
         ALR   GPR05P,@14                                          0578
*     END;                          /* END SAVE AREA INITIALIZING    */
         BCTR  GPR00P,0                                            0579
         LTR   GPR00P,GPR00P                                       0579
         BP    @DL00574                                            0579
*     GPR06P->ZSAZSVFC=0;           /* SET LAST FWRD POINTER         */
         SLR   @14,@14                                             0580
         ST    @14,ZSAZSVFC(,GPR06P)                               0580
*     GPR13P=ADDR(GPR04P->ZCRSAVEZ);/* ADDRESS SAVE AREA CHAIN       */
         LA    GPR13P,ZCRSAVEZ(,GPR04P)                            0581
*     RFY                                                          0582
*      (GPR00P,                                                    0582
*       GPR01P,                                                    0582
*       GPR02P,                                                    0582
*       GPR03P,                                                    0582
*       GPR04P,                                                    0582
*       GPR05P,                                                    0582
*       GPR06P,                                                    0582
*       GPR07P,                                                    0582
*       GPR12P,                                                    0582
*       GPR13P,                                                    0582
*       GPR15P) UNRSTD;                                            0582
*   END;                            /* END TPZENTER GENERATION       */
*   ZCRNRMEX='1'B;                  /* DEFAULT TO NORMAL EXIT. THIS
*                                      FLAG IS ZEROED ONLY WHEN A  0584
*                                      CONTACT REJECTED FSB IS FOUND
*                                                            @ZA25166*/
         L     @15,RPHCRR(,PTRRPH)                                 0584
         L     @15,CRACRR(,@15)                                    0584
         OI    ZCRNRMEX(@15),B'00001000'                           0584
*   PTRDNC=RPHMAJCB;                /* ADDRESS DNCB                  */
         L     PTRDNC,RPHMAJCB-1(,PTRRPH)                          0585
         LA    PTRDNC,0(,PTRDNC)                                   0585
*   PTRLDN=PTRDNC->NCBNSNA;         /* ADDRESS HCNCB OR LDNCB        */
         L     PTRLDN,NCBNSNA(,PTRDNC)                             0586
*   DO WHILE(PTRLDN->NCBTYPE^=LDTYPE);/* GET LDNCB FOR SURE          */
         B     @DE00587                                            0587
@DL00587 DS    0H                                                  0588
*     PTRLDN=PTRLDN->NCBNSNA;       /* ADDRESS LDNCB                 */
         L     PTRLDN,NCBNSNA(,PTRLDN)                             0588
*   END;                            /* ADDRESS LDNCB SECURED         */
@DE00587 CLI   NCBTYPE(PTRLDN),X'07'                               0589
         BNE   @DL00587                                            0589
*   PTRZLB=RPHWEA-DISFSB;           /* ADDRESS ZLBUF                 */
         L     PTRZLB,RPHWEA(,PTRRPH)                              0590
         SL    PTRZLB,DISFSB                                       0590
*/*** START -TPLOCK (DNCBLOCK)TYPE(XCLSIVE)- **                      */
*                                                                  0591
*   DO;                                                            0591
*     RFY                                                          0592
*      (GPR00P,                                                    0592
*       GPR01P,                                                    0592
*       GPR02P,                                                    0592
*       GPR03P,                                                    0592
*       GPR04P,                                                    0592
*       GPR15P) RSTD;                                              0592
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0593
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*     GPR02P=ADDR(DNCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,DNCLOCK(,PTRDNC)                             0594
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0595
*     GPR00P=CRALMS05;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,16                                           0596
*     GPR03P=ADDR(GPR04P->CRAL5PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0597
*     GPR15P=ATCLCPTR->ATCAP36;     /* ADDRESS OF LOCK ROUTINE       */
         L     @14,ATCLCPTR                                        0598
         L     GPR15P,ATCAP36(,@14)                                0598
*     DCL                                                          0599
*       FMZL0027 BASED(GPR15P) LABEL VALUERANGE(*);                0599
*     CALL FMZL0027;                                               0600
         BALR  @14,@15                                             0600
*     GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0601
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0601
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0602
*      (GPR00P,                                                    0602
*       GPR01P,                                                    0602
*       GPR02P,                                                    0602
*       GPR03P,                                                    0602
*       GPR04P,                                                    0602
*       GPR15P) UNRSTD;                                            0602
*   END;                                                           0603
*                                                                  0603
*/*** END -TPLOCK (DNCBLOCK)TYPE(XCLSIVE)- **                        */
*                                                                  0604
*                                   /* GET DNCB LOCK                 */
*   IF RPHWEA->RPHTYPE=RPTYPE THEN  /* IF QUEUE ELEMENT IS AN RPH    */
         L     @15,RPHWEA(,PTRRPH)                                 0604
         CLI   RPHTYPE(@15),X'01'                                  0604
         BNE   @RF00604                                            0604
*     DO;                           /* PROCESS RPH AS WORK ELEMENT   */
*       CALL SUB000F;               /* DEQUEUE WORK ELEMENT          */
         BAL   @14,SUB000F                                         0606
*/*TPPOST  (RPHWEA)                                                  */
*                                                                  0607
*       DO;                         /* DECLARE AND RESTRICT REGS     */
*         RESPECIFY                                                0608
*          (GPR00F,                                                0608
*           GPR01F,                                                0608
*           GPR04F,                                                0608
*           GPR05F,                                                0608
*           GPR06F,                                                0608
*           GPR14F,                                                0608
*           GPR15F) RSTD;           /* 0,1,4,5,6,14, AND 15          */
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */
*/* END OF ATBUILD                                                   */
*                                                                  0609
*         GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);            0609
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*         GPR04F=RPHWEA;            /* LOAD RPH PNTR INTO REG 4      */
         L     GPR04F,RPHWEA(,PTRRPH)                              0610
*         RFY                                                      0611
*           GPR03F RSTD;                                           0611
*         GPR03F=0;                                                0612
         SLR   @11,@11                                             0612
         LR    GPR03F,@11                                          0612
*         DO;                       /* MODESET SAVEKEY(GPR06F)     0613
*                                      KEYADDR(GPR03F)             0613
*                                      WORKREG(GPR05F)               */
*           RESPECIFY                                              0614
*            (GPR02F) RESTRICTED;                                  0614
*           GPR05F=GPR02F;          /* SAVE REGISTER 2               */
         LR    GPR05F,GPR02F                                       0615
*           IPK;                    /* SAVE CURRENT PSW KEY          */
         IPK                                                       0616
*           GPR06F=GPR02F;                                         0617
         LR    GPR06F,GPR02F                                       0617
*           GPR02F=GPR05F;          /* RESTORE REGISTER 2            */
         LR    GPR02F,GPR05F                                       0618
*           SPKA(GPR03F);           /* SET PSW KEY                   */
         SPKA  0(GPR03F)                                           0619
*           RESPECIFY                                              0620
*            (GPR02F) UNRESTRICTED;                                0620
*         END;                      /* MODESET SAVEKEY(GPR06F)     0621
*                                      KEYADDR(GPR03F)             0621
*                                      WORKREG(GPR05F)               */
*         RFY                                                      0622
*           GPR03F UNRSTD;                                         0622
*         GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5 WITH
*                                      ADDR OF MAJOR CONTROL BLOCK 0623
*                                      PLUS OFFSET OF PAB IN BLOCK   */
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0623
         LA    GPR05P,0(,GPR05P)                                   0623
         SLR   @10,@10                                             0623
         IC    @10,RPHPABOF(,GPR04P)                               0623
         ALR   GPR05P,@10                                          0623
*         GPR14P=0;                 /* LOAD 0 INTO REG 14            */
         LR    GPR14P,@11                                          0624
*         GPR15P='FFFFFFFF'X;       /* LOAD REG 15 WITH DUMMY ADDRESS*/
         SLR   GPR15P,GPR15P                                       0625
         BCTR  GPR15P,0                                            0625
*         CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME     0626
*                                      ADDRESS WITH 0 AND,IF EQUAL,
*                                      PUT DUMMY ADDRESS IN CONTROL
*                                      BLOCK RESUME ADDRESS          */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0626
*         BC(8,FMZT0032);           /* IF EQUAL, BYPASS REMAINDER OF
*                                      EXPANSION                     */
         BC    8,FMZT0032                                          0627
*FMZL0032:                                                         0628
*         IF GPR04P->RPHWT='1'B THEN/* WT/EXT CONTENTION FLAG ON     */
FMZL0032 TM    RPHWT(GPR04P),B'00001000'                           0628
         BNO   @RF00628                                            0628
*           DO;                     /* IN RPH                        */
*             GPR14P=GPR04P->RPHRESMA×RPHWT1;/* LOAD REG 14 WITH FLAG
*                                      FIELD AND MAKE CERTAIN WT/EXT
*                                      CONTENTION FLAG STILL ON      */
         L     GPR14P,RPHRESMA(,GPR04P)                            0630
         O     GPR14P,@CF01100                                     0630
*             GPR15P=GPR14P×RPHPT1; /* LOAD REG 15 WITH FLAG FIELD 0631
*                                      AND TURN POST FLAG ON         */
         LR    GPR15P,GPR14P                                       0631
         O     GPR15P,@CF01104                                     0631
*             CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG 14 0632
*                                      WITH FLAG FIELD--IF WT/EXT BIT
*                                      ON, TURN ON POST FLAG         */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0632
*             BC(4,FMZL0032);       /* IF WT/EXT BIT WAS OFF, LOOP TO
*                                      TEST CONTENTION FLAG          */
         BC    4,FMZL0032                                          0633
*             BC(8,FMZT0032);       /* IF WT/EXT BIT WAS OFF, BRANCH
*                                      TO BYPASS CODE GEN            */
         BC    8,FMZT0032                                          0634
*           END;                    /* IF POST FLAG IS ON, FALL THRU
*                                      BOTTOM OF LOOP                */
*         ELSE                                                     0636
*           ;                       /* WT/EXT CONTENTION FLAG OFF    */
@RF00628 DS    0H                                                  0637
*         IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN                0637
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0637
         BNE   @RF00637                                            0637
*           DO;                                                    0638
*             GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE   0639
*                                      ADDRESS IN SECOND WORD OF PAB */
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0639
*             GPR01P->RPHPABQP=GPR05P;/* PUT PAB ADDRESS (IN MAJOR 0640
*                                      CONTROL BLOCK) IN PAB QUEUE 0640
*                                      ADRESS IN RPH                 */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0640
*           END;                                                   0641
*         ELSE                                                     0642
*           DO;                                                    0642
         B     @RC00637                                            0642
@RF00637 DS    0H                                                  0643
*             GPR00F=0;             /* SET REG 0 TO INDICATE ENA     */
         SLR   GPR00F,GPR00F                                       0643
*             DO;                   /* LISATCVT                    0644
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0645
*             END;                  /* LISATCVT PUT POINTER TO ATCVT
*                                      IN IN REG 15                  */
*             CALL GPR15P->ATCAP32; /* CALL ISTAPC32: TPSCHED        */
         L     @11,ATCAP32(,GPR15P)                                0647
         LR    @15,@11                                             0647
         BALR  @14,@15                                             0647
*           END;                                                   0648
*FMZT0032:                                                         0649
*         DO;                       /* MODESET KEYADDR(GPR06F)     0649
*                                      WORKREG(GPR05F)               */
@RC00637 DS    0H                                                  0649
FMZT0032 DS    0H                                                  0650
*           GPR05F=GPR06F;          /* GET KEY FORM SAVE LOCATION    */
         LR    GPR05F,GPR06F                                       0650
*           SPKA(GPR05F);           /* SET PSW KEY                   */
         SPKA  0(GPR05F)                                           0651
*         END;                      /* MODESET KEYADDR(GPR06F)     0652
*                                      WORKREG(GPR05F)               */
*         GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F,
*             GPR06F);                                             0653
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*         RESPECIFY                                                0654
*          (GPR00F,                                                0654
*           GPR01F,                                                0654
*           GPR04F,                                                0654
*           GPR05F,                                                0654
*           GPR06F,                                                0654
*           GPR14F,                                                0654
*           GPR15F) UNRSTD;         /* UNRESTRICT REGS 0,1, 4,5,14,
*                                      AND 15                        */
*       END;                        /* ***END OF TPPOST GENERATION***
*                                      POST IT READY                 */
*     END;                          /* END RPH WORK ELEMENT          */
*   ELSE                            /* NOT A RPH->RPH                */
*     IF ZLBRQTG=0 THEN             /* IF OPERATOR READ REQUEST      */
*                                                                  0657
         B     @RC00604                                            0657
@RF00604 LH    @00,ZLBRQTG(,PTRZLB)                                0657
         N     @00,@CF04398                                        0657
         LTR   @00,@00                                             0657
         BNZ   @RF00657                                            0657
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(SEG000A)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0658
*       DO;                                                        0658
*         GOTO SEG000A;                                            0659
         B     SEG000A                                             0659
*SEG000A#:                                                         0660
*       END;                        /* PROCESS READ                  */
*     ELSE                          /* NOT OPERATOR READ REQUEST     */
*                                                                  0661
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(SEG000B)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0661
*       DO;                                                        0661
         B     @RC00657                                            0661
@RF00657 DS    0H                                                  0662
*         GOTO SEG000B;                                            0662
         B     SEG000B                                             0662
*SEG000B#:                                                         0663
*       END;                        /* PROCESS NON-READ              */
SEG000B# DS    0H                                                  0664
*/*** START -TPUNLOCK (DNCBLOCK)- **                                 */
*                                                                  0664
*   DO;                                                            0664
*                                                                  0664
@RC00657 DS    0H                                                  0664
@RC00604 DS    0H                                                  0665
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */
*/* END OF ATBUILD                                                   */
*                                                                  0665
*     RFY                                                          0665
*      (GPR00P,                                                    0665
*       GPR01P,                                                    0665
*       GPR02P,                                                    0665
*       GPR03P,                                                    0665
*       GPR04P,                                                    0665
*       GPR15P) RSTD;                                              0665
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0666
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*     GPR02P=ADDR(DNCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,DNCLOCK(,PTRDNC)                             0667
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0668
*     GPR00P=CRALMS05;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,16                                           0669
*     GPR03P=ADDR(GPR04P->CRAL5PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0670
*     DO;                           /* LISATCVT                    0671
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0672
*     END;                          /* LISATCVT                      */
*     GPR15P=GPR15P->ATCAP33;                                      0674
         L     GPR15P,ATCAP33(,GPR15P)                             0674
*     DCL                                                          0675
*       FMZL0046 BASED(GPR15P) LABEL VALUERANGE(*);                0675
*     CALL FMZL0046;                                               0676
         BALR  @14,@15                                             0676
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0677
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0677
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0678
*      (GPR00P,                                                    0678
*       GPR01P,                                                    0678
*       GPR02P,                                                    0678
*       GPR03P,                                                    0678
*       GPR04P,                                                    0678
*       GPR15P) UNRSTD;                                            0678
*   END;                                                           0679
*                                                                  0679
*/*** END -TPUNLOCK (DNCBLOCK)- **                                   */
*                                                                  0680
*                                   /* RELEASE DNCB LOCK             */
*   IF ZCRNRMEX='0'B THEN           /* IF EXIT NONE REQUIRED @ZA25166*/
         L     @15,RPHCRR(,PTRRPH)                                 0680
         L     @15,CRACRR(,@15)                                    0680
         TM    ZCRNRMEX(@15),B'00001000'                           0680
         BNZ   @RF00680                                            0680
*/* TPEXIT  NONE                                                     */
*                                                                  0681
*     DO;                                                          0681
*       RESPECIFY                                                  0682
*         GPR15P RSTD;                                             0682
*                                                                  0682
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  0683
*       DO;                         /* LISATCVT                    0683
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*         GPR15P=ATCLCPTR;          /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0684
*       END;                        /* LISATCVT                      */
*       RESPECIFY                                                  0686
*         GPR00F RSTD;                                             0686
*       GPR00F=0;                   /* SET PARAMETER REGISTER TO 0   */
         SLR   GPR00F,GPR00F                                       0687
*       GPR15P=GPR15P->ATCAP31;                                    0688
         L     GPR15P,ATCAP31(,GPR15P)                             0688
*       DCL                                                        0689
*         FMZL0056 BASED(GPR15P) LABEL VALUERANGE(*);              0689
*       CALL FMZL0056;                                             0690
         BALR  @14,@15                                             0690
*       RESPECIFY                                                  0691
*        (GPR00F,                                                  0691
*         GPR15P) UNRSTD;                                          0691
*     END;                          /* **** END OF TPEXIT EXIT, NO 0692
*                                      REDRIVE               @ZA25166*/
*   ELSE                            /* IF NORMAL EXIT        @ZA25166*/
*/* TPEXIT  NORM                                                     */
*                                                                  0693
*     DO;                                                          0693
         B     @RC00680                                            0693
@RF00680 DS    0H                                                  0694
*       RESPECIFY                                                  0694
*         GPR15P RSTD;                                             0694
*                                                                  0694
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  0695
*       DO;                         /* LISATCVT                    0695
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*         GPR15P=ATCLCPTR;          /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0696
*       END;                        /* LISATCVT                      */
*       RESPECIFY                                                  0698
*         GPR00F RSTD;                                             0698
*       GPR00F=4;                   /* SET PARAMETER REGISTER TO 4   */
         LA    GPR00F,4                                            0699
*       GPR15P=GPR15P->ATCAP31;                                    0700
         L     GPR15P,ATCAP31(,GPR15P)                             0700
*       DCL                                                        0701
*         FMZL0064 BASED(GPR15P) LABEL VALUERANGE(*);              0701
*       CALL FMZL0064;                                             0702
         BALR  @14,@15                                             0702
*       RESPECIFY                                                  0703
*        (GPR00F,                                                  0703
*         GPR15P) UNRSTD;                                          0703
*     END;                          /* **** END OF TPEXIT PROCESS  0704
*                                      NEXT REQUEST                  */
         EJECT
*                                                                  0705
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG000A                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS READ REQUEST.                                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0705
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000A)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0705
*   DO;                                                            0705
@RC00680 DS    0H                                                  0706
*     GOTO SEG000A@;                                               0706
         B     SEG000A@                                            0706
*SEG000A:                                                          0707
*   END;                            /* CF1A000A: SUBROUTINE          */
SEG000A  DS    0H                                                  0708
*   CALL CIDLOCK;                   /* GET DAF LOCK                  */
         BAL   @14,CIDLOCK                                         0708
*   IF(PTRDNC->NCBFMCBA&MASKWORD)^=0 THEN                          0709
         L     @15,NCBFMCBA(,PTRDNC)                               0709
         LR    @00,@15                                             0709
         N     @00,@CF04394                                        0709
         LTR   @00,@00                                             0709
         BZ    @RF00709                                            0709
*     DO;                           /* IF A FMCB EXISTS      @XM06211*/
*       PTRFMC=PTRDNC->NCBFMCBA;    /* ADDRESS FMCB          @XM06211*/
         LR    PTRFMC,@15                                          0711
*       IF FMCMODE=FMCRCD THEN      /* IF IN RECORD MODE             */
         CLC   FMCMODE(8,PTRFMC),@CC03588                          0712
         BNE   @RF00712                                            0712
*         IF ADDR(FMCPAB3)->PABINHBT='0'B THEN/* IF DATA TRAFFIC   0713
*                                      ALLOWED                       */
         TM    PABINHBT+96(PTRFMC),B'00000010'                     0713
         BNZ   @RF00713                                            0713
*           CALL SUB000G;           /* PUT INTO DIALOG               */
         BAL   @14,SUB000G                                         0714
*         ELSE                                                     0715
*           DO;                     /* DATA TRAFFIC INHIBITED        */
         B     @RC00713                                            0715
@RF00713 DS    0H                                                  0716
*             CALL SUB000E;         /* SEND OPERATOR MESSAGE         */
         BAL   @14,SUB000E                                         0716
*             LDNZF007='0'B;        /* OFF ATTN RECD FLG     @XM02359*/
         L     @00,LDNZF007-3(,PTRLDN)                             0717
@GL00001 LR    @15,@00                                             0717
         N     @15,@CF04505                                        0717
         CS    @00,@15,LDNZF007-3(PTRLDN)                          0717
         BNE   @GL00001                                            0717
*           END;                    /*                       @XM02359*/
*       ELSE                        /* NOT IN RECORD MODE            */
*         IF FMCZFB06='1'B THEN                                    0719
         B     @RC00712                                            0719
@RF00712 TM    FMCZFB06(PTRFMC),B'00000010'                        0719
         BNO   @RF00719                                            0719
*           DO;                     /* IF INVITE IS PENDING          */
*             IF ZLBCOMP=ZLBTRM THEN                               0721
         CLI   ZLBCOMP(PTRZLB),X'18'                               0721
         BE    @RT00721                                            0721
*               ;                   /* IF TEST REQUEST MESSAGE       */
*             ELSE                  /* NOT TRM                       */
*               FMCZFB06='0'B;      /* CLEAR INVITE PENDING          */
         NI    FMCZFB06(PTRFMC),B'11111101'                        0723
*             CALL SUB000G;         /* PUT INTO DIALOG               */
@RT00721 BAL   @14,SUB000G                                         0724
*           END;                    /* END INVITE PENDING            */
*         ELSE                      /* INVITE NOT PENDING            */
*           CALL SUB000E;           /* SEND OPERATOR MESSAGE         */
         B     @RC00719                                            0726
@RF00719 BAL   @14,SUB000E                                         0726
*     END;                          /* END FMCB EXISTS       @XM06211*/
*   ELSE                            /* NO FMCB EXISTS                */
*     CALL SUB000E;                 /* SEND OPERATOR MESSAGE         */
*                                                                  0728
         B     @RC00709                                            0728
@RF00709 BAL   @14,SUB000E                                         0728
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000A)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0729
*   DO;                                                            0729
@RC00709 DS    0H                                                  0730
*     GOTO SEG000A#;                                               0730
         B     SEG000A#                                            0730
*SEG000A@:                                                         0731
*   END;                            /* END OF SEGMENT                */
         EJECT
*                                                                  0732
*/****************************************************************** */
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000E                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      WRITE OPERATOR AWARENESS MESSAGE BECAUSE INPUT DATA IS      */
*/*      GOING TO BE DISCARDED.                                      */
*/*                                                                  */
*/****************************************************************** */
*                                                                  0732
*SUB000E:                                                          0732
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* CF1A000E: SUBROUTINE          */
         B     @PB00002                                            0732
SUB000E  DS    0H                                                  0733
*   RFY                                                            0733
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   ZCRSVF18=PTRG14;                /* SAVE RETURN REG       @XM09703*/
         L     @15,RPHCRR(,PTRRPH)                                 0734
         L     @15,CRACRR(,@15)                                    0734
         ST    PTRG14,ZCRSVF18(,@15)                               0734
*   RFY                                                            0735
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   CALL CIDFREE;                   /* RELEASE CID LOCK              */
         BAL   @14,CIDFREE                                         0736
*   CALL SUB000F;                   /* DEQUEUE FROM DNCB PAB         */
         BAL   @14,SUB000F                                         0737
*   IF ZLBRT08='1'B THEN                                           0738
         TM    ZLBRT08(PTRZLB),B'10000000'                         0738
         BNO   @RF00738                                            0738
*     DO;                           /* IF DEVICE END NOTIFY          */
*       ZCRPCOD1=ZCPBUF;            /* INDICATE BUFFER RELEASE       */
         L     @15,RPHCRR(,PTRRPH)                                 0740
         L     @15,CRACRR(,@15)                                    0740
         MVI   ZCRPCOD1(@15),X'04'                                 0740
*       PTRG07=PTRZLB;              /* SET BUFFER ADDRESS            */
         LR    PTRG07,PTRZLB                                       0741
*       CALL ATCZPSVT->ZPSZDFB0;    /* JUST DEALLOCATE BUFFER        */
         L     @14,ATCZPSVT(,PTRATC)                               0742
         L     @15,ZPSZDFB0(,@14)                                  0742
         BALR  @14,@15                                             0742
*     END;                          /* END DEVICE END NOTIFY         */
*   ELSE                                                           0744
*     DO;                           /* PROCESS OPERATOR MESSAGE      */
         B     @RC00738                                            0744
@RF00738 DS    0H                                                  0745
*       FSBMSGID=ZMSG10;            /* SET MESSAGE IDENTIFIER        */
         MVC   FSBMSGID+16(4,PTRZLB),@CF04302                      0745
*       ZCRFBPTR=ADDR(ZLBFSB);      /* SET FROM BUFF PTR     @XM09072*/
         L     @15,RPHCRR(,PTRRPH)                                 0746
         L     @15,CRACRR(,@15)                                    0746
         LA    @00,ZLBFSB(,PTRZLB)                                 0746
         ST    @00,ZCRFBPTR(,@15)                                  0746
*       ZCRTBPTR=0;                 /* SET NO TO BUFF PTR    @XM09072*/
         SLR   @00,@00                                             0747
         ST    @00,ZCRTBPTR(,@15)                                  0747
*       ZCRPCOD2=0;                 /* ZERO PARM FIELD       @XM09072*/
         MVI   ZCRPCOD2(@15),X'00'                                 0748
*       ZCRPMFGF='1'B;              /* SET 1ST BUFF SW       @XM09072*/
*       ZCRPPG2='1'B;               /* SET PAGEABLE BUFF SW  @XM00957*/
         OI    ZCRPMFGF(@15),B'10100000'                           0750
*       ZCRMLNG=LENGTH(FSBFSB);     /* SET LENGTH OF DATA TO MOVE  0751
*                                                            @XM09072*/
         MVC   ZCRMLNG(2,@15),@CH01017                             0751
*       CALL ISTZDFD0;              /* MOVE DATA TO PAGEABLE BUFFER
*                                                            @XM09072*/
         L     @14,ATCZPSVT(,PTRATC)                               0752
         L     @15,ZPSZDFD0(,@14)                                  0752
         BALR  @14,@15                                             0752
*       PTRG07=PTRZLB;              /* SET PARM FOR BUFF DEALLOC   0753
*                                                            @XM09072*/
         LR    PTRG07,PTRZLB                                       0753
*       PTRZLB=ZCRBFPTR;            /* GET PAGEABLE BUF ADDR @XM09072*/
         L     @15,RPHCRR(,PTRRPH)                                 0754
         L     @15,CRACRR(,@15)                                    0754
         L     PTRZLB,ZCRBFPTR(,@15)                               0754
*       ZCRPCOD1=ZCPBUF;            /* INDIC FREE BUFFER     @XM09072*/
         MVI   ZCRPCOD1(@15),X'04'                                 0755
*       CALL ISTZDFB0;              /* FREE FIXED BUFFER     @XM09072*/
         L     @14,ATCZPSVT(,PTRATC)                               0756
         L     @15,ZPSZDFB0(,@14)                                  0756
         BALR  @14,@15                                             0756
*/* BUG01: TPQUE (ADDR(ZLBFSB),LDNZPAB1) NORM                        */
*                                                                  0757
*BUG01:                                                            0757
*       DO;                                                        0757
BUG01    DS    0H                                                  0758
*         RFY                                                      0758
*          (GPR00P,                                                0758
*           GPR01P,                                                0758
*           GPR04P,                                                0758
*           GPR05P,                                                0758
*           GPR15P) RSTD;                                          0758
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0759
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 0759
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*         GPR00P=0;                                                0760
         SLR   GPR00P,GPR00P                                       0760
*         GPR15P=ADDR(LDNZPAB1);    /* HOLD PAB PTR                  */
         LA    GPR15P,LDNZPAB1(,PTRLDN)                            0761
*         GPR04P=ADDR(ZLBFSB);      /* WORK ELE PTR                  */
         LA    GPR04P,ZLBFSB(,PTRZLB)                              0762
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0763
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        0764
         L     @14,ATCLCPTR                                        0764
         L     @15,ATCAP37(,@14)                                   0764
         BALR  @14,@15                                             0764
*         GEN(NOPR  0)                                             0765
*         NOSETS NOREFS;                                           0765
         NOPR  0
*         RFY                                                      0766
*          (GPR00P,                                                0766
*           GPR01P,                                                0766
*           GPR04P,                                                0766
*           GPR05P,                                                0766
*           GPR15P) UNRSTD;                                        0766
*       END;                        /* *** END OF TPQUE GENERATION 0767
*                                      QUEUE FSB TO MESSAGE WTR      */
*     END;                          /* END OPERATOR MESSAGE          */
*   RFY                                                            0769
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
@RC00738 DS    0H                                                  0770
*   PTRG14=ZCRSVF18;                /* RESTORE RETURN REG    @XM09703*/
         L     @15,RPHCRR(,PTRRPH)                                 0770
         L     @15,CRACRR(,@15)                                    0770
         L     PTRG14,ZCRSVF18(,@15)                               0770
*   RFY                                                            0771
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   END SUB000E;                    /* END OF SUBROUTINE             */
@EL00002 DS    0H                                                  0772
@EF00002 DS    0H                                                  0772
@ER00002 BR    @14                                                 0772
         EJECT
*                                                                  0773
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000G                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      A DEVICE IS PUT INTO SESSION BECAUSE IT IS EITHER IN RECORD */
*/*      MODE WITH DATA TRAFFIC ALLOWED, OR INVITE IS PENDING.       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0773
*SUB000G:                                                          0773
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* CF1A000G: SUBROUTINE          */
SUB000G  DS    0H                                                  0774
*   RFY                                                            0774
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   ZCRSVWK1=PTRG14;                /* SAVE RETURN REGISTER          */
         L     @15,RPHCRR(,PTRRPH)                                 0775
         L     @15,CRACRR(,@15)                                    0775
         ST    PTRG14,ZCRSVWK1(,@15)                               0775
*   RFY                                                            0776
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   DNCZV001=ADDR(ISTFMCB);         /* SET FMCB ACTIVE               */
         STCM  PTRFMC,7,DNCZV001(PTRDNC)                           0777
*   PTRDNC->NCBTSKID=FMCTSKID;      /* SET TASK ID IN DNCB           */
         L     @00,FMCTSKID(,PTRFMC)                               0778
         ST    @00,NCBTSKID(,PTRDNC)                               0778
*   ADDR(DNCZC001)->PABDVTA=ADDR(FMCPAB4)->PABDVTA;/* SET TIP DVT  0779
*                                      POINTER                       */
         MVC   PABDVTA+96(3,PTRDNC),PABDVTA+112(PTRFMC)            0779
*   CALL CIDFREE;                   /* RELEASE CID LOCK              */
         BAL   @14,CIDFREE                                         0780
*   RFY                                                            0781
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   PTRG14=ZCRSVWK1;                /* RESTORE RETURN REGISTER       */
         L     @15,RPHCRR(,PTRRPH)                                 0782
         L     @15,CRACRR(,@15)                                    0782
         L     PTRG14,ZCRSVWK1(,@15)                               0782
*   RFY                                                            0783
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   END SUB000G;                    /* END OF SUBROUTINE             */
@EL00003 DS    0H                                                  0784
@EF00003 DS    0H                                                  0784
@ER00003 BR    @14                                                 0784
@PB00003 DS    0H                                                  0785
         EJECT
*                                                                  0785
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG000B                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS NON-READ REQUEST.                                   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0785
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000B)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0785
*   DO;                                                            0785
*     GOTO SEG000B@;                                               0786
         B     SEG000B@                                            0786
*SEG000B:                                                          0787
*   END;                            /* CF1A000B: SUBROUTINE          */
SEG000B  DS    0H                                                  0788
*   IF ZLBCOMP=ZLBRCOMP             /* IF SUCESSFUL RESET    @ZM11492*/
*       ×ZLBCOMP=ZLBRFAIL           /* × UNSUCESSFUL RESET   @ZM11492*/
*       ×FSBMJRCD=FRCMDRST THEN     /* IF COMMAND RESET FSB          */
         CLI   ZLBCOMP(PTRZLB),X'08'                               0788
         BE    @RT00788                                            0788
         CLI   ZLBCOMP(PTRZLB),X'14'                               0788
         BE    @RT00788                                            0788
         CLI   FSBMJRCD+16(PTRZLB),X'18'                           0788
         BNE   @RF00788                                            0788
@RT00788 DS    0H                                                  0789
*     CALL SUB000C;                 /* DEQ AND QUE FSB TO TIP        */
         BAL   @14,SUB000C                                         0789
*   ELSE                            /* IF NOT A COMMAND RESET FSB    */
*     IF ZLBCOMP=ZLBCONRJ THEN      /* IF THIS A REJECTED CONTACT    */
         B     @RC00788                                            0790
@RF00788 CLI   ZLBCOMP(PTRZLB),X'10'                               0790
         BNE   @RF00790                                            0790
*       DO;                         /* PROCESS IT            @XM18624*/
*         CALL SUB000F;             /* REMOVE FSB FROM RPH QUEUE   0792
*                                                            @XM18624*/
         BAL   @14,SUB000F                                         0792
*         LDNZATTP='0'B;            /* ZERO ATTN IN PROGRESS @ZA24326*/
         L     @00,LDNZATTP(,PTRLDN)                               0793
@GL00004 LR    @15,@00                                             0793
         N     @15,@CF04509                                        0793
         CS    @00,@15,LDNZATTP(PTRLDN)                            0793
         BNE   @GL00004                                            0793
*         CALL ATCZLFVT->ZLFZEFBA;  /* CALL LOCAL SHIPOUT            */
         L     @14,ATCZLFVT(,PTRATC)                               0794
         L     @15,ZLFZEFBA(,@14)                                  0794
         BALR  @14,@15                                             0794
*         IF LDNZATTP='1'B THEN     /* IF ATTENTION IS STILL PENDING
*                                                            @ZA25166*/
         TM    LDNZATTP(PTRLDN),B'00100000'                        0795
         BNO   @RF00795                                            0795
*           ZCRNRMEX='0'B;          /* INDICATE TPEXIT NONE SO THAT
*                                      THE CHANNEL END WILL RUN IN 0796
*                                      ORDER TO PROCESS THE PENDING
*                                      ATTENTION             @ZA25166*/
         L     @15,RPHCRR(,PTRRPH)                                 0796
         L     @15,CRACRR(,@15)                                    0796
         NI    ZCRNRMEX(@15),B'11110111'                           0796
*       END;                        /* END...REJ CONTACT     @XM18624*/
*     ELSE                                                         0798
*       DO;                         /* IF NOT A REJECTED CONTACT     */
         B     @RC00790                                            0798
@RF00790 DS    0H                                                  0799
*         FMCZFC06='0'B;            /* CLEAR CONTACT UP FLAG         */
*                                                                  0799
         NI    FMCZFC06(PTRFMC),B'11111110'                        0799
*         /***********************************************************/
*         /*                                                         */
*         /* SEGMENT(SEG000D)REQUEST                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0800
*         DO;                                                      0800
*           GOTO SEG000D;                                          0801
         B     SEG000D                                             0801
*SEG000D#:                                                         0802
*         END;                      /* PROCESS NON-REJECTED CONT.    */
SEG000D# DS    0H                                                  0803
*       END;                        /* END NON-REJECTED CONTACT      */
*                                                                  0803
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000B)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0804
*   DO;                                                            0804
@RC00790 DS    0H                                                  0804
@RC00788 DS    0H                                                  0805
*     GOTO SEG000B#;                                               0805
         B     SEG000B#                                            0805
*SEG000B@:                                                         0806
*   END;                            /* END OF SEGMENT                */
         EJECT
*                                                                  0807
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000C                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      1. REMOVE THE FSB FROM THE DNCB PAB.                        */
*/*      2. QUEUE THE FSB TO THE FMCB TIP.                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  0807
*SUB000C:                                                          0807
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* CF1A000C: SUBROUTINE          */
         B     @PB00004                                            0807
SUB000C  DS    0H                                                  0808
*   RFY                                                            0808
*     PTRG14 RSTD;                  /* TO SAVE RETURN ADDRESS        */
*   PTRG07=PTRG14;                  /* SINCE THE REGISTER IS THERE   */
         LR    PTRG07,PTRG14                                       0809
*   RFY                                                            0810
*     PTRG14 UNRSTD;                /* SAVED                         */
*   CALL SUB000F;                   /* REMOVE FSB FROM RPH QUEUE     */
         BAL   @14,SUB000F                                         0811
*/*  TPQUE (ADDR(ZLBFSB),FMCPAB4) NORM                               */
*                                                                  0812
*   DO;                                                            0812
*     RFY                                                          0813
*      (GPR00P,                                                    0813
*       GPR01P,                                                    0813
*       GPR04P,                                                    0813
*       GPR05P,                                                    0813
*       GPR15P) RSTD;                                              0813
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        0814
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    0815
         SLR   GPR00P,GPR00P                                       0815
*     GPR15P=ADDR(FMCPAB4);         /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB4(,PTRFMC)                             0816
*     GPR04P=ADDR(ZLBFSB);          /* WORK ELE PTR                  */
         LA    GPR04P,ZLBFSB(,PTRZLB)                              0817
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0818
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0819
         L     @14,ATCLCPTR                                        0819
         L     @15,ATCAP37(,@14)                                   0819
         BALR  @14,@15                                             0819
*     GEN(NOPR  0)                                                 0820
*     NOSETS NOREFS;                                               0820
         NOPR  0
*     RFY                                                          0821
*      (GPR00P,                                                    0821
*       GPR01P,                                                    0821
*       GPR04P,                                                    0821
*       GPR05P,                                                    0821
*       GPR15P) UNRSTD;                                            0821
*   END;                            /* *** END OF TPQUE GENERATION 0822
*                                      QUEUE THE FSB TO FMCB TIP     */
*   RFY                                                            0823
*     PTRG14 RSTD;                  /* TO RESTORE RETURN ADDRESS     */
*   PTRG14=PTRG07;                  /* RESTORE RETURN ADDRESS        */
         LR    PTRG14,PTRG07                                       0824
*   RFY                                                            0825
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB000C;                    /* END OF SUBROUTINE             */
@EL00004 DS    0H                                                  0826
@EF00004 DS    0H                                                  0826
@ER00004 BR    @14                                                 0826
@PB00004 DS    0H                                                  0827
         EJECT
*                                                                  0827
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG000D                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS NON-REJECTED CONTACT.                               */
*/*                                                                  */
*/********************************************************************/
*                                                                  0827
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000D)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0827
*   DO;                                                            0827
*     GOTO SEG000D@;                                               0828
         B     SEG000D@                                            0828
*SEG000D:                                                          0829
*   END;                            /* CF1A000D: SUBROUTINE          */
SEG000D  DS    0H                                                  0830
*   CALL CIDLOCK;                   /* SET DAF LOCK                  */
         BAL   @14,CIDLOCK                                         0830
*   PTRFMC=PTRDNC->NCBFMCBA;        /* GET ADDRESS 1ST FMCB          */
         L     PTRFMC,NCBFMCBA(,PTRDNC)                            0831
*   DNCZV001=PTRFMC;                /* SET ACTIVE FMCB POINTER       */
         STCM  PTRFMC,7,DNCZV001(PTRDNC)                           0832
*   PTRDNC->NCBTSKID=FMCTSKID;      /* SET TASKID IN DNCB NCB        */
         L     @00,FMCTSKID(,PTRFMC)                               0833
         ST    @00,NCBTSKID(,PTRDNC)                               0833
*   ADDR(DNCZC001)->PABDVTA=ADDR(FMCPAB4)->PABDVTA;/* SET DVT IN DNCB
*                                      FROM FMCB                     */
         MVC   PABDVTA+96(3,PTRDNC),PABDVTA+112(PTRFMC)            0834
*   CALL CIDFREE;                   /* RELEASE DAF LOCK              */
*                                                                  0835
         BAL   @14,CIDFREE                                         0835
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000D)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0836
*   DO;                                                            0836
*     GOTO SEG000D#;                                               0837
         B     SEG000D#                                            0837
*SEG000D@:                                                         0838
*   END;                            /* END OF SEGMENT                */
         EJECT
*                                                                  0839
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000F                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      REMOVE WORK ELEMENT FROM DNCB PAB                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  0839
*SUB000F:                                                          0839
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* CF1A000F: SUBROUTINE          */
         B     @PB00005                                            0839
SUB000F  DS    0H                                                  0840
*   RFY                                                            0840
*    (PTRG10,                                                      0840
*     PTRG14) RSTD;                 /* SAVE AREA, RETURN REGISTER    */
*   PTRG10=PTRG14;                  /* SAVE RETURN REGISTER          */
         LR    PTRG10,PTRG14                                       0841
*   RFY                                                            0842
*     PTRG14 UNRSTD;                /* SAVED                         */
*/* TPDEQ (,DNCZC001)                                                */
*                                                                  0843
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     DCL                                                          0844
*       FMZCA091 BIT(32) CONSTANT('80000000'X);                    0844
*     DCL                                                          0845
*       FMZCB091 BIT(32) CONSTANT('7FFFFFFF'X);                    0845
*     RFY                                                          0846
*      (GPR00P,                                                    0846
*       GPR01P,                                                    0846
*       GPR14P,                                                    0846
*       GPR15P) RSTD;                                              0846
*     RFY                                                          0847
*       ISTWKE;                                                    0847
*     GPR15P=ADDR(DNCZC001);        /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,DNCZC001(,PTRDNC)                            0848
*     GPR14P=GPR15P->PABWEQA×FMZCA091;                             0849
         L     @11,@CF02401                                        0849
         L     GPR14P,PABWEQA(,GPR15P)                             0849
         OR    GPR14P,@11                                          0849
*     IF GPR14P=FMZCA091 THEN                                      0850
         CLR   GPR14P,@11                                          0850
         BE    @RT00850                                            0850
*       ;                                                          0851
*     ELSE                                                         0852
*       DO;                                                        0852
*FMZL1091:                                                         0853
*         ;                                                        0853
FMZL1091 DS    0H                                                  0854
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA091);                    0854
         B     @DE00854                                            0854
@DL00854 DS    0H                                                  0855
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0855
         LA    GPR15P,WKECHAIN(,GPR14P)                            0855
*           GPR14P=GPR15P->PABWEQA;                                0856
         L     GPR14P,PABWEQA(,GPR15P)                             0856
*         END;                                                     0857
@DE00854 L     @11,@CF02401                                        0857
         CL    @11,WKECHAIN(,GPR14P)                               0857
         BNE   @DL00854                                            0857
*         GPR00P=FMZCA091;                                         0858
         LR    GPR00P,@11                                          0858
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0859
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0859
*         BC(7,FMZL1091);                                          0860
         BC    7,FMZL1091                                          0860
*         GPR14P->WKECHAIN=0;                                      0861
         SLR   @11,@11                                             0861
         ST    @11,WKECHAIN(,GPR14P)                               0861
*       END;                                                       0862
*ISTA0091:                                                         0863
*     ;                                                            0863
@RT00850 DS    0H                                                  0863
ISTA0091 DS    0H                                                  0864
*     GPR14P=GPR14P&FMZCB091;                                      0864
         N     GPR14P,@CF02496                                     0864
*     GPR01P->RPHWEA=GPR14P;                                       0865
         ST    GPR14P,RPHWEA(,GPR01P)                              0865
*     RFY                                                          0866
*      (GPR00P,                                                    0866
*       GPR01P,                                                    0866
*       GPR14P,                                                    0866
*       GPR15P) UNRSTD;                                            0866
*   END;                            /* END TPDEQ GENERATION REMOVE 0867
*                                      WORK ELEMENT FROM DNCB PAB    */
*   RFY                                                            0868
*     PTRG14 RSTD;                  /* TO RESTORE RETURN REGISTER    */
*   PTRG14=PTRG10;                  /* RESTORE RETURN ADDRESS        */
         LR    PTRG14,PTRG10                                       0869
*   RFY                                                            0870
*    (PTRG10,                                                      0870
*     PTRG14) UNRSTD;               /* RESTORED                      */
*   END SUB000F;                    /* END OF SUBROUTINE             */
@EL00005 DS    0H                                                  0871
@EF00005 DS    0H                                                  0871
@ER00005 BR    @14                                                 0871
         EJECT
*                                                                  0872
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      CIDLOCK                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      SET CID DAF LOCK.                                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  0872
*CIDLOCK:                                                          0872
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* CIDLOCK: SUBROUTINE           */
CIDLOCK  DS    0H                                                  0873
*   RFY                                                            0873
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   ZCRSVWK2=PTRG14;                /* SAVE RETURN REGISTER          */
         L     @15,RPHCRR(,PTRRPH)                                 0874
         L     @11,CRACRR(,@15)                                    0874
         ST    PTRG14,ZCRSVWK2(,@11)                               0874
*   RFY                                                            0875
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   ZCRR2SV=PTRG02;                 /* SAVE REGISTER 2               */
         ST    PTRG02,ZCRR2SV(,@11)                                0876
*   ZCRR13SV=PTRG13;                /* SAVE REGISTER 13              */
         ST    PTRG13,ZCRR13SV(,@11)                               0877
*   PTRG02=CIDDAF&HALFMASK;         /* SET DESTINATION ADDRESS       */
         LH    PTRG02,CIDDAF+2(,PTRDNC)                            0878
         N     PTRG02,@CF04398                                     0878
         N     PTRG02,@CF04398                                     0878
*   PTRG13=ADDR(CRASVC);            /* SET SAVE AREA ADDRESS         */
         LA    PTRG13,CRASVC(,@15)                                 0879
*   DO;                             /* CIDCTL(FIND)                  */
*     RFY                                                          0881
*      (EMCR2,                                                     0881
*       EMCR3) RSTD;                                               0881
*     GEN SETS(RPHWORK)                                            0882
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     0882
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */
         SLR   EMCR3,EMCR3                                         0883
*     EMCR3='01'X;                  /* INDICATE SHARED LOCK          */
         LA    EMCR3,1                                             0884
*     CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS REQUEST           */
         L     @14,ATCLCPTR                                        0885
         L     @15,ATCCDFND(,@14)                                  0885
         BALR  @14,@15                                             0885
*     RFY                                                          0886
*      (EMCR2,                                                     0886
*       EMCR3) UNRSTD;                                             0886
*   END;                            /* CIDCTL SET DAF LOCK           */
*   PTRG02=ZCRR2SV;                 /* RESTORE REGISTER 2            */
         L     @15,RPHCRR(,PTRRPH)                                 0888
         L     @15,CRACRR(,@15)                                    0888
         L     PTRG02,ZCRR2SV(,@15)                                0888
*   PTRG13=ZCRR13SV;                /* RESTORE REGISTER 13           */
         L     PTRG13,ZCRR13SV(,@15)                               0889
*   RFY                                                            0890
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   PTRG14=ZCRSVWK2;                /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVWK2(,@15)                               0891
*   RFY                                                            0892
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   END CIDLOCK;                    /* END OF SUBROUTINE             */
@EL00006 DS    0H                                                  0893
@EF00006 DS    0H                                                  0893
@ER00006 BR    @14                                                 0893
         EJECT
*                                                                  0894
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      CIDFREE                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      RELEASE CID DAF LOCK.                                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0894
*CIDFREE:                                                          0894
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* CIDFREE SUBROUTINE            */
CIDFREE  DS    0H                                                  0895
*   RFY                                                            0895
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   ZCRSVWK2=PTRG14;                /* SAVE RETURN REGISTER          */
         L     @15,RPHCRR(,PTRRPH)                                 0896
         L     @11,CRACRR(,@15)                                    0896
         ST    PTRG14,ZCRSVWK2(,@11)                               0896
*   RFY                                                            0897
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   ZCRR2SV=PTRG02;                 /* SAVE REGISTER 2               */
         ST    PTRG02,ZCRR2SV(,@11)                                0898
*   ZCRR13SV=PTRG13;                /* SAVE REGISTER 13              */
         ST    PTRG13,ZCRR13SV(,@11)                               0899
*   PTRG02=CIDDAF&HALFMASK;         /* SET DESTINATION ADDRESS       */
         LH    PTRG02,CIDDAF+2(,PTRDNC)                            0900
         N     PTRG02,@CF04398                                     0900
         N     PTRG02,@CF04398                                     0900
*   PTRG13=ADDR(CRASVC);            /* SET SAVE AREA ADDRESS         */
         LA    PTRG13,CRASVC(,@15)                                 0901
*   DO;                             /* CIDCTL(FINISH)                */
*     RFY                                                          0903
*      (EMCR2,                                                     0903
*       EMCR3) RSTD;                                               0903
*     GEN SETS(RPHWORK)                                            0904
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     0904
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */
         SLR   EMCR3,EMCR3                                         0905
*     CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS REQUEST           */
         L     @14,ATCLCPTR                                        0906
         L     @15,ATCCDFIN(,@14)                                  0906
         BALR  @14,@15                                             0906
*     RFY                                                          0907
*      (EMCR2,                                                     0907
*       EMCR3) UNRSTD;                                             0907
*   END;                            /* CIDCTL RELEASE DAF LOCK       */
*   PTRG02=ZCRR2SV;                 /* RESTORE REGISTER 2            */
         L     @15,RPHCRR(,PTRRPH)                                 0909
         L     @15,CRACRR(,@15)                                    0909
         L     PTRG02,ZCRR2SV(,@15)                                0909
*   PTRG13=ZCRR13SV;                /* RESTORE REGISTER 13           */
         L     PTRG13,ZCRR13SV(,@15)                               0910
*   RFY                                                            0911
*     PTRG14 RSTD;                  /* RETURN REGISTER               */
*   PTRG14=ZCRSVWK2;                /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVWK2(,@15)                               0912
*   RFY                                                            0913
*     PTRG14 UNRSTD;                /* AVAILABLE                     */
*   END CIDFREE;                    /* END OF SUBROUTINE             */
@EL00007 DS    0H                                                  0914
@EF00007 DS    0H                                                  0914
@ER00007 BR    @14                                                 0914
@PB00007 DS    0H                                                  0915
*/* TPEPILOG                                                         */
*                                                                  0915
*   GEN(PRINT OFF);                                                0915
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0916
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0916
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*   DCL                                                            0917
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            0918
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   DECLARE                                                        0919
*     EMCR0 PTR REG(0),                                            0919
*     EMCR1 PTR REG(1),                                            0919
*     EMCR2 PTR REG(2),                                            0919
*     EMCR3 PTR REG(3),                                            0919
*     EMCR4 PTR REG(4),                                            0919
*     EMCR5 PTR REG(5),                                            0919
*     EMCR6 PTR REG(6),                                            0919
*     EMCR7 PTR REG(7),                                            0919
*     EMCR8 PTR REG(8),                                            0919
*     EMCR9 PTR REG(9),                                            0919
*     EMCR10 PTR REG(10),                                          0919
*     EMCR11 PTR REG(11),                                          0919
*     EMCR12 PTR REG(12),                                          0919
*     EMCR13 PTR REG(13),                                          0919
*     EMCR14 PTR REG(14),                                          0919
*     EMCR15 PTR REG(15);                                          0919
*   DECLARE                                                        0920
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     0920
*                                      ROUTINE                       */
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   0920
*                                      ROUTINE                       */
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     0920
*                                      ROUTINE                       */
*   DCL                                                            0921
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */
*   GEN(PRINT ON);                                                 0922
*                                                                  0922
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  0923
*   END ISTZCF1A                    /* THUS ENDETH ISTZCF1A          */
*                                                                  0923
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  0923
*       ;                                                          0923
@EL00001 DS    0H                                                  0923
@EF00001 DS    0H                                                  0923
@ER00001 BR    @14                                                 0923
@DATA    DS    0H
@CH01017 DC    H'32'
@CH01690 DC    H'172'
@DATD    DSECT
         DS    0F
ISTZCF1A CSECT
         DS    0F
@CF01100 DC    XL4'08000000'
@CF01104 DC    XL4'04000000'
@CF02401 DC    XL4'80000000'
@CF02496 DC    XL4'7FFFFFFF'
@CF04394 DC    XL4'00FFFFFF'
@CF04398 DC    XL4'0000FFFF'
@CF04505 DC    BL4'11111111111111111111111111111011'
@CF04509 DC    BL4'11011111111111111111111111111111'
@CF04302 DC    C'210I'
@DATD    DSECT
         DS    0D
IOSBPTR  DS    A
SRBPTR   DS    A
CVTPTR   DS    A
LCPBPTR  DS    A
LDNCBPTR DS    A
DNCBPTR  DS    A
FMCBPTR  DS    A
FSBPTR   DS    A
WKEPTR   DS    A
ISTZMSG  DS    F
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZCF1A CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
DISFSB   DC    AL4(ZLBFSB-ISTZLBUF)
@CC03588 DC    C'RECORD  '
@CC04402 DC    C'CC1A'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RPHPTR   EQU   @01
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
PTRRPH   EQU   @01
PTRATC   EQU   @02
PTRG02   EQU   @02
PTRLDN   EQU   @03
PTRDNC   EQU   @04
PTRFMC   EQU   @05
PTRZLB   EQU   @06
PTRLCP   EQU   @07
PTRLSC   EQU   @07
PTRG07   EQU   @07
PTRG10   EQU   @10
PTRG12   EQU   @12
PTRG13   EQU   @13
PTRG14   EQU   @14
EMCR2    EQU   @02
EMCR3    EQU   @03
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
PTRG00   EQU   @00
PTRG08   EQU   @08
PTRG09   EQU   @09
PTRG11   EQU   @11
PTRG15   EQU   @15
ATCLCPTR EQU   1032
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00002 EQU   IOSB+20
IOSCSW   EQU   @NM00002+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTZPSVT EQU   0
ZPSZDFD0 EQU   ISTZPSVT+8
ZPSZDFB0 EQU   ISTZPSVT+16
ISTZFSVT EQU   0
ZFSZEFBB EQU   ISTZFSVT
ZFSZEABB EQU   ZFSZEFBB
ZFSZEFAB EQU   ISTZFSVT+4
ZFSZEAAB EQU   ZFSZEFAB
ISTZLBVT EQU   0
ISTZLFVT EQU   0
ZLFZEFBA EQU   ISTZLFVT
ZLFZEFAA EQU   ISTZLFVT+4
ZLFZEAAA EQU   ZLFZEFAA
ZLFZFFFA EQU   ISTZLFVT+8
ZLFZFAFA EQU   ZLFZFFFA
ZLFZEFTA EQU   ISTZLFVT+12
ZLFZEATA EQU   ZLFZEFTA
ZLFZFFTA EQU   ISTZLFVT+16
ZLFZFATA EQU   ZLFZFFTA
ZLFZEFFA EQU   ISTZLFVT+24
ZLFZEAFA EQU   ZLFZEFFA
ZLFZEFCA EQU   ISTZLFVT+28
ZLFZEACA EQU   ZLFZEFCA
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHTYPE  EQU   RPHCNTL
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZSVFC EQU   ISTZSAVE+4
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRID    EQU   ZCRCRR
ZCRLEN   EQU   ZCRCRR+1
ZCRCHAIN EQU   ISTZCRR+4
ZCRFRRA  EQU   ISTZCRR+8
ZCRFLGS1 EQU   ISTZCRR+12
ZCRNRMEX EQU   ZCRFLGS1
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRTBPTR EQU   ZCRPARMS+4
ZCRMLNG  EQU   ZCRPARMS+8
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRPPG2  EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRBFPTR EQU   ISTZCRR+44
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRWKARA EQU   ISTZCRR+156
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRR2SV  EQU   ISTZCRR+184
ZCRR13SV EQU   ISTZCRR+188
ZCRCIDSV EQU   ISTZCRR+192
ZCRSAVEZ EQU   ISTZCRR+196
ZCRAUDIT EQU   ISTZCRR+440
ZCRTID   EQU   ZCRAUDIT
ZCRTNAME EQU   ZCRAUDIT+1
ZCRENTER EQU   ZCRAUDIT+5
ZCRECC1A EQU   ZCRENTER+6
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTDCCRR EQU   0
CRRSPACE EQU   ISTDCCRR+12
CRRSAREA EQU   0
CRRMAS   EQU   CRRSAREA+148
CRRMAS1  EQU   CRRMAS
CRRMAS2  EQU   CRRMAS+1
CRRMAS3  EQU   CRRMAS+2
CRRMAS4  EQU   CRRMAS+3
CRRRMAS1 EQU   CRRMAS+4
CRRRMAS2 EQU   CRRMAS+5
CRRRMAS3 EQU   CRRMAS+6
CRRSMAS  EQU   CRRRMAS3
CRRATS   EQU   CRRSAREA+156
CRRATS1  EQU   CRRATS
CRRATS2  EQU   CRRATS+1
CRRATS3  EQU   CRRATS+2
CRRATS4  EQU   CRRATS+3
CRRRATS1 EQU   CRRATS+4
CRRRATS2 EQU   CRRATS+5
CRRRATS3 EQU   CRRATS+6
CRRSATS  EQU   CRRRATS3
CRRFLGS1 EQU   CRRSAREA+164
CRRFLGS2 EQU   CRRSAREA+165
CRRFLGS3 EQU   CRRSAREA+166
CRRFLGS4 EQU   CRRSAREA+167
CRRFLGS  EQU   CRRSAREA+168
CRRRFLG1 EQU   CRRSAREA+169
CRRRTYPE EQU   CRRRFLG1
CRRFDBK1 EQU   CRRSAREA+170
CRRFDB2  EQU   CRRFDBK1+1
CRRFDB3  EQU   CRRFDBK1+2
CRRFDBK2 EQU   CRRSAREA+176
CRRDSB   EQU   CRRFDBK2
CRRESR   EQU   CRRFDBK2+2
CRRTRBUF EQU   CRRSAREA+204
CRRBFLGS EQU   CRRSAREA+280
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTRIA   EQU   0
RIAABRGS EQU   ISTRIA+16
RIAFLGS  EQU   ISTRIA+80
RIAFLG1  EQU   RIAFLGS
RIAFLG2  EQU   RIAFLGS+1
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRAFRR   EQU   CRAHDR+4
CRALKACT EQU   CRABASIC+8
CRAL5PTR EQU   CRABASIC+28
CRAPROCR EQU   ISTCRA+312
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABINHBT EQU   PABFLAGS
ISTDYPAB EQU   0
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00037 EQU   LOKCHNG+2
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCAP33  EQU   ISTATCVT+444
ATCAP36  EQU   ISTATCVT+452
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00045 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCZLFVT EQU   ATCAOSM+188
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00047 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNCB   EQU   0
NCBTYPE  EQU   ISTNCB
NCBDAF   EQU   ISTNCB+2
NCBTSKID EQU   ISTNCB+8
NCBNSNA  EQU   ISTNCB+12
NCBFMCBA EQU   ISTNCB+16
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
ISTLDNCB EQU   0
LDNCFLAG EQU   ISTLDNCB+54
LDNFLAGS EQU   ISTLDNCB+107
LDNZF007 EQU   LDNFLAGS
LDNZATTP EQU   LDNFLAGS+1
LDNFLAG2 EQU   ISTLDNCB+110
LDNZPAB1 EQU   ISTLDNCB+168
LDNZIOLK EQU   ISTLDNCB+184
LDNZERPF EQU   ISTLDNCB+185
LDNZCPAN EQU   LDNZERPF
LDNZEPIN EQU   LDNZERPF
LDNZLPC  EQU   ISTLDNCB+186
LDNDCDEB EQU   ISTLDNCB+304
LDNZSAV3 EQU   ISTLDNCB+376
LDNZSAV4 EQU   LDNZSAV3+8
LDNZH003 EQU   ISTLDNCB+577
ISTDNCB  EQU   0
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCBSCED EQU   DNCOS+2
DNCZV001 EQU   DNCOS+17
DNCLOCK  EQU   DNCOS+36
DNCZC001 EQU   DNCOS+40
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCTSKID EQU   ISTFMCB+8
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCMODE  EQU   ISTFMCB+52
FMCPAB3  EQU   ISTFMCB+96
FMCPAB4  EQU   ISTFMCB+112
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF006 EQU   FMCZFLAG
FMCZFB06 EQU   FMCZF006
FMCZFC06 EQU   FMCZF006
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTFDB   EQU   0
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBMNRCD EQU   FSBFSB+2
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
ISTZLBUF EQU   0
ZLBFSM   EQU   ISTZLBUF+4
ISTLSCB  EQU   0
LSC1WORD EQU   ISTLSCB
LSCREQTG EQU   LSC1WORD+2
LSCZRT02 EQU   LSCREQTG
LSCZRT03 EQU   LSCREQTG
LSCZRT04 EQU   LSCREQTG
LSCZRT05 EQU   LSCREQTG
LSCZRT06 EQU   LSCREQTG
LSCZRT07 EQU   LSCREQTG
LSCZMNRC EQU   LSCREQTG+1
LSCZRT08 EQU   LSCZMNRC
LSCZRT09 EQU   LSCZMNRC
LSCCHAIN EQU   ISTLSCB+4
LSCCHAI1 EQU   LSCCHAIN
LSCRUCNT EQU   ISTLSCB+8
LSCFLGS  EQU   ISTLSCB+9
LSCSEQ   EQU   ISTLSCB+10
LSCFDBA  EQU   ISTLSCB+24
CIDDAF   EQU   0
ISTZDFD0 EQU   0
ISTZDFB0 EQU   0
FMZL0027 EQU   0
FMZL0046 EQU   0
FMZL0056 EQU   0
FMZL0064 EQU   0
ISTAPC37 EQU   0
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
ISTSDCCF EQU   0
ISTSDCCR EQU   0
ISTAPC34 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCN EQU   0
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00064 EQU   FSBRQTAG
ZLBBTRAN EQU   ISTZLBUF
ZLBFDBZ  EQU   ZLBBTRAN
ZLBAIO   EQU   ZLBBTRAN+16
ZLBDTIO  EQU   ZLBFSM
ZLBCCW1  EQU   ZLBDTIO
ZLBCCW2  EQU   ZLBDTIO+8
ZLBCCW3  EQU   ZLBDTIO+16
ZLBSNS   EQU   ZLBDTIO+28
ZLBERC   EQU   ZLBDTIO+29
ZLBCOMP  EQU   ZLBDTIO+31
ZLBSAF   EQU   ZLBDTIO+48
ZLBSTAT  EQU   ZLBSAF
ZLBDEVST EQU   ZLBSTAT
ZLBRQTG  EQU   ZLBDTIO+50
ZLBRQFLG EQU   ZLBRQTG
ZLBRT08  EQU   ZLBRQFLG+1
ZLBFLAGS EQU   ZLBDTIO+56
ZLBTEXTA EQU   ZLBCCW3
ZLBTEXTB EQU   ZLBFLAGS
ZLBTEXTC EQU   ZLBFLAGS
ZLBPPL   EQU   ZLBTEXTC
ZLBFAIO  EQU   ZLBAIO
ZLBFSB   EQU   ZLBFAIO
CMZCIDM  EQU   ATCCIDM
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
ZLBFDBS  EQU   ZLBFAIO+32
ZLBPPCSC EQU   ZLBPPL+14
ZLBPPRS1 EQU   ZLBPPL+13
ZLBPPRSV EQU   ZLBPPL+12
ZLBPPCLG EQU   ZLBPPL+12
ZLBPPCC  EQU   ZLBPPL+12
ZLBPPINT EQU   ZLBPPL+12
ZLBPPHIO EQU   ZLBPPL+12
ZLBPP    EQU   ZLBPPL+4
ZLBPPLDB EQU   ZLBPPL+1
ZLBPPLF  EQU   ZLBPPL
ZLBTEXT1 EQU   ZLBTEXTB
ZLBTEXT  EQU   ZLBTEXTA+8
ZLBRSV0A EQU   ZLBTEXTA
ZLBTCP   EQU   ZLBFLAGS+8
ZLBTCSW  EQU   ZLBFLAGS+1
ZLBRSV09 EQU   ZLBFLAGS
ZLBWCCSP EQU   ZLBFLAGS
ZLBRSV07 EQU   ZLBFLAGS
ZLBLSTST EQU   ZLBDTIO+52
ZLBRQSEQ EQU   ZLBRQTG+1
ZLBRT0B  EQU   ZLBRQFLG+1
ZLBRT0A  EQU   ZLBRQFLG+1
ZLBRT09  EQU   ZLBRQFLG+1
ZLBRT07  EQU   ZLBRQFLG
ZLBRT06  EQU   ZLBRQFLG
ZLBRT05  EQU   ZLBRQFLG
ZLBRT04  EQU   ZLBRQFLG
ZLBRT03  EQU   ZLBRQFLG
ZLBRT02  EQU   ZLBRQFLG
ZLBRT01  EQU   ZLBRQFLG
ZLBRT00  EQU   ZLBRQFLG
ZLBCHNST EQU   ZLBSTAT+1
ZLBUCST  EQU   ZLBDEVST
ZLBDEST  EQU   ZLBDEVST
ZLBRSV10 EQU   ZLBDEVST
ZLBLSTBF EQU   ZLBDTIO+44
ZLBRSV11 EQU   ZLBDTIO+40
ZLBLCCWA EQU   ZLBDTIO+36
ZLBLCPBA EQU   ZLBDTIO+32
ZLBRSV08 EQU   ZLBDTIO+30
ZLBRSV05 EQU   ZLBERC
ZLBFBMI  EQU   ZLBERC
ZLBETI   EQU   ZLBERC
ZLBEMI   EQU   ZLBERC
ZLBEBI   EQU   ZLBERC
ZLBECI   EQU   ZLBERC
ZLBELI   EQU   ZLBERC
ZLBSOC   EQU   ZLBSNS
ZLBSCC   EQU   ZLBSNS
ZLBSUS   EQU   ZLBSNS
ZLBSDC   EQU   ZLBSNS
ZLBSEQCK EQU   ZLBSNS
ZLBSBOL  EQU   ZLBSNS
ZLBSIR   EQU   ZLBSNS
ZLBSCR   EQU   ZLBSNS
ZLBRSV12 EQU   ZLBDTIO+24
ZLBCPTC3 EQU   ZLBCCW3+6
ZLBRSV04 EQU   ZLBCCW3+5
ZLBCPFL3 EQU   ZLBCCW3+4
ZLBCPAD3 EQU   ZLBCCW3+1
ZLBCPCF3 EQU   ZLBCCW3
ZLBCPTC2 EQU   ZLBCCW2+6
ZLBRSV03 EQU   ZLBCCW2+5
ZLBCPFL2 EQU   ZLBCCW2+4
ZLBCPAD2 EQU   ZLBCCW2+1
ZLBCPCF2 EQU   ZLBCCW2
ZLBCPTC1 EQU   ZLBCCW1+6
ZLBCMOD  EQU   ZLBCCW1+5
ZLBCPFL1 EQU   ZLBCCW1+4
ZLBCPAD1 EQU   ZLBCCW1+1
ZLBCPCF1 EQU   ZLBCCW1
ZLBLNG2  EQU   ZLBBTRAN+14
ZLBRSV01 EQU   ZLBBTRAN+12
FSBRT0B  EQU   @NM00064+1
FSBRT0A  EQU   @NM00064+1
FSBRT09  EQU   @NM00064+1
FSBRT08  EQU   @NM00064+1
FSBRT07  EQU   @NM00064
FSBRT06  EQU   @NM00064
FSBRT05  EQU   @NM00064
FSBRT04  EQU   @NM00064
FSBRT03  EQU   @NM00064
FSBRT02  EQU   @NM00064
FSBRT01  EQU   @NM00064
FSBRT00  EQU   @NM00064
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00007 EQU   IOSPCISC+4
@NM00006 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00005 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
WKECHNGP EQU   WKECHAIN+1
@NM00066 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00065 EQU   ISTWKE
LSCTLBAD EQU   ISTLSCB+28
LSCFDB2  EQU   LSCFDBA+1
LSCFDB1  EQU   LSCFDBA
LSCLCCWA EQU   ISTLSCB+20
LSCLCPBA EQU   ISTLSCB+16
LSCLCCW1 EQU   ISTLSCB+12
LSCRRCNT EQU   LSCSEQ+1
LSCRRCCT EQU   LSCSEQ
LSCATOP  EQU   LSCFLGS
LSCFREE  EQU   LSCFLGS
LSCDSTAT EQU   LSCFLGS
LSCEXRES EQU   LSCFLGS
LSCZRIMM EQU   LSCFLGS
LSCRSV01 EQU   LSCFLGS
LSCSMODE EQU   LSCFLGS
LSCZMIRC EQU   LSCRUCNT
LSCCHAI2 EQU   LSCCHAIN+1
LSCCHNG  EQU   LSCCHAI1
LSCZRTSC EQU   LSCZMNRC
LSCZRT0B EQU   LSCZMNRC
LSCZRT0A EQU   LSCZMNRC
LSCZRTL9 EQU   LSCZRT09
LSCZRTL8 EQU   LSCZRT08
LSCZRTL7 EQU   LSCZRT07
LSCZRTL6 EQU   LSCZRT06
LSCZRTL5 EQU   LSCZRT05
LSCZRTL4 EQU   LSCZRT04
LSCZRTL3 EQU   LSCZRT03
LSCZRTL2 EQU   LSCZRT02
LSCZRT01 EQU   LSCREQTG
LSCZRT00 EQU   LSCREQTG
LSCLNGTH EQU   LSC1WORD+1
LSCTYPE  EQU   LSC1WORD
ZLBLNG1  EQU   ZLBFSM
ZLBCHAIN EQU   ISTZLBUF
FSBFDB   EQU   ISTFSB+32
FSBRSV01 EQU   FSBFSB+30
FSBTHCNT EQU   FSBFSB+28
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00063 EQU   FSBSS2
@NM00062 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00061 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBELI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBDAF   EQU   FSBCID+2
FSBSAF   EQU   FSBCID
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
FSBLNGTH EQU   FSBFSB+1
FSBTYPE  EQU   FSBFSB
FDBOFSET EQU   ISTFDB+10
FDBDATCT EQU   ISTFDB+8
FDBDATAA EQU   ISTFDB+4
FDBFDBA  EQU   ISTFDB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00060 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00059 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00058 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00057 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB5  EQU   ISTFMCB+128
FMCPAB2  EQU   ISTFMCB+80
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCPROCD EQU   ISTFMCB+48
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00056 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00055 EQU   ISTFMCB+30
@NM00054 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DNCZV005 EQU   DNCOS+32
DNCZV004 EQU   DNCOS+28
DNCZV003 EQU   DNCOS+24
DNCZV002 EQU   DNCOS+21
DNCZX001 EQU   DNCOS+20
DNCZX003 EQU   DNCOS+16
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCACIP  EQU   DNCBSCED+1
DNCLICP  EQU   DNCBSCED
DNCZF008 EQU   DNCZFLGS+1
DNCZPSRD EQU   DNCZFLGS+1
DNCPSOL  EQU   DNCZFLGS+1
DNCZF007 EQU   DNCZFLGS+1
DNCZF006 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZF003 EQU   DNCZFLGS
DNCZF002 EQU   DNCZFLGS
DNCZRSCH EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCINVIT EQU   DNCZFLGS
DNCSESS  EQU   DNCZFLGS
DNCZF001 EQU   DNCZFLGS
DNCMODE  EQU   ISTDNCB+49
DNCBHSET EQU   ISTDNCB+48
DNCNCB   EQU   ISTDNCB
LDNZS00F EQU   LDNZH003+1
LDNZS00E EQU   LDNZH003+1
LDNZS00D EQU   LDNZH003+1
LDNZS00C EQU   LDNZH003+1
LDNZS00B EQU   LDNZH003+1
LDNZS007 EQU   LDNZH003
LDNZS006 EQU   LDNZH003
LDNZS005 EQU   LDNZH003
LDNZS004 EQU   LDNZH003
LDNZS003 EQU   LDNZH003
LDNZS002 EQU   LDNZH003
LDNZS001 EQU   LDNZH003
LDNZS000 EQU   LDNZH003
LDNZX006 EQU   ISTLDNCB+576
LDNZC001 EQU   ISTLDNCB+569
LDNZX005 EQU   ISTLDNCB+568
LDNZV006 EQU   ISTLDNCB+564
LDNSRB   EQU   ISTLDNCB+520
LDNIOSB  EQU   ISTLDNCB+412
@NM00053 EQU   LDNZSAV3+28
LDNRSV06 EQU   LDNZSAV4+16
LDNZSAV6 EQU   LDNZSAV4+12
LDNZSAV5 EQU   LDNZSAV4
LDNZSAVE EQU   LDNZSAV3
LDNZSAV2 EQU   ISTLDNCB+368
LDNZSAV1 EQU   ISTLDNCB+352
LDNZ3RR  EQU   ISTLDNCB+348
LDNZ2RR  EQU   ISTLDNCB+344
LDNZ1RR  EQU   ISTLDNCB+340
LDNRSV0B EQU   ISTLDNCB+336
LDNRSV0A EQU   ISTLDNCB+332
LDNRSV09 EQU   ISTLDNCB+328
LDNRSV08 EQU   ISTLDNCB+324
LDNRSV07 EQU   ISTLDNCB+320
LDNDEAD  EQU   LDNDCDEB+12
LDNUCBAD EQU   LDNDCDEB+8
LDNAPPAD EQU   LDNDCDEB+5
LDNEXSCL EQU   LDNDCDEB+4
LDNDCBAD EQU   LDNDCDEB+1
LDNDEBID EQU   LDNDCDEB
LDNZRIND EQU   ISTLDNCB+300
LDNRPH   EQU   ISTLDNCB+192
LDNZTCP  EQU   ISTLDNCB+188
LDNZCHNC EQU   ISTLDNCB+187
LDNZLPC7 EQU   LDNZLPC
LDNZLPC6 EQU   LDNZLPC
LDNZLPC5 EQU   LDNZLPC
LDNZLPC4 EQU   LDNZLPC
LDNZLPC3 EQU   LDNZLPC
LDNZLPC2 EQU   LDNZLPC
LDNZLPC1 EQU   LDNZLPC
LDNZLPC0 EQU   LDNZLPC
LDNRSV05 EQU   LDNZERPF
LDNZCTOV EQU   LDNZEPIN
LDNZF001 EQU   LDNZEPIN
LDNZFRDW EQU   LDNZCPAN
LDNZFRD  EQU   LDNZCPAN
LDNZNARD EQU   LDNZCPAN
LDNRSV04 EQU   LDNZIOLK
LDNZATBF EQU   LDNZIOLK
LDNZERLK EQU   LDNZIOLK
LDNZDSIC EQU   LDNZIOLK
LDNZV005 EQU   ISTLDNCB+160
LDNZS1VR EQU   ISTLDNCB+136
LDNZS1RR EQU   ISTLDNCB+132
LDNZS1FC EQU   ISTLDNCB+128
LDNZS1BC EQU   ISTLDNCB+124
LDNZLOCK EQU   ISTLDNCB+120
LDNZFBUF EQU   ISTLDNCB+116
LDNZLAST EQU   ISTLDNCB+112
LDNRSV02 EQU   LDNFLAG2
LDNZFF04 EQU   LDNFLAG2
LDNZFF69 EQU   LDNFLAGS+2
LDNTPBIO EQU   LDNFLAGS+2
LDNZFF03 EQU   LDNFLAGS+2
LDNZFF02 EQU   LDNFLAGS+2
LDNZFF01 EQU   LDNFLAGS+2
LDNZFF00 EQU   LDNFLAGS+2
LDNCLOSD EQU   LDNFLAGS+2
LDNZENTR EQU   LDNFLAGS+2
LDNZICCW EQU   LDNFLAGS+1
LDNZREC  EQU   LDNFLAGS+1
LDNZCTXT EQU   LDNFLAGS+1
LDNZATLK EQU   LDNFLAGS+1
LDNZCHNE EQU   LDNFLAGS+1
LDNZIOBY EQU   LDNFLAGS+1
LDNZF00A EQU   LDNFLAGS+1
LDNZF009 EQU   LDNFLAGS
LDNZF008 EQU   LDNFLAGS
LDNZF006 EQU   LDNFLAGS
LDNZF005 EQU   LDNFLAGS
LDNZF004 EQU   LDNFLAGS
LDNZF003 EQU   LDNFLAGS
LDNZF002 EQU   LDNFLAGS
LDNZHDCC EQU   ISTLDNCB+106
LDNZARM  EQU   ISTLDNCB+104
LDNZRM   EQU   ISTLDNCB+102
LDNZRB   EQU   ISTLDNCB+100
LDNCPQ   EQU   ISTLDNCB+96
LDNSIOQ  EQU   ISTLDNCB+92
LDNZX002 EQU   ISTLDNCB+91
LDNZX001 EQU   ISTLDNCB+90
LDNZH002 EQU   ISTLDNCB+88
LDNZV001 EQU   ISTLDNCB+84
LDNZACSW EQU   ISTLDNCB+76
LDNZC002 EQU   ISTLDNCB+68
LDNCSWSV EQU   ISTLDNCB+60
LDNCHFLD EQU   ISTLDNCB+56
LDNRESRV EQU   ISTLDNCB+55
@NM00052 EQU   LDNCFLAG
LDNRMF   EQU   LDNCFLAG
LDNIBI   EQU   LDNCFLAG
LDNTSAF  EQU   ISTLDNCB+52
LDNCUUA  EQU   ISTLDNCB+48
LDNCB    EQU   ISTLDNCB
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00051 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBRDTE  EQU   ISTNCB+4
NCBLNGTH EQU   ISTNCB+1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00050 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00049 EQU   ATCAOSM+333
@NM00048 EQU   @NM00047
ATCSNUF  EQU   @NM00047
ATCOPKL  EQU   @NM00047
ATCABEN  EQU   @NM00047
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00046 EQU   @NM00045
ATCVTMAB EQU   @NM00045
@NM00044 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00043 EQU   ISTATCVT+819
@NM00042 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00041 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCDVTLK EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+448
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00040 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00039 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
LOKXCL   EQU   @NM00037
LOKPRY   EQU   @NM00037
@NM00038 EQU   @NM00037
@NM00036 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
RIARSV03 EQU   RIAFLGS+2
RIARSV02 EQU   RIAFLG2
RIABR15  EQU   RIAFLG2
RIARSPCC EQU   RIAFLG2
RIARTPXT EQU   RIAFLG2
RIACONT  EQU   RIAFLG2
RIAFABN  EQU   RIAFLG2
RIARSV01 EQU   RIAFLG1
RIACTIVE EQU   RIAFLG1
RIACTL   EQU   RIAFLG1
RIAABR15 EQU   RIAABRGS+60
RIAABR14 EQU   RIAABRGS+56
RIAABR13 EQU   RIAABRGS+52
RIAABR12 EQU   RIAABRGS+48
RIAABR11 EQU   RIAABRGS+44
RIAABR10 EQU   RIAABRGS+40
RIAABR09 EQU   RIAABRGS+36
RIAABR08 EQU   RIAABRGS+32
RIAABR07 EQU   RIAABRGS+28
RIAABR06 EQU   RIAABRGS+24
RIAABR05 EQU   RIAABRGS+20
RIAABR04 EQU   RIAABRGS+16
RIAABR03 EQU   RIAABRGS+12
RIAABR02 EQU   RIAABRGS+8
RIAABR01 EQU   RIAABRGS+4
RIAABR00 EQU   RIAABRGS
RIARSV04 EQU   ISTRIA+14
RIAABPSW EQU   ISTRIA+4
RIAABCD  EQU   ISTRIA
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
CRRRVPT5 EQU   CRRSAREA+316
CRRRVPT4 EQU   CRRSAREA+312
CRRRVPT3 EQU   CRRSAREA+308
CRRRVPT2 EQU   CRRSAREA+304
CRRRVPT1 EQU   CRRSAREA+300
CRRRVCR2 EQU   CRRSAREA+292
CRRRVCR1 EQU   CRRSAREA+291
CRRXFNCD EQU   CRRSAREA+290
CRRLDOCT EQU   CRRSAREA+288
CRRBTLEN EQU   CRRSAREA+284
CRRBLEN  EQU   CRRSAREA+282
CRRBRTCD EQU   CRRSAREA+281
@NM00035 EQU   CRRBFLGS
CRRBFLG1 EQU   CRRBFLGS
CRRBLDAD EQU   CRRSAREA+276
CRRBARAD EQU   CRRSAREA+272
CRRRTN12 EQU   CRRSAREA+268
CRRRTN11 EQU   CRRSAREA+264
CRRRTN10 EQU   CRRSAREA+260
CRRRTN9  EQU   CRRSAREA+256
CRRRTN8  EQU   CRRSAREA+252
CRRRTN7  EQU   CRRSAREA+248
CRRRTN6  EQU   CRRSAREA+244
CRRRTN5  EQU   CRRSAREA+240
CRRRTN4  EQU   CRRSAREA+236
CRRRTN3  EQU   CRRSAREA+232
CRRRTN2  EQU   CRRSAREA+228
CRRRTN1  EQU   CRRSAREA+224
CRRRES1  EQU   CRRSAREA+222
CRRLCNT  EQU   CRRSAREA+220
CRRATCVT EQU   CRRSAREA+216
CRRVALCK EQU   CRRSAREA+212
CRRARPL  EQU   CRRTRBUF+4
CRRBIND  EQU   CRRTRBUF+3
CRRTRRES EQU   CRRTRBUF
CRRCLDO  EQU   CRRSAREA+200
CRRUECB  EQU   CRRSAREA+196
CRRLCPB  EQU   CRRSAREA+192
CRRCMDAD EQU   CRRSAREA+188
CRRFMCB  EQU   CRRSAREA+184
CRRCLCCW EQU   CRRSAREA+180
CRRESR2  EQU   CRRESR+1
CRRESR1  EQU   CRRESR
CRRDSB2  EQU   CRRDSB+1
CRRDSB1  EQU   CRRDSB
CRRDTACT EQU   CRRSAREA+174
CRRRSV99 EQU   CRRSAREA+173
CRRRDSOH EQU   CRRFDB3
CRRRLG   EQU   CRRFDB3
CRRLGFRC EQU   CRRFDB3
CRRRDEOT EQU   CRRFDB3
CRRRDEOM EQU   CRRFDB3
CRRRDEOB EQU   CRRFDB3
CRRUNUSD EQU   CRRFDB3
CRRUINPT EQU   CRRFDB3
CRRSTSAV EQU   CRRFDB2
CRRCUERR EQU   CRRFDB2
CRRDLGFL EQU   CRRFDB2
CRRIOERR EQU   CRRFDB2
CRRDVUNS EQU   CRRFDB2
CRRATND  EQU   CRRFDB2
CRRRVID  EQU   CRRFDB2
CRRERLK  EQU   CRRFDB2
CRRRTNCD EQU   CRRFDBK1
CRRNSNA  EQU   CRRRTYPE
CRRDFSYN EQU   CRRRTYPE
CRRRESP  EQU   CRRRTYPE
CRRDFASY EQU   CRRRTYPE
CRRDBLCK EQU   CRRRFLG1
CRRRPSBD EQU   CRRRFLG1
CRRRPLOQ EQU   CRRRFLG1
CRRRPLS  EQU   CRRRFLG1
CRRSW7   EQU   CRRFLGS
CRRSW6   EQU   CRRFLGS
CRRSW5   EQU   CRRFLGS
CRRSW4   EQU   CRRFLGS
CRRSW3   EQU   CRRFLGS
CRRSW2   EQU   CRRFLGS
CRRSW1   EQU   CRRFLGS
CRRSW0   EQU   CRRFLGS
CRRRSV04 EQU   CRRFLGS4
CRRFMCLK EQU   CRRFLGS4
CRRDLCCW EQU   CRRFLGS3
CRRRESET EQU   CRRFLGS3
CRRSUBBK EQU   CRRFLGS3
CRRRSV08 EQU   CRRFLGS3
CRRDEBQ  EQU   CRRFLGS3
CRRSTSPR EQU   CRRFLGS3
CRRDREQ  EQU   CRRFLGS3
CRRDFDBK EQU   CRRFLGS3
CRRDFSB  EQU   CRRFLGS2
CRRDPROC EQU   CRRFLGS2
CRREXTS  EQU   CRRFLGS2
CRRELSRI EQU   CRRFLGS2
CRRPOST  EQU   CRRFLGS2
CRRENDLW EQU   CRRFLGS2
CRRPRGIP EQU   CRRFLGS2
CRRDEXP  EQU   CRRFLGS2
CRRSOLRQ EQU   CRRFLGS1
CRRREQP  EQU   CRRFLGS1
CRRCPROC EQU   CRRFLGS1
CRRFINI  EQU   CRRFLGS1
CRRPREIO EQU   CRRFLGS1
CRRINIO  EQU   CRRFLGS1
CRRFLDOS EQU   CRRFLGS1
CRRDOCUR EQU   CRRFLGS1
CRRRATS4 EQU   CRRATS+7
@NM00034 EQU   CRRSATS
CRRASC51 EQU   CRRSATS
CRRASC40 EQU   CRRSATS
CRRASC30 EQU   CRRSATS
CRRASC21 EQU   CRRSATS
CRRASC10 EQU   CRRSATS
CRRASC01 EQU   CRRSATS
@NM00033 EQU   CRRRATS2
CRRPLIC  EQU   CRRRATS2
CRRRC81  EQU   CRRRATS2
CRRRC80  EQU   CRRRATS2
CRRRC65  EQU   CRRRATS2
CRRRC63  EQU   CRRRATS2
CRRRC55  EQU   CRRRATS2
CRRRC54  EQU   CRRRATS2
CRRRC53  EQU   CRRRATS1
CRRRC52  EQU   CRRRATS1
CRRRC51  EQU   CRRRATS1
CRRRC30  EQU   CRRRATS1
CRRRC26  EQU   CRRRATS1
CRRRC23  EQU   CRRRATS1
CRRRC22  EQU   CRRRATS1
CRRRC21  EQU   CRRRATS1
@NM00032 EQU   CRRATS4
CRRC3X   EQU   CRRATS4
CRRC85   EQU   CRRATS4
CRRC83   EQU   CRRATS4
CRRC82   EQU   CRRATS4
CRRC61   EQU   CRRATS4
CRRC60   EQU   CRRATS4
CRRC81   EQU   CRRATS3
CRRC80   EQU   CRRATS3
CRRC75   EQU   CRRATS3
CRRC51   EQU   CRRATS3
CRRC50   EQU   CRRATS3
CRRC42   EQU   CRRATS3
CRRC41   EQU   CRRATS3
CRRC40   EQU   CRRATS3
CRRC32   EQU   CRRATS2
CRRC31   EQU   CRRATS2
CRRC30   EQU   CRRATS2
CRRC25   EQU   CRRATS2
CRRC24   EQU   CRRATS2
CRRC23   EQU   CRRATS2
CRRC22   EQU   CRRATS2
CRRC21   EQU   CRRATS2
CRRC20   EQU   CRRATS1
CRRC13   EQU   CRRATS1
CRRC12   EQU   CRRATS1
CRRC11   EQU   CRRATS1
CRRC10   EQU   CRRATS1
CRRC02   EQU   CRRATS1
CRRC01   EQU   CRRATS1
CRRC00   EQU   CRRATS1
CRRRMAS4 EQU   CRRMAS+7
@NM00031 EQU   CRRSMAS
CRRMSC51 EQU   CRRSMAS
CRRMSC40 EQU   CRRSMAS
CRRMSC30 EQU   CRRSMAS
CRRMSC21 EQU   CRRSMAS
CRRMSC10 EQU   CRRSMAS
CRRMSC01 EQU   CRRSMAS
@NM00030 EQU   CRRRMAS2
CRRRM81  EQU   CRRRMAS2
CRRRM80  EQU   CRRRMAS2
CRRRM65  EQU   CRRRMAS2
CRRRM63  EQU   CRRRMAS2
CRRRM55  EQU   CRRRMAS2
CRRRM54  EQU   CRRRMAS2
CRRRM53  EQU   CRRRMAS1
CRRRM52  EQU   CRRRMAS1
CRRRM51  EQU   CRRRMAS1
CRRRM30  EQU   CRRRMAS1
CRRRM26  EQU   CRRRMAS1
CRRRM23  EQU   CRRRMAS1
CRRRM22  EQU   CRRRMAS1
CRRRM21  EQU   CRRRMAS1
@NM00029 EQU   CRRMAS4
CRRM3X   EQU   CRRMAS4
CRRM85   EQU   CRRMAS4
CRRM83   EQU   CRRMAS4
CRRM82   EQU   CRRMAS4
CRRM61   EQU   CRRMAS4
CRRM60   EQU   CRRMAS4
CRRM81   EQU   CRRMAS3
CRRM80   EQU   CRRMAS3
CRRM75   EQU   CRRMAS3
CRRM51   EQU   CRRMAS3
CRRM50   EQU   CRRMAS3
CRRM42   EQU   CRRMAS3
CRRM41   EQU   CRRMAS3
CRRM40   EQU   CRRMAS3
CRRM32   EQU   CRRMAS2
CRRM31   EQU   CRRMAS2
CRRM30   EQU   CRRMAS2
CRRM25   EQU   CRRMAS2
CRRM24   EQU   CRRMAS2
CRRM23   EQU   CRRMAS2
CRRM22   EQU   CRRMAS2
CRRM21   EQU   CRRMAS2
CRRM20   EQU   CRRMAS1
CRRM13   EQU   CRRMAS1
CRRM12   EQU   CRRMAS1
CRRM11   EQU   CRRMAS1
CRRM10   EQU   CRRMAS1
CRRM02   EQU   CRRMAS1
CRRM01   EQU   CRRMAS1
CRRM00   EQU   CRRMAS1
CRRFSB   EQU   CRRSAREA+144
CRRSAVE1 EQU   CRRSAREA+72
CRRSAVE  EQU   CRRSAREA
CRRRSV22 EQU   ISTDCCRR+4
CRRCRR   EQU   ISTDCCRR
@NM00028 EQU   ISTAPCRR+137
@NM00027 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00026 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00025 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00024 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00023 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00022 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00021 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00020 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRREMIC EQU   ISTZCRR+436
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00019 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00018 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00017 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFLAG  EQU   ZCRCRR+3
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPNXLCW EQU   ISTLCPB+20
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00016 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZACTV EQU   ZSAZSVMS
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00015 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00014 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00013 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
ZLFZWRD5 EQU   ISTZLFVT+48
ZLFZWRD4 EQU   ISTZLFVT+44
ZLFZDFK0 EQU   ISTZLFVT+40
ZLFZEMEA EQU   ISTZLFVT+36
ZLFZFFEA EQU   ISTZLFVT+32
ZLFZEMCA EQU   ZLFZEACA
ZLFZEMFA EQU   ZLFZEAFA
ZLFZFFXA EQU   ISTZLFVT+20
ZLFZFMTA EQU   ZLFZFATA
ZLFZEMTA EQU   ZLFZEATA
ZLFZFMFA EQU   ZLFZFAFA
ZLFZEMAA EQU   ZLFZEAAA
ZLBZBFSC EQU   ISTZLBVT+88
ZLBZIFVB EQU   ISTZLBVT+84
ZLBZIFUB EQU   ISTZLBVT+80
ZLBZIFSB EQU   ISTZLBVT+76
ZLBRSV22 EQU   ISTZLBVT+72
ZLBZBFID EQU   ISTZLBVT+68
ZLBZBFX0 EQU   ISTZLBVT+64
ZLBRSV02 EQU   ISTZLBVT+60
ZLBRSV21 EQU   ISTZLBVT+56
ZLBZBFJB EQU   ISTZLBVT+52
ZLBZBFIB EQU   ISTZLBVT+48
ZLBZBFHB EQU   ISTZLBVT+44
ZLBZBFGB EQU   ISTZLBVT+40
ZLBZBFFB EQU   ISTZLBVT+36
ZLBZBFEB EQU   ISTZLBVT+32
ZLBZBFDB EQU   ISTZLBVT+28
ZLBZBFCB EQU   ISTZLBVT+24
ZLBZBFBB EQU   ISTZLBVT+20
ZLBZBFAB EQU   ISTZLBVT+16
ZLBZBFNB EQU   ISTZLBVT+12
ZLBZCFAI EQU   ISTZLBVT+8
ZLBZBF0B EQU   ISTZLBVT+4
ZLBZAF0B EQU   ISTZLBVT
ZFSZWRD4 EQU   ISTZFSVT+36
ZFSZWRD3 EQU   ISTZFSVT+32
ZFSZEFCB EQU   ISTZFSVT+28
ZFSZFFEB EQU   ISTZFSVT+24
ZFSZDFJ0 EQU   ISTZFSVT+20
ZFSZFFFB EQU   ISTZFSVT+16
ZFSZFFDB EQU   ISTZFSVT+12
ZFSZFFCB EQU   ISTZFSVT+8
ZFSZEMAB EQU   ZFSZEAAB
ZFSZEMBB EQU   ZFSZEABB
ZPSZDFQR EQU   ISTZPSVT+80
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
ZPSZDFNB EQU   ISTZPSVT+52
@NM00012 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFZ0 EQU   ISTZPSVT+28
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFC0 EQU   ISTZPSVT+4
ZPSZDFA0 EQU   ISTZPSVT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00011 EQU   CVTFIX+248
@NM00010 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00009 EQU   SRBSECT+40
@NM00008 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00004 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00003 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00002
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00001 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
SEG000A# EQU   @RC00657
@RC00719 EQU   @RC00709
@RC00712 EQU   @RC00709
@PB00002 EQU   @PB00003
@RF00795 EQU   @RC00790
SEG000B@ EQU   @PB00004
@PB00006 EQU   @PB00007
@RC00713 EQU   @RC00712
SEG000A@ EQU   @PB00002
@PB00005 EQU   @PB00006
SEG000D@ EQU   @PB00005
@ENDDATA EQU   *
         END   ISTZCF1A,(C'PLS2331',0603,77277)
