         TITLE 'ISTZCFBI/ABI-VS1/MBI-VS2 - DIALOGUE SCHEDULER INBOUND  *
                        '
ISTZCFBI CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZCFBI  77.110'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         EJECT
*                                                                  0511
*/********************************************************************/
*/*                                                                  */
*/*     ISTZCFBI - DIALOGUE SCHEDULER INBOUND - 1 3270 RECORD        */
*/*                                                                  */
*/********************************************************************/
*/* TPZENTER  AC(CCBI)FRR(IN)SAVES(ZCRSAVNO)                         */
*                                                                  0511
*   DO;                                                            0511
*                                                                  0511
*/* ATBUILD (ISTZSAVE,ISTZCRR)                                       */
*/* END OF ATBUILD                                                   */
*/* ATBUILD (ISTRPH,ISTCRA)                                          */
*/* END OF ATBUILD                                                   */
*                                                                  0512
*     RFY                                                          0512
*      (GPR00P,                                                    0512
*       GPR01P,                                                    0512
*       GPR02P,                                                    0512
*       GPR03P,                                                    0512
*       GPR04P,                                                    0512
*       GPR05P,                                                    0512
*       GPR06P,                                                    0512
*       GPR07P,                                                    0512
*       GPR12P,                                                    0512
*       GPR13P,                                                    0512
*       GPR15P) RSTD;                                              0512
*     GEN SETS(GPR12P);                                            0513
*                     /* ESTABLISH BASE */
          BALR  GPR12P,0
          USING *,GPR12P
*     DO;                           /* LISATCVT                    0514
*                                      CVTBASE(PAGEABLE,(GPR02P))    */
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR02P,ATCLCPTR                                     0515
*     END;                          /* LISATCVT                      */
*     GPR03P=GPR01P->RPHCRR;        /* ADDRESS CRA                   */
         L     GPR03P,RPHCRR(,GPR01P)                              0517
*     GPR04P=ADDR(GPR03P->CRAPROCR);/* ADDRESS ZCRR                  */
         LA    GPR04P,CRAPROCR(,GPR03P)                            0518
*     GPR06P=GPR04P;                /* INITIALIZE ZCR POINTER        */
         LR    GPR06P,GPR04P                                       0519
*     GPR05P=LENGTH(ISTZCRR);       /* SETUP ZCRR LENGTH             */
         LA    GPR05P,536                                          0520
*     GPR07P=0;                     /* ZERO REG 7                    */
         SLR   GPR07P,GPR07P                                       0521
*     MVCL(GPR04P,GPR06P);          /* CLEAR ZCRR                    */
         MVCL  GPR04P,GPR06P                                       0522
*     GPR04P=ADDR(GPR03P->CRAPROCR);/* ADDRESS ZCRR                  */
         LA    GPR04P,CRAPROCR(,GPR03P)                            0523
*     GPR04P->ZCRFRRA=GPR03P->CRAFRR;/* SAVE CURRENT FRR POINTER     */
         L     @14,CRAFRR(,GPR03P)                                 0524
         ST    @14,ZCRFRRA(,GPR04P)                                0524
*     GPR03P->CRAFRR=0;             /* CLEAR FRR POINTER             */
         SLR   @14,@14                                             0525
         ST    @14,CRAFRR(,GPR03P)                                 0525
*     GPR04P->ZCRCHAIN=GPR03P->CRACRR;/* SAVE CURRENT CRR            */
         L     @14,CRACRR(,GPR03P)                                 0526
         ST    @14,ZCRCHAIN(,GPR04P)                               0526
*     GPR03P->CRACRR=GPR04P;        /* SET ZCRR AS CURRENT CRR       */
         ST    GPR04P,CRACRR(,GPR03P)                              0527
*     GPR04P->ZCRID=ZCTYPE;         /* INDICATE CRR AS ZCRR          */
         MVI   ZCRID(GPR04P),X'00'                                 0528
*     GPR04P->ZCRLEN=ZCLNG;         /* SET ZCRR LENGTH               */
         MVC   ZCRLEN(2,GPR04P),@CH01920                           0529
*     GPR04P->ZCRTID=ZCRTCCBI;      /* SET THREAD ID                 */
         MVI   ZCRTID(GPR04P),X'10'                                0530
*     GPR04P->ZCRECCBI='1'B;        /* SET MODULE ENTERED            */
         OI    ZCRECCBI(GPR04P),B'00100000'                        0531
*     GPR04P->ZCRTNAME='CCBI';      /* SET THREAD NAME               */
         MVC   ZCRTNAME(4,GPR04P),@CC04495                         0532
*     GPR05P=ADDR(GPR04P->ZCRSAVEZ);/* ADDR 1ST BUFF                 */
         LA    GPR05P,ZCRSAVEZ(,GPR04P)                            0533
*     GPR06P=0;                     /* ADDRESS PREVIOUS BUFFER       */
         SLR   GPR06P,GPR06P                                       0534
*     DO GPR00P=ZCRSAVNO TO 1 BY-1; /* INITIALIZE SAVE AREAS         */
         LA    GPR00P,6                                            0535
@DL00535 DS    0H                                                  0536
*       GPR05P->ZSAZSVBC=GPR06P;    /* SET BACK POINTER              */
         ST    GPR06P,ZSAZSVBC(,GPR05P)                            0536
*       GPR05P->ZSAZSVFC=GPR05P+ZSAZSVSZ;/* SET FWRD PTR             */
         LA    @14,40                                              0537
         LR    @11,GPR05P                                          0537
         ALR   @11,@14                                             0537
         ST    @11,ZSAZSVFC(,GPR05P)                               0537
*       GPR06P=GPR05P;              /* PREV. BUFF = CURRENT BUFF     */
         LR    GPR06P,GPR05P                                       0538
*       GPR05P=GPR05P+ZSAZSVSZ;     /* POINT TO NEXT BUFF            */
         ALR   GPR05P,@14                                          0539
*     END;                          /* END SAVE AREA INITIALIZING    */
         BCTR  GPR00P,0                                            0540
         LTR   GPR00P,GPR00P                                       0540
         BP    @DL00535                                            0540
*     GPR06P->ZSAZSVFC=0;           /* SET LAST FWRD POINTER         */
         SLR   @14,@14                                             0541
         ST    @14,ZSAZSVFC(,GPR06P)                               0541
*     GPR13P=ADDR(GPR04P->ZCRSAVEZ);/* ADDRESS SAVE AREA CHAIN       */
         LA    GPR13P,ZCRSAVEZ(,GPR04P)                            0542
*     RFY                                                          0543
*      (GPR00P,                                                    0543
*       GPR01P,                                                    0543
*       GPR02P,                                                    0543
*       GPR03P,                                                    0543
*       GPR04P,                                                    0543
*       GPR05P,                                                    0543
*       GPR06P,                                                    0543
*       GPR07P,                                                    0543
*       GPR12P,                                                    0543
*       GPR13P,                                                    0543
*       GPR15P) UNRSTD;                                            0543
*   END;                            /* END TPZENTER GENERATION     0544
*                                      ESTABLISH INITIAL ENTRY     0544
*                                      REQUIREMENTS                  */
*                                                                  0544
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00A)REQUEST                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0545
*   DO;                                                            0545
*     GOTO CFBI00A;                                                0546
         B     CFBI00A                                             0546
*CFBI00A#:                                                         0547
*   END;                                                           0547
CFBI00A# DS    0H                                                  0548
*   IF ADDR(DNCZC001)->PABWEQP^=0 THEN/* DNCB TIP EMPTY?     @XM10823*/
         L     @00,PABWEQP+95(,DNCBREG)                            0548
         ICM   @00,8,@CB00214                                      0548
         LTR   @00,@00                                             0548
         BZ    @RF00548                                            0548
*     BFRREG=RPHWEA&'00FFFFFF'X;    /* PICK UP POINTER TO WORK     0549
*                                      ELEMENT ON DNCB TIP           */
         L     BFRREG,RPHWEA(,RPHREG)                              0549
         N     BFRREG,@CF04500                                     0549
*   ELSE                            /* NOT EMPTY             @XM10823*/
*     BFRREG=0;                     /* ZERO WORK ELEMENT     @XM10823*/
         B     @RC00548                                            0550
@RF00548 SLR   BFRREG,BFRREG                                       0550
*   IF BFRREG=EMPTY THEN            /* IS WORK ELEM QUEUE EMPTY?     */
@RC00548 LTR   BFRREG,BFRREG                                       0551
         BZ    @RT00551                                            0551
*     ;                             /* YES, (NULL)                   */
*   ELSE                            /* NO,                           */
*FBIDO010:                                                         0553
*     DO;                                                          0553
FBIDO010 DS    0H                                                  0554
*       IF BFRREG->FSBTYPE=FSTYPE THEN/* IS WORK ELEM FSB?           */
         CLI   FSBTYPE(BFRREG),X'02'                               0554
         BNE   @RF00554                                            0554
*FBIDO020:                                                         0555
*         DO;                       /* YES, PROCESS FEEDBACK         */
FBIDO020 DS    0H                                                  0556
*           BFRREG=BFRREG-LENGTH(ZIBAIOCM);/* ADJUST FSB PTR TO POINT
*                                      TO INBOUND BUFFER             */
         SL    BFRREG,@CF00134                                     0556
*           IF(DNCZF002=ON          /* IS DIALOG SCHED FLAG ON?      */
*               ×DNCZF008=ON)       /* OR BIND FAILURE       @XM17985*/
*               &                   /* YES,                  @ZA18462*/
*               (BDUCOMND=BCMDZ&(BDUMODIF=BMODZBHM×/* MODIFY BLK   0557
*                                      HNDLR SET OR                  */
*               BDUMODIF=BMODZSMM)) THEN/* SET DEST. MODE    @XM05945*/
         TM    DNCZF002(DNCBREG),B'00000010'                       0557
         BO    @GL00001                                            0557
         TM    DNCZF008(DNCBREG),B'00000001'                       0557
         BNO   @RF00557                                            0557
@GL00001 LA    @15,62                                              0557
         ALR   @15,BFRREG                                          0557
         CLI   BDUCOMND(@15),X'08'                                 0557
         BNE   @RF00557                                            0557
         CLI   BDUMODIF(@15),X'8D'                                 0557
         BE    @RT00557                                            0557
         CLI   BDUMODIF(@15),X'9A'                                 0557
         BNE   @RF00557                                            0557
@RT00557 DS    0H                                                  0558
*             DO;                   /* YES,                          */
*/*                                     ANALYZE DIALOG SCHED FSB     */
*                                                                  0559
*               /*****************************************************/
*               /*                                                   */
*               /* SEGMENT(CFBI00B)REQUEST                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0559
*               DO;                                                0559
*                 GOTO CFBI00B;                                    0560
         B     CFBI00B                                             0560
*CFBI00B#:                                                         0561
*               END;                                               0561
*                                                                  0561
CFBI00B# DS    0H                                                  0562
*/*                                     CHECK QUEUES AND ACTIVATE TOP*/
*                                                                  0562
*               /*****************************************************/
*               /*                                                   */
*               /* SEGMENT(CFBI00C)REQUEST                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0562
*               DO;                                                0562
*                 GOTO CFBI00C;                                    0563
         B     CFBI00C                                             0563
*CFBI00C#:                                                         0564
*               END;                                               0564
CFBI00C# DS    0H                                                  0565
*             END;                                                 0565
*           ELSE                    /* NO, (DIALOG SCHED FLAG OFF  0566
*                                                            @ZA18462*/
*             IF BDUCOMND^=BCMDI&   /* BDU CMD NOT INVITE            */
*                 BDUCOMND^=BCMDR&  /* OR READ                       */
*                 BDUCOMND^=BCMDD&  /* OR DISCONNECT         @XM05945*/
*                 BDUCOMND^=BCMDT&  /* AND NOT TEST          @XM09183*/
*                 (BDUCOMND^=BCMDZ×BDUMODIF^=BMODZEM) THEN/* RESET 0566
*                                      ERROR LOCK            @XM05945*/
*                                                                  0566
         B     @RC00557                                            0566
@RF00557 LA    @15,62                                              0566
         ALR   @15,BFRREG                                          0566
         CLI   BDUCOMND(@15),X'05'                                 0566
         BE    @RF00566                                            0566
         CLI   BDUCOMND(@15),X'01'                                 0566
         BE    @RF00566                                            0566
         CLI   BDUCOMND(@15),X'07'                                 0566
         BE    @RF00566                                            0566
         CLI   BDUCOMND(@15),X'03'                                 0566
         BE    @RF00566                                            0566
         CLI   BDUCOMND(@15),X'08'                                 0566
         BNE   @RT00566                                            0566
         CLI   BDUMODIF(@15),X'41'                                 0566
         BE    @RF00566                                            0566
@RT00566 DS    0H                                                  0567
*               /*****************************************************/
*               /*                                                   */
*               /* SEGMENT(CFBI00E)REQUEST                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0567
*               DO;                                                0567
*                 GOTO CFBI00E;                                    0568
         B     CFBI00E                                             0568
*CFBI00E#:                                                         0569
*               END;                /* YES, PROCESS CONTACT/ RESET 0569
*                                      COMPLETION                    */
*             ELSE                  /* CMD=INVITE OR READ            */
*               CALL CFBI00D;       /* PROCESS UNSOLICITED DATA      */
         B     @RC00566                                            0570
@RF00566 BAL   @14,CFBI00D                                         0570
*         END FBIDO020;                                            0571
*       ELSE                        /* NO, (WK ELEM NOT A FSB)       */
*         DO;                                                      0572
         B     @RC00554                                            0572
@RF00554 DS    0H                                                  0573
*           CALL CFBI0AI;           /* DEQUEUE RPH FROM DNCB TIP     */
         BAL   @14,CFBI0AI                                         0573
*/*                                     POST CLOSE DEST RPH          */
*/*TPPOST  (BFRREG)                                                  */
*                                                                  0574
*           DO;                     /* DECLARE AND RESTRICT REGS     */
*             RESPECIFY                                            0575
*              (GPR00F,                                            0575
*               GPR01F,                                            0575
*               GPR04F,                                            0575
*               GPR05F,                                            0575
*               GPR06F,                                            0575
*               GPR14F,                                            0575
*               GPR15F) RSTD;       /* 0,1,4,5,6,14, AND 15          */
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */
*/* END OF ATBUILD                                                   */
*                                                                  0576
*             GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);        0576
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*             GPR04F=BFRREG;        /* LOAD RPH PNTR INTO REG 4      */
         LR    GPR04F,BFRREG                                       0577
*             RFY                                                  0578
*               GPR03F RSTD;                                       0578
*             GPR03F=0;                                            0579
         SLR   GPR03F,GPR03F                                       0579
*             DO;                   /* MODESET SAVEKEY(GPR06F)     0580
*                                      KEYADDR(GPR03F)             0580
*                                      WORKREG(GPR05F)               */
*               RESPECIFY                                          0581
*                (GPR02F) RESTRICTED;                              0581
*               GPR05F=GPR02F;      /* SAVE REGISTER 2               */
         LR    GPR05F,GPR02F                                       0582
*               IPK;                /* SAVE CURRENT PSW KEY          */
         IPK                                                       0583
*               GPR06F=GPR02F;                                     0584
         LR    GPR06F,GPR02F                                       0584
*               GPR02F=GPR05F;      /* RESTORE REGISTER 2            */
         LR    GPR02F,GPR05F                                       0585
*               SPKA(GPR03F);       /* SET PSW KEY                   */
         SPKA  0(GPR03F)                                           0586
*               RESPECIFY                                          0587
*                (GPR02F) UNRESTRICTED;                            0587
*             END;                  /* MODESET SAVEKEY(GPR06F)     0588
*                                      KEYADDR(GPR03F)             0588
*                                      WORKREG(GPR05F)               */
*             RFY                                                  0589
*               GPR03F UNRSTD;                                     0589
*             GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5
*                                      WITH ADDR OF MAJOR CONTROL  0590
*                                      BLOCK PLUS OFFSET OF PAB IN 0590
*                                      BLOCK                         */
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0590
         LA    GPR05P,0(,GPR05P)                                   0590
         SLR   @11,@11                                             0590
         IC    @11,RPHPABOF(,GPR04P)                               0590
         ALR   GPR05P,@11                                          0590
*             GPR14P=0;             /* LOAD 0 INTO REG 14            */
         SLR   GPR14P,GPR14P                                       0591
*             GPR15P='FFFFFFFF'X;   /* LOAD REG 15 WITH DUMMY ADDRESS*/
         SLR   GPR15P,GPR15P                                       0592
         BCTR  GPR15P,0                                            0592
*             CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME 0593
*                                      ADDRESS WITH 0 AND,IF EQUAL,
*                                      PUT DUMMY ADDRESS IN CONTROL
*                                      BLOCK RESUME ADDRESS          */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0593
*             BC(8,FMZT0021);       /* IF EQUAL, BYPASS REMAINDER OF
*                                      EXPANSION                     */
         BC    8,FMZT0021                                          0594
*FMZL0021:                                                         0595
*             IF GPR04P->RPHWT='1'B THEN/* WT/EXT CONTENTION FLAG ON */
FMZL0021 TM    RPHWT(GPR04P),B'00001000'                           0595
         BNO   @RF00595                                            0595
*               DO;                 /* IN RPH                        */
*                 GPR14P=GPR04P->RPHRESMA×RPHWT1;/* LOAD REG 14 WITH
*                                      FLAG FIELD AND MAKE CERTAIN 0597
*                                      WT/EXT CONTENTION FLAG STILL
*                                      ON                            */
         L     GPR14P,RPHRESMA(,GPR04P)                            0597
         O     GPR14P,@CF01332                                     0597
*                 GPR15P=GPR14P×RPHPT1;/* LOAD REG 15 WITH FLAG FIELD
*                                      AND TURN POST FLAG ON         */
         LR    GPR15P,GPR14P                                       0598
         O     GPR15P,@CF01336                                     0598
*                 CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG
*                                      14 WITH FLAG FIELD--IF WT/EXT
*                                      BIT ON, TURN ON POST FLAG     */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0599
*                 BC(4,FMZL0021);   /* IF WT/EXT BIT WAS OFF, LOOP TO
*                                      TEST CONTENTION FLAG          */
         BC    4,FMZL0021                                          0600
*                 BC(8,FMZT0021);   /* IF WT/EXT BIT WAS OFF, BRANCH
*                                      TO BYPASS CODE GEN            */
         BC    8,FMZT0021                                          0601
*               END;                /* IF POST FLAG IS ON, FALL THRU
*                                      BOTTOM OF LOOP                */
*             ELSE                                                 0603
*               ;                   /* WT/EXT CONTENTION FLAG OFF    */
@RF00595 DS    0H                                                  0604
*             IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN            0604
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0604
         BNE   @RF00604                                            0604
*               DO;                                                0605
*                 GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE
*                                      ADDRESS IN SECOND WORD OF PAB */
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0606
*                 GPR01P->RPHPABQP=GPR05P;/* PUT PAB ADDRESS (IN   0607
*                                      MAJOR CONTROL BLOCK) IN PAB 0607
*                                      QUEUE ADRESS IN RPH           */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0607
*               END;                                               0608
*             ELSE                                                 0609
*               DO;                                                0609
         B     @RC00604                                            0609
@RF00604 DS    0H                                                  0610
*                 GPR00F=0;         /* SET REG 0 TO INDICATE ENA     */
         SLR   GPR00F,GPR00F                                       0610
*                 DO;               /* LISATCVT                    0611
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*                   GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0612
*                 END;              /* LISATCVT PUT POINTER TO ATCVT
*                                      IN IN REG 15                  */
*                 CALL GPR15P->ATCAP32;/* CALL ISTAPC32: TPSCHED     */
         L     @11,ATCAP32(,GPR15P)                                0614
         LR    @15,@11                                             0614
         BALR  @14,@15                                             0614
*               END;                                               0615
*FMZT0021:                                                         0616
*             DO;                   /* MODESET KEYADDR(GPR06F)     0616
*                                      WORKREG(GPR05F)               */
@RC00604 DS    0H                                                  0616
FMZT0021 DS    0H                                                  0617
*               GPR05F=GPR06F;      /* GET KEY FORM SAVE LOCATION    */
         LR    GPR05F,GPR06F                                       0617
*               SPKA(GPR05F);       /* SET PSW KEY                   */
         SPKA  0(GPR05F)                                           0618
*             END;                  /* MODESET KEYADDR(GPR06F)     0619
*                                      WORKREG(GPR05F)               */
*             GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F
*                 ,GPR06F);                                        0620
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*             RESPECIFY                                            0621
*              (GPR00F,                                            0621
*               GPR01F,                                            0621
*               GPR04F,                                            0621
*               GPR05F,                                            0621
*               GPR06F,                                            0621
*               GPR14F,                                            0621
*               GPR15F) UNRSTD;     /* UNRESTRICT REGS 0,1, 4,5,14,
*                                      AND 15                        */
*           END;                    /* ***END OF TPPOST GENERATION***
*                                      BFRREG->RPH                   */
*         END;                                                     0623
*     END FBIDO010;                                                0624
*                                                                  0624
@RC00554 DS    0H                                                  0625
*/*** START -TPUNLOCK (DNCBLOCK)- **                                 */
*                                                                  0625
*   DO;                                                            0625
*                                                                  0625
@RT00551 DS    0H                                                  0626
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */
*/* END OF ATBUILD                                                   */
*                                                                  0626
*     RFY                                                          0626
*      (GPR00P,                                                    0626
*       GPR01P,                                                    0626
*       GPR02P,                                                    0626
*       GPR03P,                                                    0626
*       GPR04P,                                                    0626
*       GPR15P) RSTD;                                              0626
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0627
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*     GPR02P=ADDR(DNCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,DNCLOCK(,DNCBREG)                            0628
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0629
*     GPR00P=CRALMS05;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,16                                           0630
*     GPR03P=ADDR(GPR04P->CRAL5PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0631
*     DO;                           /* LISATCVT                    0632
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0633
*     END;                          /* LISATCVT                      */
*     GPR15P=GPR15P->ATCAP33;                                      0635
         L     GPR15P,ATCAP33(,GPR15P)                             0635
*     DCL                                                          0636
*       FMZL0033 BASED(GPR15P) LABEL VALUERANGE(*);                0636
*     CALL FMZL0033;                                               0637
         BALR  @14,@15                                             0637
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0638
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0638
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0639
*      (GPR00P,                                                    0639
*       GPR01P,                                                    0639
*       GPR02P,                                                    0639
*       GPR03P,                                                    0639
*       GPR04P,                                                    0639
*       GPR15P) UNRSTD;                                            0639
*   END;                                                           0640
*                                                                  0640
*/*** END -TPUNLOCK (DNCBLOCK)- **                                   */
*                                                                  0641
*                                   /* RELEASE THE DNCB LOCK         */
*/* TPEXIT  NORM                                                     */
*                                                                  0641
*   DO;                                                            0641
*     RESPECIFY                                                    0642
*       GPR15P RSTD;                                               0642
*                                                                  0642
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  0643
*     DO;                           /* LISATCVT                    0643
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0644
*     END;                          /* LISATCVT                      */
*     RESPECIFY                                                    0646
*       GPR00F RSTD;                                               0646
*     GPR00F=4;                     /* SET PARAMETER REGISTER TO 4   */
         LA    GPR00F,4                                            0647
*     GPR15P=GPR15P->ATCAP31;                                      0648
         L     GPR15P,ATCAP31(,GPR15P)                             0648
*     DCL                                                          0649
*       FMZL0043 BASED(GPR15P) LABEL VALUERANGE(*);                0649
*     CALL FMZL0043;                                               0650
         BALR  @14,@15                                             0650
*     RESPECIFY                                                    0651
*      (GPR00F,                                                    0651
*       GPR15P) UNRSTD;                                            0651
*   END;                            /* **** END OF TPEXIT            */
         EJECT
*                                                                  0653
*/********************************************************************/
*/*                                                                  */
*/* CFBI00A: THIS ROUTINE INITIALIZES REGISTERS COMMON TO THIS       */
*/*          COMPONENT AND INITIALIZES THE SAVE AREA CHAIN.          */
*/*          THE DNCB LOCK IS OBTAINED EXCLUSIVE.                    */
*/*                                                                  */
*/********************************************************************/
*                                                                  0653
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00A)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0653
*   DO;                                                            0653
*     GOTO CFBI00A@;                                               0654
         B     CFBI00A@                                            0654
*CFBI00A:                                                          0655
*   END;                                                           0655
CFBI00A  DS    0H                                                  0656
*   DNCBREG=RPHMAJCB;               /* INITIALIZE DNCB POINTER       */
         L     DNCBREG,RPHMAJCB-1(,RPHREG)                         0656
         LA    DNCBREG,0(,DNCBREG)                                 0656
*/*** START -TPLOCK (DNCBLOCK)TYPE(XCLSIVE)- **                      */
*                                                                  0657
*   DO;                                                            0657
*     RFY                                                          0658
*      (GPR00P,                                                    0658
*       GPR01P,                                                    0658
*       GPR02P,                                                    0658
*       GPR03P,                                                    0658
*       GPR04P,                                                    0658
*       GPR15P) RSTD;                                              0658
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0659
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*     GPR02P=ADDR(DNCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,DNCLOCK(,DNCBREG)                            0660
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0661
*     GPR00P=CRALMS05;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,16                                           0662
*     GPR03P=ADDR(GPR04P->CRAL5PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0663
*     GPR15P=ATCLCPTR->ATCAP36;     /* ADDRESS OF LOCK ROUTINE       */
         L     @14,ATCLCPTR                                        0664
         L     GPR15P,ATCAP36(,@14)                                0664
*     DCL                                                          0665
*       FMZL0052 BASED(GPR15P) LABEL VALUERANGE(*);                0665
*     CALL FMZL0052;                                               0666
         BALR  @14,@15                                             0666
*     GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0667
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0667
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0668
*      (GPR00P,                                                    0668
*       GPR01P,                                                    0668
*       GPR02P,                                                    0668
*       GPR03P,                                                    0668
*       GPR04P,                                                    0668
*       GPR15P) UNRSTD;                                            0668
*   END;                                                           0669
*                                                                  0669
*/*** END -TPLOCK (DNCBLOCK)TYPE(XCLSIVE)- **                        */
*                                                                  0670
*                                   /* OBTAIN DNCB LOCK EXCLUSIVE    */
*   ICNCBREG=NCBNSNA;               /* GET NEXT SCHED NODE PTR       */
         L     ICNCBREG,NCBNSNA(,DNCBREG)                          0670
*   DO WHILE(ADDR(ICNCBREG->ICNCB)->NCBTYPE^=ICTYPE);/* LOCATE ACTUAL
*                                      NEXT SCHEDULEABLE NODE        */
         B     @DE00671                                            0671
@DL00671 DS    0H                                                  0672
*     ICNCBREG=ADDR(ICNCBREG->ICNCB)->NCBNSNA;                     0672
         L     ICNCBREG,NCBNSNA(,ICNCBREG)                         0672
*   END;                                                           0673
*                                                                  0673
@DE00671 CLI   NCBTYPE(ICNCBREG),X'06'                             0673
         BNE   @DL00671                                            0673
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00A)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0674
*   DO;                                                            0674
*     GOTO CFBI00A#;                                               0675
         B     CFBI00A#                                            0675
*CFBI00A@:                                                         0676
*   END;                                                           0676
CFBI00A@ DS    0H                                                  0677
         EJECT
*                                                                  0677
*/********************************************************************/
*/*                                                                  */
*/* CFBI00B: THIS ROUTINE ANALYZES THE DIALOG SCHEDULER FSB.         */
*/*      CFBI0AI IS CALLED TO DEQUEUE A FSB FROM THE DNCB TIP AND    */
*/*      THE FMCB PTR IS SET FROM THE DNCB DIALOG SCHEDULING FMCB    */
*/*      POINTER.                                                    */
*/*        IF DNCB DATA PURGE IS INDICATED, THE CURRENT BUFFERS ARE  */
*/*      DEALLOCATED AND THE ROUTINE EXITS TO THE CALLER.            */
*/*      OTHERWISE:                                                  */
*/*        IF I/O COMPLETION IS NORMAL, THE DNCB BHSET AND MODE      */
*/*      FIELDS ARE SET FROM THE FMCB( VALUES GIVEN BY THE CURRENT   */
*/*      APPLICATION). THE BUFFERS ARE RELEASED AND THE ROUTINE IS   */
*/*      FINISHED.                                                   */
*/*        IF NORMAL I/O COMPLETION IS NOT MADE, THE FOLLOWING ARE   */
*/*      DONE:                                                       */
*/*      (1) THE ADDRESS OF THE LCPB ASSOCIATED WITH THE ERROR IS    */
*/*          OBTAINED FROM THE ASYNCH WAITQ(FOR 3270 RECORD DEVICES) */
*/*          OR THE FMCB TOP(FOR OTHER DEVICES).                     */
*/*      (2) LCPB IS MARKED FOR LOGICAL ERROR AND THE APPROPRIATE    */
*/*          MINOR RETURN CODE IS DETERMINED AND SET IN THE LCPB.    */
*/*      (3) DNCB IS MARKED FOR LOGICAL ERROR.                       */
*/*      (4) THE CURRENT BUFFERS ARE DEALLOCATED.                    */
*/*                                                                  */
*/********************************************************************/
*                                                                  0677
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00B)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0677
*   DO;                                                            0677
*     GOTO CFBI00B@;                                               0678
         B     CFBI00B@                                            0678
*CFBI00B:                                                          0679
*   END;                                                           0679
CFBI00B  DS    0H                                                  0680
*   CALL CFBI0AI;                   /* DEQUEUE FSB FROM DNCB TIP     */
         BAL   @14,CFBI0AI                                         0680
*   FMCBREG=DNCZV002;               /* PICK UP POINTER TO DIALOG   0681
*                                      SCHEDULER FMCB                */
         L     FMCBREG,DNCZV002-1(,DNCBREG)                        0681
         LA    FMCBREG,0(,FMCBREG)                                 0681
*   IF DNCZF008=ON THEN             /* DNCB DATA PURGE ON?           */
         TM    DNCZF008(DNCBREG),B'00000001'                       0682
         BNO   @RF00682                                            0682
*     CALL CFBI0AH;                 /* YES DEALLOCATE BUFFERS        */
         BAL   @14,CFBI0AH                                         0683
*   ELSE                            /* NO DNCB PURGE                 */
*     IF FSBMJRCD=FRNORM THEN       /* NORMAL COMPLETION OF I/O?     */
         B     @RC00682                                            0684
@RF00682 CLI   FSBMJRCD+16(BFRREG),X'00'                           0684
         BNE   @RF00684                                            0684
*       DO;                         /* YES                           */
*         IF BDUMODIF=BMODZSMM THEN /* IF SET MODE UPDATE            */
         CLI   BDUMODIF+62(BFRREG),X'9A'                           0686
         BNE   @RF00686                                            0686
*           DNCMODE=PROPROC(9:32);  /* PROC MODE IN DNCB     @XM10465*/
         MVC   DNCMODE(3,DNCBREG),PROPROC+49(FMCBREG)              0687
*         ELSE                      /*                       @XM10465*/
*           DNCBHSET=FMCBHSET;      /* UPDATE BH SET IN DNCB         */
         B     @RC00686                                            0688
@RF00686 IC    @00,FMCBHSET(,FMCBREG)                              0688
         STC   @00,DNCBHSET(,DNCBREG)                              0688
*         CALL CFBI0AH;             /* DEALLOCATE BUFFERS            */
@RC00686 BAL   @14,CFBI0AH                                         0689
*       END;                                                       0690
*     ELSE                          /* NOT NORMAL I/O COMPLETION     */
*FBIDO070:                                                         0691
*       DO;                                                        0691
         B     @RC00684                                            0691
@RF00684 DS    0H                                                  0691
FBIDO070 DS    0H                                                  0692
*         ZCRDAFSV=FSBSAF;          /* SAVE SAF FROM BUF     @XM10465*/
         L     @15,RPHCRR(,RPHREG)                                 0692
         L     @15,CRACRR(,@15)                                    0692
         LA    @14,16                                              0692
         ALR   @14,BFRREG                                          0692
         MVC   ZCRDAFSV(2,@15),FSBSAF(@14)                         0692
*         ZCRSAFSV=FSBDAF;          /* SAVE DAF FROM BUF     @XM10465*/
         MVC   ZCRSAFSV(2,@15),FSBDAF(@14)                         0693
*         IF FMCMODE=FMCRCD THEN    /* FMCB IN RECORD MODE?          */
         CLC   FMCMODE(8,FMCBREG),@CC03431                         0694
         BNE   @RF00694                                            0694
*/* TPFEL (,FMCLCPAQ) RETPTR(ELEMREG)                                */
*                                                                  0695
*           DO;                     /* BEGIN TPFEL CODE GENERATION   */
*             DCL                                                  0696
*               FMZCA059 BIT(32) CONSTANT('80000000'X);            0696
*             DCL                                                  0697
*               FMZCB059 BIT(32) CONSTANT('7FFFFFFF'X);            0697
*             RFY                                                  0698
*              (GPR00P,                                            0698
*               GPR01P,                                            0698
*               GPR14P,                                            0698
*               GPR15P) RSTD;                                      0698
*             RFY                                                  0699
*               ISTWKE;                                            0699
*             GPR15P=ADDR(FMCLCPAQ);/* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPAQ(,FMCBREG)                           0700
*             GPR14P=GPR15P->PABWEQA×FMZCA059;                     0701
         L     @11,@CF02185                                        0701
         L     GPR14P,PABWEQA(,GPR15P)                             0701
         OR    GPR14P,@11                                          0701
*             IF GPR14P=FMZCA059 THEN                              0702
         CLR   GPR14P,@11                                          0702
         BE    @RT00702                                            0702
*               ;                                                  0703
*             ELSE                                                 0704
*               DO;                                                0704
*                 GPR00P=FMZCA059;  /* INITIALIZE QUIT FLAG          */
         L     GPR00P,@CF02185                                     0705
*                 DO WHILE(GPR00P^=GPR14P->WKECHAIN);              0706
         B     @DE00706                                            0706
@DL00706 DS    0H                                                  0707
*                   GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF   0707
*                                      CHAIN                         */
         L     GPR14P,WKECHAIN(,GPR14P)                            0707
*                 END;                                             0708
@DE00706 C     GPR00P,WKECHAIN(,GPR14P)                            0708
         BNE   @DL00706                                            0708
*               END;                                               0709
*             GPR14P=GPR14P&FMZCB059;                              0710
@RT00702 N     GPR14P,@CF02280                                     0710
*             ELEMREG=GPR14P;                                      0711
         LR    ELEMREG,GPR14P                                      0711
*             RFY                                                  0712
*              (GPR00P,                                            0712
*               GPR01P,                                            0712
*               GPR14P,                                            0712
*               GPR15P) UNRSTD;                                    0712
*           END;                    /* END TPFEL GENERATION GET    0713
*                                      OLDEST LCPB ADDR FROM FMCB  0713
*                                      ATOP                          */
*         ELSE                      /* NOT FMCB IN RECORD MODE       */
*/*                                     GET ADDRESS OF OLDEST LCPB   */
*/*                                         ON TPIOS OUTBOUND PAB    */
*/* TPFEL (,FMCPAB3) RETPTR(ELEMREG)RESET(YES)                       */
*                                                                  0714
*           DO;                     /* BEGIN TPFEL CODE GENERATION   */
         B     @RC00694                                            0714
@RF00694 DS    0H                                                  0715
*             RFY                                                  0715
*              (GPR00P,                                            0715
*               GPR01P,                                            0715
*               GPR14P,                                            0715
*               GPR15P) RSTD;                                      0715
*             GPR15P=ADDR(FMCPAB3); /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB3(,FMCBREG)                            0716
*             GPR14P=GPR15P->PABWEQA×PABWEQG1;                     0717
         L     @11,@CF02185                                        0717
         L     GPR14P,PABWEQA(,GPR15P)                             0717
         OR    GPR14P,@11                                          0717
*             IF GPR14P=PABWEQG1 THEN                              0718
         CLR   GPR14P,@11                                          0718
         BE    @RT00718                                            0718
*               ;                                                  0719
*             ELSE                                                 0720
*               DO;                                                0720
*FMZL1063:                                                         0721
*                 ;                                                0721
FMZL1063 DS    0H                                                  0722
*                 DO WHILE GPR14P->WKECHAIN^=PABWEQG1;             0722
         B     @DE00722                                            0722
@DL00722 DS    0H                                                  0723
*                   GPR14P=GPR14P->WKECHAIN;                       0723
         L     GPR14P,WKECHAIN(,GPR14P)                            0723
*                 END;                                             0724
@DE00722 L     @11,@CF02185                                        0724
         CL    @11,WKECHAIN(,GPR14P)                               0724
         BNE   @DL00722                                            0724
*                 IF GPR14P->LCPRESET='1'B&(GPR14P->LCPRSTQH×PABWEQG1)
*                     ^=PABWEQG1 THEN                              0725
         TM    LCPRESET(GPR14P),B'10000000'                        0725
         BNO   @RF00725                                            0725
         L     @10,LCPRSTQH(,GPR14P)                               0725
         OR    @10,@11                                             0725
         CLR   @10,@11                                             0725
         BE    @RF00725                                            0725
*                   DO;                                            0726
*                     GPR14P=GPR14P->LCPRSTQH×PABWEQG1;            0727
         LR    GPR14P,@10                                          0727
*                     GOTO FMZL1063;                               0728
         B     FMZL1063                                            0728
*                   END;                                           0729
*                 ELSE                                             0730
*                   ;                                              0730
@RF00725 DS    0H                                                  0731
*               END;                                               0731
*             GPR14P=GPR14P&FMZCB059;                              0732
@RT00718 N     GPR14P,@CF02280                                     0732
*             ELEMREG=GPR14P;                                      0733
         LR    ELEMREG,GPR14P                                      0733
*             RFY                                                  0734
*              (GPR00P,                                            0734
*               GPR01P,                                            0734
*               GPR14P,                                            0734
*               GPR15P) UNRSTD;                                    0734
*           END;                    /* END TPFEL GENERATION  @XM02347*/
*         LCPZRT00=ON;              /* SET ON LOGICAL ERROR FLAG     */
@RC00694 OI    LCPZRT00(ELEMREG),B'10000000'                       0736
*         IF BDUMODIF=BMODZBHM THEN /* IS COMMAND BH SET?            */
         CLI   BDUMODIF+62(BFRREG),X'8D'                           0737
         BNE   @RF00737                                            0737
*           LCPMNRCD=FRMBHNDG;      /* YES, SET MINOR RC: INVALID BH
*                                      SET                           */
         MVI   LCPMNRCD(ELEMREG),X'B6'                             0738
*         ELSE                      /* CMD NOT BH SET                */
*           IF BDUMODIF=BMODZSMM THEN/* IS COMMAND SET MODE?         */
         B     @RC00737                                            0739
@RF00737 CLI   BDUMODIF+62(BFRREG),X'9A'                           0739
         BNE   @RF00739                                            0739
*             LCPMNRCD=FRMMDNDG;    /* YES, SET MINOR RC: INVALID  0740
*                                      MODE                          */
         MVI   LCPMNRCD(ELEMREG),X'B7'                             0740
*           ELSE                    /* NOT SET MODE CMD              */
*             LCPMNRCD=FRMERNR;     /* SET MINOR RC: EXPECTED      0741
*                                      RESPONSE NOT RECEIVED         */
         B     @RC00739                                            0741
@RF00739 MVI   LCPMNRCD(ELEMREG),X'AF'                             0741
*         DNCZF003=ON;              /* SET ON DNCB LOGICAL ERROR     */
@RC00739 DS    0H                                                  0742
@RC00737 OI    DNCZF003(DNCBREG),B'00000001'                       0742
*         CALL CFBI0AH;             /* DEALLOCATE BUFFERS            */
         BAL   @14,CFBI0AH                                         0743
*       END FBIDO070;                                              0744
*                                                                  0744
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00B)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0745
*   DO;                                                            0745
@RC00684 DS    0H                                                  0745
@RC00682 DS    0H                                                  0746
*     GOTO CFBI00B#;                                               0746
         B     CFBI00B#                                            0746
*CFBI00B@:                                                         0747
*   END;                                                           0747
CFBI00B@ DS    0H                                                  0748
         EJECT
*                                                                  0748
*/********************************************************************/
*/*                                                                  */
*/* CFBI00C: THIS ROUTINE DISCARDS LSCBS USED FOR MODESET AND BHSET  */
*/*      AND ACTIVATES THE FMCB TOP OR ATOP IF THE WAITQ IS EMPTY    */
*/*      (I.E. MODESET AND BH SET ARE ALL DONE).                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0748
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00C)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0748
*   DO;                                                            0748
*     GOTO CFBI00C@;                                               0749
         B     CFBI00C@                                            0749
*CFBI00C:                                                          0750
*   END;                                                           0750
*                                                                  0750
CFBI00C  DS    0H                                                  0751
*/*                                     REMOVE OLDEST ELEMENT FROM   */
*/*                                         FMCB WAITQ               */
*/* TPDEQ (,FMCLCPBQ) RETPTR(ELEMREG)                                */
*                                                                  0751
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          0752
*      (GPR00P,                                                    0752
*       GPR01P,                                                    0752
*       GPR14P,                                                    0752
*       GPR15P) RSTD;                                              0752
*     GPR15P=ADDR(FMCLCPBQ);        /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0753
*     GPR14P=GPR15P->PABWEQA×FMZCA059;                             0754
         L     @11,@CF02185                                        0754
         L     GPR14P,PABWEQA(,GPR15P)                             0754
         OR    GPR14P,@11                                          0754
*     IF GPR14P=FMZCA059 THEN                                      0755
         CLR   GPR14P,@11                                          0755
         BE    @RT00755                                            0755
*       ;                                                          0756
*     ELSE                                                         0757
*       DO;                                                        0757
*FMZL1070:                                                         0758
*         ;                                                        0758
FMZL1070 DS    0H                                                  0759
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA059);                    0759
         B     @DE00759                                            0759
@DL00759 DS    0H                                                  0760
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0760
         LA    GPR15P,WKECHAIN(,GPR14P)                            0760
*           GPR14P=GPR15P->PABWEQA;                                0761
         L     GPR14P,PABWEQA(,GPR15P)                             0761
*         END;                                                     0762
@DE00759 L     @11,@CF02185                                        0762
         CL    @11,WKECHAIN(,GPR14P)                               0762
         BNE   @DL00759                                            0762
*         GPR00P=FMZCA059;                                         0763
         LR    GPR00P,@11                                          0763
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0764
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0764
*         BC(7,FMZL1070);                                          0765
         BC    7,FMZL1070                                          0765
*         GPR14P->WKECHAIN=0;                                      0766
         SLR   @11,@11                                             0766
         ST    @11,WKECHAIN(,GPR14P)                               0766
*       END;                                                       0767
*ISTA0070:                                                         0768
*     ;                                                            0768
@RT00755 DS    0H                                                  0768
ISTA0070 DS    0H                                                  0769
*     GPR14P=GPR14P&FMZCB059;                                      0769
         N     GPR14P,@CF02280                                     0769
*     ELEMREG=GPR14P;                                              0770
         LR    ELEMREG,GPR14P                                      0770
*     RFY                                                          0771
*      (GPR00P,                                                    0771
*       GPR01P,                                                    0771
*       GPR14P,                                                    0771
*       GPR15P) UNRSTD;                                            0771
*   END;                            /* END TPDEQ GENERATION          */
*   IF ELEMREG^=0 THEN              /* ANYTHING ON Q ?       @ZA15142*/
         LTR   ELEMREG,ELEMREG                                     0773
         BZ    @RF00773                                            0773
*     DO;                           /* YES                   @ZA15142*/
*       ZCRPCOD1='00'X;             /* CLEAR LSCB DEALLOC FLAGS      */
         L     @15,RPHCRR(,RPHREG)                                 0775
         L     @15,CRACRR(,@15)                                    0775
         MVI   ZCRPCOD1(@15),X'00'                                 0775
*       ZCRPLSCB=ON;                /* SET PARM FLAG:DEALLOC LSCB    */
         OI    ZCRPLSCB(@15),B'00001000'                           0776
*       CALL ZPSZDFB0;              /* CALL LSCB DEALLOCATION        */
         L     @14,ATCZPSVT(,VTCVTREG)                             0777
         L     @15,ZPSZDFB0(,@14)                                  0777
         BALR  @14,@15                                             0777
*     END;                          /*                       @ZA15142*/
*   ELSE                                                           0779
*     ;                             /*                       @ZA15142*/
@RF00773 DS    0H                                                  0780
*   IF FMCLCPB2=0                   /* WAITQ EMPTY?          @ZA18462*/
*     THEN                                                         0780
         L     @00,FMCLCPB2-1(,FMCBREG)                            0780
         ICM   @00,8,@CB00214                                      0780
         LTR   @00,@00                                             0780
         BNZ   @RF00780                                            0780
*     FMCZF002='0'B;                /* TURN OFF SCHED. SUSPD.@ZA18462*/
         NI    FMCZF002(FMCBREG),B'10111111'                       0781
*   ELSE                                                           0782
*     ;                             /*                       @ZA18462*/
@RF00780 DS    0H                                                  0783
*   IF(FMCLCPBQ&PABWEQG0)=EMPTY×    /* IS FMCB WAITQ EMPTY?  @ZA18462*/
*       (FMCZF023='1'B&             /*                       @ZA18462*/
*       (FMCLCPBQ->LSCCHAIN&PABWEQG0)=0)/*                   @ZA18462*/
*     THEN                          /*                       @ZA18462*/
         SLR   @15,@15                                             0783
         L     @14,@CF02280                                        0783
         L     @11,FMCLCPBQ(,FMCBREG)                              0783
         LR    @00,@11                                             0783
         NR    @00,@14                                             0783
         CR    @00,@15                                             0783
         BE    @RT00783                                            0783
         TM    FMCZF023(FMCBREG),B'00000100'                       0783
         BNO   @RF00783                                            0783
         N     @14,LSCCHAIN(,@11)                                  0783
         CR    @14,@15                                             0783
         BNE   @RF00783                                            0783
@RT00783 DS    0H                                                  0784
*FBIDO080:                                                         0784
*     DO;                           /* YES                           */
FBIDO080 DS    0H                                                  0785
*       DNCZV002=EMPTY;             /* NULLIFY DIALOG SCHEDULER FMCB
*                                      POINTER                       */
*                                                                  0785
         SLR   @00,@00                                             0785
         STCM  @00,7,DNCZV002(DNCBREG)                             0785
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(CFBI0AF)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0786
*       DO;                                                        0786
*         GOTO CFBI0AF;                                            0787
         B     CFBI0AF                                             0787
*CFBI0AF#:                                                         0788
*       END;                        /* ACTIVATE TOP                  */
CFBI0AF# DS    0H                                                  0789
*       IF DNCZF008=ON THEN         /* DNCB DATA PURGE ON?           */
         TM    DNCZF008(DNCBREG),B'00000001'                       0789
         BNO   @RF00789                                            0789
*         DO;                                                      0790
*           DNCZF008=OFF;           /* SET OFF DNCB DATA PURGE       */
         NI    DNCZF008(DNCBREG),B'11111110'                       0791
*           DNCZF002=OFF;           /* SET OFF DIALOG SCHED SW       */
         NI    DNCZF002(DNCBREG),B'11111101'                       0792
*         END;                                                     0793
*       ELSE                                                       0794
*         ;                         /* NO DNCB DATA PURGE            */
@RF00789 DS    0H                                                  0795
*       IF FMCMODE=FMCRCD THEN      /* FMCB RECORD MODE?     @XM07170*/
         CLC   FMCMODE(8,FMCBREG),@CC03431                         0795
         BE    @RT00795                                            0795
*         ;                         /* YES, (NULL)           @XM07170*/
*       ELSE                        /* NO                    @XM07170*/
*         DNCZF002=OFF;             /* SET OFF DNCB DIALOG SCHEDULE
*                                      FLAG                  @XM07170*/
         NI    DNCZF002(DNCBREG),B'11111101'                       0797
*       IF DNCZF003=ON THEN         /* WAS DNCB LOGICAL ERROR SET    */
@RT00795 TM    DNCZF003(DNCBREG),B'00000001'                       0798
         BO    @RT00798                                            0798
*         ;                         /* YES , (NULL)                  */
*       ELSE                        /* NO, (DNCB LOG ERR NOT SET)    */
*         DO;                                                      0800
*           FMCBREG=NCBFMCBA;       /* LOCATE MOST RECENTLY OPENED 0801
*                                      FMCB                          */
         L     FMCBREG,NCBFMCBA(,DNCBREG)                          0801
*           IF FMCZF010=ON THEN     /* RESET IN PROGRESS?            */
         TM    FMCZF010(FMCBREG),B'10000000'                       0802
         BNO   @RF00802                                            0802
*/* TPSCHED (ADDR(FMCPAB3)) IMMED                                    */
*                                                                  0803
*             DO;                                                  0803
*               RFY                                                0804
*                (GPR00P,                                          0804
*                 GPR01P,                                          0804
*                 GPR05P) RSTD;                                    0804
*               GEN REFS(GPR01P) SETS(RPHWORK)                     0805
*                   (STM   GPR02P,GPR08P,RPHWORK(GPR01P));         0805
         STM   GPR02P,GPR08P,RPHWORK(GPR01P)
*               GPR00P=0;                                          0806
         SLR   GPR00P,GPR00P                                       0806
*               GPR05P=ADDR(FMCPAB3);                              0807
         LA    @15,FMCPAB3(,FMCBREG)                               0807
         LR    GPR05P,@15                                          0807
*               CALL ATCLCPTR->ATCAP38->ISTAPC38;                  0808
         L     @14,ATCLCPTR                                        0808
         L     @15,ATCAP38(,@14)                                   0808
         BALR  @14,@15                                             0808
*               GEN(NOPR 4)                                        0809
*               NOSETS NOREFS;                                     0809
         NOPR 4
*               RFY                                                0810
*                (GPR00P,                                          0810
*                 GPR01P,                                          0810
*                 GPR05P) UNRSTD;                                  0810
*             END;                  /* **** END TPSCHED YES, SCHEDULE
*                                      FMCB TOP IMMEDIATELY          */
*           ELSE                                                   0812
*             ;                     /* NO RESET IN PROG (NULL)       */
@RF00802 DS    0H                                                  0813
*         END;                                                     0813
*     END FBIDO080;                                                0814
*   ELSE                                                           0815
*     ;                             /*                       @ZA18462*/
@RF00783 DS    0H                                                  0816
*   IF DNCZF003=ON THEN             /* IF LOGICAL ERROR      @XM10465*/
@RC00783 TM    DNCZF003(DNCBREG),B'00000001'                       0816
         BNO   @RF00816                                            0816
*     DO;                                                          0817
*       ZCRRELK=ON;                 /* SET RESET ERR LCK     @XM10465*/
         L     @15,RPHCRR(,RPHREG)                                 0818
         L     @15,CRACRR(,@15)                                    0818
         OI    ZCRRELK(@15),B'00100000'                            0818
*       RFY                                                        0819
*         WKREGA RSTD;                                             0819
*       WKREGA=ZCRCIDSV;            /* SET CID FOR CALL      @XM10465*/
         L     WKREGA,ZCRCIDSV(,@15)                               0820
*       BFRREG=0;                   /* NO BUFFER             @XM10465*/
         SLR   BFRREG,BFRREG                                       0821
*       ELEMREG=0;                  /* NO LCPB               @XM10465*/
         SLR   ELEMREG,ELEMREG                                     0822
*       CALL ISTZBFOB;              /* SCHED RESET           @XM10465*/
         L     @14,ATCZPSVT(,VTCVTREG)                             0823
         L     @15,ZPSZBFOB(,@14)                                  0823
         BALR  @14,@15                                             0823
*       RFY                                                        0824
*         WKREGA UNRSTD;                                           0824
*     END;                          /*                       @XM10465*/
*   ELSE                                                           0826
*     ;                             /* NOT LOG ERROR         @XM10465*/
*                                                                  0826
@RF00816 DS    0H                                                  0827
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00C)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0827
*   DO;                                                            0827
*     GOTO CFBI00C#;                                               0828
         B     CFBI00C#                                            0828
*CFBI00C@:                                                         0829
*   END;                                                           0829
         EJECT
*                                                                  0830
*/********************************************************************/
*/*                                                                  */
*/* CFBI00D: THIS ROUTINE PROCESS UNSOLICITED DATA.                  */
*/*        THE ROUTINE OBTAINS THE DAF LOCK. AND HAS IT RELEASED     */
*/*        BEFORE EXITING.                                           */
*/*        THE DISCONNECT SCHEDULER IS CALLED AND AN OPERATOR        */
*/*        MESSAGE IS PRODUCED UNLESS AN FMCB IN RECORD MODE WITH    */
*/*        DATA TRAFFIC NOT INHIBITED EXISTS OR AN FMCB NOT IN       */
*/*        MODE BUT WITH INVITE PENDING EXISTS. IN THESE CASES,      */
*/*        DIALOG IS ENTERED.                                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0830
*CFBI00D:                                                          0830
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0830
         B     @PB00002                                            0830
CFBI00D  DS    0H                                                  0831
*   RFY                                                            0831
*     LNKREG RSTD;                                                 0831
*   ZCRSVF6=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 0832
         L     @15,CRACRR(,@15)                                    0832
         ST    LNKREG,ZCRSVF6(,@15)                                0832
*   RFY                                                            0833
*     LNKREG UNRSTD;                                               0833
*   CALL CFBI0AD;                   /* OBTAIN DAF LOCK               */
         BAL   @14,CFBI0AD                                         0834
*   FMCBREG=NCBFMCBA&NOGATE;        /* GET ADDR OF MOST RECENTLY   0835
*                                      OPENED FMCB, IF ANY           */
         L     FMCBREG,NCBFMCBA(,DNCBREG)                          0835
         N     FMCBREG,@CF02280                                    0835
*   IF FMCBREG^=EMPTY THEN          /* DOES AN FMCB EXIST?           */
         LTR   FMCBREG,FMCBREG                                     0836
         BZ    @RF00836                                            0836
*     IF FMCMODE=FMCRCD THEN        /* YES, IS IT RECORD MODE?       */
         CLC   FMCMODE(8,FMCBREG),@CC03431                         0837
         BNE   @RF00837                                            0837
*       IF ADDR(FMCPAB3)->PABINHBT=OFF/* YES, IS TRAFFIC             */
*           &BDUCOMND=BCMDI THEN    /* ALLOWED, AND IS THIS AN INVITE
*                                      COMMAND               @ZA15112*/
         TM    PABINHBT+96(FMCBREG),B'00000010'                    0838
         BNZ   @RF00838                                            0838
         CLI   BDUCOMND+62(BFRREG),X'05'                           0838
         BNE   @RF00838                                            0838
*         DO;                       /* YES                           */
*           CALL CFBIECA;           /* ESTABLISH SESSION             */
         BAL   @14,CFBIECA                                         0840
*           CALL CFBI0AE;           /* RELEASE DAF LOCK              */
         BAL   @14,CFBI0AE                                         0841
*         END;                                                     0842
*       ELSE                        /* DATA TRAFFIC INHIBITED        */
*         DO;                                                      0843
         B     @RC00838                                            0843
@RF00838 DS    0H                                                  0844
*           CALL CFBI0AE;           /* RELEASE DAF LOCK              */
         BAL   @14,CFBI0AE                                         0844
*           CALL CFBI0DA;           /* ISSUE OPERATOR MESSAGE        */
         BAL   @14,CFBI0DA                                         0845
*         END;                                                     0846
*     ELSE                          /* FMCB NOT IN RECORD MODE       */
*       IF FMCZFB06=ON              /* INVITE PENDING?               */
*           &BDUCOMND=BCMDI THEN    /*                       @ZA15112*/
         B     @RC00837                                            0847
@RF00837 TM    FMCZFB06(FMCBREG),B'00000010'                       0847
         BNO   @RF00847                                            0847
         CLI   BDUCOMND+62(BFRREG),X'05'                           0847
         BNE   @RF00847                                            0847
*         DO;                       /* YES                           */
*           CALL CFBIECA;           /* ESTABLISH SESSION             */
         BAL   @14,CFBIECA                                         0849
*           CALL CFBI0AE;           /* RELEASE DAF LOCK              */
         BAL   @14,CFBI0AE                                         0850
*         END;                                                     0851
*       ELSE                        /* INVITE NOT PENDING            */
*         DO;                                                      0852
         B     @RC00847                                            0852
@RF00847 DS    0H                                                  0853
*           IF FMCZFC06=ON THEN     /* IS CONTACT OUTSTANDNG @ZA13701*/
         TM    FMCZFC06(FMCBREG),B'00000001'                       0853
         BNO   @RF00853                                            0853
*             BDUCOMND=BCMDR;       /* NO DISCONNECT NEEDED  @ZA13701*/
         MVI   BDUCOMND+62(BFRREG),X'01'                           0854
*           ELSE                                                   0855
*             ;                     /*                       @ZA13701*/
@RF00853 DS    0H                                                  0856
*           CALL CFBI0AE;           /* RELEASE DAF LOCK              */
         BAL   @14,CFBI0AE                                         0856
*           CALL CFBI0DA;           /* ISSUE OPERATOR MESSAGE        */
         BAL   @14,CFBI0DA                                         0857
*         END;                                                     0858
*   ELSE                            /* NO FMCB TO BE USED            */
*     DO;                                                          0859
         B     @RC00836                                            0859
@RF00836 DS    0H                                                  0860
*       CALL CFBI0AE;               /* RELEASE DAF LOCK              */
         BAL   @14,CFBI0AE                                         0860
*       CALL CFBI0DA;               /* ISSUE OPERATOR MESSAGE        */
         BAL   @14,CFBI0DA                                         0861
*     END;                                                         0862
*   RFY                                                            0863
*     LNKREG RSTD;                                                 0863
@RC00836 DS    0H                                                  0864
*   LNKREG=ZCRSVF6;                 /* RESTORE RETURN ADDRESS        */
         L     @15,RPHCRR(,RPHREG)                                 0864
         L     @15,CRACRR(,@15)                                    0864
         L     LNKREG,ZCRSVF6(,@15)                                0864
*   RFY                                                            0865
*     LNKREG UNRSTD;                                               0865
*   END CFBI00D;                                                   0866
@EL00002 DS    0H                                                  0866
@EF00002 DS    0H                                                  0866
@ER00002 BR    @14                                                 0866
         EJECT
*                                                                  0867
*/********************************************************************/
*/*                                                                  */
*/* CFBI0DA: THIS ROUTINE ISSUES AN OPERATOR MESSAGE FOR UNSOLICITED */
*/*        DATA, QUEUES THE FSB WITH THIS MESSAGE ID ONTO THE MSG    */
*/*        WRITER PAB, OR RELEASES CURRENT BUFFERS.                  */
*/* FUNCTION: IF FEEDBACK REPRESENTS A BSC STATUS MESSAGE FOR NO     */
*/*        ERROR, THE BUFFERS ARE MERELY RELEASED.                   */
*/*          OTHERWISE, THE MESSAGE FORMATTER (ISTZDFNB) IS CALLED   */
*/*        IF THE FSB IS MARKED IN ERROR. THE MESSAGE ID FOR         */
*/*        UNSOLICITED DATA IS PLACED IN THE FSB AND THE FSB IS      */
*/*        QUEUED ON THE MSG WRITER PAB.                             */
*/*                                                                  */
*/********************************************************************/
*                                                                  0867
*CFBI0DA:                                                          0867
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0867
CFBI0DA  DS    0H                                                  0868
*   RFY                                                            0868
*     LNKREG RSTD;                                                 0868
*   ZCRSVF8=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 0869
         L     @15,CRACRR(,@15)                                    0869
         ST    LNKREG,ZCRSVF8(,@15)                                0869
*   RFY                                                            0870
*     LNKREG UNRSTD;                                               0870
*   CALL CFBI0AI;                   /* DEQUEUE FSB FROM DNCB TIP     */
         BAL   @14,CFBI0AI                                         0871
*   IF(BDUCOMND=BCMDZ&BDUMODIF=BMODZEM)×/* FDBK FOR RESET ERR LOCK   */
*       (BDUCOMND=BCMDD&BDUMODIF=BMODW) THEN/* OR DISOCNNECT @XM05945*/
         LA    @15,62                                              0872
         ALR   @15,BFRREG                                          0872
         CLI   BDUCOMND(@15),X'08'                                 0872
         BNE   @GL00015                                            0872
         CLI   BDUMODIF(@15),X'41'                                 0872
         BE    @RT00872                                            0872
@GL00015 LA    @15,62                                              0872
         ALR   @15,BFRREG                                          0872
         CLI   BDUCOMND(@15),X'07'                                 0872
         BNE   @RF00872                                            0872
         CLI   BDUMODIF(@15),X'00'                                 0872
         BNE   @RF00872                                            0872
@RT00872 DS    0H                                                  0873
*     CALL CFBI0AH;                 /* DEALLOCATE BUFFERS            */
         BAL   @14,CFBI0AH                                         0873
*   ELSE                                                           0874
*     DO;                           /*                       @XM05945*/
         B     @RC00872                                            0874
@RF00872 DS    0H                                                  0875
*       IF FSBMJRCD=FRNETP&         /* NETWORK PROC.         @XM06437*/
*           FSBMNRCD=FRMNPDES THEN  /* DEVICE-END STATUS     @XM06437*/
         LA    @15,16                                              0875
         ALR   @15,BFRREG                                          0875
         CLI   FSBMJRCD(@15),X'80'                                 0875
         BNE   @RF00875                                            0875
         CLI   FSBMNRCD(@15),X'08'                                 0875
         BNE   @RF00875                                            0875
*         IF BDUCOMND=BCMDI THEN    /* INVITE COMND          @XM10465*/
         CLI   BDUCOMND+62(BFRREG),X'05'                           0876
         BNE   @RF00876                                            0876
*           DO;                     /*                       @XM09791*/
*             ZCRDAFSV=FSBSAF;      /*                       @XM09809*/
         L     @14,RPHCRR(,RPHREG)                                 0878
         L     @14,CRACRR(,@14)                                    0878
         MVC   ZCRDAFSV(2,@14),FSBSAF(@15)                         0878
*             ZCRSAFSV=FSBDAF;      /*                       @XM09809*/
         MVC   ZCRSAFSV(2,@14),FSBDAF(@15)                         0879
*             RFY                                                  0880
*               WKREGA RSTD;                                       0880
*             WKREGA=ZCRCIDSV;      /*                       @XM09809*/
         L     WKREGA,ZCRCIDSV(,@14)                               0881
*             CALL ZPSZBFOB;        /* DISCONNECT SCHEDR.@XM05945    */
         L     @14,ATCZPSVT(,VTCVTREG)                             0882
         L     @15,ZPSZBFOB(,@14)                                  0882
         BALR  @14,@15                                             0882
*             RFY                                                  0883
*               WKREGA UNRSTD;                                     0883
*           END;                    /*                       @XM09791*/
*         ELSE                                                     0885
*           CALL CFBI0AH;           /* DEALLOCATE BUFFS      @XM10465*/
         B     @RC00876                                            0885
@RF00876 BAL   @14,CFBI0AH                                         0885
*       ELSE                        /* NO, (NOT BSC STATUS MSG FOR NO
*                                      ERROR)                        */
*         DO;                                                      0886
         B     @RC00875                                            0886
@RF00875 DS    0H                                                  0887
*           IF FSBMNELI=ON THEN     /* IS ERROR CONDITION SET?       */
         LA    @15,16                                              0887
         ALR   @15,BFRREG                                          0887
         TM    FSBMNELI(@15),B'10000000'                           0887
         BNO   @RF00887                                            0887
*             DO;                   /* YES                           */
*               FSBDMGRS=BTUTEXT(6:7);/* MOVE 3270 STATUS INFO TO FSB*/
         MVC   FSBDMGRS(2,@15),BTUTEXT+53(BFRREG)                  0889
*               FDBDATAA=EMPTY;     /* ZERO FDB DATA ADDR            */
         SLR   @15,@15                                             0890
         ST    @15,FDBDATAA(,BFRREG)                               0890
*               FDBDATCT=0;         /* ZERO FDB DATA COUNT           */
         STH   @15,FDBDATCT(,BFRREG)                               0891
*               CALL ZPSZDFNB;      /* MSG FORMATTER                 */
         L     @14,ATCZPSVT(,VTCVTREG)                             0892
         L     @15,ZPSZDFNB(,@14)                                  0892
         BALR  @14,@15                                             0892
*               BTUZRT00=ON;        /* SET ON ERROR MSG FLAG         */
         OI    BTUZRT00+48(BFRREG),B'10000000'                     0893
*             END;                                                 0894
*           ELSE                    /* NO ERROR CONDITION SET        */
*             DO;                                                  0895
         B     @RC00887                                            0895
@RF00887 DS    0H                                                  0896
*               BTUZRT00=OFF;       /* SET OFF ERROR MSG FLAG        */
         NI    BTUZRT00+48(BFRREG),B'01111111'                     0896
*             END;                                                 0897
*           FSBMSGID=ZMSG10;        /* SET MSGID IN FSB FOR        0898
*                                      UNSOLICITED DATA              */
@RC00887 LA    @15,16                                              0898
         ALR   @15,BFRREG                                          0898
         MVC   FSBMSGID(4,@15),@CF04374                            0898
*           ZCRFBPTR=ADDR(ISTFSB);  /* SET FROM BUFF PTR     @XM09072*/
         L     @14,RPHCRR(,RPHREG)                                 0899
         L     @14,CRACRR(,@14)                                    0899
         ST    @15,ZCRFBPTR(,@14)                                  0899
*           ZCRTBPTR=0;             /* SET NO TO BUFF PTR    @XM09072*/
         SLR   @00,@00                                             0900
         ST    @00,ZCRTBPTR(,@14)                                  0900
*           ZCRPCOD2=0;             /* ZERO PARM FIELD       @XM09072*/
         MVI   ZCRPCOD2(@14),X'00'                                 0901
*           ZCRPMFGF='1'B;          /* SET 1ST BUFF SW       @XM09072*/
*           ZCRPPG2='1'B;           /* GET PAGEABLE BUFF     @XM00957*/
         OI    ZCRPMFGF(@14),B'10100000'                           0903
*           ZCRMLNG=LENGTH(FSBFSB)+ /* SET LENGTH OF DATA TO MOVE    */
*               LENGTH(ISTBTU);     /*                       @XM10465*/
         MVC   ZCRMLNG(2,@14),@CH04640                             0904
*           CALL ISTZDFD0;          /* MOVE DATA TO PAGEABLE BUFFER
*                                                            @XM09072*/
         L     @14,ATCZPSVT(,VTCVTREG)                             0905
         L     @15,ZPSZDFD0(,@14)                                  0905
         BALR  @14,@15                                             0905
*           PTRG07=BFRREG;          /* SET PARM FOR BUFF DEALLOC   0906
*                                                            @XM09072*/
         LR    PTRG07,BFRREG                                       0906
*           BFRREG=ZCRBFPTR;        /* GET PAGEABLE BUF ADDR @XM09072*/
         L     @15,RPHCRR(,RPHREG)                                 0907
         L     @15,CRACRR(,@15)                                    0907
         L     BFRREG,ZCRBFPTR(,@15)                               0907
*           ZCRPCOD1=ZCPBUF;        /* INDIC FREE BUFFER     @XM09072*/
         MVI   ZCRPCOD1(@15),X'04'                                 0908
*           CALL ISTZDFB0;          /* FREE FIXED BUFFER     @XM09072*/
         L     @14,ATCZPSVT(,VTCVTREG)                             0909
         L     @15,ZPSZDFB0(,@14)                                  0909
         BALR  @14,@15                                             0909
*           CALL CFBI0AC;           /* Q FSB TO MSG WRITER           */
         BAL   @14,CFBI0AC                                         0910
*         END;                                                     0911
*     END;                          /*                       @XM05945*/
@RC00875 DS    0H                                                  0913
*   RFY                                                            0913
*     LNKREG RSTD;                                                 0913
@RC00872 DS    0H                                                  0914
*   LNKREG=ZCRSVF8;                 /* RESTORE RETURN ADDRESS        */
         L     @15,RPHCRR(,RPHREG)                                 0914
         L     @15,CRACRR(,@15)                                    0914
         L     LNKREG,ZCRSVF8(,@15)                                0914
*   RFY                                                            0915
*     LNKREG UNRSTD;                                               0915
*   END CFBI0DA;                                                   0916
@EL00003 DS    0H                                                  0916
@EF00003 DS    0H                                                  0916
@ER00003 BR    @14                                                 0916
@PB00003 DS    0H                                                  0916
         EJECT
*                                                                  0917
*/********************************************************************/
*/*                                                                  */
*/* CFBI00E: THIS ROUTINE PROCESSES CONTACT/RESET COMPLETION         */
*/* FUNCTION: IF THE BDU REPRESENTS A RESET CONTROL COMMAND, THE FSB */
*/*      IS REMOVED FROM THE DNCB TIP, THE FMCB POINTER IS SET, AND  */
*/*      THE FSB IS QUEUED TO THE FMCB TIP.                          */
*/*      OTHERWISE, ROUTINE CFBI0EB IS CALLED TO CHECK FOR DIALOG    */
*/*      INITIATION VIA CONTACT.                                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0917
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00E)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0917
*   DO;                                                            0917
*     GOTO CFBI00E@;                                               0918
         B     CFBI00E@                                            0918
*CFBI00E:                                                          0919
*   END;                                                           0919
CFBI00E  DS    0H                                                  0920
*   IF BDUCOMND=BCMDZ&(BDUMODIF=BMODZEM×BDUMODIF=BMODZQM×BDUMODIF= 0920
*       BMODZIM×BDUMODIF=BMODZOM×BDUMODIF=BMODZXO×BDUMODIF=BMODZCM×
*       BDUMODIF=BMODZECM) THEN     /* CONTROL COMMAND WITH RESET  0920
*                                      MODIFIER?                     */
         LA    @15,62                                              0920
         ALR   @15,BFRREG                                          0920
         CLI   BDUCOMND(@15),X'08'                                 0920
         BNE   @RF00920                                            0920
         CLI   BDUMODIF(@15),X'41'                                 0920
         BE    @RT00920                                            0920
         CLI   BDUMODIF(@15),X'42'                                 0920
         BE    @RT00920                                            0920
         CLI   BDUMODIF(@15),X'44'                                 0920
         BE    @RT00920                                            0920
         CLI   BDUMODIF(@15),X'48'                                 0920
         BE    @RT00920                                            0920
         CLI   BDUMODIF(@15),X'43'                                 0920
         BE    @RT00920                                            0920
         CLI   BDUMODIF(@15),X'50'                                 0920
         BE    @RT00920                                            0920
         CLI   BDUMODIF(@15),X'60'                                 0920
         BNE   @RF00920                                            0920
@RT00920 DS    0H                                                  0921
*     DO;                           /* YES                           */
*       CALL CFBI0AI;               /* DEQUEUE FSB FROM DNCB TIP     */
         BAL   @14,CFBI0AI                                         0922
*       FMCBREG=NCBFMCBA;           /* GET ADDR OF MOST RECENTLY   0923
*                                      OPENED FMCB                   */
*                                                                  0923
         L     FMCBREG,NCBFMCBA(,DNCBREG)                          0923
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(CFBI0AB)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0924
*       DO;                                                        0924
*         GOTO CFBI0AB;                                            0925
         B     CFBI0AB                                             0925
*CFBI0AB#:                                                         0926
*       END;                        /* Q FSB TO FMCB TIP             */
CFBI0AB# DS    0H                                                  0927
*     END;                                                         0927
*   ELSE                            /* NOT CONTROL WITH RESET        */
*                                                                  0928
*     /***************************************************************/
*     /*                                                             */
*     /* SEGMENT(CFBI0EB)REQUEST                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0928
*     DO;                                                          0928
         B     @RC00920                                            0928
@RF00920 DS    0H                                                  0929
*       GOTO CFBI0EB;                                              0929
         B     CFBI0EB                                             0929
*CFBI0EB#:                                                         0930
*     END;                          /* CHECK FOR DIALOG INIT VIA   0930
*                                      CONTACT                       */
*                                                                  0930
CFBI0EB# DS    0H                                                  0931
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI00E)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0931
*   DO;                                                            0931
@RC00920 DS    0H                                                  0932
*     GOTO CFBI00E#;                                               0932
         B     CFBI00E#                                            0932
*CFBI00E@:                                                         0933
*   END;                                                           0933
CFBI00E@ DS    0H                                                  0934
         EJECT
*                                                                  0934
*/********************************************************************/
*/*                                                                  */
*/* CFBI0EB: THIS ROUTINE CHECKS DIALOG INITIATION VIA CONTACT.      */
*/* FUNCTION: IF CONTACT WAS REJECTED FOR SESSION STARTED VIA INVITE */
*/*           THE FSB IS DEQUEUED FROM THE DNCB TIP AND THE FDB AND  */
*/*           PIU SET UP FOR A CALL TO TPIOS SHIPOUT (TO             */
*/*           RESCHEDULE THE CONTACT).                               */
*/*            OTHERWISE, ROUTINE CFBIECA IS USED TO ENTER DIALOG.   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0934
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI0EB)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0934
*   DO;                                                            0934
*     GOTO CFBI0EB@;                                               0935
         B     CFBI0EB@                                            0935
*CFBI0EB:                                                          0936
*   END;                                                           0936
CFBI0EB  DS    0H                                                  0937
*   IF FSBSCODE=NCPCRJS×            /* IS CONTACT REJECTED BECAUSE 0937
*                                      SESSION STARTED BY INVT?      */
*       (FSBSERR=ON&FSBSPHSE=NCPPHSE0&FSBSCODE=NCPCSXE) THEN/* SYSTEM
*                                      RESPONSE              @XM05945*/
         TM    FSBSCODE+16(BFRREG),B'00011000'                     0937
         BNO   @GL00026                                            0937
         TM    FSBSCODE+16(BFRREG),B'00000111'                     0937
         BZ    @RT00937                                            0937
@GL00026 LA    @15,16                                              0937
         ALR   @15,BFRREG                                          0937
         TM    FSBSERR(@15),B'10000000'                            0937
         BNO   @RF00937                                            0937
         TM    FSBSPHSE(@15),B'01100000'                           0937
         BNZ   @RF00937                                            0937
         TM    FSBSCODE(@15),B'00001000'                           0937
         BNO   @RF00937                                            0937
         TM    FSBSCODE(@15),B'00010111'                           0937
         BNZ   @RF00937                                            0937
@RT00937 DS    0H                                                  0938
*     DO;                           /* YES                           */
*       ZCRSAFSV=FSBDAF;            /*                       @XM09809*/
         L     @15,RPHCRR(,RPHREG)                                 0939
         L     @15,CRACRR(,@15)                                    0939
         LA    @14,16                                              0939
         ALR   @14,BFRREG                                          0939
         MVC   ZCRSAFSV(2,@15),FSBDAF(@14)                         0939
*       ZCRDAFSV=FSBSAF;            /*                       @XM09809*/
         MVC   ZCRDAFSV(2,@15),FSBSAF(@14)                         0940
*       RFY                                                        0941
*         WKREGA RSTD;                                             0941
*       WKREGA=ZCRCIDSV;            /* PTR TO DAF            @XM09809*/
         L     WKREGA,ZCRCIDSV(,@15)                               0942
*       RFY                                                        0943
*         BFRSAV RSTD;              /*                       @XM05945*/
*       BFRSAV=BFRREG;              /* SAVE PTR TO BFR       @XM05945*/
         LR    BFRSAV,BFRREG                                       0944
*       BFRREG=0;                   /* PARM FOR BFOB         @XM05945*/
         SLR   BFRREG,BFRREG                                       0945
*       ELEMREG=0;                  /* NO LCPB               @XM10465*/
         SLR   ELEMREG,ELEMREG                                     0946
*       ZCRRELK=ON;                 /* PARM FOR RESET        @XM10465*/
         OI    ZCRRELK(@15),B'00100000'                            0947
*       CALL ZPSZBFOB;              /* RESET ERR LOCK        @XM05945*/
         L     @11,ATCZPSVT(,VTCVTREG)                             0948
         L     @15,ZPSZBFOB(,@11)                                  0948
         BALR  @14,@15                                             0948
*       WKREGA=ZCRCIDSV;            /* CID FOR BFOB          @XM10465*/
         L     @11,RPHCRR(,RPHREG)                                 0949
         L     @11,CRACRR(,@11)                                    0949
         L     WKREGA,ZCRCIDSV(,@11)                               0949
*       BFRREG=0;                   /* NO BUFFER             @XM10465*/
         SLR   BFRREG,BFRREG                                       0950
*       CALL ZPSZBFOB;              /* SCHED DISCONNECT      @XM10465*/
         L     @11,ATCZPSVT(,VTCVTREG)                             0951
         L     @15,ZPSZBFOB(,@11)                                  0951
         BALR  @14,@15                                             0951
*       RFY                                                        0952
*         WKREGA UNRSTD;                                           0952
*       BFRREG=BFRSAV;              /* RESTORE PTR           @XM05945*/
         LR    BFRREG,BFRSAV                                       0953
*       CALL CFBI0AI;               /* DEQUEUE FSB FROM DNCB TIP   0954
*                                      SHIPOUT FDB                   */
         BAL   @14,CFBI0AI                                         0954
*       FDBDATCT=FDBDATCT+LENGTH(ISTBTU);/* INIT DATA COUNT FOR    0955
*                                      SHIPOUT                       */
         LA    @11,20                                              0955
         AH    @11,FDBDATCT(,BFRREG)                               0955
         STH   @11,FDBDATCT(,BFRREG)                               0955
*       BTUSYSTR=ZERO;              /* CLEAR BTH FIELDS              */
         LA    @11,48                                              0956
         ALR   @11,BFRREG                                          0956
         MVI   BTUSYSTR(@11),X'00'                                 0956
*       BTUEXTR=ZERO;                                              0957
         MVI   BTUEXTR(@11),X'00'                                  0957
*       BTUFID=THSET;               /* INIT TH BYTES 1&2             */
         MVC   BTUFID(2,@11),@CB04455                              0958
*       BTURH=0;                    /* INIT REQST HEADR              */
         SLR   @00,@00                                             0959
         STCM  @00,15,BTURH(@11)                                   0959
*       ZCRPCOD1='00'X;             /* BUFFER ALLOC PARM     @XM09027*/
         L     @11,RPHCRR(,RPHREG)                                 0960
         L     @11,CRACRR(,@11)                                    0960
         MVI   ZCRPCOD1(@11),X'00'                                 0960
*       ZCRPBUF='1'B;               /* BUFFER ALLOC PARM     @XM09027*/
         OI    ZCRPBUF(@11),B'00000100'                            0961
*       CALL ZPSZDFA0;              /* GET BUFFER FOR ZOB            */
         L     @11,ATCZPSVT(,VTCVTREG)                             0962
         L     @15,ZPSZDFA0(,@11)                                  0962
         BALR  @14,@15                                             0962
*       BFRSAV=RPHSRPRM;            /* ADDRESS ZOB           @XM09027*/
         L     BFRSAV,RPHSRPRM(,RPHREG)                            0963
*       RFY                                                        0964
*         ISTZOBUF BASED(BFRSAV);   /*                       @XM09027*/
*       ZOBBTU(1:FDBDATCT)=ZIBBTU(1:FDBDATCT);/*             @XM09027
*                                      MOVE ZIB INTO ZOB     @XM09027*/
         LH    @11,FDBDATCT(,BFRREG)                               0965
         BCTR  @11,0                                               0965
         EX    @11,@SM04651                                        0965
*       ADDR(ZOBBTU)->BTUDCF=BTUDCF+10;/*                    @XM09541*/
         LA    @11,10                                              0966
         LH    @00,BTUDCF+48(,BFRREG)                              0966
         N     @00,@CF04653                                        0966
         ALR   @11,@00                                             0966
         STH   @11,BTUDCF+28(,BFRSAV)                              0966
*       IF NCBFTRIO=ON THEN         /* I/O TRACE ACTIVE?     @XM10497*/
         CLI   NCBFTRIO(DNCBREG),1                                 0967
         BNE   @RF00967                                            0967
*         ZOBRT08=ON;               /* FLAG IT               @XM10497*/
         OI    ZOBRT08(BFRSAV),B'01000000'                         0968
*       ELSE                                                       0969
*         ;                         /* NO I/O TRACE          @XM10497*/
@RF00967 DS    0H                                                  0970
*       IF PROCFTX=ON THEN          /* CONFIDENTIAL TEXT     @XM10497*/
         TM    PROCFTX+48(FMCBREG),B'00000001'                     0970
         BNO   @RF00970                                            0970
*         ZOBRT06=ON;               /* RECORD THE FACT       @XM10497*/
         OI    ZOBRT06(BFRSAV),B'10000000'                         0971
*       ELSE                                                       0972
*         ;                         /* NO CONF TEXT          @XM10497*/
@RF00970 DS    0H                                                  0973
*       FDBDATAA=ADDR(ZOBBTU);      /* LOC BTU FOR EFBB      @XM09027*/
         LA    @11,ZOBBTU(,BFRSAV)                                 0973
         ST    @11,FDBDATAA(,BFRREG)                               0973
*       BFRSAV->ISTFDB=BFRREG->ISTFDB;/*                     @XM09027
*                                      COPY FDB FROM ZIB     @XM09027*/
         MVC   ISTFDB(12,BFRSAV),ISTFDB(BFRREG)                    0974
*       ZCRPCOD1='00'X;             /* BUFFER DALLOC PARM    @XM09027*/
         L     @11,RPHCRR(,RPHREG)                                 0975
         L     @11,CRACRR(,@11)                                    0975
         MVI   ZCRPCOD1(@11),X'00'                                 0975
*       ZCRPBUF='1'B;               /* BUFFER DALLOC PARM    @XM09027*/
         OI    ZCRPBUF(@11),B'00000100'                            0976
*       ELEMREG=BFRREG;             /* BUFFER DALLOC PARM    @XM09027*/
         LR    ELEMREG,BFRREG                                      0977
*       BFRREG->FDBFDBA=0;          /* RELEASE FIRST BUF.    @XM09794*/
         SLR   @11,@11                                             0978
         ST    @11,FDBFDBA(,BFRREG)                                0978
*       CALL ZPSZDFB0;              /* RELEASE FSB BUF       @XM09027*/
         L     @11,ATCZPSVT(,VTCVTREG)                             0979
         L     @15,ZPSZDFB0(,@11)                                  0979
         BALR  @14,@15                                             0979
*       BFRREG=BFRSAV;              /* ADDRESS NEW BUF       @XM09027*/
         LR    BFRREG,BFRSAV                                       0980
*       CALL ZFSZEFBB;              /* CALL TPIOS SHIPOUT            */
         L     @11,ATCZFSVT(,VTCVTREG)                             0981
         L     @15,ZFSZEFBB(,@11)                                  0981
         BALR  @14,@15                                             0981
*       RFY                                                        0982
*         BFRSAV UNRSTD;            /*                       @XM05945*/
*     END;                                                         0983
*   ELSE                            /* CONTACT NOT REJECTED          */
*     DO;                                                          0984
         B     @RC00937                                            0984
@RF00937 DS    0H                                                  0985
*       CALL CFBI0AD;               /* OBTAIN DAF LOCK               */
         BAL   @14,CFBI0AD                                         0985
*       CALL CFBIECA;               /* ENTER DIALOG                  */
         BAL   @14,CFBIECA                                         0986
*       CALL CFBI0AE;               /* RELEASE DAF LOCK              */
         BAL   @14,CFBI0AE                                         0987
*     END;                                                         0988
*                                                                  0988
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI0EB)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0989
*   DO;                                                            0989
@RC00937 DS    0H                                                  0990
*     GOTO CFBI0EB#;                                               0990
         B     CFBI0EB#                                            0990
*CFBI0EB@:                                                         0991
*   END;                                                           0991
         EJECT
*                                                                  0992
*/********************************************************************/
*/*                                                                  */
*/* CFBIECA: THIS ROUTINE PLACES THE APPLICATION (FMCB) IN DIALOG.   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0992
*CFBIECA:                                                          0992
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0992
         B     @PB00004                                            0992
CFBIECA  DS    0H                                                  0993
*   RFY                                                            0993
*     LNKREG RSTD;                                                 0993
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 0994
         L     @15,CRACRR(,@15)                                    0994
         ST    LNKREG,ZCRSVF7(,@15)                                0994
*   RFY                                                            0995
*     LNKREG UNRSTD;                                               0995
*   FMCBREG=NCBFMCBA;               /* GET ADDR OF MOST RECENTLY   0996
*                                      OPENED FMCB                   */
         L     FMCBREG,NCBFMCBA(,DNCBREG)                          0996
*   DNCZV001=FMCBREG;               /* SET THIS FMCB AS ACTIVE       */
         STCM  FMCBREG,7,DNCZV001(DNCBREG)                         0997
*   NCBTSKID=FMCTSKID;              /* SET DNCB TASK ID AS THAT OF 0998
*                                      THIS APPLICATION              */
         L     @00,FMCTSKID(,FMCBREG)                              0998
         ST    @00,NCBTSKID(,DNCBREG)                              0998
*   ADDR(DNCZC001)->PABDVTA=ADDR(FMCPAB4)->PABDVTA;/* MOVE FMCB TIP
*                                      DVT ADDR TO DNCB TIP DVT ADDR */
         MVC   PABDVTA+96(3,DNCBREG),PABDVTA+112(FMCBREG)          0999
*   DNCSESS=ON;                     /* SET ON DEV SESSION STATUS     */
         OI    DNCSESS(DNCBREG),B'01000000'                        1000
*   RFY                                                            1001
*     LNKREG RSTD;                                                 1001
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @15,RPHCRR(,RPHREG)                                 1002
         L     @15,CRACRR(,@15)                                    1002
         L     @15,ZCRSVF7(,@15)                                   1002
         LR    LNKREG,@15                                          1002
*   RFY                                                            1003
*     LNKREG UNRSTD;                                               1003
*   END CFBIECA;                                                   1004
@EL00004 DS    0H                                                  1004
@EF00004 DS    0H                                                  1004
@ER00004 BR    @14                                                 1004
@PB00004 DS    0H                                                  1004
         EJECT
*                                                                  1005
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AB: THIS ROUTINE QUEUES A FSB TO AN FMCB TIP.               */
*/*                                                                  */
*/********************************************************************/
*                                                                  1005
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI0AB)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1005
*   DO;                                                            1005
*     GOTO CFBI0AB@;                                               1006
         B     CFBI0AB@                                            1006
*CFBI0AB:                                                          1007
*   END;                                                           1007
*                                                                  1007
CFBI0AB  DS    0H                                                  1008
*/* PLACE FSB ON FMCB TIP                                            */
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB4) NORM                               */
*                                                                  1008
*   DO;                                                            1008
*     RFY                                                          1009
*      (GPR00P,                                                    1009
*       GPR01P,                                                    1009
*       GPR04P,                                                    1009
*       GPR05P,                                                    1009
*       GPR15P) RSTD;                                              1009
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1010
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    1011
         SLR   GPR00P,GPR00P                                       1011
*     GPR15P=ADDR(FMCPAB4);         /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB4(,FMCBREG)                            1012
*     GPR04P=ADDR(ZIBFSB);          /* WORK ELE PTR                  */
         LA    GPR04P,ZIBFSB(,BFRREG)                              1013
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1014
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            1015
         L     @14,ATCLCPTR                                        1015
         L     @15,ATCAP37(,@14)                                   1015
         BALR  @14,@15                                             1015
*     GEN(NOPR  0)                                                 1016
*     NOSETS NOREFS;                                               1016
         NOPR  0
*     RFY                                                          1017
*      (GPR00P,                                                    1017
*       GPR01P,                                                    1017
*       GPR04P,                                                    1017
*       GPR05P,                                                    1017
*       GPR15P) UNRSTD;                                            1017
*   END;                            /* *** END OF TPQUE GENERATION   */
*                                                                  1018
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI0AB)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1019
*   DO;                                                            1019
*     GOTO CFBI0AB#;                                               1020
         B     CFBI0AB#                                            1020
*CFBI0AB@:                                                         1021
*   END;                                                           1021
         EJECT
*                                                                  1022
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AC: THIS ROUTINE QUEUES A FSB ON THE MESSAGE WRITER PAB,    */
*/*           ICNZPAB4.                                              */
*/*                                                                  */
*/********************************************************************/
*                                                                  1022
*CFBI0AC:                                                          1022
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1022
         B     @PB00005                                            1022
CFBI0AC  DS    0H                                                  1023
*   RFY                                                            1023
*     LNKREG RSTD;                                                 1023
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 1024
         L     @15,CRACRR(,@15)                                    1024
         ST    LNKREG,ZCRSVF7(,@15)                                1024
*   RFY                                                            1025
*     LNKREG UNRSTD;                                               1025
*                                                                  1025
*/* PLACE FSB ON MESSAGE WRITER PAB                                  */
*/*  TPQUE (ADDR(ZIBFSB),ICNZPAB4) NORM                              */
*                                                                  1026
*   DO;                                                            1026
*     RFY                                                          1027
*      (GPR00P,                                                    1027
*       GPR01P,                                                    1027
*       GPR04P,                                                    1027
*       GPR05P,                                                    1027
*       GPR15P) RSTD;                                              1027
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1028
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    1029
         SLR   GPR00P,GPR00P                                       1029
*     GPR15P=ADDR(ICNZPAB4);        /* HOLD PAB PTR                  */
         LA    GPR15P,ICNZPAB4(,ICNCBREG)                          1030
*     GPR04P=ADDR(ZIBFSB);          /* WORK ELE PTR                  */
         LA    GPR04P,ZIBFSB(,BFRREG)                              1031
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1032
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            1033
         L     @14,ATCLCPTR                                        1033
         L     @15,ATCAP37(,@14)                                   1033
         BALR  @14,@15                                             1033
*     GEN(NOPR  0)                                                 1034
*     NOSETS NOREFS;                                               1034
         NOPR  0
*     RFY                                                          1035
*      (GPR00P,                                                    1035
*       GPR01P,                                                    1035
*       GPR04P,                                                    1035
*       GPR05P,                                                    1035
*       GPR15P) UNRSTD;                                            1035
*   END;                            /* *** END OF TPQUE GENERATION   */
*   RFY                                                            1037
*     LNKREG RSTD;                                                 1037
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @15,RPHCRR(,RPHREG)                                 1038
         L     @15,CRACRR(,@15)                                    1038
         L     LNKREG,ZCRSVF7(,@15)                                1038
*   RFY                                                            1039
*     LNKREG UNRSTD;                                               1039
*   END CFBI0AC;                                                   1040
@EL00005 DS    0H                                                  1040
@EF00005 DS    0H                                                  1040
@ER00005 BR    @14                                                 1040
         EJECT
*                                                                  1041
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AD: THIS ROUTINE OBTAINS THE DAF LOCK (DAF FROM BTUDEST)    */
*/*                                                                  */
*/********************************************************************/
*                                                                  1041
*CFBI0AD:                                                          1041
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1041
CFBI0AD  DS    0H                                                  1042
*   RFY                                                            1042
*     LNKREG RSTD;                                                 1042
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 1043
         L     @11,CRACRR(,@15)                                    1043
         ST    LNKREG,ZCRSVF7(,@11)                                1043
*   RFY                                                            1044
*     LNKREG UNRSTD;                                               1044
*   ZCRR2SV=VTCVTREG;               /* SAVE AFFECTED REGS            */
         ST    VTCVTREG,ZCRR2SV(,@11)                              1045
*   ZCRR13SV=SAVAREG;                                              1046
         ST    SAVAREG,ZCRR13SV(,@11)                              1046
*   ZCRCIDSV=0;                     /* CLEAR CID                     */
         SLR   @00,@00                                             1047
         ST    @00,ZCRCIDSV(,@11)                                  1047
*   ZCRDAFSV=BTUDEST;               /* GET DAF                       */
         MVC   ZCRDAFSV(2,@11),BTUDEST+48(BFRREG)                  1048
*   VTCVTREG=ZCRCIDSV;              /* SET CID REG                   */
         L     VTCVTREG,ZCRCIDSV(,@11)                             1049
*   SAVAREG=ADDR(CRASVC);           /* GET SAVE AREA ADDR            */
         LA    SAVAREG,CRASVC(,@15)                                1050
*   DO;                             /* CIDCTL(FIND)                  */
*     RFY                                                          1052
*      (EMCR2,                                                     1052
*       EMCR3) RSTD;                                               1052
*     GEN SETS(RPHWORK)                                            1053
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     1053
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */
         SLR   EMCR3,EMCR3                                         1054
*     EMCR3='01'X;                  /* INDICATE SHARED LOCK          */
         LA    EMCR3,1                                             1055
*     CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS REQUEST           */
         L     @14,ATCLCPTR                                        1056
         L     @15,ATCCDFND(,@14)                                  1056
         BALR  @14,@15                                             1056
*     RFY                                                          1057
*      (EMCR2,                                                     1057
*       EMCR3) UNRSTD;                                             1057
*   END;                            /* CIDCTL OBTAIN DAF LOCK        */
*   VTCVTREG=ZCRR2SV;               /* RESTORE AFFECTED REGS         */
         L     @15,RPHCRR(,RPHREG)                                 1059
         L     @15,CRACRR(,@15)                                    1059
         L     VTCVTREG,ZCRR2SV(,@15)                              1059
*   SAVAREG=ZCRR13SV;                                              1060
         L     SAVAREG,ZCRR13SV(,@15)                              1060
*   RFY                                                            1061
*     LNKREG RSTD;                                                 1061
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     LNKREG,ZCRSVF7(,@15)                                1062
*   RFY                                                            1063
*     LNKREG UNRSTD;                                               1063
*   END CFBI0AD;                                                   1064
@EL00006 DS    0H                                                  1064
@EF00006 DS    0H                                                  1064
@ER00006 BR    @14                                                 1064
         EJECT
*                                                                  1065
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AE: THIS ROUTINE RELEASES THE DAF LOCK (DAF FROM BTUDEST)   */
*/*                                                                  */
*/********************************************************************/
*                                                                  1065
*CFBI0AE:                                                          1065
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1065
CFBI0AE  DS    0H                                                  1066
*   RFY                                                            1066
*     LNKREG RSTD;                                                 1066
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 1067
         L     @11,CRACRR(,@15)                                    1067
         ST    LNKREG,ZCRSVF7(,@11)                                1067
*   RFY                                                            1068
*     LNKREG UNRSTD;                                               1068
*   ZCRR2SV=VTCVTREG;               /* SAVE AFFECTED REGS            */
         ST    VTCVTREG,ZCRR2SV(,@11)                              1069
*   ZCRR13SV=SAVAREG;                                              1070
         ST    SAVAREG,ZCRR13SV(,@11)                              1070
*   ZCRCIDSV=0;                     /* CLEAR CID                     */
         SLR   @00,@00                                             1071
         ST    @00,ZCRCIDSV(,@11)                                  1071
*   ZCRDAFSV=BTUDEST;               /* GET DAF                       */
         MVC   ZCRDAFSV(2,@11),BTUDEST+48(BFRREG)                  1072
*   VTCVTREG=ZCRCIDSV;              /* SET CID REG                   */
         L     VTCVTREG,ZCRCIDSV(,@11)                             1073
*   SAVAREG=ADDR(CRASVC);           /* GET SAVE AREA ADDR            */
         LA    SAVAREG,CRASVC(,@15)                                1074
*   DO;                             /* CIDCTL(FINISH)                */
*     RFY                                                          1076
*      (EMCR2,                                                     1076
*       EMCR3) RSTD;                                               1076
*     GEN SETS(RPHWORK)                                            1077
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     1077
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */
         SLR   EMCR3,EMCR3                                         1078
*     CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS REQUEST           */
         L     @14,ATCLCPTR                                        1079
         L     @15,ATCCDFIN(,@14)                                  1079
         BALR  @14,@15                                             1079
*     RFY                                                          1080
*      (EMCR2,                                                     1080
*       EMCR3) UNRSTD;                                             1080
*   END;                            /* CIDCTL RELEASE DAF LOCK       */
*   VTCVTREG=ZCRR2SV;               /* RESTORE AFFECTED REGS         */
         L     @15,RPHCRR(,RPHREG)                                 1082
         L     @15,CRACRR(,@15)                                    1082
         L     VTCVTREG,ZCRR2SV(,@15)                              1082
*   SAVAREG=ZCRR13SV;                                              1083
         L     SAVAREG,ZCRR13SV(,@15)                              1083
*   RFY                                                            1084
*     LNKREG RSTD;                                                 1084
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     LNKREG,ZCRSVF7(,@15)                                1085
*   RFY                                                            1086
*     LNKREG UNRSTD;                                               1086
*   END CFBI0AE;                                                   1087
@EL00007 DS    0H                                                  1087
@EF00007 DS    0H                                                  1087
@ER00007 BR    @14                                                 1087
@PB00007 DS    0H                                                  1087
         EJECT
*                                                                  1088
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AF: THIS ROUTINE SCHEDULES THE FMCB ATOP (IMMED) IF THE     */
*/*        FMCB IS IN RECORD MODE, OTHERWISE IT SCHEDULES THE FMCB   */
*/*        TOP (IMMED).                                              */
*/*                                                                  */
*/********************************************************************/
*                                                                  1088
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI0AF)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1088
*   DO;                                                            1088
*     GOTO CFBI0AF@;                                               1089
         B     CFBI0AF@                                            1089
*CFBI0AF:                                                          1090
*   END;                                                           1090
CFBI0AF  DS    0H                                                  1091
*   IF FMCMODE=FMCRCD THEN          /* FMCB IN RECORD MODE?          */
         CLC   FMCMODE(8,FMCBREG),@CC03431                         1091
         BNE   @RF01091                                            1091
*/* TPSCHED (ADDR(FMCPAB5)) UNCOND                                   */
*                                                                  1092
*     DO;                                                          1092
*       RFY                                                        1093
*        (GPR00P,                                                  1093
*         GPR01P,                                                  1093
*         GPR05P) RSTD;                                            1093
*       GEN REFS(GPR01P) SETS(RPHWORK)                             1094
*           (STM   GPR02P,GPR08P,RPHWORK(GPR01P));                 1094
         STM   GPR02P,GPR08P,RPHWORK(GPR01P)
*       GPR00P=0;                                                  1095
         SLR   GPR00P,GPR00P                                       1095
*       GPR05P=ADDR(FMCPAB5);                                      1096
         LA    @15,FMCPAB5(,FMCBREG)                               1096
         LR    GPR05P,@15                                          1096
*       CALL ATCLCPTR->ATCAP38->ISTAPC38;                          1097
         L     @14,ATCLCPTR                                        1097
         L     @15,ATCAP38(,@14)                                   1097
         BALR  @14,@15                                             1097
*       GEN(NOPR 1)                                                1098
*       NOSETS NOREFS;                                             1098
         NOPR 1
*       RFY                                                        1099
*        (GPR00P,                                                  1099
*         GPR01P,                                                  1099
*         GPR05P) UNRSTD;                                          1099
*     END;                          /* **** END TPSCHED YES, SCHEDULE
*                                      ATOP UNCOND           @XM06038*/
*   ELSE                            /* NOT RECORD MODE               */
*/* TPSCHED (ADDR(FMCPAB3)) IMMED                                    */
*                                                                  1101
*     DO;                                                          1101
         B     @RC01091                                            1101
@RF01091 DS    0H                                                  1102
*       RFY                                                        1102
*        (GPR00P,                                                  1102
*         GPR01P,                                                  1102
*         GPR05P) RSTD;                                            1102
*       GEN REFS(GPR01P) SETS(RPHWORK)                             1103
*           (STM   GPR02P,GPR08P,RPHWORK(GPR01P));                 1103
         STM   GPR02P,GPR08P,RPHWORK(GPR01P)
*       GPR00P=0;                                                  1104
         SLR   GPR00P,GPR00P                                       1104
*       GPR05P=ADDR(FMCPAB3);                                      1105
         LA    @15,FMCPAB3(,FMCBREG)                               1105
         LR    GPR05P,@15                                          1105
*       CALL ATCLCPTR->ATCAP38->ISTAPC38;                          1106
         L     @14,ATCLCPTR                                        1106
         L     @15,ATCAP38(,@14)                                   1106
         BALR  @14,@15                                             1106
*       GEN(NOPR 4)                                                1107
*       NOSETS NOREFS;                                             1107
         NOPR 4
*       RFY                                                        1108
*        (GPR00P,                                                  1108
*         GPR01P,                                                  1108
*         GPR05P) UNRSTD;                                          1108
*     END;                          /* **** END TPSCHED SCHEDULE FMCB
*                                      TOP IMMED             @XM06038*/
*                                                                  1109
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(CFBI0AF)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1110
*   DO;                                                            1110
@RC01091 DS    0H                                                  1111
*     GOTO CFBI0AF#;                                               1111
         B     CFBI0AF#                                            1111
*CFBI0AF@:                                                         1112
*   END;                                                           1112
         EJECT
*                                                                  1113
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AH: THIS ROUTINE DEALLOCATES THE CURRENT DATA BUFFERS       */
*/*                                                                  */
*/********************************************************************/
*                                                                  1113
*CFBI0AH:                                                          1113
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1113
         B     @PB00008                                            1113
CFBI0AH  DS    0H                                                  1114
*   RFY                                                            1114
*     LNKREG RSTD;                                                 1114
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 1115
         L     @15,CRACRR(,@15)                                    1115
         ST    LNKREG,ZCRSVF7(,@15)                                1115
*   RFY                                                            1116
*     LNKREG UNRSTD;                                               1116
*   ZCRPCOD1='00'X;                 /* CLEAR BUFFER DEALLOCATION   1117
*                                      ROUTINE PARAM FLAGS           */
         MVI   ZCRPCOD1(@15),X'00'                                 1117
*   ZCRPBUF=ON;                     /* SET PARAM: RELEASE BUFFERS    */
         OI    ZCRPBUF(@15),B'00000100'                            1118
*   ELEMREG=BFRREG;                 /* SET PARAM REG: ADDRESS OF   1119
*                                      CURRENT BUFFER                */
         LR    ELEMREG,BFRREG                                      1119
*   CALL ZPSZDFB0;                  /* CALL BUFFER DEALLOCATION      */
         L     @14,ATCZPSVT(,VTCVTREG)                             1120
         L     @15,ZPSZDFB0(,@14)                                  1120
         BALR  @14,@15                                             1120
*   RFY                                                            1121
*     LNKREG RSTD;                                                 1121
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @15,RPHCRR(,RPHREG)                                 1122
         L     @15,CRACRR(,@15)                                    1122
         L     LNKREG,ZCRSVF7(,@15)                                1122
*   RFY                                                            1123
*     LNKREG UNRSTD;                                               1123
*   END CFBI0AH;                                                   1124
@EL00008 DS    0H                                                  1124
@EF00008 DS    0H                                                  1124
@ER00008 BR    @14                                                 1124
         EJECT
*                                                                  1125
*/********************************************************************/
*/*                                                                  */
*/* CFBI0AI: THIS ROUTINE DEQUEUES THE OLDEST WORK ELEMENT FROM THE  */
*/*        DNCB TIP.                                                 */
*/*                                                                  */
*/********************************************************************/
*                                                                  1125
*CFBI0AI:                                                          1125
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1125
CFBI0AI  DS    0H                                                  1126
*   RFY                                                            1126
*     LNKREG RSTD;                                                 1126
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHREG)                                 1127
         L     @15,CRACRR(,@15)                                    1127
         ST    LNKREG,ZCRSVF7(,@15)                                1127
*   RFY                                                            1128
*     LNKREG UNRSTD;                                               1128
*                                                                  1128
*/* REMOVE WORK ELEMENT FROM DNCB TIP                                */
*/* TPDEQ (,DNCZC001)                                                */
*                                                                  1129
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          1130
*      (GPR00P,                                                    1130
*       GPR01P,                                                    1130
*       GPR14P,                                                    1130
*       GPR15P) RSTD;                                              1130
*     GPR15P=ADDR(DNCZC001);        /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,DNCZC001(,DNCBREG)                           1131
*     GPR14P=GPR15P->PABWEQA×FMZCA059;                             1132
         L     @11,@CF02185                                        1132
         L     GPR14P,PABWEQA(,GPR15P)                             1132
         OR    GPR14P,@11                                          1132
*     IF GPR14P=FMZCA059 THEN                                      1133
         CLR   GPR14P,@11                                          1133
         BE    @RT01133                                            1133
*       ;                                                          1134
*     ELSE                                                         1135
*       DO;                                                        1135
*FMZL1124:                                                         1136
*         ;                                                        1136
FMZL1124 DS    0H                                                  1137
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA059);                    1137
         B     @DE01137                                            1137
@DL01137 DS    0H                                                  1138
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         1138
         LA    GPR15P,WKECHAIN(,GPR14P)                            1138
*           GPR14P=GPR15P->PABWEQA;                                1139
         L     GPR14P,PABWEQA(,GPR15P)                             1139
*         END;                                                     1140
@DE01137 L     @11,@CF02185                                        1140
         CL    @11,WKECHAIN(,GPR14P)                               1140
         BNE   @DL01137                                            1140
*         GPR00P=FMZCA059;                                         1141
         LR    GPR00P,@11                                          1141
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       1142
         CS    GPR14P,@00,PABWEQA(GPR15P)                          1142
*         BC(7,FMZL1124);                                          1143
         BC    7,FMZL1124                                          1143
*         GPR14P->WKECHAIN=0;                                      1144
         SLR   @11,@11                                             1144
         ST    @11,WKECHAIN(,GPR14P)                               1144
*       END;                                                       1145
*ISTA0124:                                                         1146
*     ;                                                            1146
@RT01133 DS    0H                                                  1146
ISTA0124 DS    0H                                                  1147
*     GPR14P=GPR14P&FMZCB059;                                      1147
         N     GPR14P,@CF02280                                     1147
*     GPR01P->RPHWEA=GPR14P;                                       1148
         ST    GPR14P,RPHWEA(,GPR01P)                              1148
*     RFY                                                          1149
*      (GPR00P,                                                    1149
*       GPR01P,                                                    1149
*       GPR14P,                                                    1149
*       GPR15P) UNRSTD;                                            1149
*   END;                            /* END TPDEQ GENERATION  @XM07171*/
*   RFY                                                            1151
*     LNKREG RSTD;                                                 1151
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @15,RPHCRR(,RPHREG)                                 1152
         L     @15,CRACRR(,@15)                                    1152
         L     LNKREG,ZCRSVF7(,@15)                                1152
*   RFY                                                            1153
*     LNKREG UNRSTD;                                               1153
*   END CFBI0AI;                                                   1154
*                                                                  1154
@EL00009 DS    0H                                                  1154
@EF00009 DS    0H                                                  1154
@ER00009 BR    @14                                                 1154
@PB00009 DS    0H                                                  1154
*/* TPEPILOG                                                         */
*                                                                  1155
*   GEN(PRINT OFF);                                                1155
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    1156
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           1156
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*   DCL                                                            1157
*     ISTAPC38 ENTRY BASED(ATCAP38) VALRG(*);/* TPSCHED ROUTINE      */
*   DCL                                                            1158
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            1159
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   DECLARE                                                        1160
*     EMCR0 PTR REG(0),                                            1160
*     EMCR1 PTR REG(1),                                            1160
*     EMCR2 PTR REG(2),                                            1160
*     EMCR3 PTR REG(3),                                            1160
*     EMCR4 PTR REG(4),                                            1160
*     EMCR5 PTR REG(5),                                            1160
*     EMCR6 PTR REG(6),                                            1160
*     EMCR7 PTR REG(7),                                            1160
*     EMCR8 PTR REG(8),                                            1160
*     EMCR9 PTR REG(9),                                            1160
*     EMCR10 PTR REG(10),                                          1160
*     EMCR11 PTR REG(11),                                          1160
*     EMCR12 PTR REG(12),                                          1160
*     EMCR13 PTR REG(13),                                          1160
*     EMCR14 PTR REG(14),                                          1160
*     EMCR15 PTR REG(15);                                          1160
*   DECLARE                                                        1161
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     1161
*                                      ROUTINE                       */
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   1161
*                                      ROUTINE                       */
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     1161
*                                      ROUTINE                       */
*   DCL                                                            1162
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */
*   GEN(PRINT ON);                                                 1163
*                                                                  1163
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  1164
*   END ISTZCFBI                                                   1164
*                                                                  1164
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  1164
*       ;                                                          1164
@DATA    DS    0H
@CH04640 DC    H'52'
@CH01920 DC    H'172'
@SM04651 MVC   ZOBBTU(0,BFRSAV),ZIBBTU(BFRREG)
@DATD    DSECT
         DS    0F
ISTZCFBI CSECT
         DS    0F
@CF00134 DC    F'16'
@CF01332 DC    XL4'08000000'
@CF01336 DC    XL4'04000000'
@CF02185 DC    XL4'80000000'
@CF02280 DC    XL4'7FFFFFFF'
@CF04500 DC    XL4'00FFFFFF'
@CF04653 DC    XL4'0000FFFF'
@CF04374 DC    C'210I'
@DATD    DSECT
         DS    0D
IOSBPTR  DS    A
SRBPTR   DS    A
CVTPTR   DS    A
LCPBPTR  DS    A
DNCBPTR  DS    A
FMCBPTR  DS    A
FSBPTR   DS    A
BDUPTR   DS    A
BTUPTR   DS    A
ZPSZGFCB DS    A
WKEPTR   DS    A
ISTZMSG  DS    F
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZCFBI CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC03431 DC    C'RECORD  '
@CC04495 DC    C'CCBI'
@CB04455 DC    X'0E00'
@CB00214 DC    X'00'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
RPHPTR   EQU   @01
WKREGA   EQU   @00
RPHREG   EQU   @01
VTCVTREG EQU   @02
ICNCBREG EQU   @03
DNCBREG  EQU   @04
FMCBREG  EQU   @05
BFRREG   EQU   @06
ELEMREG  EQU   @07
DAFPTR   EQU   @07
PTRG07   EQU   @07
BFRSAV   EQU   @10
BASEREG  EQU   @12
SAVAREG  EQU   @13
LNKREG   EQU   @14
EMCR2    EQU   @02
EMCR3    EQU   @03
CIDREG   EQU   @02
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
RCDREG   EQU   @15
WKREGB   EQU   @09
WKREGC   EQU   @08
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ATCLCPTR EQU   1032
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00002 EQU   IOSB+20
IOSCSW   EQU   @NM00002+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZSVFC EQU   ISTZSAVE+4
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZRT00 EQU   LCPFLAGS
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPRESET EQU   LCPFLG1
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPRSTQH EQU   LCPLCCW
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRID    EQU   ZCRCRR
ZCRLEN   EQU   ZCRCRR+1
ZCRCHAIN EQU   ISTZCRR+4
ZCRFRRA  EQU   ISTZCRR+8
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRRELK  EQU   ZCRIBPR
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRTBPTR EQU   ZCRPARMS+4
ZCRMLNG  EQU   ZCRPARMS+8
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRPPG2  EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRBFPTR EQU   ISTZCRR+44
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRWKARA EQU   ISTZCRR+156
ZCRR2SV  EQU   ISTZCRR+184
ZCRR13SV EQU   ISTZCRR+188
ZCRCIDSV EQU   ISTZCRR+192
ZCRSAFSV EQU   ZCRCIDSV
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAVEZ EQU   ISTZCRR+196
ZCRAUDIT EQU   ISTZCRR+440
ZCRTID   EQU   ZCRAUDIT
ZCRTNAME EQU   ZCRAUDIT+1
ZCRENTER EQU   ZCRAUDIT+5
ZCRECCBI EQU   ZCRENTER+16
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRAFRR   EQU   CRAHDR+4
CRALKACT EQU   CRABASIC+8
CRAL5PTR EQU   CRABASIC+28
CRAPROCR EQU   ISTCRA+312
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABWEQP  EQU   PABWEQA+1
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABINHBT EQU   PABFLAGS
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00053 EQU   LOKCHNG+2
ISTDYPAB EQU   0
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCAP33  EQU   ISTATCVT+444
ATCAP36  EQU   ISTATCVT+452
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00061 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCZFSVT EQU   ATCAOSM+68
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCAP38  EQU   ATCAOSM+268
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNCB   EQU   0
NCBTYPE  EQU   ISTNCB
NCBTSKID EQU   ISTNCB+8
NCBNSNA  EQU   ISTNCB+12
NCBFMCBA EQU   ISTNCB+16
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
ISTICNCB EQU   0
ICNCB    EQU   ISTICNCB
@NM00065 EQU   ISTICNCB+53
ICNZPAB4 EQU   ISTICNCB+80
ICNCKFLD EQU   ISTICNCB+96
ICNFLAG  EQU   ISTICNCB+100
ICNZF006 EQU   ICNFLAG
ICNFFLAG EQU   ISTICNCB+101
ICNZSWS  EQU   ISTICNCB+102
ICNFLAG2 EQU   ISTICNCB+236
ICNZD001 EQU   ISTICNCB+288
ICNWSCCW EQU   ICNZD001
ICNZD002 EQU   ISTICNCB+296
ICNZD003 EQU   ISTICNCB+320
ICNRSCCW EQU   ICNZD003
ICNZD004 EQU   ISTICNCB+328
ICNZS1VR EQU   ISTICNCB+348
ICNSRV02 EQU   ICNZS1VR
ICNDIEWA EQU   ICNSRV02
ICNDCDEB EQU   ISTICNCB+480
ICNDIDEB EQU   ICNDCDEB+12
ICNZFLAG EQU   ISTICNCB+508
ICNZH002 EQU   ISTICNCB+509
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
ICNZCONS EQU   ISTICNCB+680
ISTDNCB  EQU   0
DNCNCB   EQU   ISTDNCB
DNCBHSET EQU   ISTDNCB+48
DNCMODE  EQU   ISTDNCB+49
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCSESS  EQU   DNCZFLGS
DNCZF002 EQU   DNCZFLGS
DNCZF003 EQU   DNCZFLGS
DNCZF008 EQU   DNCZFLGS+1
DNCBSCED EQU   DNCOS+2
DNCZV001 EQU   DNCOS+17
DNCZV002 EQU   DNCOS+21
DNCLOCK  EQU   DNCOS+36
DNCZC001 EQU   DNCOS+40
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROCFTX  EQU   PROPROC2
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCTSKID EQU   ISTFMCB+8
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCPROCD EQU   ISTFMCB+48
FMCMODE  EQU   ISTFMCB+52
FMCPAB3  EQU   ISTFMCB+96
FMCPAB4  EQU   ISTFMCB+112
FMCPAB5  EQU   ISTFMCB+128
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCBHSET EQU   ISTFMCB+185
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF002 EQU   FMCZFLAG
FMCZF006 EQU   FMCZFLAG
FMCZFB06 EQU   FMCZF006
FMCZFC06 EQU   FMCZF006
FMCZF010 EQU   FMCZFLAG+2
FMCZF023 EQU   FMCZFLAG+3
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTLSCB  EQU   0
LSC1WORD EQU   ISTLSCB
LSCREQTG EQU   LSC1WORD+2
LSCZRT02 EQU   LSCREQTG
LSCZRT03 EQU   LSCREQTG
LSCZRT04 EQU   LSCREQTG
LSCZRT05 EQU   LSCREQTG
LSCZRT06 EQU   LSCREQTG
LSCZRT07 EQU   LSCREQTG
LSCZMNRC EQU   LSCREQTG+1
LSCZRT08 EQU   LSCZMNRC
LSCZRT09 EQU   LSCZMNRC
LSCCHAIN EQU   ISTLSCB+4
LSCCHAI1 EQU   LSCCHAIN
LSCRUCNT EQU   ISTLSCB+8
LSCFLGS  EQU   ISTLSCB+9
LSCSEQ   EQU   ISTLSCB+10
LSCLCCWA EQU   ISTLSCB+20
LSCFDBA  EQU   ISTLSCB+24
ISTFDB   EQU   0
FDBFDBA  EQU   ISTFDB
FDBDATAA EQU   ISTFDB+4
FDBDATCT EQU   ISTFDB+8
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBTYPE  EQU   FSBFSB
FSBMNRCD EQU   FSBFSB+2
FSBMNELI EQU   FSBMNRCD
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBSERR  EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSCODE EQU   FSBSYSRS
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THFLGB   EQU   THFLAG1+1
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2MPF   EQU   TH2FLAG1
ISTBDU   EQU   0
BDUCOMND EQU   ISTBDU
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTLH    EQU   0
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUDEST  EQU   BTUBTH+2
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTUZRT00 EQU   BTURQFLG
BTUDCF   EQU   BTUBTH+8
BTURH    EQU   BTUBTH+10
BTUBDU   EQU   ISTBTU+14
BTUSYSTR EQU   ISTBTU+18
BTUEXTR  EQU   ISTBTU+19
BTUTEXT  EQU   ISTBTU+20
ISTZIBUF EQU   0
ZIBFSM   EQU   ISTZIBUF+4
ISTZOBUF EQU   0
ZOBFSM   EQU   ISTZOBUF+4
ISTZPSVT EQU   0
ZPSZDFA0 EQU   ISTZPSVT
ZPSZDFD0 EQU   ISTZPSVT+8
ZPSZDFB0 EQU   ISTZPSVT+16
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZDFNB EQU   ISTZPSVT+52
ISTZFSVT EQU   0
ZFSZEFBB EQU   ISTZFSVT
ZFSZEABB EQU   ZFSZEFBB
ZFSZEFAB EQU   ISTZFSVT+4
ZFSZEAAB EQU   ZFSZEFAB
ISTZBFOB EQU   0
ISTZDFB0 EQU   0
ISTZDFD0 EQU   0
FMZL0033 EQU   0
FMZL0043 EQU   0
FMZL0052 EQU   0
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
ISTAPC38 EQU   0
ISTAPC37 EQU   0
ISTSDCCF EQU   0
ISTSDCCR EQU   0
ISTAPC34 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCN EQU   0
ISTZDFNB EQU   0
ISTZEFBB EQU   0
ISTZGFCB EQU   0
ZIBSRB   EQU   0
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
PSARSVTE EQU   PSARSVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00083 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFDBZ  EQU   ZIBAIOCM
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
@NM00087 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00087+1
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00089 EQU   ZIBBTU
ZOBDLBT  EQU   ISTZOBUF
ZOBDLBCM EQU   ZOBDLBT
@NM00090 EQU   ZOBDLBCM+25
ZOBBTU   EQU   ZOBDLBT+28
ZOBWCC   EQU   ZOBDLBT+48
ZOBECCC  EQU   ZOBDLBT+50
ZOBDIO   EQU   ZOBFSM
ZOBCCW2  EQU   ZOBDIO+8
ZOBCPTCC EQU   ZOBCCW2
ZOBFLAGS EQU   ZOBCCW2+5
ZOBRT06  EQU   ZOBFLAGS
ZOBRT08  EQU   ZOBFLAGS
ZOBCCW3  EQU   ZOBDIO+16
ZOBCPTRC EQU   ZOBCCW3
ZOBCPN2C EQU   ZOBCPTRC
ZOBCPTRA EQU   ZOBCCW3+1
@NM00094 EQU   ZOBBTU
CMZCIDM  EQU   ATCCIDM
FLC      EQU   PSA
SRB      EQU   SRBSECT
ZOBTEXT  EQU   ZOBBTU
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
ZOBTH2   EQU   @NM00094+4
ZOBLH    EQU   @NM00094
ZOBCPN2K EQU   ZOBCCW3+6
ZOBRSV99 EQU   ZOBCCW3+5
ZOBCPN2F EQU   ZOBCCW3+4
ZOBCPTC2 EQU   ZOBCPTRA
ZOBCPTC1 EQU   ZOBCPN2C
ZOBCPNPK EQU   ZOBCCW2+6
ZOBRSV03 EQU   ZOBFLAGS
ZOBCPNPF EQU   ZOBCCW2+4
ZOBCPTCA EQU   ZOBCCW2+1
ZOBCPNPC EQU   ZOBCPTCC
ZOBCPWTK EQU   ZOBDIO+6
ZOBRSV02 EQU   ZOBDIO+5
ZOBCPWTF EQU   ZOBDIO+4
ZOBCPTXA EQU   ZOBDIO+1
ZOBCPWTC EQU   ZOBDIO
ZOBRSV09 EQU   ZOBECCC
ZOBECSP  EQU   ZOBECCC
ZOBRSV08 EQU   ZOBECCC
ZOBRSV07 EQU   ZOBDLBT+49
ZOBRSV06 EQU   ZOBWCC
ZOBWCSP  EQU   ZOBWCC
ZOBRSV05 EQU   ZOBWCC
ZOBRSV10 EQU   ZOBDLBCM+26
@NM00093 EQU   @NM00090
@NM00092 EQU   @NM00090
@NM00091 EQU   @NM00090
ZOBRSV04 EQU   ZOBDLBCM+16
ZOBLNG2  EQU   ZOBDLBCM+14
ZOBRSV01 EQU   ZOBDLBCM+12
ZOBFDB   EQU   ZOBDLBCM
ZIBTH2   EQU   @NM00089+4
ZIBLH    EQU   @NM00089
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBTEXT  EQU   ZIBSIB+4
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
ZIBTEXT1 EQU   ZIBFIB+52
@NM00088 EQU   @NM00087
ZIBFDBS  EQU   ZIBBTU
@NM00086 EQU   ZIBMDREC
@NM00085 EQU   ZIBFSB
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00083+1
FSBRT0A  EQU   @NM00083+1
FSBRT09  EQU   @NM00083+1
FSBRT08  EQU   @NM00083+1
FSBRT07  EQU   @NM00083
FSBRT06  EQU   @NM00083
FSBRT05  EQU   @NM00083
FSBRT04  EQU   @NM00083
FSBRT03  EQU   @NM00083
FSBRT02  EQU   @NM00083
FSBRT01  EQU   @NM00083
FSBRT00  EQU   @NM00083
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00007 EQU   IOSPCISC+4
@NM00006 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00005 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
WKECHNGP EQU   WKECHAIN+1
@NM00097 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00096 EQU   ISTWKE
ZFSZWRD4 EQU   ISTZFSVT+36
ZFSZWRD3 EQU   ISTZFSVT+32
ZFSZEFCB EQU   ISTZFSVT+28
ZFSZFFEB EQU   ISTZFSVT+24
ZFSZDFJ0 EQU   ISTZFSVT+20
ZFSZFFFB EQU   ISTZFSVT+16
ZFSZFFDB EQU   ISTZFSVT+12
ZFSZFFCB EQU   ISTZFSVT+8
ZFSZEMAB EQU   ZFSZEAAB
ZFSZEMBB EQU   ZFSZEABB
ZPSZDFQR EQU   ISTZPSVT+80
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
@NM00095 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFZ0 EQU   ISTZPSVT+28
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFC0 EQU   ISTZPSVT+4
ZOBLNG1  EQU   ZOBFSM
ZOBCHAIN EQU   ISTZOBUF
ZIBLNG1  EQU   ZIBFSM
ZIBCHAIN EQU   ISTZIBUF
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT05 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT03 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUSORCE EQU   BTUBTH+4
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00084 EQU   ISTLH+2
LHLEN    EQU   ISTLH
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
TH2SNF   EQU   ISTTH2+4
TH2OAF   EQU   ISTTH2+3
TH2DAF   EQU   ISTTH2+2
TH2CDF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2PYF   EQU   TH2FLAG1+1
TH2AFI   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
TH2FID   EQU   TH2FLAG1
THDCF    EQU   ISTTH+8
THSNF    EQU   ISTTH+6
THOAF    EQU   ISTTH+4
THDAF    EQU   ISTTH+2
THCDF    EQU   THFLGB
THSEF    EQU   THFLGB
THPYF    EQU   THFLGB
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
THRHI    EQU   THMPF
THFID    EQU   THFLAG1
FSBFDB   EQU   ISTFSB+32
FSBRSV01 EQU   FSBFSB+30
FSBTHCNT EQU   FSBFSB+28
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00082 EQU   FSBSS2
@NM00081 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00080 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBELI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBLNGTH EQU   FSBFSB+1
FDBOFSET EQU   ISTFDB+10
LSCTLBAD EQU   ISTLSCB+28
LSCFDB2  EQU   LSCFDBA+1
LSCFDB1  EQU   LSCFDBA
LSCLCPBA EQU   ISTLSCB+16
LSCLCCW1 EQU   ISTLSCB+12
LSCRRCNT EQU   LSCSEQ+1
LSCRRCCT EQU   LSCSEQ
LSCATOP  EQU   LSCFLGS
LSCFREE  EQU   LSCFLGS
LSCDSTAT EQU   LSCFLGS
LSCEXRES EQU   LSCFLGS
LSCZRIMM EQU   LSCFLGS
LSCRSV01 EQU   LSCFLGS
LSCSMODE EQU   LSCFLGS
LSCZMIRC EQU   LSCRUCNT
LSCCHAI2 EQU   LSCCHAIN+1
LSCCHNG  EQU   LSCCHAI1
LSCZRTSC EQU   LSCZMNRC
LSCZRT0B EQU   LSCZMNRC
LSCZRT0A EQU   LSCZMNRC
LSCZRTL9 EQU   LSCZRT09
LSCZRTL8 EQU   LSCZRT08
LSCZRTL7 EQU   LSCZRT07
LSCZRTL6 EQU   LSCZRT06
LSCZRTL5 EQU   LSCZRT05
LSCZRTL4 EQU   LSCZRT04
LSCZRTL3 EQU   LSCZRT03
LSCZRTL2 EQU   LSCZRT02
LSCZRT01 EQU   LSCREQTG
LSCZRT00 EQU   LSCREQTG
LSCLNGTH EQU   LSC1WORD+1
LSCTYPE  EQU   LSC1WORD
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00079 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00078 EQU   FMCLCPAQ
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00077 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00076 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB2  EQU   ISTFMCB+80
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00075 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00074 EQU   ISTFMCB+30
@NM00073 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PRORSV11 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DNCZV005 EQU   DNCOS+32
DNCZV004 EQU   DNCOS+28
DNCZV003 EQU   DNCOS+24
DNCZX001 EQU   DNCOS+20
DNCZX003 EQU   DNCOS+16
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCACIP  EQU   DNCBSCED+1
DNCLICP  EQU   DNCBSCED
DNCZPSRD EQU   DNCZFLGS+1
DNCPSOL  EQU   DNCZFLGS+1
DNCZF007 EQU   DNCZFLGS+1
DNCZF006 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZRSCH EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCINVIT EQU   DNCZFLGS
DNCZF001 EQU   DNCZFLGS
ICNZCON6 EQU   ICNZCONS+10
ICNZCON5 EQU   ICNZCONS+8
ICNZCON4 EQU   ICNZCONS+6
ICNZCON3 EQU   ICNZCONS+4
ICNZCON2 EQU   ICNZCONS+2
ICNZCON1 EQU   ICNZCONS
ICNZATSA EQU   ISTICNCB+676
ICNZX012 EQU   ISTICNCB+675
ICNZX011 EQU   ISTICNCB+674
ICNZX010 EQU   ISTICNCB+672
ICNSRB   EQU   ISTICNCB+628
ICNIOSB  EQU   ISTICNCB+520
ICNZC001 EQU   ISTICNCB+512
ICNZX013 EQU   ISTICNCB+511
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZF028 EQU   ICNZFLAG
ICNZF027 EQU   ICNZFLAG
ICNZF026 EQU   ICNZFLAG
ICNZF025 EQU   ICNZFLAG
ICNZF024 EQU   ICNZFLAG
ICNZF023 EQU   ICNZFLAG
ICNZF022 EQU   ICNZFLAG
ICNZF021 EQU   ICNZFLAG
ICNWORD5 EQU   ISTICNCB+504
ICNMSIZE EQU   ISTICNCB+500
ICNLCVTA EQU   ISTICNCB+496
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+8
ICNAPPAD EQU   ICNDCDEB+5
ICNEXSCL EQU   ICNDCDEB+4
ICNDCBAD EQU   ICNDCDEB+1
ICNDEBID EQU   ICNDCDEB
@NM00072 EQU   ISTICNCB+477
ICNERCNT EQU   ISTICNCB+476
ICNZX002 EQU   ISTICNCB+475
ICNZX001 EQU   ISTICNCB+474
ICNZH001 EQU   ISTICNCB+472
ICNZSW3R EQU   ISTICNCB+468
ICNZSW2R EQU   ISTICNCB+464
ICNZSW1R EQU   ISTICNCB+460
ICNZS4VR EQU   ISTICNCB+436
ICNZS4RR EQU   ISTICNCB+432
ICNZS4FC EQU   ISTICNCB+428
ICNZS4BC EQU   ISTICNCB+424
ICNZS3VR EQU   ISTICNCB+400
ICNZS3RR EQU   ISTICNCB+396
ICNZS3FC EQU   ISTICNCB+392
ICNZS3BC EQU   ISTICNCB+388
ICNZS1RC EQU   ICNZS1VR+36
ICNDIEW3 EQU   ICNDIEWA+8
ICNDIEW2 EQU   ICNDIEWA+4
ICNDIEW1 EQU   ICNDIEWA
ICNZS1RR EQU   ISTICNCB+344
ICNZS1FC EQU   ISTICNCB+340
ICNZS1BC EQU   ISTICNCB+336
ICNRSTIC EQU   ICNZD004
ICNRDCOD EQU   ICNRSCCW
ICNZD006 EQU   ISTICNCB+312
ICNZD005 EQU   ISTICNCB+304
ICNWSTIC EQU   ICNZD002
ICNWRCOD EQU   ICNWSCCW
ICNZV008 EQU   ISTICNCB+284
ICNZV007 EQU   ISTICNCB+280
ICNZV006 EQU   ISTICNCB+276
ICNZV005 EQU   ISTICNCB+272
ICNZV004 EQU   ISTICNCB+268
ICNLSTIT EQU   ISTICNCB+264
ICNLSTIF EQU   ISTICNCB+260
ICNZV002 EQU   ISTICNCB+256
ICNZV001 EQU   ISTICNCB+252
ICNZV00A EQU   ISTICNCB+249
ICNBUFF  EQU   ISTICNCB+248
ICNCPQ   EQU   ISTICNCB+244
ICNNICNA EQU   ISTICNCB+240
@NM00071 EQU   ICNFLAG2+2
ICNZF019 EQU   ICNFLAG2+2
ICNZF018 EQU   ICNFLAG2+2
ICNZF017 EQU   ICNFLAG2+2
ICNZF016 EQU   ICNFLAG2+2
ICNZF015 EQU   ICNFLAG2+2
ICNMSG   EQU   ICNFLAG2+1
ICNCLOSE EQU   ICNFLAG2+1
ICNZF014 EQU   ICNFLAG2+1
ICNZF013 EQU   ICNFLAG2+1
ICNZF012 EQU   ICNFLAG2+1
ICNZF011 EQU   ICNFLAG2+1
ICNZF00D EQU   ICNFLAG2+1
ICNZF00B EQU   ICNFLAG2+1
ICNZF00A EQU   ICNFLAG2
ICNZF008 EQU   ICNFLAG2
ICNZF007 EQU   ICNFLAG2
ICNZF005 EQU   ICNFLAG2
ICNZF004 EQU   ICNFLAG2
ICNZF003 EQU   ICNFLAG2
ICNZF002 EQU   ICNFLAG2
ICNZF001 EQU   ICNFLAG2
ICNLOCK  EQU   ISTICNCB+232
ICNLICNA EQU   ISTICNCB+228
ICNRPH   EQU   ISTICNCB+120
ICNZV003 EQU   ISTICNCB+116
ICNLAST  EQU   ISTICNCB+112
ICNLSTBT EQU   ISTICNCB+108
ICNSIOQ  EQU   ISTICNCB+104
ICNFLAG1 EQU   ISTICNCB+103
ICNZSW08 EQU   ICNZSWS
ICNZSW07 EQU   ICNZSWS
ICNZSW06 EQU   ICNZSWS
ICNZSW05 EQU   ICNZSWS
ICNZSW04 EQU   ICNZSWS
ICNZSW03 EQU   ICNZSWS
ICNZSW02 EQU   ICNZSWS
ICNZSW01 EQU   ICNZSWS
ICNZFF69 EQU   ICNFFLAG
@NM00070 EQU   ICNFFLAG
ICNZFF05 EQU   ICNFFLAG
ICNZFF04 EQU   ICNFFLAG
ICNZFF03 EQU   ICNFFLAG
ICNZFF02 EQU   ICNFFLAG
ICNZFF01 EQU   ICNFFLAG
ICNZFF00 EQU   ICNFFLAG
@NM00069 EQU   ICNFLAG
ICNZCRIT EQU   ICNFLAG
ICNSTART EQU   ICNFLAG
ICNSLOW  EQU   ICNFLAG
ICNZF010 EQU   ICNFLAG
ICNZF00F EQU   ICNFLAG
ICNZF00E EQU   ICNFLAG
ICNCONF  EQU   ICNZF006
ICNCKPAB EQU   ICNCKFLD+1
ICNRSV07 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNZPAB1 EQU   ISTICNCB+64
ICNRSV01 EQU   ISTICNCB+60
@NM00068 EQU   ISTICNCB+56
@NM00067 EQU   ISTICNCB+54
@NM00066 EQU   @NM00065
ICNRRY   EQU   @NM00065
ICNLCLUS EQU   @NM00065
ICNROLN  EQU   @NM00065
ICNRNRY  EQU   @NM00065
ICNLNKMD EQU   ISTICNCB+52
ICNCUUA  EQU   ISTICNCB+48
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00064 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00063 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
ATCRPT26 EQU   ATCAOSM+332
ATCRPT25 EQU   ATCAOSM+328
ATCRPT24 EQU   ATCAOSM+324
ATCRPT23 EQU   ATCAOSM+320
ATCRPT22 EQU   ATCAOSM+316
ATCRPT21 EQU   ATCAOSM+312
ATCRPT20 EQU   ATCAOSM+308
ATCRPT19 EQU   ATCAOSM+304
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00062 EQU   @NM00061
ATCVTMAB EQU   @NM00061
@NM00060 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00059 EQU   ISTATCVT+819
@NM00058 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00057 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCDVTLK EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+448
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00056 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00055 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
LOKXCL   EQU   @NM00053
LOKPRY   EQU   @NM00053
@NM00054 EQU   @NM00053
@NM00052 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
@NM00051 EQU   ISTAPCRR+137
@NM00050 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00049 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00048 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00047 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00046 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00045 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00044 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00043 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRREMIC EQU   ISTZCRR+436
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00042 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00041 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00040 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFLAG  EQU   ZCRCRR+3
LCPFTYPE EQU   LCPRPHA
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPNXLCW EQU   ISTLCPB+20
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00039 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZACTV EQU   ZSAZSVMS
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00038 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00037 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00036 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00035 EQU   CVTFIX+248
@NM00034 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00009 EQU   SRBSECT+40
@NM00008 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00004 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00003 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00002
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00001 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
@NM00033 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00032 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00031 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00030 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00029 EQU   FLCFSA
@NM00028 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00027 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00026 EQU   FLCIOA
@NM00025 EQU   FLCMCLA+15
@NM00024 EQU   FLCMCLA+14
@NM00023 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00022 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00021 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00020 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00019 EQU   FLCPER
@NM00018 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00017 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00016 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00015 EQU   FLCPIILC
@NM00014 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00013 EQU   FLCSVILC
@NM00012 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00011 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00010 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00566 EQU   @RC00554
@RC00557 EQU   @RC00554
@RT00798 EQU   @RC00783
@RC00847 EQU   @RC00836
@RC00837 EQU   @RC00836
@PB00002 EQU   @PB00003
@RC00876 EQU   @RC00875
CFBI0EB@ EQU   @PB00004
@PB00006 EQU   @PB00007
@PB00008 EQU   @PB00009
CFBI00E# EQU   @RC00566
CFBI00C@ EQU   @PB00002
@RC00838 EQU   @RC00837
@PB00005 EQU   @PB00006
CFBI0AF@ EQU   @PB00008
CFBI0AB@ EQU   @PB00005
@ENDDATA EQU   *
         END   ISTZCFBI,(C'PLS0955',0701,77110)
