         TITLE 'IKTXINIT- EXTENDED LOGON INITIALIZATION PROCEDURE      *
                        '
IKTXINIT CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IKTXINIT  78.045'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @11,8(,@13)                                         0001
         LR    @13,@11                                             0001
*                                                                  0147
*/********************************************************************/
*/* ALLOCATE AND INITIALIZE TVWA                                     */
*/********************************************************************/
*                                                                  0147
*   CALL TVWAINIT;                                                 0147
*                                                                  0147
         BAL   @14,TVWAINIT                                        0147
*/* TEST RETURN CODE OF INITIALIZATION ROUTINE                       */
*                                                                  0148
*   RFY                                                            0148
*     RETCODE RSTD;                 /* RESTRICT RETURN CODE REGISTER */
*   IF RETCODE^=0 THEN                                             0149
*                                                                  0149
         LTR   RETCODE,RETCODE                                     0149
         BZ    @RF00149                                            0149
*/*IF INITIALIZATION FAILS, RETURN FAIL CODE                         */
*                                                                  0150
*     DO;                                                          0150
*       RFY                                                        0151
*         RETCODE UNRSTD;           /* UNRESTRICT RETURN CODE      0151
*                                      REGISTER                      */
*       RETURN CODE(4);                                            0152
         L     @13,4(,@13)                                         0152
         L     @00,@SIZDATD                                        0152
         LR    @01,@11                                             0152
         FREEMAIN R,LV=(0),A=(1)
         LA    @15,4                                               0152
         L     @14,12(,@13)                                        0152
         LM    @00,@12,20(@13)                                     0152
         BR    @14                                                 0152
*     END;                                                         0153
*   RFY                                                            0154
*     ADDREG RSTD;                                                 0154
*                                                                  0154
@RF00149 DS    0H                                                  0155
*/********************************************************************/
*/* AFTER WORK AREA INITIALIZATION IDENTIFY APPLICATION              */
*/* TO VTAM                                                          */
*/********************************************************************/
*                                                                  0155
*   TVWARTR=ADDR(RETRYMAX);         /* SET RETRY COUNTER             */
         L     @10,PSAAOLD                                         0155
         L     @01,TSBPTR(,@10)                                    0155
         L     @01,TSBEXTNT(,@01)                                  0155
         L     @10,TVWAPTR(,@01)                                   0155
         SLR   @01,@01                                             0155
         LA    @05,RETRYMAX(,@01)                                  0155
         STH   @05,TVWARTR(,@10)                                   0155
*   ADDREG=TVWAACB;                 /* SET ADDRESS OF ACB INTO REG1  */
         L     ADDREG,TVWAACB(,@10)                                0156
*   DO WHILE ACBOPEN^='1'B;         /* SETUP OPEN LOOP               */
         B     @DE00157                                            0157
@DL00157 DS    0H                                                  0158
*/****************************************************************** */
*/*           OPEN ACB IS NOT ISSUED IN A MACRO FORMAT DUE TO        */
*/*           REENTRANCY REQUIREMENTS AND IS HARD CODED TO           */
*/*           RETAIN VIABILITY                                       */
*/****************************************************************** */
*                                                                  0158
*     AUXSAVE=ADDREG×'80000000'X;   /* INSERT PARAMETER INTO AREA    */
         LR    @10,ADDREG                                          0158
         O     @10,@CF02869                                        0158
         ST    @10,AUXSAVE(,REG13)                                 0158
*     RFY                                                          0159
*       REG1 RSTD;                  /* RESTRICT PARAMETER REGISTER   */
*     REG1=ADDR(AUXSAVE);           /* LOAD ADDRESS OF PARAMETER     */
         LA    REG1,AUXSAVE(,REG13)                                0160
*     GENERATE CODE( SVC  19);      /* ISSUE OPEN SVC                */
          SVC  19
*     RFY                                                          0162
*       RETCODE RSTD;               /* RESTRICT RETURN CODE REGISTER */
*     IF RETCODE^=0 THEN            /* TEST FOR UNSUCCESSFUL RETURN
*                                      CODE                          */
         SLR   @14,@14                                             0163
         CR    RETCODE,@14                                         0163
         BE    @RF00163                                            0163
*       IF^(RETCODE=8&ACBERFLG=20)×TVWARTR<=0 THEN/* TEST FOR RETRY  */
         C     RETCODE,@CF00036                                    0164
         BNE   @RT00164                                            0164
         L     @10,PSAAOLD                                         0164
         L     @10,TSBPTR(,@10)                                    0164
         L     @10,TSBEXTNT(,@10)                                  0164
         L     @10,TVWAPTR(,@10)                                   0164
         L     @05,TVWAACB(,@10)                                   0164
         CLI   ACBERFLG(@05),20                                    0164
         BNE   @RT00164                                            0164
         CH    @14,TVWARTR(,@10)                                   0164
         BL    @RF00164                                            0164
@RT00164 DS    0H                                                  0165
*         DO;                                                      0165
*           RFY                                                    0166
*             RETCODE UNRSTD;       /* UNRESTRICT RETURN CODE      0166
*                                      REGISTER                      */
*           CALL DIAGNOSE;          /* DIAGNOSE ACB FOR ERROR        */
         BAL   @14,DIAGNOSE                                        0167
*           RETURN CODE(4);         /* SEND BAD RETURN CODE TO CALLER*/
         L     @13,4(,@13)                                         0168
         L     @00,@SIZDATD                                        0168
         LR    @01,@11                                             0168
         FREEMAIN R,LV=(0),A=(1)
         LA    @15,4                                               0168
         L     @14,12(,@13)                                        0168
         LM    @00,@12,20(@13)                                     0168
         BR    @14                                                 0168
*         END;                                                     0169
*       ELSE                                                       0170
*         TVWARTR=TVWARTR-1;        /* DECREMENT RETRY COUNTER       */
@RF00164 L     @10,PSAAOLD                                         0170
         L     @10,TSBPTR(,@10)                                    0170
         L     @10,TSBEXTNT(,@10)                                  0170
         L     @10,TVWAPTR(,@10)                                   0170
         LH    @05,TVWARTR(,@10)                                   0170
         BCTR  @05,0                                               0170
         STH   @05,TVWARTR(,@10)                                   0170
*   END;                                                           0171
@RF00163 DS    0H                                                  0171
@DE00157 L     @10,PSAAOLD                                         0171
         L     @01,TSBPTR(,@10)                                    0171
         L     @01,TSBEXTNT(,@01)                                  0171
         L     @01,TVWAPTR(,@01)                                   0171
         L     @01,TVWAACB(,@01)                                   0171
         TM    ACBOPEN(@01),B'00010000'                            0171
         BNO   @DL00157                                            0171
*   RFY                                                            0172
*     ADDREG UNRSTD;                /* UNRESTRICT REGISTER 1         */
*/********************************************************************/
*/* AFTER ACB IS OPENED REQUEST TERMINAL CONTR0L                     */
*/********************************************************************/
*                                                                  0173
*   CALL TERMCON;                                                  0173
         BAL   @14,TERMCON                                         0173
*   RFY                                                            0174
*     RETCODE RSTD;                 /* RESTRICT RETURN CODE REGISTER */
*   IF RETCODE^=0 THEN              /* TEST FOR NO TERMINAL CONTROL  */
         LTR   RETCODE,RETCODE                                     0175
         BZ    @RF00175                                            0175
*     DO;                                                          0176
*       RFY                                                        0177
*         RETCODE UNRSTD;           /* UNRESTRICT RETURN CODE      0177
*                                      REGISTER                      */
*       RETURN CODE(4);             /* RETURN TO CALLER INDICATING 0178
*                                      FAILURE                       */
         L     @13,4(,@13)                                         0178
         L     @00,@SIZDATD                                        0178
         LR    @01,@11                                             0178
         FREEMAIN R,LV=(0),A=(1)
         LA    @15,4                                               0178
         L     @14,12(,@13)                                        0178
         LM    @00,@12,20(@13)                                     0178
         BR    @14                                                 0178
*     END;                                                         0179
*                                                                  0179
*/********************************************************************/
*/* WHEN TERMINAL CONTROL IS WITHIN THE ADDRESS SPACE                */
*/* CALL THE QUEUE MANAGER INITIALIZATION ROUTINE                    */
*/********************************************************************/
*                                                                  0180
*   CALL IKTQMINT;                  /* INITIALIZE QUEUE MANAGER    0180
*                                      CONTROL AREA                  */
@RF00175 BAL   @14,IKTQMINT                                        0180
*   RFY                                                            0181
*     RETCODE RSTD;                 /* RESTRICT RETURN CODE REGISTER */
*   IF RETCODE^=0 THEN              /* TEST FOR UNSUCCESSFUL       0182
*                                      INITIALIZATION                */
         LTR   RETCODE,RETCODE                                     0182
         BZ    @RF00182                                            0182
*     DO;                                                          0183
*       RFY                                                        0184
*         RETCODE UNRSTD;           /* RESTRICT RETURN CODE REGISTER */
*       RETURN CODE(4);             /* RETURN TO CALLER INDICATING 0185
*                                      FAILURE                       */
         L     @13,4(,@13)                                         0185
         L     @00,@SIZDATD                                        0185
         LR    @01,@11                                             0185
         FREEMAIN R,LV=(0),A=(1)
         LA    @15,4                                               0185
         L     @14,12(,@13)                                        0185
         LM    @00,@12,20(@13)                                     0185
         BR    @14                                                 0185
*     END;                                                         0186
*                                                                  0186
*/********************************************************************/
*/* AFTER QUEUE MANAGER IS ESTABLISHED, INITIALIZE THE I/O           */
*/* MANAGERS AND CHECK FOR CORRECT RANGE OF VALUES                   */
*/********************************************************************/
*                                                                  0187
*   REG13=REG13+8;                  /* INCREMENT SAVE AREA ADDRESS 0187
*                                      BECAUSE OF SAVE CONVENTION  0187
*                                      USED IN SETLOCK               */
@RF00182 AL    REG13,@CF00036                                      0187
*   GENERATE CODE REFS(FLC,PSALITA);                               0188
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=SAVE,             **
               RELATED=('I/O MANAGER INITIALIZATION ')
*   REG13=REG13-8;                  /* RESTORE SAVE AREA ADDRESS     */
         SL    REG13,@CF00036                                      0189
*   DO;                             /* CASE(TSBXTMTP)NAMES(INIT3270,I
*                                      NITRT12,USEREXIT,INITLU2)     */
*     DCL                                                          0191
*       CL0001@ LABEL BASED(CP0001@(TSBXTMTP)) VALUERANGE(INIT3270,
*           INITRT12,USEREXIT,INITLU2);/* BRANCH TARGET              */
*     DCL                                                          0192
*       CP0001@(4) PTR(31) INIT(ADDR(INIT3270),ADDR(INITRT12),ADDR(
*           USEREXIT),ADDR(INITLU2));                              0192
*     GOTO CL0001@;                 /* BRANCH TO SELECTED CASE     0193
*                                                            @G58AK3A*/
         L     @10,PSAAOLD                                         0193
         L     @10,TSBPTR(,@10)                                    0193
         L     @10,TSBEXTNT(,@10)                                  0193
         SLR   @15,@15                                             0193
         IC    @15,TSBXTMTP(,@10)                                  0193
         SLA   @15,2                                               0193
         L     @10,CP0001@-4(@15)                                  0193
         BR    @10                                                 0193
*INIT3270:                                                         0194
*     DO;                           /* SUBCASE                       */
INIT3270 DS    0H                                                  0195
*       TSBXTIM=TIM3270;            /* INSERT ENTRY POINT ADDRESS OF
*                                      INPUT MANAGER                 */
         L     @10,PSAAOLD                                         0195
         L     @10,TSBPTR(,@10)                                    0195
         L     @15,TSBEXTNT(,@10)                                  0195
         L     @14,CVTPTR                                          0195
         L     @14,TCASTPTR(,@14)                                  0195
         L     @14,TCASTTL(,@14)                                   0195
         L     @09,TIM3270(,@14)                                   0195
         ST    @09,TSBXTIM(,@15)                                   0195
*       TSBXTOM=TOM3270;            /* INSERT ENTRY POINT ADDRESS OF
*                                      OUTPUT MANAGER                */
         L     @14,TOM3270(,@14)                                   0196
         ST    @14,TSBXTOM(,@15)                                   0196
*       TSB3270='1'B;               /* TURN ON 3270 INDICATOR        */
*       TSBDSPLY='1'B;              /* TURN ON DISPLAY SCREEN      0198
*                                      INDICATOR                     */
         OI    TSB3270(@10),B'00100010'                            0198
*       CALL IKTIIOM;               /* CALL THE 3270 INITIALIZATION
*                                      ROUTINE                       */
         L     @15,@CV02836                                        0199
         BALR  @14,@15                                             0199
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */
         B     CE0001@                                             0200
*     END;                          /* END OF SUBCASE                */
*INITRT12:                                                         0202
*     DO;                           /* SUBCASE                       */
INITRT12 DS    0H                                                  0203
*       TSBXTIM=TIMRTS;             /* INSERT ENTRY POINT ADDRESS OF
*                                      INPUT MANAGER                 */
         L     @10,PSAAOLD                                         0203
         L     @10,TSBPTR(,@10)                                    0203
         L     @10,TSBEXTNT(,@10)                                  0203
         L     @15,CVTPTR                                          0203
         L     @15,TCASTPTR(,@15)                                  0203
         L     @15,TCASTTL(,@15)                                   0203
         L     @14,TIMRTS(,@15)                                    0203
         ST    @14,TSBXTIM(,@10)                                   0203
*       TSBXTOM=TOMRTS;             /* INSERT ENTRY POINT ADDRESS OF
*                                      OUTPUT MANAGER                */
         L     @15,TOMRTS(,@15)                                    0204
         ST    @15,TSBXTOM(,@10)                                   0204
*       CALL IKTIIOM;               /* CALL THE 3767/3770          0205
*                                      INITIALIZATION ROUTINE        */
         L     @15,@CV02836                                        0205
         BALR  @14,@15                                             0205
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */
         B     CE0001@                                             0206
*     END;                          /* END OF SUBCASE                */
*USEREXIT:                                                         0208
*     DO;                           /* SUBCASE PROVISION FOR A USER
*                                      EXIT                          */
USEREXIT DS    0H                                                  0209
*       IF ADDRUEXT^=0 THEN         /* CHECK FOR VALID USER EXIT   0209
*                                      POINTER                       */
         L     @10,ADDRUEXT                                        0209
         LTR   @10,@10                                             0209
         BZ    @RF00209                                            0209
*         CALL IKTINX2;             /* CALL USER EXIT                */
         L     @15,@CV02839                                        0210
         BALR  @14,@15                                             0210
*       ELSE                                                       0211
*         DO;                                                      0211
         B     @RC00209                                            0211
@RF00209 DS    0H                                                  0212
*           REG13=REG13+8;          /* INCREMENT SAVE AREA ADDRESS 0212
*                                      BECAUSE OF SAVE CONVENTION  0212
*                                      USED BY SETLOCK MACRO         */
         AL    REG13,@CF00036                                      0212
*           GENERATE CODE REFS(FLC,PSALITA);                       0213
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,                        **
               RELATED=('INITIALIZATION COMPLETE')
*           REG13=REG13-8;          /* RESTORE SAVE AREA ADDRESS     */
         SL    REG13,@CF00036                                      0214
*           RETURN CODE(4);         /* RETURN INDICATING FAILURE TO
*                                      INITIALIZE                    */
         L     @13,4(,@13)                                         0215
         L     @00,@SIZDATD                                        0215
         LR    @01,@11                                             0215
         FREEMAIN R,LV=(0),A=(1)
         LA    @15,4                                               0215
         L     @14,12(,@13)                                        0215
         LM    @00,@12,20(@13)                                     0215
         BR    @14                                                 0215
*         END;                                                     0216
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */
         B     CE0001@                                             0217
*     END;                          /* END OF SUBCASE                */
*INITLU2:                                                          0219
*     DO;                           /* SUBCASE               @G58AK3A*/
INITLU2  DS    0H                                                  0220
*       TSBXTIM=TIMLU2;             /* ADDRESS OF INPUT MANAGER    0220
*                                                            @G58AK3A*/
         L     @10,PSAAOLD                                         0220
         L     @10,TSBPTR(,@10)                                    0220
         L     @15,TSBEXTNT(,@10)                                  0220
         L     @14,CVTPTR                                          0220
         L     @14,TCASTPTR(,@14)                                  0220
         L     @14,TCASTTL(,@14)                                   0220
         L     @09,TIMLU2(,@14)                                    0220
         ST    @09,TSBXTIM(,@15)                                   0220
*       TSBXTOM=TOMLU2;             /* ADDRESS OF OUTPUT MANAGER   0221
*                                                            @G58AK3A*/
         L     @14,TOMLU2(,@14)                                    0221
         ST    @14,TSBXTOM(,@15)                                   0221
*       TSB3270='1'B;               /* TURN ON 3270 FLAG     @G58AK3A*/
*       TSBDSPLY='1'B;              /* TURN ON DISPLAY FLAG  @G58AK3A*/
         OI    TSB3270(@10),B'00100010'                            0223
*       CALL IKTIIOM;               /* CALL NDS INITIALIZATION     0224
*                                      ROUTINE               @G58AK3A*/
         L     @15,@CV02836                                        0224
         BALR  @14,@15                                             0224
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */
         B     CE0001@                                             0225
*     END;                          /* END OF SUBCASE        @G58AK3A*/
*CE0001@:                                                          0227
*   END;                            /* END OF CASE                   */
CE0001@  DS    0H                                                  0228
*/* TEST FOR THE COMPLETION OF THE INITIALIZATION FOR                */
*/* I/O MANAGERS                                                     */
*                                                                  0228
*   RFY                                                            0228
*     RETCODE RSTD;                 /* RESTRICT RETURN CODE REGISTER */
*   IF RETCODE^=0 THEN                                             0229
         LTR   RETCODE,RETCODE                                     0229
         BZ    @RF00229                                            0229
*     DO;                                                          0230
*       REG13=REG13+8;              /* INCREMENT SAVE AREA ADDRESS 0231
*                                      BECAUSE OF SAVE CONVENTION  0231
*                                      USED BY SETLOCK MACRO         */
         AL    REG13,@CF00036                                      0231
*       GENERATE CODE REFS(FLC,PSALITA);                           0232
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,                        **
               RELATED=('INITIALIZATION COMPLETE')
*       REG13=REG13-8;              /* RESTORE SAVE AREA ADDRESS     */
         SL    REG13,@CF00036                                      0233
*       RFY                                                        0234
*         RETCODE UNRSTD;           /* UNRESTRICT RETURN CODE      0234
*                                      REGISTER                      */
*       RETURN CODE(4);             /* RETURN TO CALLER INDICATING 0235
*                                      FAILURE                       */
         L     @13,4(,@13)                                         0235
         L     @00,@SIZDATD                                        0235
         LR    @01,@11                                             0235
         FREEMAIN R,LV=(0),A=(1)
         LA    @15,4                                               0235
         L     @14,12(,@13)                                        0235
         LM    @00,@12,20(@13)                                     0235
         BR    @14                                                 0235
*     END;                                                         0236
*   ELSE                                                           0237
*     DO;                                                          0237
@RF00229 DS    0H                                                  0238
*       REG13=REG13+8;              /* INCREMENT SAVE AREA ADDRESS 0238
*                                      BECAUSE OF SAVE CONVENTION  0238
*                                      USED BY SETLOCK MACRO         */
         AL    REG13,@CF00036                                      0238
*       GENERATE CODE REFS(FLC,PSALITA);                           0239
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,                        **
               RELATED=('INITIALIZATION COMPLETE')
*       REG13=REG13-8;              /* RESTORE SAVE AREA ADDRESS     */
         SL    REG13,@CF00036                                      0240
*       RETURN CODE(0);             /* RETURN AND INDICATE         0241
*                                      INITIALIZATION COMPLETE       */
         L     @13,4(,@13)                                         0241
         L     @00,@SIZDATD                                        0241
         LR    @01,@11                                             0241
         FREEMAIN R,LV=(0),A=(1)
         SLR   @15,@15                                             0241
         L     @14,12(,@13)                                        0241
         LM    @00,@12,20(@13)                                     0241
         BR    @14                                                 0241
*     END;                                                         0242
*DIAGNOSE:                                                         0243
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA,RETREG);                   0243
DIAGNOSE DS    0H                                                  0244
*   IF TVWARTR<=0 THEN              /* TEST FOR RETRY LIMIT EXCEEDED */
         L     @10,PSAAOLD                                         0244
         L     @10,TSBPTR(,@10)                                    0244
         L     @10,TSBEXTNT(,@10)                                  0244
         L     @10,TVWAPTR(,@10)                                   0244
         LH    @10,TVWARTR(,@10)                                   0244
         LTR   @10,@10                                             0244
         BP    @RF00244                                            0244
*     DO;                                                          0245
*       RFY                                                        0246
*         REG2 RSTD;                /* RESTRICT WORK REGSITER        */
*       REG2=IKTMSGS(14)+2;         /* LOAD ADDRESS OF LIST FORM OF
*                                      MACRO                         */
         L     @10,CVTPTR                                          0247
         L     @10,TCASTPTR(,@10)                                  0247
         L     @10,TCASMSGS(,@10)                                  0247
         LA    REG2,2                                              0247
         AL    REG2,IKTMSGS+52(,@10)                               0247
*       GENERATE CODE;                                             0248
          WTO  ,ROUTCDE=(1,8),DESC=4,MF=(E,(2)) RETRY ERROR MESSAGE
*       RETURN;                     /* RETURN TO CALLING ROUTINE     */
@EL00002 DS    0H                                                  0249
@EF00002 DS    0H                                                  0249
@ER00002 BR    @14                                                 0249
*     END;                                                         0250
*   IF ACBERFLG=84×ACBERFLG=88×ACBERFLG=90×ACBERFLG=86 THEN        0251
@RF00244 L     @10,PSAAOLD                                         0251
         L     @10,TSBPTR(,@10)                                    0251
         L     @10,TSBEXTNT(,@10)                                  0251
         L     @10,TVWAPTR(,@10)                                   0251
         L     @10,TVWAACB(,@10)                                   0251
         CLI   ACBERFLG(@10),84                                    0251
         BE    @RT00251                                            0251
         CLI   ACBERFLG(@10),88                                    0251
         BE    @RT00251                                            0251
         CLI   ACBERFLG(@10),90                                    0251
         BE    @RT00251                                            0251
         CLI   ACBERFLG(@10),86                                    0251
         BNE   @RF00251                                            0251
@RT00251 DS    0H                                                  0252
*     DO;                                                          0252
*       REG2=IKTMSGS(15)+2;         /* APPLID SPECIFICATION ERROR  0253
*                                      MESSAGE                       */
         L     @10,CVTPTR                                          0253
         L     @10,TCASTPTR(,@10)                                  0253
         L     @10,TCASMSGS(,@10)                                  0253
         LA    REG2,2                                              0253
         AL    REG2,IKTMSGS+56(,@10)                               0253
*       GENERATE CODE;                                             0254
         WTO   ,ROUTCDE=(1,8),DESC=3,MF=(E,(2))
         LA   15,ACBERR       SET REASON CODE
         ABEND  VTAMERR,DUMP,,SYSTEM     ABEND
*     END;                                                         0255
*                                                                  0255
*/* IF ACBERFLG='70'X THEN DO NOT ABEND OR PUT MSG OUT @ZA25207      */
*/* IF NO ERROR CODE COVERS THE SITUATION OUTPUT FOLLOWING           */
*                                                                  0256
*   IF ACBERFLG^='70'X THEN         /* ABEND ONLY IF ^='70'X @ZA25207*/
@RF00251 L     @10,PSAAOLD                                         0256
         L     @10,TSBPTR(,@10)                                    0256
         L     @10,TSBEXTNT(,@10)                                  0256
         L     @10,TVWAPTR(,@10)                                   0256
         L     @10,TVWAACB(,@10)                                   0256
         CLI   ACBERFLG(@10),X'70'                                 0256
         BE    @RF00256                                            0256
*     DO;                           /* MESSAGE AND ABEND NOW @ZA25207*/
*       REG2=IKTMSGS(16)+2;         /* LOAD ADDRESS OF LIST FORM INTO
*                                      REGISTER                      */
         L     @10,CVTPTR                                          0258
         L     @10,TCASTPTR(,@10)                                  0258
         L     @10,TCASMSGS(,@10)                                  0258
         LA    REG2,2                                              0258
         AL    REG2,IKTMSGS+60(,@10)                               0258
*       GENERATE CODE;                                             0259
         WTO   ,ROUTCDE=(1,8),DESC=4,MF=(E,(2)) UNKNOWN ERROR MESSAGE
         LA    15,ACBERR1   LOAD REASON CODE IN REGISTER
         ABEND  VTAMERR,DUMP,,SYSTEM
*     END;                          /*                       @ZA25207*/
*   ELSE                                                           0261
*     ;                             /* ACBERFLG='70'X, DO NOT ABEND
*                                      OR MESSAGE            @ZA25207*/
@RF00256 DS    0H                                                  0262
*   END DIAGNOSE;                                                  0262
         B     @EL00002                                            0262
*TVWAINIT:                                                         0263
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA,RETREG);                   0263
TVWAINIT DS    0H                                                  0264
*   DECLARE                                                        0264
*     1 INTBUFR CHAR(*) BDY(WORD) BASED(TVWAVST),/* INTERNAL BUFFER
*                                      FOR LOGON MESSAGE             */
*      2 BUFLEN FIXED(15),          /* LENGTH OF BUFFER              */
*      2 BUFOFSET FIXED(15),        /* OFF SET FROM START OF DATA  0264
*                                      AREA                          */
*      2 BUFDATA CHAR(*);           /* LOGON DATA FIELD              */
*   DECLARE                                                        0265
*     1 EXTBUFR CHAR(*) BDY(WORD) BASED(TSBXLBUF),/* LOGON BUFFER IN
*                                      CSA                           */
*      2 EBUFLEN FIXED(15),         /* LENGTH OF BUFFER              */
*      2 EBUFOFS FIXED(15),         /* DATA OFFSET POINTER           */
*      2 EBUFDATA CHAR(*);          /* DATA AREA FOR MESSAGE         */
*   DECLARE                                                        0266
*     TSO CHAR(3) INIT('TSO') STATIC LOCAL;/* CHARACTER CONSTANT     */
*   DECLARE                                                        0267
*     IKTRPLXT EXTERNAL LABEL;                                     0267
*   DECLARE                                                        0268
*     1 INPWA BASED,                                               0268
*                                                                  0268
*/********************************************************************/
*/*                                                                  */
*/*           TSO/VTAM QUEUE MANAGER INPUT SERVICES                  */
*/*           PARAMETER LIST                                         */
*/*                                                                  */
*/*           TSO/VTAM LEVEL 2.0 SU58                                */
*/*                                                                  */
*/*           THE TSO/VTAM QUEUE MANAGER INPUT SERVICES PARAMETER    */
*/*           LIST IS FOR MAPPING THE PARAMETER LIST FOR THE         */
*/*           INPUT QUEUE SERVICES.                                  */
*/*                                                                  */
*/*                                                                  */
*/*           METHOD OF ACCESS                                       */
*/*                BAL - A DSECT IS PRODUCED FOR IPARMS.  USING ON   */
*/*                      IPARMS GIVES ADDRESSABILITY FOR ALL IPARMS  */
*/*                      SYMBOLS.                            @G58SKSR*/
*/*                PL/S- SPECIFY %STRCTR='MAJOR' IF A MAJOR          */
*/*                      STRUCTURE IS DESIRED                        */
*/*                                                                  */
*/*           F. E.'S-                                               */
*/*                MICROFICHE LISTING - IKTIPARM                     */
*/*                                                                  */
*/*           CHANGE ACTIVITY -                                      */
*/*           SEP 77 - TSO/VTAM LEVEL 2.0 SU58               @G58SKSR*/
*/********************************************************************/
*                                                                  0268
*      2 IPARMS BDY(WORD),                                         0268
*        4 IPBUFADR PTR(31),        /* ADDRESS OF BUFFER FOR MESSAGE */
*        4 IPREQ FIXED(8),          /* REQUEST CODE                  */
*        4 IPRC FIXED(8),           /* RETURN CODE                   */
*        4 IPBFSZ FIXED(15),        /* SIZE OF MESSAGE BUFFER        */
*        4 IPFLAGS,                                                0268
*          6 IPALLOC BIT(1),        /* METHOD OF ALLOCATION          */
*          6 * BIT(7),              /* RESERVED                      */
*          6 IPAVBL BIT(1),         /* THIS MESSAGE IS AVAILABLE     */
*          6 IPPRMPT BIT(1),                                       0268
*          6 IPPRTL BIT(1),                                        0268
*          6 * BIT(5),              /* RESERVED                      */
*          6 IPCCC FIXED(8),        /* CONTROL CHARACTER COUNT       */
*          6 IPTRMTYP FIXED(8),     /* TERMINAL TYPE                 */
*        4 * FIXED(15),             /* RESERVED                      */
*        4 IPNXBFSZ FIXED(15),      /* SIZE OF NEXT MESSAGE          */
*        4 IPNXFLGS,                /* FLAGS OF NEXT MESSAGE         */
*          6 IPNXALC BIT(1),        /* METHOD OF ALLOCATION          */
*          6 * BIT(7),              /* RESERVED                      */
*          6 IPNXAVBL BIT(1),       /* THIS MESSAGE IS AVAILABLE     */
*          6 IPNXPMT BIT(1),                                       0268
*          6 IPNXPRTL BIT(1),                                      0268
*          6 * BIT(5),              /* RESERVED                      */
*          6 IPNXCCC FIXED(8),      /* CONTROL CHARACTER COUNT       */
*          6 IPNXTMTP FIXED(8),     /* TERMINAL TYPE                 */
*      2 IPARMLST FIXED(31);        /* END OF INPUT PARAMETERS       */
*   DECLARE                                                        0269
*     1 OUTPWA BASED,                                              0269
*                                                                  0269
*/********************************************************************/
*/*                                                                  */
*/*           TSO/VTAM QUEUE MANAGER OUTPUT SERVICES                 */
*/*           PARAMETER LIST                                         */
*/*                                                                  */
*/*           TSO/VTAM LEVEL 2.0 SU58                                */
*/*                                                                  */
*/*           THE TSO/VTAM QUEUE MANAGER OUTPUT SERVICES PARAMETER   */
*/*           LIST IS FOR MAPPING THE PARAMETER LIST FOR THE         */
*/*           OUTPUT QUEUE SERVICES.                                 */
*/*                                                                  */
*/*                                                                  */
*/*           METHOD OF ACCESS                                       */
*/*                BAL - A DSECT IS PRODUCED FOR OPARMS. USING ON    */
*/*                      OPARMS GIVES ADDRESSABILITY FOR ALL OPARMS  */
*/*                      SYMBOLS.                            @G58SKSR*/
*/*                PL/S- SPECIFY %STRCTR='MAJOR' IF A MAJOR          */
*/*                      STRUCTURE IS DESIRED                        */
*/*                                                                  */
*/*           F. E.'S-                                               */
*/*                MICROFICHE LISTING - IKTOPARM                     */
*/*                                                                  */
*/*           CHANGE ACTIVITY -                                      */
*/*           SEP 77 - TSO/VTAM LEVEL 2.0 SU58               @G58SKSR*/
*/********************************************************************/
*                                                                  0269
*      2 OPARMS BDY(WORD),                                         0269
*        4 OPBUFADR PTR(31),        /* ADDRESS OF MESSAGE BUFFER     */
*        4 OPREQ FIXED(8),          /* REQUEST CODE                  */
*        4 OPRC FIXED(8),           /* RETURN CODE                   */
*        4 OPBFSZ FIXED(15),        /* SIZE OF MESSAGE BUFFER        */
*        4 OPFLAGS,                                                0269
*          6 OPALLOC BIT(1),        /* ALLOCATION METHOD             */
*          6 OPADTOP BIT(1),        /* THIS ELEMENT ADDED TO TOP OF
*                                      QUEUE                         */
*          6 * BIT(6),              /* RESERVED                      */
*          6 OPOPTNS,               /* OUTPUT OPTIONS                */
*            8 OPHOLD BIT(1),       /* TPUT HOLD INDICATOR           */
*            8 OPBRK BIT(1),        /* TPUT BREAKIN INDICATOR        */
*            8 OPEDIT BIT(2),       /* EDIT OPTIONS                  */
*            8 OPASID BIT(1),       /* ASID TPUT INDICATOR           */
*            8 * BIT(3),                                           0269
*          6 * CHAR(1),                                            0269
*          6 * CHAR(1),             /* RESERVED                      */
*        4 * FIXED(15),                                            0269
*        4 OPNXBFSZ FIXED(15),                                     0269
*        4 OPNXFLGS,                                               0269
*          6 OPNXALC BIT(1),        /* ALLOCATION METHOD             */
*          6 OPNXADTP BIT(1),       /* THIS ELEMENT ADDED TO TOP OF
*                                      QUEUE                         */
*          6 * BIT(6),              /* RESERVED                      */
*          6 OPNXHOLD BIT(1),       /* TPUT HOLD INDICATOR           */
*          6 OPNXBRK BIT(1),                                       0269
*          6 OPNXEDIT BIT(2),       /* EDIT OPTIONS                  */
*          6 OPNXASID BIT(1),                                      0269
*          6 * BIT(3),                                             0269
*          6 * CHAR(1),                                            0269
*          6 * CHAR(1),             /* RESERVED                      */
*      2 OPARMLST FIXED(31);        /* END OF OUTPUT PARAMETERS      */
*/********************************************************************/
*/* ALLOCATE STORAGE FOR TVWA,LOCAL LOGON BUFFER,VTAM CONTROL BLOCKS */
*/* AND LOCAL LOCK WORK AREA FROM SUBPOOL 229                        */
*/********************************************************************/
*                                                                  0270
*   RFY                                                            0270
*     REG14 RSTD;                                                  0270
*   AUXSAVE=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,AUXSAVE(,REG13)                               0271
*   RFY                                                            0272
*     REG14 UNRSTD;                                                0272
*   RFY                                                            0273
*    (REG1,                                                        0273
*     REG2) RSTD;                                                  0273
*   REG0=4096;                      /* INSERT THE LENGTH OF AREA     */
         L     REG0,@CF02966                                       0274
*   REG2=TVKEY;                     /* LOAD TSO VTAM STORAGE KEY     */
         SLR   REG2,REG2                                           0275
         IC    REG2,TVKEY                                          0275
*   GENERATE CODE;                                                 0276
         MODESET KEYADDR=(2) PSW KEY FOR SP229
         GETMAIN RC,BNDRY=PAGE,LV=(0),SP=229 GET KEY 6 STORAGE
         MODESET EXTKEY=ZERO,SAVEKEY=(2)
*   IF RETCODE^=0 THEN              /* CHECK FOR GETMAIN FAILURE     */
         LTR   RETCODE,RETCODE                                     0277
         BZ    @RF00277                                            0277
*     DO;                                                          0278
*       RFY                                                        0279
*         REG14 RSTD;                                              0279
*       REG14=AUXSAVE;              /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0280
*       RETURN CODE(4);             /* RETURN ERROR CODE             */
         LA    @15,4                                               0281
@EL00003 DS    0H                                                  0281
@EF00003 DS    0H                                                  0281
@ER00003 BR    @14                                                 0281
*       RFY                                                        0282
*         REG14 UNRSTD;                                            0282
*     END;                                                         0283
*                                                                  0283
*/****************************************************************** */
*/*                                                                  */
*/* ESTABLISH TVWA LINKAGE TO TSB AND THE INTERNAL BUFFER TO TVWA    */
*/*                                                                  */
*/****************************************************************** */
*                                                                  0284
*   TSBXTVWA=REG1;                  /* INSERT ADDRESS OF WORK AREA 0284
*                                      INTO TSBX                     */
@RF00277 L     @10,PSAAOLD                                         0284
         L     @10,TSBPTR(,@10)                                    0284
         L     @10,TSBEXTNT(,@10)                                  0284
         ST    REG1,TSBXTVWA(,@10)                                 0284
*   TVWA=TVWA&&TVWA;                /* ZERO CORE FOR TVWA            */
         L     @03,TVWAPTR(,@10)                                   0285
         XC    TVWA(216,@03),TVWA(@03)                             0285
*   TCBPKF=KEY8;                    /* INSERT PROTECT KEY 8 INTO TCB */
         L     @03,TCBPTR                                          0286
         MVI   TCBPKF(@03),X'80'                                   0286
*   REG0=EBUFLEN×'01000000'X;       /* LOAD LENGTH OF BUFFER AND   0287
*                                      SUBPOOL 1 ID INTO REGISTER 0  */
         L     @10,TSBXLBUF(,@10)                                  0287
         LH    REG0,EBUFLEN(,@10)                                  0287
         O     REG0,@CF02967                                       0287
*   GENERATE CODE                   /* GETMAIN KEY ZERO STORAGE FOR
*                                      BUFFER                        */
*       ;                                                          0288
         GETMAIN R,LV=(0)
*   TCBPKF=KEY0;                    /* RESTORE KEY 0                 */
         L     @10,TCBPTR                                          0289
         MVI   TCBPKF(@10),X'00'                                   0289
*   RFY                                                            0290
*     REG2 UNRSTD;                  /* UNRESTRICT WORK REGISTER      */
*   TVWAVST=REG1;                   /* INSERT ADDRESS OF INTERNAL  0291
*                                      BUFFER INTO TVWA              */
         L     @10,PSAAOLD                                         0291
         L     @10,TSBPTR(,@10)                                    0291
         L     @10,TSBEXTNT(,@10)                                  0291
         L     @15,TVWAPTR(,@10)                                   0291
         ST    REG1,TVWAVST(,@15)                                  0291
*   TVWAVSZ=EBUFLEN;                /* INSERT BUFFER LENGTH INTO TVWA*/
         L     @14,TSBXLBUF(,@10)                                  0292
         LH    @09,EBUFLEN(,@14)                                   0292
         STH   @09,TVWAVSZ(,@15)                                   0292
*/****************************************************************** */
*/*                                                                  */
*/*BRING ACROSS THE LOGON MESSAGE RECEIVED BY  TCAS IN THE LOGON     */
*/* EXIT                                                             */
*/*                                                                  */
*/****************************************************************** */
*                                                                  0293
*   INTBUFR(1:EBUFLEN)=EXTBUFR(1:EBUFLEN);/* MOVE LOGON MESSAGE TO 0293
*                                      INTERNAL BUFFER               */
         L     @08,PSAAOLD                                         0293
         L     @08,TSBPTR(,@08)                                    0293
         L     @08,TSBEXTNT(,@08)                                  0293
         L     @08,TVWAPTR(,@08)                                   0293
         L     @08,TVWAVST(,@08)                                   0293
         LR    @07,@09                                             0293
         BCTR  @07,0                                               0293
         EX    @07,@SM03007                                        0293
*   EXTBUFR(3:EBUFLEN)=EXTBUFR(3:EBUFLEN)&&EXTBUFR(3:EBUFLEN);/* ZERO
*                                      CSA BUFFER AND LEAVE LENGTH 0294
*                                      VALUE                 @YM03236*/
         SL    @09,@CF00072                                        0294
         EX    @09,@SX03009                                        0294
*   TVWATCB=PSATOLD;                /* INSERT ADDRESS OF TCB INTO  0295
*                                      TVWA                          */
         L     @14,PSATOLD                                         0295
         ST    @14,TVWATCB(,@15)                                   0295
*   RFY                                                            0296
*     REG1 UNRSTD;                  /* UNRESTRICT GETMAIN ADDRESS  0296
*                                      REGISTER                      */
*/********************************************************************/
*/*                                                                  */
*/* ESTABLISH AN ACB FOR THIS TSO USER ADDRESS SPACE IN ALLOCATED    */
*/* LOCAL STORAGE                                                    */
*/*                                                                  */
*/********************************************************************/
*                                                                  0297
*   TVWAACB=TSBXTVWA+LENGTH(TVWA);  /* INSERT ADDRESS OF ACB STORAGE */
         LA    @01,216                                             0297
         AL    @01,TSBXTVWA(,@10)                                  0297
         ST    @01,TVWAACB(,@15)                                   0297
*   IFGACB=DUMACB;                  /* MOVE DUMMY ACB INTO ALLOCATED
*                                      STORAGE                       */
         MVC   IFGACB(88,@01),DUMACB                               0298
*/*                                                                  */
*/* CREATE AN APPLID OUT OF THE INDEX NUMBER IN THE TSB.  THIS IS A  */
*/* UNIQUE NUMBER ASSIGNED BY TCAS IN CHAINING THE TSB ONTO THE TSB  */
*/*                                                                  */
*                                                                  0299
*   CVD(TSBXAIND,TSBXUID);          /* CONVERT INDEX TO ZONED DECIMAL*/
         LH    @14,TSBXAIND(,@10)                                  0299
         CVD   @14,TSBXUID(,@10)                                   0299
*   UNPK(TVWAPPL,TSBXUID);          /* CONVERT PACKED DECIMAL TO   0300
*                                      ZONED DECIMAL                 */
         UNPK  TVWAPPL(8,@15),TSBXUID(8,@10)                       0300
*   TVWAPPL(8)=TVWAPPL(8)×'F0'X;    /* COVER SIGN ZONE               */
         OI    TVWAPPL+7(@15),X'F0'                                0301
*   TVWAPPL(2:4)=TSO;               /* INSERT CHARACTERS TSO INTO  0302
*                                      APPLID                        */
         MVC   TVWAPPL+1(3,@15),TSO                                0302
*   TVWAPPL(1)='07'X;               /* INSERT LENGTH VALUE           */
         MVI   TVWAPPL(@15),X'07'                                  0303
*   ACBAPID=ADDR(TVWAPPL);          /* INSERT APPLID ADDRESS         */
         ST    @15,ACBAPID(,@01)                                   0304
*   IF TCASACBP^=NULPSWRD THEN      /* CHECK FOR PASS WORD         0305
*                                      SPECIFICATION         @YM03212*/
         L     @10,CVTPTR                                          0305
         L     @10,TCASTPTR(,@10)                                  0305
         CLC   TCASACBP(8,@10),NULPSWRD                            0305
         BE    @RF00305                                            0305
*     DO;                           /*                       @YM03213*/
*       PASLEN=LENGTH(TCASACBP);    /* INSERT LENGTH OF PASS WORD  0307
*                                                            @YM03212*/
         MVI   PASLEN(REG13),X'08'                                 0307
*       PASSWRD=TCASACBP;           /* INSERT PASS WORD      @YM03212*/
         MVC   PASSWRD(8,REG13),TCASACBP(@10)                      0308
*       ACBPASSW=ADDR(PSWCHAR);     /* INSERT ADDRESS OF PASSWORD  0309
*                                      INTO ACB              @YM03212*/
         LA    @10,PSWCHAR(,REG13)                                 0309
         ST    @10,ACBPASSW(,@01)                                  0309
*     END;                          /*                       @YM03212*/
*/********************************************************************/
*/*                                                                  */
*/* ESTABLISH A NIB FOR THIS TSO USER IN THE ALLOCATED LOCAL STORAGE */
*/*                                                                  */
*/********************************************************************/
*                                                                  0311
*   TVWANIB=TVWAACB+LENGTH(IFGACB); /* INSERT ADDRESS OF NIB INTO  0311
*                                      TVWA                          */
@RF00305 L     @10,PSAAOLD                                         0311
         L     @01,TSBPTR(,@10)                                    0311
         L     @15,TSBEXTNT(,@01)                                  0311
         L     @14,TVWAPTR(,@15)                                   0311
         LA    @09,88                                              0311
         AL    @09,TVWAACB(,@14)                                   0311
         ST    @09,TVWANIB(,@14)                                   0311
*   ISTNIB=DUMNIB;                  /* MOVE NIB INTO ALLOCATED     0312
*                                      STORAGE                       */
         MVC   ISTNIB(64,@09),DUMNIB                               0312
*   NIBSYM=TSBTRMID;                /* INSERT TERMINAL ID INTO NIB 0313
*                                                            @G32TKKM*/
         MVC   NIBSYM(8,@09),TSBTRMID(@01)                         0313
*   NIBUSER=ASCBTSB;                /* INSERT ADDRESS OF TSB INTO NIB*/
         L     @10,ASCBTSB(,@10)                                   0314
         ST    @10,NIBUSER(,@09)                                   0314
*   IF TSBXTMTP>4×TSBXTMTP<=0 THEN  /* CHECK FOR RANGE OF RECOGNIZED
*                                      TERMINAL TYPES        @G58AK3A*/
         CLI   TSBXTMTP(@15),4                                     0315
         BH    @RT00315                                            0315
         CLI   TSBXTMTP(@15),0                                     0315
         BH    @RF00315                                            0315
@RT00315 DS    0H                                                  0316
*     DO;                                                          0316
*       RFY                                                        0317
*         REG14 RSTD;                                              0317
*       REG14=AUXSAVE;                                             0318
         L     REG14,AUXSAVE(,REG13)                               0318
*       RETURN CODE(4);             /* RETURN INDICATING ERROR       */
         LA    @15,4                                               0319
         BR    @14                                                 0319
*       RFY                                                        0320
*         REG14 UNRSTD;                                            0320
*     END;                                                         0321
*   ELSE                            /* RANGE IS ACCEPTABLE           */
*     IF TSBXTMTP=3 THEN            /*                       @G58AK3A*/
@RF00315 L     @10,PSAAOLD                                         0322
         L     @01,TSBPTR(,@10)                                    0322
         L     @10,TSBEXTNT(,@01)                                  0322
         CLI   TSBXTMTP(@10),3                                     0322
         BNE   @RF00322                                            0322
*       NIBNDAR=ADDR(BINDUSER);     /* INSERT ADDRESS OF USER BIND 0323
*                                                            @G58AK3A*/
         L     @01,TVWAPTR(,@10)                                   0323
         L     @01,TVWANIB(,@01)                                   0323
         L     @10,@CA02866                                        0323
         ST    @10,NIBNDAR(,@01)                                   0323
*     ELSE                          /*                       @G58AK3A*/
*       NIBNDAR=ADDR(TSBXBIND);     /* INSERT ADDRESS OF BIND IMAGE
*                                                            @G58AK3A*/
         B     @RC00322                                            0324
@RF00322 L     @10,PSAAOLD                                         0324
         L     @01,TSBPTR(,@10)                                    0324
         L     @10,TSBEXTNT(,@01)                                  0324
         L     @01,TVWAPTR(,@10)                                   0324
         L     @01,TVWANIB(,@01)                                   0324
         LA    @10,TSBXBIND(,@10)                                  0324
         ST    @10,NIBNDAR(,@01)                                   0324
*/********************************************************************/
*/*                                                                  */
*/* ESTABLISH AN RPL FOR THIS TSO USER IN ALLOCATED STORAGE LOCAL TO */
*/* THE USER'S ADDRESS SPACE.  IT WILL BE SET UP FOR A BIND TO THE   */
*/* TERMINAL ASSOCIATED WITH THIS ADDRESS SPACE.                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0325
*   TVWARPL=TVWANIB+LENGTH(ISTNIB); /* INSERT ADDRESS OF RPL INTO  0325
*                                      TVWA                          */
@RC00322 L     @10,PSAAOLD                                         0325
         L     @01,TSBPTR(,@10)                                    0325
         L     @01,TSBEXTNT(,@01)                                  0325
         L     @10,TVWAPTR(,@01)                                   0325
         L     @01,TVWANIB(,@10)                                   0325
         LA    @15,64                                              0325
         ALR   @15,@01                                             0325
         ST    @15,TVWARPL(,@10)                                   0325
*   IFGRPL=DUMRPL;                  /* MOVE RPL INTO WORK AREA       */
         MVC   IFGRPL(112,@15),DUMRPL                              0326
*   RPLDACB=TVWAACB;                /* INSERT ACB ADDRESS INTO RPL   */
         L     @14,TVWAACB(,@10)                                   0327
         ST    @14,RPLDACB(,@15)                                   0327
*   RPLARG=TVWANIB;                 /* INSERT NIB ADDRESS INTO RPL   */
         ST    @01,RPLARG(,@15)                                    0328
*   RPLECB=ADDR(IKTRPLXT);          /* INSERT ENTRY ADDRESS FOR    0329
*                                      OPNDST EXIT                   */
         L     @01,@CV02906                                        0329
         ST    @01,RPLECB(,@15)                                    0329
*   RPLEXIT='1'B;                   /* TURN ON FLAG TO INDICATE EXIT
*                                      ADDRESS                       */
         OI    RPLEXIT(@15),B'00100000'                            0330
*   TVWADLST=INITLST;               /* MOVE THE ADDRESSES OF ALL THE
*                                      INITIALIZATION PROCEDURES INTO
*                                      THE TVWA ALL AT ONCE          */
         MVC   TVWADLST(12,@10),INITLST                            0331
*   TVWALLWA=TVWARPL+LENGTH(IFGRPL);/* INITIALIZE POINTER TO LOCAL 0332
*                                      LOCK WORK AREA                */
         AL    @15,@CF03004                                        0332
         ST    @15,TVWALLWA(,@10)                                  0332
*/********************************************************************/
*/*                                                                  */
*/* ESTABLISH EXLST CONTROL BLOCK TO DEFINE LOSTERM EXIT FOR THIS    */
*/* TSO USER ADDRESS SPACE IN ALLOCATED LOCAL STORAGE                */
*/*                                                                  */
*/********************************************************************/
*                                                                  0333
*   TVWAEXL=TVWALLWA+EVAL(88+MAX(LENGTH(INPWA),LENGTH(OUTPWA)));/* 0333
*                                      DETERMINE THE ADDRESS OF THE
*                                      SPACE ALLOCATED FOR THE     0333
*                                      CONTROL BLOCK                 */
         AL    @15,@CF03004                                        0333
         ST    @15,TVWAEXL(,@10)                                   0333
*   IFGEXLST=DUMXLST;               /* MOVE IN PRIMED COPY OF EXLST  */
         MVC   IFGEXLST(65,@15),DUMXLST                            0334
*   EXLNLGNP=TCASLTE;               /* INSERT LOSTERM ENTRY ADDRESS
*                                      FROM TCAS TABLE               */
         L     @10,CVTPTR                                          0335
         L     @10,TCASTPTR(,@10)                                  0335
         MVC   EXLNLGNP(4,@15),TCASLTE(@10)                        0335
*   EXLTPNDP=TCASTPND;              /* TPEND ENTRY ADDRESS FROM TCAS
*                                      TABLE                 @ZM21019*/
         MVC   EXLTPNDP(4,@15),TCASTPND(@10)                       0336
*   ACBUEL=TVWAEXL;                 /* INSERT ADDRESS OF EXLST INTO
*                                      ACB                           */
         ST    @15,ACBUEL(,@14)                                    0337
*   RFY                                                            0338
*     REG14 RSTD;                                                  0338
*   REG14=AUXSAVE;                  /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0339
*   RFY                                                            0340
*     REG14 UNRSTD;                                                0340
*   RETURN CODE(0);                 /* RETURN TO CALLER              */
         SLR   @15,@15                                             0341
         BR    @14                                                 0341
*   END TVWAINIT;                                                  0342
*TERMCON:                                                          0343
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA,RETREG);                   0343
TERMCON  DS    0H                                                  0344
*   DECLARE                                                        0344
*     CSCBPTR DEFINED(ASCBCSCB);    /* POINTER DEFINED IN ASCB       */
*   DECLARE                                                        0345
*     WEREG REGISTER(4),            /* ADDRESS OF WORK ELEMENT       */
*     QHREG REGISTER(5),            /* ADDRESS OF WORK ELEMENT ON  0345
*                                      QUEUE                         */
*     ANCHREG REGISTER(6);          /* ADDRESS OF WORK ELEMENT QUEUE */
*   RFY                                                            0346
*     REG14 RSTD;                                                  0346
*   AUXSAVE=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,AUXSAVE(,REG13)                               0347
*   RFY                                                            0348
*    (RPLREG) RSTD;                 /* RESTRICT GP REGISTERS         */
*   TVWARTR=ADDR(RETRYMAX);         /* INITIALIZE RETRY COUNTER      */
         L     @15,PSAAOLD                                         0349
         L     @01,TSBPTR(,@15)                                    0349
         L     @01,TSBEXTNT(,@01)                                  0349
         L     @15,TVWAPTR(,@01)                                   0349
         SLR   @01,@01                                             0349
         LA    @10,RETRYMAX(,@01)                                  0349
         STH   @10,TVWARTR(,@15)                                   0349
*   RPLREG=TVWARPL;                 /* LOAD RPL ADDRESS INTO REGISTER
*                                      1                             */
         L     RPLREG,TVWARPL(,@15)                                0350
*   GENERATE CODE( OPNDST  RPL=(RPLREG));/* ISSUE QUEUED BIND COMMAND*/
          OPNDST  RPL=(RPLREG)
*/********************************************************************/
*/* TEST FOR A FAILURE IN THE ASYNCHRONOUS BIND, INITIALLY           */
*/********************************************************************/
*                                                                  0352
*   RFY                                                            0352
*     RETCODE RSTD;                 /* RESTRICT RETURN CODE REGISTER */
*   DO WHILE RETCODE^=0;            /* TEST FOR UNSUCCESSFUL RETURN
*                                      CODE                          */
         B     @DE00353                                            0353
@DL00353 DS    0H                                                  0354
*     IF RETCODE=4&REG0=8 THEN      /* TEST FOR RETRYABLE ERROR      */
         LA    @10,4                                               0354
         CR    RETCODE,@10                                         0354
         BNE   @RF00354                                            0354
         C     REG0,@CF00036                                       0354
         BNE   @RF00354                                            0354
*       DO;                                                        0355
*         TVWARTR=TVWARTR-1;        /* DECREMENT COUNTER             */
         L     @03,PSAAOLD                                         0356
         L     @01,TSBPTR(,@03)                                    0356
         L     @01,TSBEXTNT(,@01)                                  0356
         L     @03,TVWAPTR(,@01)                                   0356
         LH    @01,TVWARTR(,@03)                                   0356
         BCTR  @01,0                                               0356
         STH   @01,TVWARTR(,@03)                                   0356
*         IF TVWARTR<=0 THEN                                       0357
         LTR   @01,@01                                             0357
         BP    @RF00357                                            0357
*           DO;                                                    0358
*             RFY                                                  0359
*               RETCODE UNRSTD;     /* UNRESTRICT RETURN CODE      0359
*                                      REGISTER                      */
*             REG14=AUXSAVE;        /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0360
*             RETURN CODE(4);       /* RETURN TO CALLER AND INDICATE
*                                      TERMINAL REQUEST FAILURE      */
         LR    @15,@10                                             0361
@EL00004 DS    0H                                                  0361
@EF00004 DS    0H                                                  0361
@ER00004 BR    @14                                                 0361
*             RFY                                                  0362
*               RETCODE RSTD;       /* RESTRICT REURN CODE REGISTER  */
*           END;                                                   0363
*         ELSE                      /* RETRY COUNT GREATER THAN ZERO */
*           DO;                                                    0364
@RF00357 DS    0H                                                  0365
*             GENERATE CODE(EXECRPL RPL=(RPLREG));/* RETRY OPERATION */
         EXECRPL RPL=(RPLREG)
*           END;                                                   0366
*       END;                                                       0367
*     ELSE                          /* RETRY NOT POSSIBLE INDICATED
*                                      BY RETURN CODE                */
*       DO;                                                        0368
         B     @RC00354                                            0368
@RF00354 DS    0H                                                  0369
*         RFY                                                      0369
*           RETCODE UNRSTD;         /* UNRESTRICT RETURN CODE      0369
*                                      REGISTER                      */
*         REG14=AUXSAVE;            /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0370
*         RETURN CODE(4);           /* RETURN TO CALLER AND INDICATE
*                                      FAILURE                       */
         LA    @15,4                                               0371
         BR    @14                                                 0371
*         RFY                                                      0372
*           RETCODE RSTD;           /* RESTRICT RETURN CODE REGISTER */
*       END;                                                       0373
*   END;                            /* END OF LOOP                   */
@RC00354 DS    0H                                                  0374
@DE00353 SLR   @10,@10                                             0374
         CR    RETCODE,@10                                         0374
         BNE   @DL00353                                            0374
*   RFY                                                            0375
*    (RPLREG,                                                      0375
*     REG14) UNRSTD;                /* UNRESTRICT GP REGISTERS       */
*   RFY                                                            0376
*     RETCODE UNRSTD;               /* UNRESTRICT RETURN CODE      0376
*                                      REGISTER                      */
*/********************************************************************/
*/* REQUEST TERMINAL CONTROL FROM TCAS                               */
*/********************************************************************/
*                                                                  0377
*   TVWAECB=0;                      /* ZERO TERMINAL CONTROL ECB     */
         L     @01,PSAAOLD                                         0377
         L     @15,TSBPTR(,@01)                                    0377
         L     @15,TSBEXTNT(,@15)                                  0377
         L     @14,TVWAPTR(,@15)                                   0377
         ST    @10,TVWAECB(,@14)                                   0377
*   RFY                                                            0378
*     ECB BASED(ADDR(TSBXECB));     /* BASE ECB ON TSBXECB           */
*   IF TCASABND='0'B&ECBPOSTB='0'B THEN/* TEST FOR REQUEST FOR ABEND
*                                      ORTCAS ABEND                  */
         L     @10,CVTPTR                                          0379
         L     @10,TCASTPTR(,@10)                                  0379
         TM    TCASABND(@10),B'00100000'                           0379
         BNZ   @RF00379                                            0379
         TM    ECBPOSTB+8(@15),B'01000000'                         0379
         BNZ   @RF00379                                            0379
*     DO;                                                          0380
*       WESTD=WESTD&&WESTD;         /* ZERO WORK ELEMENT             */
         L     @09,TSBXLBUF(,@15)                                  0381
         XC    WESTD(68,@09),WESTD(@09)                            0381
*       WECODE1F='21'X;             /* INSERT FUNCTION CODE        0382
*                                      INDICATING REQUEST FOR TERM   */
         MVI   WECODE1F(@09),X'21'                                 0382
*       WEUASCB=ADDR(ASCB);         /* INSERT ADDRESS OF ASCB        */
         ST    @01,WEUASCB(,@09)                                   0383
*       WEUECB=ADDR(TSBXECB);       /* INSERT ADDRESS OF CANCEL ECB  */
         LA    @01,TSBXECB(,@15)                                   0384
         ST    @01,WEUECB(,@09)                                    0384
*       WEVRPL=TSBXRPL;             /* INSERT ADDRESS OF RPL PASSED
*                                      FROM TCAS                     */
         L     @01,TSBXRPL(,@15)                                   0385
         ST    @01,WEVRPL(,@09)                                    0385
*/*                                                                  */
*/*                    INSERT ON TERMINAL CONTROL QUEUE              */
*/*                                                                  */
*                                                                  0386
*       RFY                                                        0386
*        (WEREG,                                                   0386
*         QHREG,                                                   0386
*         ANCHREG) RSTD;            /* RESTRICT WORK REGISTERS       */
*       WEREG=TSBXLBUF;             /* LOAD ADDRESS OF NEW WORK    0387
*                                      ELEMENT                       */
         LR    WEREG,@09                                           0387
*       WELEN=TVWAVSZ;              /* INSERT LENGTH OF WORK ELEMENT
*                                      TO BE FREED                   */
         LH    @07,TVWAVSZ(,@14)                                   0388
         STH   @07,WELEN(,@09)                                     0388
*       RFY                                                        0389
*         WESTD BASED(WEREG);       /* BASE WORKELEMENT ON ADDRESS IN
*                                      REGISTER                      */
*       QHREG=TCASTTQH;             /* GET THE ADDRESS OF THE CURRENT
*                                      ELEMENT FROM THE QUEUE        */
         L     QHREG,TCASTTQH(,@10)                                0390
*       ANCHREG=ADDR(TCASTTQH);     /* LOAD THE ADDRESS OF THE ANCHOR
*                                      LOCATION                      */
         LA    ANCHREG,TCASTTQH(,@10)                              0391
*       GENERATE CODE REFS(WENEXT);                                0392
REDO      LTR  QHREG,QHREG        LOAD REGISTER TO SET CONDITION CODE
          BNM  NOEXIT             BRANCH TO ROUTINE
          B    EXIT               BRANCH TO EXIT INSTRUCTIONS
NOEXIT    ST  QHREG,WENEXT(WEREG)  INSERT ADDRESS OF CURRENT WORK     **
               ELEMENT INTO NEXT WORK ELEMENT LOCATION
          CS  QHREG,WEREG,0(ANCHREG)    COMPARE AND SWAP ON ANCHOR    **
               LOCATION
          BNE  REDO        IF NOT EQUAL RETRY UNTIL YOU GET IT RIGHT.
*       TSBXLBUF=0;                 /* ZERO POINTER TO WORK ELEMENT
*                                      SPACE -IN USE-                */
         L     @10,PSAAOLD                                         0393
         L     @01,TSBPTR(,@10)                                    0393
         L     @01,TSBEXTNT(,@01)                                  0393
         SLR   @10,@10                                             0393
         ST    @10,TSBXLBUF(,@01)                                  0393
*       RFY                                                        0394
*        (WEREG,                                                   0394
*         QHREG,                                                   0394
*         ANCHREG) UNRSTD;          /* UNRESTRICT WORK REGISTERS     */
*     END;                                                         0395
*   ELSE                                                           0396
*     DO;                                                          0396
         B     @RC00379                                            0396
@RF00379 DS    0H                                                  0397
*EXIT:                                                             0397
*       RFY                                                        0397
*         REG14 RSTD;                                              0397
EXIT     DS    0H                                                  0398
*       REG14=AUXSAVE;              /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0398
*       RFY                                                        0399
*         REG14 UNRSTD;                                            0399
*       RETURN CODE(4);             /* INDICATE THAT TERMINAL CONTROL
*                                      IS NOT AVAILABLE BECAUSE OF 0400
*                                      TCAS PROBLEM                  */
         LA    @15,4                                               0400
         BR    @14                                                 0400
*     END;                                                         0401
*                                                                  0401
*/********************************************************************/
*/* POST TCAS TO INFORM THAT THERE IS A REQUEST ON THE TERMINAL      */
*/* REQUEST QUEUE AND WAIT FOR RESPONSE FROM TCAS                    */
*/********************************************************************/
*                                                                  0402
*   TVWAECB1=ADDR(TSBXECB);         /* INSERT ADDRESS OF TCAS CANCEL
*                                      ECB                           */
@RC00379 L     @10,PSAAOLD                                         0402
         L     @01,TSBPTR(,@10)                                    0402
         L     @10,TSBEXTNT(,@01)                                  0402
         L     @01,TVWAPTR(,@10)                                   0402
         LA    @10,TSBXECB(,@10)                                   0402
         ST    @10,TVWAECB1(,@01)                                  0402
*   TVWAECB2=ADDR(TVWAECB)×'80000000'X;/* INDICATE END WAITLIST AND
*                                      INSERT ADDRESS OF LAST ECB    */
         LA    @10,TVWAECB(,@01)                                   0403
         O     @10,@CF02869                                        0403
         ST    @10,TVWAECB2(,@01)                                  0403
*   RFY                                                            0404
*    (REG3,                                                        0404
*     REG2,                                                        0404
*     REG4) RSTD;                                                  0404
*   REG3=TCASXECB;                  /* INSERT ADDRESS OF TCAS      0405
*                                      TERMINAL ECB                  */
         L     @10,CVTPTR                                          0405
         L     @10,TCASTPTR(,@10)                                  0405
         L     REG3,TCASXECB(,@10)                                 0405
*   REG2=TCASASCB;                  /* GET ADDRESS OF TCAS ASCB FROM
*                                      TCAS TABLE                    */
         L     REG2,TCASASCB(,@10)                                 0406
*   RFY                                                            0407
*     MACAREA BASED(REG13);         /* BASE MACRO AREA ON SAVA AREA
*                                      ADDRESS                       */
*   MACAREA=POSTMAC;                /* MOVE LIST FORM OF MACRO TO  0408
*                                      DYNAMIC AREA                  */
         MVI   MACAREA+12(REG13),C' '                              0408
         MVC   MACAREA+13(7,REG13),MACAREA+12(REG13)               0408
         MVC   MACAREA(12,REG13),POSTMAC                           0408
*   REG4=ADDR(MACAREA);             /* INSERT ADDRESS OF LIST FORM OF
*                                      MACRO                         */
         LA    REG4,MACAREA(,REG13)                                0409
*   ERRETADD=AUXSAVE;               /* INSERT RETURN ADDRESS FOR   0410
*                                      ERROR EXIT                    */
         L     @10,AUXSAVE(,REG13)                                 0410
         ST    @10,ERRETADD(,REG13)                                0410
*   GENERATE CODE( POST  (3),,ASCB=(2),MF=(E,(4))    );/* POST TCAS  */
          POST  (3),,ASCB=(2),MF=(E,(4))
*   RFY                                                            0412
*     REG1 RSTD;                                                   0412
*   RFY                                                            0413
*    (REG2,                                                        0413
*     REG3,                                                        0413
*     REG4) UNRSTD;                                                0413
*   REG1=ADDR(TVWAECBL);            /* GET ADDRESS OF ECBLIST        */
         L     @10,PSAAOLD                                         0414
         L     @10,TSBPTR(,@10)                                    0414
         L     @10,TSBEXTNT(,@10)                                  0414
         L     REG1,TVWAPTR(,@10)                                  0414
         LA    REG1,TVWAECBL(,REG1)                                0414
*   GENERATE CODE( WAIT ECBLIST=(1));/* WAIT ON ECBLIST FOR CONTROL  */
          WAIT ECBLIST=(1)
*/********************************************************************/
*/*  DETERMINE THE ACTION TO BE TAKEN BY CHECKING THE VARIOUS ECBS   */
*/********************************************************************/
*                                                                  0416
*   RFY                                                            0416
*     ECB BASED(ADDR(TVWAECB));     /* ESTABLISH ADDRESSABILITY TO 0416
*                                      TVWA ECB                      */
*   IF ECBPOSTB='0'B THEN           /* CHECK FOR NO POST             */
         L     @10,PSAAOLD                                         0417
         L     @10,TSBPTR(,@10)                                    0417
         L     @10,TSBEXTNT(,@10)                                  0417
         L     @10,TVWAPTR(,@10)                                   0417
         TM    ECBPOSTB+112(@10),B'01000000'                       0417
         BNZ   @RF00417                                            0417
*     DO;                           /* THIS MEANS THAT A CANCEL    0418
*                                      REQUEST WAS MADE BY TCAS      */
*       RFY                                                        0419
*         REG14 RSTD;                                              0419
*       REG14=AUXSAVE;              /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0420
*       RFY                                                        0421
*         REG14 UNRSTD;                                            0421
*       RETURN CODE(4);             /* INDICATE INITIALIZATION CANNOT
*                                      CONTINUE                      */
         LA    @15,4                                               0422
         BR    @14                                                 0422
*     END;                                                         0423
*   ELSE                            /* TVWAECB WAS POSTED BY IKTRPLXT*/
*     DO;                                                          0424
@RF00417 DS    0H                                                  0425
*       TSBXACTV='1'B;              /* INDICATE TERMINAL STATUS KNOWN*/
         L     @10,PSAAOLD                                         0425
         L     @10,TSBPTR(,@10)                                    0425
         L     @10,TSBEXTNT(,@10)                                  0425
         OI    TSBXACTV(@10),B'01000000'                           0425
*       RFY                                                        0426
*         REG14 RSTD;                                              0426
*       REG14=AUXSAVE;              /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0427
*       RFY                                                        0428
*         REG14 UNRSTD;                                            0428
*       RETURN CODE(0);             /* INDICATE SUCCESSFUL TERMINAL
*                                      REQUEST                       */
         SLR   @15,@15                                             0429
         BR    @14                                                 0429
*     END;                                                         0430
*POSTERR:                                                          0431
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA,RETREG);                   0431
*                                                                  0431
POSTERR  DS    0H                                                  0432
*/*             THE ROUTINE SHOULD GIVE AN INDICATION OF FURTHER     */
*/*        PROCESSING IMPOSSIBLE.  POST ISSUED TO CANCEL THE ADDRESS */
*/*        SPACE.                                                    */
*                                                                  0432
*   RFY                                                            0432
*     REG2 RSTD;                    /* RESTRICT WORK REGSITER        */
*   REG2=ADDR(TSBXECB);             /* LOAD ADDRESS OF TSO CANCEL ECB*/
         L     @10,PSAAOLD                                         0433
         L     @10,TSBPTR(,@10)                                    0433
         L     REG2,TSBEXTNT(,@10)                                 0433
         LA    REG2,TSBXECB(,REG2)                                 0433
*   GENERATE CODE;                                                 0434
*              /* ISSUE POST TO CANCEL INITIALIZATION */
          POST (REG2),X'0'
*   RFY                                                            0435
*     REG2 UNRSTD;                  /* UNRESTRICT REGISTER           */
*   END POSTERR;                                                   0436
@EL00005 DS    0H                                                  0436
@EF00005 DS    0H                                                  0436
@ER00005 BR    @14                                                 0436
*   GENERATE CODE DEFS(POSTMAC,POSTLEN);                           0437
POSTMAC  POST  ,,ERRET=POSTERR,MF=L
*   END TERMCON;                                                   0438
         B     @EL00004                                            0438
*IKTQMINT:                                                         0439
*   PROC OPTIONS(NOSAVE,NOSAVEAREA,RETREG);                        0439
*                                                                  0439
IKTQMINT DS    0H                                                  0440
*/*  THIS ROUTINE INITIALIZES THE QUEUE MANAGER                      */
*                                                                  0440
*   RFY                                                            0440
*     AUXSAVE BASED(REG13);         /* BASE SAVE AREA ON REGISTER 13 */
*   RFY                                                            0441
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER      */
*   AUXSAVE=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,AUXSAVE(,REG13)                               0442
*   RFY                                                            0443
*     REG1 RSTD;                                                   0443
*   TVWAQMWA=((TVWAEXL+LENGTH(IFGEXLST))/8)*8+8;/* INSERT ADDRESS OF
*                                      WORK AREA INTO TVWA   @YM03605*/
         L     @15,PSAAOLD                                         0444
         L     @15,TSBPTR(,@15)                                    0444
         L     @15,TSBEXTNT(,@15)                                  0444
         L     @15,TVWAPTR(,@15)                                   0444
         LA    @10,8                                               0444
         LA    @02,65                                              0444
         AL    @02,TVWAEXL(,@15)                                   0444
         SRDA  @02,32                                              0444
         DR    @02,@10                                             0444
         SLA   @03,3                                               0444
         ALR   @03,@10                                             0444
         ST    @03,TVWAQMWA(,@15)                                  0444
*/*     CHECKS FOR CONTROL BLOCK TOTAL GROWTH NOT LARGER THAN A      */
*/* THOUSAND BYTES AND RETURNS AN ERROR CODE IF THE TOTAL BYTE COUNT */
*/* IS GREATER THAN ONE THOUSAND BYTES .                             */
*                                                                  0445
*   IF ADDR(TVWA)+1000<TVWAQMWA+120 THEN/* CHECK FOR SPACE PROBLEM 0445
*                                                            @YM03258*/
         AL    @15,@CF03000                                        0445
         AL    @03,@CF03001                                        0445
         CR    @15,@03                                             0445
         BNL   @RF00445                                            0445
*     DO;                                                          0446
*       REG14=AUXSAVE;              /* RESTORE RETURN ADDRESS      0447
*                                                            @YM03258*/
         L     @10,AUXSAVE(,REG13)                                 0447
         LR    REG14,@10                                           0447
*       RETURN CODE(4);             /* RETURN ERROR CODE     @YM03258*/
         LA    @15,4                                               0448
@EL00006 DS    0H                                                  0448
@EF00006 DS    0H                                                  0448
@ER00006 BR    @14                                                 0448
*     END;                                                         0449
*   ELSE                                                           0450
*     REG1=TVWAQMWA+120;            /* INSERT ADDRESS OF BUFFER AREA
*                                                            @YM03258*/
@RF00445 L     @15,PSAAOLD                                         0450
         L     @15,TSBPTR(,@15)                                    0450
         L     @15,TSBEXTNT(,@15)                                  0450
         L     @15,TVWAPTR(,@15)                                   0450
         LA    REG1,120                                            0450
         AL    REG1,TVWAQMWA(,@15)                                 0450
*   RFY                                                            0451
*    (REG0,                                                        0451
*     REG3) RSTD;                                                  0451
*   REG3=TCASCLSZ+20;               /* GET SIZE OF CELL FOR BLDCPOOL */
         L     @10,CVTPTR                                          0452
         L     @10,TCASTPTR(,@10)                                  0452
         LA    REG3,20                                             0452
         AH    REG3,TCASCLSZ(,@10)                                 0452
*   TVWACLSZ=REG3;                  /* PUT CELL SIZE IN TVWA         */
         STH   REG3,TVWACLSZ(,@15)                                 0453
*   TVWAHBUF=TCASHBUF;              /* INSERT BUFFER CEILINGS        */
         L     @02,TCASHBUF(,@10)                                  0454
         ST    @02,TVWAHBUF(,@15)                                  0454
*   TVWALBUF=TCASLBUF;              /* INSERT BUFFER THRESHOLD       */
         L     @10,TCASLBUF(,@10)                                  0455
         ST    @10,TVWALBUF(,@15)                                  0455
*   GEN                             /* BUILD THE CELL POOL           */
*       REFS(CVTBLDCP,CVTMAP);                                     0456
        BLDCPOOL CSIZE=(REG3),POOLSIZ=3,SP=229,CPADDR=(1),AUTODEL=YES,**
               BRANCH=YES    DIVIDE CELL POOL                @YM03258
*   RFY                                                            0457
*     REG3 UNRSTD;                                                 0457
*   TVWACPID=REG0;                  /* STORE DYNAMIC CELL POOL ID IN
*                                      TVWA                          */
*                                                                  0458
         L     @15,PSAAOLD                                         0458
         L     @15,TSBPTR(,@15)                                    0458
         L     @15,TSBEXTNT(,@15)                                  0458
         L     @15,TVWAPTR(,@15)                                   0458
         ST    REG0,TVWACPID(,@15)                                 0458
*   /*****************************************************************/
*   /*                                                               */
*   /* GET A CELL FOR THE LOOK ASIDE BUFFER                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0459
*   GEN REFS(CVTGETCL,CVTMAP);                                     0459
        GETCELL CPID=(0),BRANCH=YES
*   TVWAQMLB=REG1;                  /* STORE @ OF LOOK ASIDE BUFFER
*                                      IN TVWA                       */
         L     @15,PSAAOLD                                         0460
         L     @15,TSBPTR(,@15)                                    0460
         L     @15,TSBEXTNT(,@15)                                  0460
         L     @15,TVWAPTR(,@15)                                   0460
         ST    REG1,TVWAQMLB(,@15)                                 0460
*   TVWAQLBU='0'B;                  /* MARK LOOK ASIDE BUFFER AS NOT
*                                      IN USE                        */
         NI    TVWAQLBU(@15),B'11111011'                           0461
*   RFY                                                            0462
*    (REG0,                                                        0462
*     REG1) UNRSTD;                                                0462
*   REG14=AUXSAVE;                  /* RESTORE RETURN ADDRESS        */
         L     REG14,AUXSAVE(,REG13)                               0463
*   RETURN CODE(0);                 /* INDICATE SUCCESSFUL         0464
*                                      INITIALIZATION                */
         SLR   @15,@15                                             0464
         BR    @14                                                 0464
*   END IKTQMINT;                                                  0465
*   END IKTXINIT                                                   0466
*                                                                  0466
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */
*/*%INCLUDE SYSLIB  (IKTTVWA )                                       */
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */
*/*%INCLUDE SYSLIB  (IFGEXLVT)                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (IFGACBVT)                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */
*/*%INCLUDE SYSLIB  (IHAECB  )                                       */
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */
*/*%INCLUDE SYSLIB  (IKTIPARM)                                       */
*/*%INCLUDE SYSLIB  (IKTOPARM)                                       */
*                                                                  0466
*       ;                                                          0466
@DATA    DS    0H
@SM03007 MVC   INTBUFR(0,@08),EXTBUFR(@14)
@SX03009 XC    EXTBUFR+2(0,@14),EXTBUFR+2(@14)
@DATD    DSECT
         DS    0F
@SA00001 DS    25F
IKTXINIT CSECT
         DS    0F
@CF00072 DC    F'3'
@CF00036 DC    F'8'
@CF03004 DC    F'112'
@CF03001 DC    F'120'
@CF03000 DC    F'1000'
@CF02966 DC    F'4096'
@CF02869 DC    XL4'80000000'
@CF02967 DC    XL4'01000000'
@DATD    DSECT
         DS    0D
IKTXINIT CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV02836 DC    V(IKTIIOM)
@CV02839 DC    V(IKTINX2)
@CA02866 DC    A(BINDUSER)
@CV02906 DC    V(IKTRPLXT)
         DS    0D
TVKEY    DC    AL1(96)
         DS    CL3
INITLST  DS    CL12
         ORG   INITLST
ADDR3270 DC    VL4(IKTIIOM)
ADDRTR12 DC    VL4(IKTIIOM)
ADDRUEXT DC    VL4(IKTINX2)
         ORG   INITLST+12
NULPSWRD DC    CL8' '
TSO      DC    CL3'TSO'
         DS    CL1
PATAREA  DC    50F'0'
CP0001@  DC    AL4(INIT3270)
         DC    AL4(INITRT12)
         DC    AL4(USEREXIT)
         DC    AL4(INITLU2)
IKTXINIT CSECT
DUMXLST  EXLST AM=VTAM,                                               **
               LOSTERM=DUMXLST,                                       **
               TPEND=DUMXLST     /* DUMMY LOSTERM AND TPEND EXITS
*                                   DECLARED                @ZM21019*/
IKTXINIT CSECT
DUMACB   ACB   AM=VTAM,   SPECIFY VTAM ACCESS METHOD                  **
               APPLID=0,                                              **
               EXLST=0,   SPECIFY AN ENTRY FOR AN EXLST               **
               MACRF=LOGON   SPECIFY ---- QUEUEING OF LOGON REQUESTS
IKTXINIT CSECT
DUMNIB   NIB   LISTEND=YES,      SPECIFY ONLY NIB                     **
               MODE=RECORD,      RECORD MODE TERMINAL ONLY            **
               RESPLIM=0,        NO RESPONSE LIMIT                    **
               PROC=(CS,CONFTXT,KEEP)
IKTXINIT CSECT
DUMRPL   RPL   AM=VTAM,                                               **
               ACB=DUMACB,                                            **
               NIB=DUMNIB,                                            **
               EXIT=POSTERR,                                          **
               OPTCD=(ACCEPT,SPEC,ASY,Q)
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IKTXINIT CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RETCODE  EQU   @15
REG1     EQU   @01
REG0     EQU   @00
REG4     EQU   @04
REG13    EQU   @13
REG14    EQU   @14
REG3     EQU   @03
REG2     EQU   @02
ADDREG   EQU   @04
RPLREG   EQU   @02
WEREG    EQU   @04
QHREG    EQU   @05
ANCHREG  EQU   @06
REG10    EQU   @10
REG11    EQU   @11
REG12    EQU   @12
REG15    EQU   @15
REG5     EQU   @05
REG6     EQU   @06
REG7     EQU   @07
REG8     EQU   @08
REG9     EQU   @09
         EXTRN BINDUSER
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSATOLD  EQU   PSA+540
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBCSCB EQU   ASCB+56
ASCBTSB  EQU   ASCB+60
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCAST    EQU   0
TCASUSER EQU   TCAST+4
TCASACBP EQU   TCAST+8
TCASCLSZ EQU   TCAST+18
TCASHBUF EQU   TCAST+20
TCASLBUF EQU   TCAST+24
TCASXECB EQU   TCAST+40
TCASMSGS EQU   TCAST+52
TCASTTL  EQU   TCAST+64
TCASLTE  EQU   TCAST+84
TCASFLG1 EQU   TCAST+88
TCASABND EQU   TCASFLG1
TCASFLG2 EQU   TCAST+89
TCASASCB EQU   TCAST+92
TCASTTQH EQU   TCAST+104
TCASTPND EQU   TCAST+124
TSB      EQU   0
TSBASCBA EQU   TSB
TSBSTAT  EQU   TSBASCBA
TSBDSPLY EQU   TSBSTAT
TSB3270  EQU   TSBSTAT
TSBFLG1  EQU   TSB+4
TSBFLG2  EQU   TSB+16
TSBFLG3  EQU   TSB+24
TSBFLG5  EQU   TSB+25
TSBTERMC EQU   TSB+26
TSBTERM1 EQU   TSBTERMC
TSBTERM2 EQU   TSBTERMC+1
TSBSTCC  EQU   TSB+34
TSBFLG4  EQU   TSB+41
TSBRCB   EQU   TSB+64
TSBLINKA EQU   TSBRCB+4
TSBTPOST EQU   TSB+72
TSBTPFLG EQU   TSBTPOST
TSBMINL  EQU   TSB+84
TSBEXTNT EQU   TSB+96
TSBTRMID EQU   TSB+104
TSBX     EQU   0
TSBXECB  EQU   TSBX+8
TSBXUID  EQU   TSBX+24
TSBXFLG1 EQU   TSBX+32
TSBXACTV EQU   TSBXFLG1
TSBXTVWA EQU   TSBX+36
TSBXTIM  EQU   TSBX+40
TSBXTOM  EQU   TSBX+44
TSBXLBUF EQU   TSBX+64
TSBXAIND EQU   TSBX+70
TSBXTERM EQU   TSBX+72
TSBXTMTP EQU   TSBXTERM
TSBXRPL  EQU   TSBX+76
TSBXBIND EQU   TSBX+80
TVWA     EQU   0
TVWAPPL  EQU   TVWA
TVWALLWA EQU   TVWA+24
TVWAQMWA EQU   TVWA+28
TVWACPID EQU   TVWA+56
TVWATCB  EQU   TVWA+64
TVWARTR  EQU   TVWA+72
TVWACLSZ EQU   TVWA+74
TVWAHBUF EQU   TVWA+76
TVWALBUF EQU   TVWA+80
TVWAACB  EQU   TVWA+88
TVWANIB  EQU   TVWA+92
TVWARPL  EQU   TVWA+96
TVWAEXL  EQU   TVWA+100
TVWAVST  EQU   TVWA+104
TVWAVSZ  EQU   TVWA+108
TVWAFLG7 EQU   TVWA+110
TVWAECB  EQU   TVWA+112
TVWAECBL EQU   TVWA+120
TVWAECB1 EQU   TVWAECBL
TVWAECB2 EQU   TVWAECBL+4
TVWADLST EQU   TVWA+132
TVWAFLG1 EQU   TVWA+144
TVWAFLG2 EQU   TVWA+145
TVWAFLG3 EQU   TVWA+146
TVWAQLBU EQU   TVWAFLG3
TVWAFLG4 EQU   TVWA+147
TVWAFLG5 EQU   TVWA+150
TVWAQMLB EQU   TVWA+176
TVWAFLG6 EQU   TVWA+182
WESTD    EQU   0
WECODE1  EQU   WESTD
WECODE1F EQU   WECODE1+1
WECODE2  EQU   WESTD+2
WECODE2F EQU   WECODE2+1
WENEXT   EQU   WESTD+4
WERC     EQU   WESTD+8
WELEN    EQU   WESTD+10
WELBUF   EQU   WESTD+12
WEUASCB  EQU   WELBUF
WEVNIB   EQU   WESTD+16
WEUECB   EQU   WEVNIB
WEVRPL   EQU   WESTD+20
WETERM   EQU   WESTD+24
WETMFLG  EQU   WETERM+1
IFGEXLST EQU   0
EXLCOMN  EQU   IFGEXLST
EXLLEN   EQU   EXLCOMN+2
EXLEODF  EQU   EXLCOMN+5
EXLSYNF  EQU   EXLCOMN+10
EXLLERF  EQU   EXLCOMN+15
EXLSCIPF EQU   EXLCOMN+20
EXLLGNF  EQU   EXLCOMN+25
EXLJRNF  EQU   EXLCOMN+30
EXLOPNF  EQU   EXLCOMN+35
EXLVTEXT EQU   IFGEXLST+40
EXLNLGNF EQU   EXLVTEXT
EXLNLGNP EQU   EXLVTEXT+1
EXLRLRQF EQU   EXLVTEXT+5
EXLATTNF EQU   EXLVTEXT+15
EXLTPNDF EQU   EXLVTEXT+20
EXLTPNDP EQU   EXLVTEXT+21
EXLDFAS  EQU   0
EXLDFASF EQU   EXLDFAS
EXLRESP  EQU   0
EXLRESPF EQU   EXLRESP
IFGEXLEF EQU   0
EXLENTRY EQU   IFGEXLEF
EXLFLAG  EQU   EXLENTRY
EXLENFL  EQU   EXLFLAG
EXLEXITP EQU   EXLENTRY+1
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBDVIND EQU   ACBDSORG
ACBPASSW EQU   ACBCOMN+32
ACBEXLST EQU   ACBCOMN+36
ACBUEL   EQU   ACBEXLST
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBOPEN  EQU   ACBOFLGS
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBERFLG EQU   ACBCOMN+49
ACBINFLG EQU   ACBCOMN+50
ACBVVIC  EQU   ACBINFLG
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBAPID  EQU   ACBCOMN+72
ACBVTEXT EQU   IFGACB+76
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLDACB  EQU   RPLCOMN+24
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLOPT4  EQU   RPLOPTCD+3
RPLNXTRP EQU   RPLCOMN+44
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
RPLEXIT  EQU   RPLEXTD1
RPLVTEXT EQU   IFGRPL+76
RPLFDBK2 EQU   RPLVTEXT+12
RPLSSNSI EQU   RPLFDBK2
RPLDSB   EQU   RPLSSNSI
RPLDSB1  EQU   RPLDSB
RPLSSEI  EQU   RPLDSB1
RPLDSB2  EQU   RPLDSB+1
RPLUSNSI EQU   RPLFDBK2+2
RPLOPTC3 EQU   RPLVTEXT+20
RPLOPT9  EQU   RPLOPTC3
RPLOPT10 EQU   RPLOPTC3+1
RPLOPT11 EQU   RPLOPTC3+2
RPLOPT12 EQU   RPLOPTC3+3
RPLOSENS EQU   RPLVTEXT+24
RPLSSNSO EQU   RPLOSENS
RPLSSEO  EQU   RPLSSNSO
RPLOF16  EQU   0
RPLRH3   EQU   RPLOF16
RPLSRTYP EQU   RPLOF16+1
RPLSTYPE EQU   RPLSRTYP
RPLRTYPE EQU   RPLSRTYP
RPLCHN   EQU   RPLOF16+2
RPLVTFL1 EQU   RPLOF16+3
RPLVTFL2 EQU   RPLOF16+4
RPLPOSTV EQU   RPLVTFL2
RPLRESP  EQU   RPLVTFL2
RPLCNTRL EQU   RPLOF16+5
RPLCNTDF EQU   RPLCNTRL
RPLCNTDC EQU   RPLCNTRL+1
RPLCNTSC EQU   RPLCNTRL+2
RPLOF60  EQU   0
RPLOBSQ  EQU   RPLOF60+4
RPLIBSQ  EQU   RPLOF60+5
ECB      EQU   0
ECBRB    EQU   ECB
ECBEVTB  EQU   ECBRB
ECBCC    EQU   ECBEVTB
ECBEVNT  EQU   ECBCC
ECBPOSTB EQU   ECBEVNT
ECBCCCNT EQU   ECBEVTB+1
ECBRBA   EQU   ECBCCCNT
CHAIN    EQU   0
CHFLG    EQU   CHAIN+4
CHSTS    EQU   CHFLG+2
CHACT    EQU   CHFLG+3
CHKEY    EQU   CHAIN+8
CHPARM   EQU   CHKEY
CHPKE    EQU   CHAIN+28
CHTJID   EQU   CHAIN+30
CHPROCSN EQU   CHAIN+32
CHACT1   EQU   CHPROCSN+3
CHASM    EQU   CHAIN+40
CHCIBP   EQU   CHASM+4
CHRGNSZ  EQU   CHASM+8
CHSTEP   EQU   CHASM+24
CHSWT    EQU   CHSTEP
CHSHORT  EQU   CHASM+32
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNIB   EQU   0
NIBUSER  EQU   ISTNIB+8
NIBSYM   EQU   ISTNIB+12
NIBFLGS  EQU   ISTNIB+40
NIBFLG1  EQU   NIBFLGS
NIBNDAR  EQU   ISTNIB+56
TIOMA    EQU   0
TIM3270  EQU   TIOMA+4
TOM3270  EQU   TIOMA+8
TIMRTS   EQU   TIOMA+12
TOMRTS   EQU   TIOMA+16
TIMLU2   EQU   TIOMA+20
TOMLU2   EQU   TIOMA+24
RETRYMAX EQU   10
SVEAREA  EQU   0
PSWCHAR  EQU   80
PASLEN   EQU   PSWCHAR
PASSWRD  EQU   PSWCHAR+1
MACAREA  EQU   80
ERRETADD EQU   76
AUXSAVE  EQU   72
IKTMSGS  EQU   0
CL0001@  EQU   0
INTBUFR  EQU   0
EXTBUFR  EQU   0
EBUFLEN  EQU   EXTBUFR
INPWA    EQU   0
IPARMS   EQU   INPWA
IPFLAGS  EQU   IPARMS+8
IPNXFLGS EQU   IPARMS+16
OUTPWA   EQU   0
OPARMS   EQU   OUTPWA
OPFLAGS  EQU   OPARMS+8
OPOPTNS  EQU   OPFLAGS+1
OPNXFLGS EQU   OPARMS+16
ACBERR   EQU   513
ACBERR1  EQU   514
ISTACB   EQU   0
ISTRPL   EQU   0
VTAMERR  EQU   171
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
ASCBPTR  EQU   PSAAOLD
TCBPTR   EQU   PSATOLD
CVTPTR   EQU   FLCCVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTBLDCP EQU   CVTS01+140
CVTGETCL EQU   CVTS01+144
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
CVTTCASP EQU   CVTS01+664
TCASTPTR EQU   CVTTCASP
TSBPTR   EQU   ASCBTSB
TVWAPTR  EQU   TSBXTVWA
CSCBPTR  EQU   ASCBCSCB
CHAINS01 EQU   CHASM
CHTYPE   EQU   CHAINS01+124
CHTRSTAT EQU   CHAINS01+125
CHCSYSO  EQU   CHAINS01+134
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CHLAST   EQU   CHAINS01+136
CHSPA    EQU   CHAINS01+135
CHUSERID EQU   CHCSYSO
CHJB     EQU   CHCSYSO
CHDUMP   EQU   CHCSYSO
CHQUE    EQU   CHCSYSO
CHHOLD   EQU   CHCSYSO
CHOUT    EQU   CHCSYSO
CHINN    EQU   CHCSYSO
CHALL    EQU   CHCSYSO
CHINC    EQU   CHAINS01+132
CHPEND   EQU   CHAINS01+128
CHARID   EQU   CHAINS01+127
CHCNID   EQU   CHAINS01+126
@NM00129 EQU   CHTRSTAT
CHTSL    EQU   CHTRSTAT
CHTS     EQU   CHTRSTAT
CHINITL  EQU   CHTRSTAT
CHINIT   EQU   CHTRSTAT
CHJOBSL  EQU   CHTRSTAT
CHJOBS   EQU   CHTRSTAT
CHDEF    EQU   CHTYPE
CHHIAR   EQU   CHTYPE
CHARSV29 EQU   CHTYPE
CHARSV28 EQU   CHTYPE
CHARSV27 EQU   CHTYPE
CHARSV26 EQU   CHTYPE
CHARSV25 EQU   CHTYPE
CHDSTAT  EQU   CHTYPE
CHBUF    EQU   CHAINS01
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
OPARMLST EQU   OUTPWA+20
@NM00150 EQU   OPNXFLGS+3
@NM00149 EQU   OPNXFLGS+2
@NM00148 EQU   OPNXFLGS+1
OPNXASID EQU   OPNXFLGS+1
OPNXEDIT EQU   OPNXFLGS+1
OPNXBRK  EQU   OPNXFLGS+1
OPNXHOLD EQU   OPNXFLGS+1
@NM00147 EQU   OPNXFLGS
OPNXADTP EQU   OPNXFLGS
OPNXALC  EQU   OPNXFLGS
OPNXBFSZ EQU   OPARMS+14
@NM00146 EQU   OPARMS+12
@NM00145 EQU   OPFLAGS+3
@NM00144 EQU   OPFLAGS+2
@NM00143 EQU   OPOPTNS
OPASID   EQU   OPOPTNS
OPEDIT   EQU   OPOPTNS
OPBRK    EQU   OPOPTNS
OPHOLD   EQU   OPOPTNS
@NM00142 EQU   OPFLAGS
OPADTOP  EQU   OPFLAGS
OPALLOC  EQU   OPFLAGS
OPBFSZ   EQU   OPARMS+6
OPRC     EQU   OPARMS+5
OPREQ    EQU   OPARMS+4
OPBUFADR EQU   OPARMS
IPARMLST EQU   INPWA+20
IPNXTMTP EQU   IPNXFLGS+3
IPNXCCC  EQU   IPNXFLGS+2
@NM00141 EQU   IPNXFLGS+1
IPNXPRTL EQU   IPNXFLGS+1
IPNXPMT  EQU   IPNXFLGS+1
IPNXAVBL EQU   IPNXFLGS+1
@NM00140 EQU   IPNXFLGS
IPNXALC  EQU   IPNXFLGS
IPNXBFSZ EQU   IPARMS+14
@NM00139 EQU   IPARMS+12
IPTRMTYP EQU   IPFLAGS+3
IPCCC    EQU   IPFLAGS+2
@NM00138 EQU   IPFLAGS+1
IPPRTL   EQU   IPFLAGS+1
IPPRMPT  EQU   IPFLAGS+1
IPAVBL   EQU   IPFLAGS+1
@NM00137 EQU   IPFLAGS
IPALLOC  EQU   IPFLAGS
IPBFSZ   EQU   IPARMS+6
IPRC     EQU   IPARMS+5
IPREQ    EQU   IPARMS+4
IPBUFADR EQU   IPARMS
EBUFDATA EQU   EXTBUFR+4
EBUFOFS  EQU   EXTBUFR+2
BUFDATA  EQU   INTBUFR+4
BUFOFSET EQU   INTBUFR+2
BUFLEN   EQU   INTBUFR
@NM00136 EQU   SVEAREA+12
FORWPTR  EQU   SVEAREA+8
BACKPTR  EQU   SVEAREA+4
@NM00135 EQU   SVEAREA
TIOMLEN  EQU   TIOMA
NIBRESV  EQU   ISTNIB+60
NIBLMODE EQU   ISTNIB+48
NIBEXLST EQU   ISTNIB+44
NIBLIMIT EQU   ISTNIB+42
@NM00134 EQU   ISTNIB+41
@NM00133 EQU   NIBFLG1
@NM00132 EQU   NIBFLG1
@NM00131 EQU   NIBFLG1
@NM00130 EQU   NIBFLG1
NIBSHLTP EQU   NIBFLG1
NIBSDAPP EQU   NIBFLG1
NIBCON   EQU   NIBFLG1
NIBLAST  EQU   NIBFLG1
NIBPROCD EQU   ISTNIB+36
NIBDEVCH EQU   ISTNIB+28
NIBMODE  EQU   ISTNIB+20
NIBCID   EQU   ISTNIB+4
NIBLEN   EQU   ISTNIB+3
NIBCONDN EQU   ISTNIB+2
NIBRSV01 EQU   ISTNIB+1
NIBID    EQU   ISTNIB
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
CHARSV16 EQU   CHSHORT+100
CHARSV15 EQU   CHSHORT+96
CHJSCBVS EQU   CHSHORT+92
CHUSCVS  EQU   CHSHORT+88
@NM00128 EQU   CHSHORT+84
@NM00127 EQU   CHSHORT+80
CHSQA    EQU   CHSHORT+44
CHQPA    EQU   CHSHORT+8
CHJCL    EQU   CHSHORT+4
CHSPC    EQU   CHSHORT
CHSPB    EQU   CHSTEP+4
CHTCB    EQU   CHSTEP+1
CHARSV23 EQU   CHSWT
CHARSV22 EQU   CHSWT
CHARSV21 EQU   CHSWT
CHAC     EQU   CHSWT
CHPSF    EQU   CHSWT
CHPSD    EQU   CHSWT
CHJCT    EQU   CHSWT
CHARSV20 EQU   CHSWT
CHCECB   EQU   CHASM+20
CHECB    EQU   CHASM+16
CHRGNAD  EQU   CHASM+12
CHARSV18 EQU   CHRGNSZ+1
CHRPRTY  EQU   CHRGNSZ
@NM00126 EQU   CHCIBP
CHEND    EQU   CHCIBP
CHECBP   EQU   CHASM
CHDER    EQU   CHPROCSN+4
CHARSV10 EQU   CHACT1
CHARSV09 EQU   CHACT1
CHARSV08 EQU   CHACT1
CHARSV07 EQU   CHACT1
CHARSV06 EQU   CHACT1
CHARSV05 EQU   CHACT1
CHARSV04 EQU   CHACT1
CHRDWTR  EQU   CHACT1
CHARSV30 EQU   CHPROCSN+2
CHQID    EQU   CHPROCSN
CHASID   EQU   CHTJID
CHUCMP   EQU   CHAIN+29
CHTRKID  EQU   CHPKE
CHCIBCTR EQU   CHAIN+27
CHUNIT   EQU   CHAIN+24
CHCLS    EQU   CHAIN+16
CHPCOI   EQU   CHPARM
CHIFY    EQU   CHACT
CHAIFX   EQU   CHACT
CHCLD    EQU   CHACT
CHCL     EQU   CHACT
CHDSI    EQU   CHACT
CHDISC   EQU   CHACT
CHTERM   EQU   CHACT
CHSWAP   EQU   CHACT
CHABTERM EQU   CHSTS
CHFC     EQU   CHSTS
CHDL     EQU   CHSTS
CHAD     EQU   CHSTS
CHQSPC   EQU   CHSTS
CHSOUT   EQU   CHSTS
CHSYS    EQU   CHSTS
CHAP     EQU   CHSTS
CHSZE    EQU   CHFLG+1
CHVCD    EQU   CHFLG
CHPTR    EQU   CHAIN
ECBEVTBA EQU   ECBRBA
@NM00125 EQU   ECBCC
ECBWAITB EQU   ECBEVNT
RPLSEQNO EQU   RPLOF60+6
@NM00124 EQU   RPLIBSQ
RPLIINV  EQU   RPLIBSQ
RPLINEG  EQU   RPLIBSQ
RPLIPOS  EQU   RPLIBSQ
RPLIIGN  EQU   RPLIBSQ
RPLIRSET EQU   RPLIBSQ
RPLITST  EQU   RPLIBSQ
RPLISET  EQU   RPLIBSQ
@NM00123 EQU   RPLOBSQ
RPLOINV  EQU   RPLOBSQ
RPLONEG  EQU   RPLOBSQ
RPLOPOS  EQU   RPLOBSQ
RPLOIGN  EQU   RPLOBSQ
RPLORSET EQU   RPLOBSQ
RPLOTST  EQU   RPLOBSQ
RPLOSET  EQU   RPLOBSQ
RPLIBSQV EQU   RPLOF60+2
RPLOBSQV EQU   RPLOF60
@NM00122 EQU   RPLCNTSC
RPLRSHUT EQU   RPLCNTSC
RPLRQR   EQU   RPLCNTSC
RPLSHUTC EQU   RPLCNTSC
RPLSHUTD EQU   RPLCNTSC
RPLSTSN  EQU   RPLCNTSC
RPLCLEAR EQU   RPLCNTSC
RPLSDT   EQU   RPLCNTSC
@NM00121 EQU   RPLCNTDC
RPLSIGNL EQU   RPLCNTDC
RPLLUS   EQU   RPLCNTDC
RPLRTR   EQU   RPLCNTDC
RPLBID   EQU   RPLCNTDC
@NM00120 EQU   RPLCNTDF
RPLQI    EQU   RPLCNTDF
RPLRELQ  EQU   RPLCNTDF
RPLCHASE EQU   RPLCNTDF
RPLQEC   EQU   RPLCNTDF
RPLQC    EQU   RPLCNTDF
RPLCNCEL EQU   RPLCNTDF
RPLDATA  EQU   RPLCNTDF
RPLRRN   EQU   RPLRESP
RPLNFME  EQU   RPLRESP
RPLEX    EQU   RPLRESP
@NM00119 EQU   RPLRESP
@NM00118 EQU   RPLPOSTV
RPLSCHED EQU   RPLPOSTV
@NM00117 EQU   RPLVTFL1
RPLAUTUS EQU   RPLVTFL1
RPLVTUSE EQU   RPLVTFL1
@NM00116 EQU   RPLVTFL1
@NM00115 EQU   RPLCHN
RPLONLY  EQU   RPLCHN
RPLLAST  EQU   RPLCHN
RPLMIDLE EQU   RPLCHN
RPLFIRST EQU   RPLCHN
@NM00114 EQU   RPLRTYPE
RPLDFASY EQU   RPLRTYPE
RPLNFSYN EQU   RPLRTYPE
RPLRRESP EQU   RPLRTYPE
@NM00113 EQU   RPLSTYPE
RPLSRESP EQU   RPLSTYPE
@NM00112 EQU   RPLRH3
RPLCSI   EQU   RPLRH3
RPLCHREQ EQU   RPLRH3
RPLCMD   EQU   RPLRH3
RPLEB    EQU   RPLRH3
RPLBB    EQU   RPLRH3
RPLSIGDA EQU   RPLVTEXT+32
RPLSAV13 EQU   RPLVTEXT+28
RPLUSNSO EQU   RPLOSENS+2
RPLSSMO  EQU   RPLSSNSO+1
@NM00111 EQU   RPLSSEO
RPLRRO   EQU   RPLSSEO
RPLFIO   EQU   RPLSSEO
RPLSTATO EQU   RPLSSEO
RPLCPMO  EQU   RPLSSEO
@NM00110 EQU   RPLSSEO
RPLFMHDR EQU   RPLOPT12
@NM00109 EQU   RPLOPT12
@NM00108 EQU   RPLOPT12
@NM00107 EQU   RPLOPT12
RPLNIBTK EQU   RPLOPT12
RPLTRUNC EQU   RPLOPT12
RPLKEEP  EQU   RPLOPT12
@NM00106 EQU   RPLOPT12
RPLRSVE8 EQU   RPLOPT11
RPLRSVE7 EQU   RPLOPT11
RPLRSVE6 EQU   RPLOPT11
RPLRSVE5 EQU   RPLOPT11
RPLRSVE4 EQU   RPLOPT11
RPLSTOP  EQU   RPLOPT11
RPLSTART EQU   RPLOPT11
RPLQUIES EQU   RPLOPT11
RPLRSVI6 EQU   RPLOPT10
RPLRSVI5 EQU   RPLOPT10
RPLRSVI4 EQU   RPLOPT10
RPLRSVI3 EQU   RPLOPT10
RPLRSVI2 EQU   RPLOPT10
RPLSPARM EQU   RPLOPT10
RPLDSPLY EQU   RPLOPT10
RPLBSCID EQU   RPLOPT10
RPLTOPL  EQU   RPLOPT9
RPLCIDE  EQU   RPLOPT9
RPLRNNM  EQU   RPLOPT9
RPLAPPST EQU   RPLOPT9
RPLCOUNT EQU   RPLOPT9
RPLTERMS EQU   RPLOPT9
RPLDEVCH EQU   RPLOPT9
RPLLOGON EQU   RPLOPT9
RPLUSFLD EQU   RPLVTEXT+16
RPLESR2  EQU   RPLUSNSI+1
RPLESR1  EQU   RPLUSNSI
RPLSSMI  EQU   RPLDSB2
@NM00105 EQU   RPLSSEI
RPLRRI   EQU   RPLSSEI
RPLFII   EQU   RPLSSEI
RPLSTATI EQU   RPLSSEI
RPLCPMI  EQU   RPLSSEI
RPLPATHI EQU   RPLSSEI
RPLARCLN EQU   RPLVTEXT+8
RPLAARLN EQU   RPLVTEXT+4
RPLAAREA EQU   RPLVTEXT
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00104 EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00103 EQU   RPLRBAR+3
@NM00102 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLTCRNO EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
@NM00101 EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLBUFL  EQU   RPLCOMN+52
RPLRLEN  EQU   RPLCOMN+48
RPLCHAIN EQU   RPLNXTRP
RPLBOP   EQU   RPLOPT4
@NM00100 EQU   RPLOPT4
RPLMKFRM EQU   RPLOPT4
RPLENDTR EQU   RPLOPT4
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
@NM00099 EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLDIR   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLAREA  EQU   RPLCOMN+32
RPLTCBPT EQU   RPLCOMN+28
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
@NM00098 EQU   ACBVTEXT+8
@NM00097 EQU   ACBVTEXT+6
ACBRTN   EQU   ACBVTEXT
ACBCBMWA EQU   ACBCOMN+68
ACBUAPTR EQU   ACBCOMN+64
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00096 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
@NM00095 EQU   ACBINFLG+1
ACBBYPSS EQU   ACBINFLG
ACBSDS   EQU   ACBVVIC
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00094 EQU   ACBINFLG
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00093 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00092 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBMSGAR EQU   ACBCOMN+28
@NM00091 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00090 EQU   ACBDSORG
ACBOPTJ  EQU   ACBDVIND
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00089 EQU   ACBCCTYP
ACBTRCID EQU   ACBCCTYP
@NM00088 EQU   ACBRECFM
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00087 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00086 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00085 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
EXLEADDR EQU   EXLEXITP
@NM00084 EQU   EXLENFL
EXLLNK   EQU   EXLENFL
EXLACTM  EQU   EXLENFL
EXLSPEC  EQU   EXLENFL
EXLRESPP EQU   EXLRESP+1
@NM00083 EQU   EXLRESPF
EXLRESPK EQU   EXLRESPF
EXLRESPA EQU   EXLRESPF
EXLRESPS EQU   EXLRESPF
EXLDFASP EQU   EXLDFAS+1
@NM00082 EQU   EXLDFASF
EXLDFASK EQU   EXLDFASF
EXLDFASA EQU   EXLDFASF
EXLDFASS EQU   EXLDFASF
@NM00081 EQU   EXLTPNDF
EXLTPNDK EQU   EXLTPNDF
EXLTPNDA EQU   EXLTPNDF
EXLTPNDS EQU   EXLTPNDF
EXLATTNP EQU   EXLVTEXT+16
@NM00080 EQU   EXLATTNF
EXLATTNK EQU   EXLATTNF
EXLATTNA EQU   EXLATTNF
EXLATTNS EQU   EXLATTNF
@NM00079 EQU   EXLVTEXT+10
EXLRLRQP EQU   EXLVTEXT+6
@NM00078 EQU   EXLRLRQF
EXLRLRQK EQU   EXLRLRQF
EXLRLRQA EQU   EXLRLRQF
EXLRLRQS EQU   EXLRLRQF
@NM00077 EQU   EXLNLGNF
EXLNLGNK EQU   EXLNLGNF
EXLNLGNA EQU   EXLNLGNF
EXLNLGNS EQU   EXLNLGNF
EXLOPNP  EQU   EXLCOMN+36
@NM00076 EQU   EXLOPNF
EXLOPNK  EQU   EXLOPNF
EXLOPNA  EQU   EXLOPNF
EXLOPNS  EQU   EXLOPNF
EXLJRNP  EQU   EXLCOMN+31
@NM00075 EQU   EXLJRNF
EXLJRNK  EQU   EXLJRNF
EXLJRNA  EQU   EXLJRNF
EXLJRNS  EQU   EXLJRNF
EXLLGNP  EQU   EXLCOMN+26
@NM00074 EQU   EXLLGNF
EXLLGNK  EQU   EXLLGNF
EXLLGNA  EQU   EXLLGNF
EXLLGNS  EQU   EXLLGNF
EXLSCIPP EQU   EXLCOMN+21
@NM00073 EQU   EXLSCIPF
EXLSCIPK EQU   EXLSCIPF
EXLSCIPA EQU   EXLSCIPF
EXLSCIPS EQU   EXLSCIPF
EXLLERP  EQU   EXLCOMN+16
@NM00072 EQU   EXLLERF
EXLLERK  EQU   EXLLERF
EXLLERA  EQU   EXLLERF
EXLLERS  EQU   EXLLERF
EXLSYNP  EQU   EXLCOMN+11
@NM00071 EQU   EXLSYNF
EXLSYNK  EQU   EXLSYNF
EXLSYNA  EQU   EXLSYNF
EXLSYNS  EQU   EXLSYNF
EXLEODP  EQU   EXLCOMN+6
@NM00070 EQU   EXLEODF
EXLEODK  EQU   EXLEODF
EXLEODA  EQU   EXLEODF
EXLEODS  EQU   EXLEODF
@NM00069 EQU   EXLCOMN+4
EXLLEN2  EQU   EXLLEN
EXLSTYP  EQU   EXLCOMN+1
EXLID    EQU   EXLCOMN
WEBIND   EQU   WESTD+32
@NM00068 EQU   WESTD+30
WERUSZO  EQU   WESTD+29
WERUSZI  EQU   WESTD+28
WETMBF   EQU   WETERM+2
@NM00067 EQU   WETMFLG
WEFLG1   EQU   WETMFLG
WETMTP   EQU   WETERM
WERC2    EQU   WERC+1
WERC1    EQU   WERC
WECD2MIF EQU   WECODE2F
WECD2MAF EQU   WECODE2F
WECODE2T EQU   WECODE2
WECDMIF  EQU   WECODE1F
WECDMAF  EQU   WECODE1F
WECODE1T EQU   WECODE1
TVWAEND  EQU   TVWA+216
@NM00066 EQU   TVWA+208
TVWAUSRA EQU   TVWA+200
@NM00065 EQU   TVWA+192
TVWAFRWO EQU   TVWA+188
TVWAFRWI EQU   TVWA+184
TVWARSHW EQU   TVWA+183
@NM00064 EQU   TVWAFLG6
TVWAINB  EQU   TVWAFLG6
TVWAFMEW EQU   TVWAFLG6
TVWARCDT EQU   TVWAFLG6
TVWAIOP  EQU   TVWAFLG6
TVWAIOTR EQU   TVWAFLG6
TVWAISYS EQU   TVWAFLG6
@NM00063 EQU   TVWA+180
TVWAATBO EQU   TVWA+172
TVWAATBI EQU   TVWA+168
TVWATRNM EQU   TVWA+160
TVWATABO EQU   TVWA+156
TVWATABI EQU   TVWA+152
TVWALNCT EQU   TVWA+151
TVWAP1ST EQU   TVWAFLG5
TVWAPRMT EQU   TVWAFLG5
TVWANFSP EQU   TVWAFLG5
TVWATIR  EQU   TVWAFLG5
TVWAFSW  EQU   TVWAFLG5
TVWAWO   EQU   TVWAFLG5
TVWAFSM  EQU   TVWAFLG5
TVWASCAN EQU   TVWAFLG5
@NM00062 EQU   TVWA+148
TVWADARC EQU   TVWAFLG4
TVWARCRS EQU   TVWAFLG4
TVWAQMEV EQU   TVWAFLG4
TVWAFLSC EQU   TVWAFLG4
TVWANOFB EQU   TVWAFLG4
TVWAKBDL EQU   TVWAFLG4
TVWADOOQ EQU   TVWAFLG4
TVWAFMSC EQU   TVWAFLG4
TVWATRDF EQU   TVWAFLG3
TVWATRAN EQU   TVWAFLG3
TVWAQMIO EQU   TVWAFLG3
TVWAQMRT EQU   TVWAFLG3
TVWAAIGN EQU   TVWAFLG3
TVWASDSG EQU   TVWAFLG3
TVWABRIN EQU   TVWAFLG3
TVWABIR  EQU   TVWAFLG2
TVWARTRY EQU   TVWAFLG2
TVWABKMG EQU   TVWAFLG2
TVWAERMG EQU   TVWAFLG2
TVWAGERR EQU   TVWAFLG2
TVWASCD  EQU   TVWAFLG2
TVWAPGN  EQU   TVWAFLG2
TVWABFC  EQU   TVWAFLG2
TVWAOOPS EQU   TVWAFLG1
TVWALTE  EQU   TVWAFLG1
TVWAULK  EQU   TVWAFLG1
TVWAXSCD EQU   TVWAFLG1
TVWATID  EQU   TVWAFLG1
TVWATAS  EQU   TVWAFLG1
TVWATIS  EQU   TVWAFLG1
TVWATOD  EQU   TVWAFLG1
TVWADIN3 EQU   TVWADLST+8
TVWADIN2 EQU   TVWADLST+4
TVWADIN1 EQU   TVWADLST
TVWAECB3 EQU   TVWAECBL+8
TVWATECB EQU   TVWA+116
TVWALNSV EQU   TVWA+111
@NM00061 EQU   TVWAFLG7
TVWACHSE EQU   TVWAFLG7
TVWATOBB EQU   TVWAFLG7
TVWARISW EQU   TVWAFLG7
TVWARET  EQU   TVWAFLG7
TVWARDBF EQU   TVWAFLG7
TVWASND1 EQU   TVWAFLG7
TVWABKPG EQU   TVWAFLG7
TVWATQL2 EQU   TVWA+87
TVWATQL1 EQU   TVWA+86
TVWAATTN EQU   TVWA+85
TVWACHNL EQU   TVWA+84
TVWAGMPT EQU   TVWA+68
TVWAUSMN EQU   TVWA+60
TVWAEOQ  EQU   TVWA+52
TVWANOM  EQU   TVWA+48
TVWABOQ  EQU   TVWA+44
TVWAEIQ  EQU   TVWA+40
TVWANIM  EQU   TVWA+36
TVWABIQ  EQU   TVWA+32
TVWABFPT EQU   TVWA+20
TVWATOPQ EQU   TVWA+16
TVWATOMW EQU   TVWA+12
TVWATIMW EQU   TVWA+8
TSBXEND  EQU   TSBX+120
@NM00060 EQU   TSBX+116
TSBXTMBF EQU   TSBXTERM+2
@NM00059 EQU   TSBXTERM+1
TSBXRSZO EQU   TSBX+69
TSBXRSZI EQU   TSBX+68
TSBXCSAP EQU   TSBX+60
TSBXSRB  EQU   TSBX+56
TSBXSRBI EQU   TSBX+52
@NM00058 EQU   TSBX+48
@NM00057 EQU   TSBX+33
@NM00056 EQU   TSBXFLG1
TSBXWREC EQU   TSBXFLG1
TSBXLOGF EQU   TSBXFLG1
TSBXASCI EQU   TSBXFLG1
@NM00055 EQU   TSBX+16
@NM00054 EQU   TSBX+12
TSBXBCK  EQU   TSBX+4
TSBXFWD  EQU   TSBX
TSBEND   EQU   TSB+120
TSBSF1   EQU   TSB+112
TSBALTC  EQU   TSB+103
TSBALTR  EQU   TSB+102
TSBPRMC  EQU   TSB+101
TSBPRMR  EQU   TSB+100
TSBPSWD  EQU   TSB+88
TSBLECB  EQU   TSBMINL
TSBLINE  EQU   TSB+82
TSBSTAX  EQU   TSB+81
TSBATTNC EQU   TSB+80
TSBF1V   EQU   TSBTPOST+7
TSBF1M   EQU   TSBTPOST+6
TSBF2V   EQU   TSBTPOST+5
TSBF2M   EQU   TSBTPOST+4
TSBFLAGV EQU   TSBTPOST+3
TSBFLAGM EQU   TSBTPOST+2
TSBSBASV EQU   TSBTPOST+1
@NM00053 EQU   TSBTPFLG
@NM00052 EQU   TSBTPFLG
@NM00051 EQU   TSBTPFLG
@NM00050 EQU   TSBTPFLG
TSBNEWID EQU   TSBTPFLG
TSBTPAYI EQU   TSBTPFLG
TSBTPQCB EQU   TSBTPFLG
TSBPOSTO EQU   TSBTPFLG
TSBLINKB EQU   TSBLINKA+1
TSBPRI   EQU   TSBLINKA
TSBRQCB  EQU   TSBRCB
TSBCTCB  EQU   TSB+60
TSBERSDS EQU   TSB+56
TSBAUTOI EQU   TSB+52
TSBAUTOS EQU   TSB+48
TSBATNCC EQU   TSB+44
TSBASRCE EQU   TSB+42
TSBHLDL  EQU   TSBFLG4
TSBGETBF EQU   TSBFLG4
TSBCANC  EQU   TSBFLG4
TSBHOLD  EQU   TSBFLG4
TSBHUNG  EQU   TSBFLG4
TSBOWAIT EQU   TSBFLG4
TSBIWAIT EQU   TSBFLG4
TSBOCAB  EQU   TSBFLG4
TSBLNNO  EQU   TSB+40
TSBATNTC EQU   TSB+38
TSBATNLC EQU   TSB+36
TSBCHDCC EQU   TSBSTCC+1
TSBLNDCC EQU   TSBSTCC
TSBWTJID EQU   TSB+32
TSBECB   EQU   TSB+28
TSBC1050 EQU   TSBTERM2
@NM00049 EQU   TSBTERM2
@NM00048 EQU   TSBTERM2
@NM00047 EQU   TSBTERM2
@NM00046 EQU   TSBTERM2
TSBCTWX  EQU   TSBTERM2
@NM00045 EQU   TSBTERM2
@NM00044 EQU   TSBTERM2
@NM00043 EQU   TSBTERM1
@NM00042 EQU   TSBTERM1
@NM00041 EQU   TSBTERM1
TSBC2741 EQU   TSBTERM1
TSBC5041 EQU   TSBTERM1
TSBCATTN EQU   TSBTERM1
TSBCBRK  EQU   TSBTERM1
TSBCIHBN EQU   TSBTERM1
TSBVTAM  EQU   TSBFLG5
TSBKEYS  EQU   TSBFLG5
@NM00040 EQU   TSBFLG5
TSBATMP  EQU   TSBFLG5
TSBNFLOP EQU   TSBFLG3
TSBNOBRK EQU   TSBFLG3
TSBTPUT  EQU   TSBFLG3
TSBAWOIP EQU   TSBFLG3
TSBNBKSP EQU   TSBFLG3
TSBSPIT  EQU   TSBFLG3
TSBTJMSG EQU   TSBFLG3
TSBATTN  EQU   TSBFLG3
TSBIBFP  EQU   TSB+21
TSBNIBF  EQU   TSB+20
TSBITBFP EQU   TSB+17
TSBSATN2 EQU   TSBFLG2
TSBSATN1 EQU   TSBFLG2
TSBSTAUT EQU   TSBFLG2
TSBAUTOC EQU   TSBFLG2
TSBAULST EQU   TSBFLG2
TSBBRKIN EQU   TSBFLG2
TSBAUTON EQU   TSBFLG2
TSBBIPI  EQU   TSBFLG2
TSBOBFP  EQU   TSB+13
TSBNOBF  EQU   TSB+12
TSBOTBFP EQU   TSB+9
TSBLNSZ  EQU   TSB+8
TSBWTCB  EQU   TSB+5
TSBTJBF  EQU   TSBFLG1
TSBTJIP  EQU   TSBFLG1
TSBTJOW  EQU   TSBFLG1
TSBIFLSH EQU   TSBFLG1
TSBWOWIP EQU   TSBFLG1
TSBOWIP  EQU   TSBFLG1
TSBOFLSH EQU   TSBFLG1
TSBANSR  EQU   TSBFLG1
TSBASCB  EQU   TSBASCBA+1
TSBATNLD EQU   TSBSTAT
TSBDISC  EQU   TSBSTAT
TSBITOFF EQU   TSBSTAT
TSBNOBUF EQU   TSBSTAT
TSBLWAIT EQU   TSBSTAT
TSBINUSE EQU   TSBSTAT
TCASTEND EQU   TCAST+136
TCASDUMP EQU   TCAST+132
TCASSCHD EQU   TCAST+128
TCASOMJR EQU   TCAST+120
@NM00039 EQU   TCAST+118
TCASBR14 EQU   TCAST+116
TCASATTN EQU   TCAST+112
TCASASCI EQU   TCAST+108
@NM00038 EQU   TCAST+102
@NM00037 EQU   TCAST+100
@NM00036 EQU   TCAST+98
@NM00035 EQU   TCAST+96
@NM00034 EQU   TCAST+90
@NM00033 EQU   TCASFLG2
@NM00032 EQU   TCASFLG1
TCASNACT EQU   TCASFLG1
TCASVSD  EQU   TCASFLG1
TCASMDSW EQU   TCASFLG1
TCASBKMD EQU   TCASFLG1
TCASEXIT EQU   TCAST+80
TCASOQM  EQU   TCAST+76
TCASIQM  EQU   TCAST+72
TCASTSB  EQU   TCAST+68
TCASWA   EQU   TCAST+60
TCASFRR  EQU   TCAST+56
TCASDATO EQU   TCAST+48
TCASDATI EQU   TCAST+44
TCASTID  EQU   TCAST+32
@NM00031 EQU   TCAST+31
TCASCHNL EQU   TCAST+30
TCASCRSZ EQU   TCAST+28
TCASRCON EQU   TCAST+16
TCASUMAX EQU   TCASUSER+2
TCASUSEC EQU   TCASUSER
TCASID   EQU   TCAST
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00030 EQU   CVTFIX+248
@NM00029 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00028 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00027 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00026 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00025 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
@NM00024 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00023 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00022 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00021 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00020 EQU   FLCFSA
@NM00019 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00018 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00017 EQU   FLCIOA
@NM00016 EQU   FLCMCLA+15
@NM00015 EQU   FLCMCLA+14
@NM00014 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00013 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00012 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00011 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00010 EQU   FLCPER
@NM00009 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00008 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00007 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00006 EQU   FLCPIILC
@NM00005 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00004 EQU   FLCSVILC
@NM00003 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00002 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00001 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00209 EQU   CE0001@
@ENDDATA EQU   *
         END   IKTXINIT,(C'PLS2248',0701,78045)
