)ATTR
 @ TYPE(OUTPUT) INTENS(LOW)
 # TYPE(OUTPUT) INTENS(HIGH)
 ^ TYPE(INPUT) INTENS(LOW) CAPS(ON) JUST(LEFT)
)BODY
%--------------------------  TSO COMMAND PROCESSOR  --------------------
+ENTER/SELECT TSO COMMAND OR CLIST BELOW:
+
_S1 %===>^VCMD1


_S2 %===>^VCMD2
_S3 %===>^VCMD3
_S4 %===>^VCMD4
_S5 %===>^VCMD5
_S6 %===>^VCMD6
_S7 %===>^VCMD7
_S8 %===>^VCMD8
_S9 %===>^VCMD9
_S10%===>^VCMD10
_S11%===>^VCMD11
_S12%===>^VCMD12
_S13%===>^VCMD13
_S14%===>^VCMD14
_S15%===>^VCMD15
)INIT
.HELP = V00TT1
IF  (.MSG = &Z)
    .MSG = &VMSG
    &VMSG = &Z
)PROC
&VHELP1 = TRUNC(&VCMD1,' ')
&VHELP2 = TRUNC(&VCMD2,' ')
&VHELP3 = TRUNC(&VCMD3,' ')
&VHELP4 = TRUNC(&VCMD4,' ')
&VHELP5 = TRUNC(&VCMD5,' ')
&VHELP6 = TRUNC(&VCMD6,' ')
&VHELP7 = TRUNC(&VCMD7,' ')
&VHELP8 = TRUNC(&VCMD8,' ')
&VHELP9 = TRUNC(&VCMD9,' ')
&VHELP10 = TRUNC(&VCMD10,' ')
&VHELP11 = TRUNC(&VCMD11,' ')
&VHELP12 = TRUNC(&VCMD12,' ')
&VHELP13 = TRUNC(&VCMD13,' ')
&VHELP14 = TRUNC(&VCMD14,' ')
&VHELP15 = TRUNC(&VCMD15,' ')
)END
