//XM4000   JOB 1,FLYNN,MSGLEVEL=(1,1)
//   EXEC RPGCOMPL
//RPG.LIBRARY  DD DSNAME=CIETE.H002.LD(XM4000)
//RPG.SYSIN  DD *
0101 H
0102 FDISKIN  IPE F7200 400            DISK14       S
0103 FDDPRINT O   V 132 132     OF    LDISK14       S
0105 F*****************************************************************
0106 F*                                                               *
0107 F*   THIS PROGRAM  PRINTS  THE  MAX  ELAPSED AND CPU TIME        *
0108 F*              USED BY EACH PROGRAM                             *
0109 F*                                                               *
0110 F*   INPUT  IS       SORTED  VERSION  OF  FILE PRODUCED BY ALT   *
0111 F*                                                               *
0112 F*                                                               *
0113 F*                                                               *
0114 F*                                                               *
0115 F*                                                               *
0116 F*                                                               *
0117 F*                                                               *
0118 F*                                                               *
0119 F*                                                               *
0120 F*****************************************************************
0104 LDDPRINT 0010105612
0201 IDISKIN  AA  01   1 C4
0202 I                                       23  30 PGM   L1
0203 I                                    P  39  410CORE            99
0204 I                                    P  42  462START
0205 I                                    P  47  512END
0206 I                                    P  52  562CPU
0209 I        AB  02
     C                     SETOF                     94
     C   01N95             Z-ADD0         COREX   50
     C   01N95             SETON                     95
     C   01N99   CORE      COMP COREX                94
     C   94                MOVE CORE      COREX
0303 C   01      COUNT     ADD  1         COUNT   90       RO. OF EXECS
0305 C   01      END       SUB  START     TIM1    92   98  OVER
0306 C   98      TIM1      ADD  86400     TIM1                 MIDNIGHT
0307 C   01      TIM1      ADD  TIM2      TIM2   152       TOTAL TIME
0308 C   01      CPU       ADD  CPUTOT    CPUTOT 152       CPU TIME
0401 ODDPRINT H   01   1P
0402 O       OR        OF
04061O                                   71 'CORE(K)'
0403 O                                   62 'CPU TIME (SECS)'
0404 O                                   44 'ELAPSED TIME (SECS)'
0405 O                                   23 'NUMBER'
0406 O                                   10 'PROGRAM'
0407 O        T 2      L1
04081O                         COREX ZB  71
0408 O                         CPUTOT B  62 '            0.  '
0409 O                         TIM2   B  44 '            0.  '
0410 O                         COUNT ZB  23
0411 O                         PGM       11
/*
