//HASPMOD PROC UTILPRT='SYSOUT=B',
//     DUMPRT='SYSOUT=B',
//     ASMPRT='SYSOUT=B',
//     ATYPE=TRK,
//     APRIME=95,
//     ASEC=10,
//     APRTBLK=121,
//     OBJDS='SYS1.HASPOBJN',
//        MODULES=ALL
//SELECT EXEC PGM=HASPSEL
//STEPLIB DD DSN=HO.HASPLIB,DISP=SHR
//SYSPRINT DD &UTILPRT
//SYSUT1 DD DSN=SYS1.HASPUPDT,DISP=SHR
//SYSUT2 DD DSN=&&SELECT,DISP=(,PASS,DELETE),
//     UNIT=DISK,SPACE=(TRK,(10,2)),
//     DCB=(RECFM=FB,LRECL=80,BLKSIZE=4000)
//SYSIN DD DDNAME=INPUT
//SYSUDUMP DD &DUMPRT
//NEWMODS EXEC PGM=IEBGENER
//SYSPRINT DD &UTILPRT
//SYSUT1 DD DDNAME=INPUT
//SYSUT2 DD DSN=&&SELECT,DISP=(MOD,PASS,DELETE)
//SYSIN DD DUMMY
//SORT EXEC PGM=SORT,PARM='MSG=CC,CORE=80000'
//SORTLIB DD DSN=SM01.SORTLIB,DISP=SHR
//SORTWK01 DD UNIT=DISK,SPACE=(TRK,(10),,CONTIG)
//SORTWK02 DD UNIT=DISK,SPACE=(TRK,(10),,CONTIG)
//SORTWK03 DD UNIT=DISK,SPACE=(TRK,(10),,CONTIG)
//SORTIN DD DSN=&&SELECT,DISP=(OLD,DELETE,DELETE)
//SORTOUT DD DSN=&&SORTED,DISP=(,PASS,DELETE),
//     UNIT=DISK,SPACE=(TRK,(10,2)),
//     DCB=(RECFM=FB,LRECL=80,BLKSIZE=4000)
//SYSIN DD DSN=HO.CLIB(ZZ15),DISP=SHR
//UNDUPE EXEC PGM=HASPUNDP
//STEPLIB DD DSN=HO.HASPLIB,DISP=SHR
//SYSPRINT DD &UTILPRT
//SYSUT1 DD DSN=&&SORTED,DISP=(OLD,DELETE,DELETE)
//SYSUT2 DD DSN=&&UPDATES,DISP=(,PASS,DELETE),UNIT=DISK,
//     DCB=(RECFM=FB,LRECL=80,BLKSIZE=4000),
//     SPACE=(TRK,(10,2))
//SYSUDUMP DD &DUMPRT
//UPDATE EXEC PGM=IEBUPDTE
//SYSPRINT DD &UTILPRT
//SYSUT1 DD DSN=SYS1.HASPSRC,DISP=SHR
//SYSUT2 DD DSN=HASPNSR,DISP=(,CATLG,DELETE),UNIT=DISK,
//     SPACE=(CYL,(5,2,20)),
//     DCB=(RECFM=FB,LRECL=80,BLKSIZE=4000,DSORG=PO)
//SYSIN DD DSN=&&UPDATES,DISP=(OLD,DELETE,DELETE)
//ASM EXEC PGM=HASMDRIV,
//     PARM='&MODULES'
//STEPLIB DD DSN=HO.HASPLIB,DISP=SHR
//SYSPRINT DD &ASMPRT,SPACE=(&ATYPE,(&APRIME,&ASEC)),
//     DCB=BLKSIZE=&APRTBLK
//SYSUT1 DD UNIT=DISK,SPACE=(CYL,(10,2))
//SYSUT2 DD UNIT=DISK,SPACE=(CYL,(10,2))
//SYSUT3 DD UNIT=DISK,SPACE=(CYL,(10,2))
//SYSLIB DD DSN=HASPNSR,DISP=(OLD)
// DD DSN=SYS1.HASPSRC,DISP=SHR
//  DD DSN=SYS1.MACLIB,DISP=SHR
//SYSGO    DD DSN=&OBJDS(EAB),DISP=OLD
//SYSIN DD DSN=HASPNSR(EAB),DISP=(OLD,DELETE,DELETE)
//SYSUDUMP DD &DUMPRT
