         MACRO
         HMONREC
HMONREC  DSECT
BSTAMP   DS    2F
BACT     DS    C
BBUF     DS    C
BTPBUF   DS    C
BCMB     DS    C
BSTAT    DS    C
BECF     DS    2C
BVAR     DS    0C
         MEND
