         MACRO
         RARMACRO &PROGRAM
*
*        THIS MACRO GIVES THE RECORD FORMAT FOR THE ARCHIVE QUEUE
*        AND THE ACTION FLAGS FOR ARCHIVE QUEUE
*
*        ARCHIVE QUEUE STRUCTURE
*
* EACH QUEUE BLOCK CONSISTS OF 32 ENTRIES OF 127 CHARACTERS EACH
*      (--> BLKSIZE=4064,RECFM=F,LRECL=4064)
*
* THE LAST RECORD USED HAS FLAGEND SET
* THE LAST POSSIBLE ENTRY IN A BLOCK HAS BLKEND SET
* THE LAST BLOCK ALWAYS HAS QUEEND SET IN THE LAST POSSIBLE ENTRY
*
* IE     +-------------------------------------+
*        ×            ENTRY                  × ×
*        +-------------------------------------+
*        ×            ENTRY                  × ×
*        +-------------------------------------+
*        ×            ENTRY                  ×*× <--- FLAGEND
*        +-------------------------------------+
*        ×            NOT USED               × ×
*        +-------------------------------------+
*        ×            NOT USED               × ×
*        +-------------------------------------+
*        ×            NOT USED               ×#× <--- BLKEND AND
*        +-------------------------------------+     QUEEND IF LAST BLK
*
* NOTE: THE FIRST ENTRY IN THE QUEUE IS ALWAYS A DUMMY ENTRY TO HOLD
*       THE FLAGEND MARKER WHEN THE QUEUE IS EMPTY
*
         DSECT
QUEUEMAP DSECT
QDSN     DS    CL44                DSN
QVOLSER  DS    CL6                 VOLUME OF DS
QUSERID  DS    CL7                 USERID MAKING REQUEST
QDATE    DS    CL6                 DATE ARCHIVED USED FOR RETURN
QTAPE    DS    CL6                 TAPE VOL   - USED FOR RETURN
QTLBL    DS    CL4                 TAPE LABEL - USED FOR RETURN
QKEY     DS    CL8                 ARCHIVE KEY
QNEWDSN  DS    CL44                NEWNAME FOR RETURN
QACTION  DS    XL1                 08=RETURN,04=RETURN,02=SCRATCHED
*
*        ARCHIVE QUEUE ACTION FLAGS
*
FLAGARC  EQU   X'08'               ARCHIVE DS
FLAGRET  EQU   X'04'               RETURN DS FROM TAPE
FLAGDEL  EQU   X'02'               SCRATCHED QUEUE ENTRY
FLAGNNME EQU   X'01'               RETURN AS NEWNAME
BADBITS  EQU   X'F0'               SHOULD NOT BE SET
*
QEND     DS    XL1
FLAGEND  EQU   X'08'               END FLAG
BLKEND   EQU   X'80'               END OF BLOCK FLAG
QUEEND   EQU   X'10'               END OF QUEUE FLAG
RECSIZE  EQU   *-QUEUEMAP          SIZE OF A RECORD
BLKSIZE  EQU   32*RECSIZE          SIZE OF A BLOCK
**********************************************************************
*
*        TRACE RECORD DEFINITION
*
         AIF  ('&PROGRAM' NE 'RARTRACE').L1
RARTRACE CSECT
TRACEMAP EQU   *
         AGO   .L11
.L1      ANOP
TRACEMAP DSECT
.L11     ANOP
TRACEUSR DS    CL7                 USERID )  ALTERNATE INDEX 1
TRACEKEY DS    CL8                 KEY    )
TRACEDSN DS    CL44                DSN       ALTERNAME INDEX 2
TRACEDAT DS    CL6                 DATE
TRACEDSK DS    CL6                 DISK VOLSER
TRACETPE DS    CL6                 TAPE VOLSER
TRACELBL DS    CL4                 TAPE LABEL
TRACEDVC DS    XL4                 DEVICE TYPE WHERE DSN ORIGINATED
TRACEDS1 DS    XL96                DSCB1          FORMAT1
TRACEDS3 DS    XL140               DSCB2 IF USED  FORMAT3
TRECSIZE EQU   *-TRACEMAP          RECORD LENGTH
**********************************************************************
*
*        FDR CONTROL RECORD DEFINITION
* COMMENTS IN THE FDR CONTROL RECORD PASS FROM RARDUMP AND RARRETN
*          TO BE INTERPRETED BY RARTRACE
*
FDRCNTL  DSECT
* RECORD 1
* 0----+----1----+----2----+----3--     +----8
* '  DUMP    TYPE=DSF,MAXCARDS=NUM.  E.     1 ' TOTAL 80 BYTES
* '  RESTORE TYPE=DSF                       1 ' TOTAL 80 BYTES
FDRR1    DS    0CL80
         DC    CL2' '
FDR1TYPE DC    C'RESTORE'        OR 'DUMP   '
         DC    C' '
FDR1TYP  DC    C'TYPE'
         DC    C'=DSF,MAXCARDS=' (MAXCARDS NOT PRESENT IF RESTORE)
FDR1NUM  DS    CL4               MAXIMUM NUMBER OF CARDS EXPECTED
         DC    CL46' '
FDR1ID   DC    C'1 '
         ORG   FDRCNTL
* RECORD 2
* 0----+--        ---+----6----+----7----+----8
* ' S DSN=...44..., .DISK.       .TAPE.      2 ' TOTAL 80 BYTES
* '                       USERID.      LBL.    '
FDRR2    DS    0CL80
         DC    C' S DSN='
FDR2DSN  DS    CL44              DATASET NAME
         DC    C', '             OPTIONAL ,
FDR2DSK  DS    CL6               DISK VOLSER
FDR2USR  DS    CL7               REQUESTING USERID
FDR2TPE  DS    CL6               TAPE VOLSER
FDR2LBL  DS    CL4               TAPE LABEL
         DC    CL2' '
FDR2ID   DC    C'2 '
         ORG   FDRCNTL
* RECORD 3
* 0----+----1        +----6----+----7----+----8
* '* NEWNAME=...44... ..KEY...               3 '  TOTAL 80 BYTES
FDRR3    DS    0CL80
         DC    C'* NEWNAME='     COMMENT FOR DUMP, NEWNAME= FOR RETURN
FDR3DSN  DS    CL44              NEW DSN (RETURN ONLY)
         DC    C' '
FDR3KEY  DS    CL8               ARCHIVE KEY
         DC    CL15' '
FDR3ID   DC    C'3 '
         MEND
