         TITLE '**************** IDCNC01: NULLIFYC FSR *****************
               *        '
        MACRO
        GETMAIN &R,&LV=
        L     REG15,0(REG1)           GDTTBL ADDRESS
        L     REG15,GDTPRL(REG15)     PROL ROUTINE ADDRESS
        CNOP  2,4                     BOUNDARY ALIGNMENT
        LA    REG14,*+14              RETURN ADDRESS
        BALR  REG1,REG15              LINKAGE TO PROL ROUTINE
        DC    A(MODID)                MODULE ID ADDRESS
        DC    A(@SIZDATD)             AUTOMATIC STORAGE SIZE ADDRESS
        MEND
IDCNC01  CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'IDCNC01   76.201'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @10,0                                               0002
@PSTART  LA    @12,4095(,@10)                                      0002
         USING @PSTART,@10                                         0002
         USING @PSTART+4095,@12                                    0002
         L     @00,@SIZDATD                                        0002
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0002
         USING @DATD,@11                                           0002
         ST    @13,@SA00001+4                                      0002
         LM    @00,@01,20(@13)                                     0002
         ST    @11,8(,@13)                                         0002
         LR    @13,@11                                             0002
         MVC   @PC00001(12),0(@01)                                 0002
*   IF GDTDBG=NULLPTR THEN                                         0231
         L     @15,@PC00001                                        0231
         L     @15,GDTDBG(,@15)                                    0231
         LTR   @15,@15                                             0231
         BZ    @RT00231                                            0231
*     ;                                                            0232
*   ELSE                                                           0233
*     CALL IDCDB010(GDTTBL,'NCAA'); /*                       @Z40LB38*/
         L     @15,@PC00001                                        0233
         ST    @15,@AL00001                                        0233
         LA    @14,@CC01094                                        0233
         ST    @14,@AL00001+4                                      0233
         MVI   @AL00001+4,X'80'                                    0233
         L     @15,GDTDBG(,@15)                                    0233
         LA    @01,@AL00001                                        0233
         BALR  @14,@15                                             0233
*   OLDERID2=NEWERID2;                                             0234
@RT00231 L     @15,@PC00001                                        0234
         L     @15,GDTTR2(,@15)                                    0234
         MVC   @TS00001(95),NEWERID2(@15)                          0234
         MVC   OLDERID2(95,@15),@TS00001                           0234
*   NEWID2='NCAA';                  /*                       @Z40LB38*/
*                                                                  0235
         MVC   NEWID2(4,@15),@CC01094                              0235
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE POINTERS AND SET THE PARAMETERS LISTS      @Z40LB38*/
*   /* TO 0. PRINTAB IS USED FOR THE PRINT PARM LIST AND NULLCA IS   */
*   /* THE PARAMETER LIST PASSED TO THE USSC MACRO TO DO THE NULLIFYC*/
*   /* FUNCTION.                                             @Z40LB38*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0236
*   DDSTRU=ADDR(PRINTAB);           /*                       @Z40LB38*/
         LA    @15,PRINTAB                                         0236
         ST    @15,DDSTRU                                          0236
*   NULLCPTR=ADDR(NULLCA);          /*                       @Z40LB38*/
         LA    @15,NULLCA                                          0237
         ST    @15,NULLCPTR                                        0237
*   NULLCX=''B;                     /*                       @Z40LB38*/
         XC    NULLCX(44,@15),NULLCX(@15)                          0238
*   PRINTAB=''B;                    /*                       @Z40LB38*/
         XC    PRINTAB(20),PRINTAB                                 0239
*   LASTCOND=''B;                   /*                       @Z40LB38*/
*                                                                  0240
         L     @15,@PC00001+8                                      0240
         SLR   @14,@14                                             0240
         STH   @14,LASTCOND(,@15)                                  0240
*   /*****************************************************************/
*   /*                                                               */
*   /* TEST IF THE CARTRIDGE SERIAL NUMBER WAS SPECIFIED.    @Z40LB38*/
*   /* IF YES, TEST THE LENGTH AND CALL CKCSNLEN IF NOT 12 CHARACTERS*/
*   /* LONG.                                                 @Z40LB38*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0241
*   IF ADDR(CART)^=0 THEN                                          0241
         L     @15,@PC00001+4                                      0241
         L     @15,FDTPTR+12(,@15)                                 0241
         LTR   @15,@15                                             0241
         BZ    @RF00241                                            0241
*     DO;                           /*                       @Z40LB38*/
*       CSNNAME=CARTVAL;            /*                       @Z40LB38*/
*                                                                  0243
         MVC   CSNNAME(12),CARTVAL(@15)                            0243
*       /*************************************************************/
*       /*                                                           */
*       /* TEST THE CSN LENGTH. IF IT IS NOT 12 CHARACTERS,  @Z40LB38*/
*       /* CALL CKCSNLEN TO CHECK FOR SYNTAX AND INSERT A BLANK IN   */
*       /* THE FOURTH POSITION IF IT IS 11 CHARS.            @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0244
*       IF CARTLEN^=MAXCSNLN THEN                                  0244
         CLI   CARTLEN(@15),12                                     0244
         BE    @RF00244                                            0244
*         DO;                       /*                       @Z40LB38*/
*           CSNL=CARTLEN;           /*                       @Z40LB38*/
         MVC   CSNL(1),CARTLEN(@15)                                0246
*           CALL CKCSNLEN(CSNNAME,CSNL);/*                   @Z40LB38*/
         LA    @15,CSNNAME                                         0247
         ST    @15,@AL00001                                        0247
         LA    @15,CSNL                                            0247
         ST    @15,@AL00001+4                                      0247
         LA    @01,@AL00001                                        0247
         BAL   @14,CKCSNLEN                                        0247
*           RESPECIFY                                              0248
*             RTNREG RSTD;                                         0248
*           TESTRC=RTNREG;                                         0249
         LR    TESTRC,RTNREG                                       0249
*           RESPECIFY                                              0250
*             RTNREG UNRSTD;        /*                       @Z40LB38*/
*           LASTCOND=TESTRC;        /*                       @Z40LB38*/
         L     @02,@PC00001+8                                      0251
         STH   TESTRC,LASTCOND(,@02)                               0251
*         END;                      /*                       @Z40LB38*/
*     END;                          /*                       @Z40LB38*/
*                                                                  0253
@RF00244 DS    0H                                                  0254
*   /*****************************************************************/
*   /*                                                               */
*   /* TEST IF THE RETURN CODE FROM CKCSNLEN IS 0. IF YES,   @Z40LB38*/
*   /* CONTINUE. IF NO, SET LASTCOND TO 12.                  @Z40LB38*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0254
*   IF LASTCOND=LASTCC00 THEN                                      0254
@RF00241 SLR   @15,@15                                             0254
         L     @14,@PC00001+8                                      0254
         CH    @15,LASTCOND(,@14)                                  0254
         BNE   @RF00254                                            0254
*     DO;                           /*                       @Z40LB38*/
*                                                                  0255
*       /*************************************************************/
*       /*                                                           */
*       /* TEST IF THE ACTIVE PARAMETER IS SPECIFIED. IF YES,        */
*       /*                                                   @Z40LB38*/
*       /* BUILD THE PARAMETER LIST TO UPDATE THE MSC TABLES AND MSVI*/
*       /* DATA SET FOR AN ACTIVE VOLUME.                    @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0256
*       IF ADDR(ACT)^=0 THEN                                       0256
         L     @14,@PC00001+4                                      0256
         C     @15,FDTPTR(,@14)                                    0256
         BE    @RF00256                                            0256
*         DO;                       /*                       @Z40LB38*/
*           NULVOLID=VOLVAL;        /*                       @Z40LB38*/
         L     @09,NULLCPTR                                        0258
         L     @01,FDTPTR+16(,@14)                                 0258
         MVC   NULVOLID(6,@09),VOLVAL(@01)                         0258
*           NULVOL=ON;              /*                       @Z40LB38*/
         OI    NULVOL(@09),B'10000000'                             0259
*           IF ADDR(SEQ1)^=0 THEN                                  0260
         C     @15,FDTPTR+24(,@14)                                 0260
         BE    @RF00260                                            0260
*             NULCART1=ON;          /*                       @Z40LB38*/
         OI    NULCART1(@09),B'00000100'                           0261
*           IF ADDR(SEQ2)^=0 THEN                                  0262
@RF00260 L     @15,@PC00001+4                                      0262
         L     @15,FDTPTR+28(,@15)                                 0262
         LTR   @15,@15                                             0262
         BZ    @RF00262                                            0262
*             NULCART2=ON;          /*                       @Z40LB38*/
         L     @01,NULLCPTR                                        0263
         OI    NULCART2(@01),B'00000010'                           0263
*         END;                      /*                       @Z40LB38*/
*                                                                  0264
@RF00262 DS    0H                                                  0265
*       /*************************************************************/
*       /*                                                           */
*       /* TEST IF THE INACTIVE PARAMETER IS SPECIFIED. IF YES, BUILD*/
*       /* THE PARAMETER LIST TO UPDATE THE MSC TABLES AND MSVI DATA */
*       /* SET FOR AN INACTIVE VOLUME.                       @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0265
*       IF ADDR(INACT)^=0 THEN                                     0265
@RF00256 SLR   @15,@15                                             0265
         L     @14,@PC00001+4                                      0265
         C     @15,FDTPTR+4(,@14)                                  0265
         BE    @RF00265                                            0265
*         DO;                       /*                       @Z40LB38*/
*           NULCSN=CSNNAME;         /*                       @Z40LB38*/
         L     @09,NULLCPTR                                        0267
         MVC   NULCSN(12,@09),CSNNAME                              0267
*           NULTRAN=ON;             /*                       @Z40LB38*/
         OI    NULTRAN(@09),B'01000000'                            0268
*           IF ADDR(SEQ1)^=0 THEN                                  0269
         C     @15,FDTPTR+24(,@14)                                 0269
         BE    @RF00269                                            0269
*             NULCART1=ON;          /*                       @Z40LB38*/
         OI    NULCART1(@09),B'00000100'                           0270
*           IF ADDR(SEQ2)^=0 THEN                                  0271
@RF00269 L     @15,@PC00001+4                                      0271
         L     @15,FDTPTR+28(,@15)                                 0271
         LTR   @15,@15                                             0271
         BZ    @RF00271                                            0271
*             NULCART2=ON;          /*                       @Z40LB38*/
         L     @01,NULLCPTR                                        0272
         OI    NULCART2(@01),B'00000010'                           0272
*         END;                      /*                       @Z40LB38*/
*                                                                  0273
@RF00271 DS    0H                                                  0274
*       /*************************************************************/
*       /*                                                           */
*       /* TEST IF THE SCRATCHCARTRIDGE PARAMETER IS SPECIFIED.      */
*       /*                                                   @Z40LB38*/
*       /* IF YES, BUILD THE PARAMETER LIST TO UPDATE THE SCRATCH    */
*       /* CARTRIDGE LIST PORTION OF THE MSC TABLES.         @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0274
*       IF ADDR(SCRC)^=0 THEN                                      0274
@RF00265 L     @15,@PC00001+4                                      0274
         L     @15,FDTPTR+8(,@15)                                  0274
         LTR   @15,@15                                             0274
         BZ    @RF00274                                            0274
*         DO;                       /*                       @Z40LB38*/
*           NULCSN=CSNNAME;         /*                       @Z40LB38*/
         L     @15,NULLCPTR                                        0276
         MVC   NULCSN(12,@15),CSNNAME                              0276
*           NULSCRC=ON;             /*                       @Z40LB38*/
         OI    NULSCRC(@15),B'00100000'                            0277
*         END;                      /*                       @Z40LB38*/
*                                                                  0278
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE THE UDUMP MACRO TO TAKE SYMBOLIC DUMP       @Z40LB38*/
*       /* OF USSC PARAMETER LIST                            @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0279
*       IF GDTDBG=NULLPTR THEN                                     0279
@RF00274 L     @15,@PC00001                                        0279
         L     @15,GDTDBG(,@15)                                    0279
         LTR   @15,@15                                             0279
         BZ    @RT00279                                            0279
*         ;                                                        0280
*       ELSE                                                       0281
*         DO;                                                      0281
*           DMPINDEX=ADDR(DMPSTG);  /*                       @Z40LB38*/
         LA    DMPINDEX,DMPSTG                                     0282
*           DMPITMNM='NULLCA';                                     0283
         MVI   DMPITMNM+6(DMPINDEX),C' '                           0283
         MVI   DMPITMNM+7(DMPINDEX),C' '                           0283
         MVC   DMPITMNM(6,DMPINDEX),@CC01097                       0283
*           DMPITMPT=ADDR(NULLCA);                                 0284
         LA    @03,NULLCA                                          0284
         ST    @03,DMPITMPT(,DMPINDEX)                             0284
*           DMPITMLN=LENGTH(NULLCA);                               0285
         MVC   DMPITMLN(2,DMPINDEX),@CH00783                       0285
*           DMPITMTP='H';                                          0286
         MVI   DMPITMTP(DMPINDEX),C'H'                             0286
*           DMPINDEX=DMPINDEX+DMPELEMT;/*                    @Z40LB38*/
         AL    DMPINDEX,@CF00473                                   0287
*           DMPTRM=DMPTRMVL;                                       0288
         MVI   DMPTRM(DMPINDEX),X'FF'                              0288
*         END;                      /*                       @Z40LB38*/
*       IF GDTDBG=NULLPTR THEN                                     0290
@RT00279 L     @15,@PC00001                                        0290
         L     @15,GDTDBG(,@15)                                    0290
         LTR   @15,@15                                             0290
         BZ    @RT00290                                            0290
*         ;                                                        0291
*       ELSE                                                       0292
*         CALL IDCDB010(GDTTBL,'NCAB',ADDR(DMPSTG));/*       @Z40LB38*/
         L     @15,@PC00001                                        0292
         ST    @15,@AL00001                                        0292
         LA    @14,@CC01099                                        0292
         ST    @14,@AL00001+4                                      0292
         LA    @14,DMPSTG                                          0292
         ST    @14,@AFTEMPS                                        0292
         LA    @14,@AFTEMPS                                        0292
         ST    @14,@AL00001+8                                      0292
         MVI   @AL00001+8,X'80'                                    0292
         L     @15,GDTDBG(,@15)                                    0292
         LA    @01,@AL00001                                        0292
         BALR  @14,@15                                             0292
*       CALL IDCSASS0(GDTTBL,NULLIFYC,NULLCPTR,REASONCD,ECBCODE,MSGPTR)
*           ;                       /*                       @Z40LB38*/
@RT00290 L     @02,@PC00001                                        0293
         ST    @02,@AL00001                                        0293
         LA    @15,NULLIFYC                                        0293
         ST    @15,@AL00001+4                                      0293
         LA    @15,NULLCPTR                                        0293
         ST    @15,@AL00001+8                                      0293
         LA    @15,REASONCD                                        0293
         ST    @15,@AL00001+12                                     0293
         LA    @15,ECBCODE                                         0293
         ST    @15,@AL00001+16                                     0293
         LA    @15,MSGPTR                                          0293
         ST    @15,@AL00001+20                                     0293
         MVI   @AL00001+20,X'80'                                   0293
         L     @15,GDTSSC(,@02)                                    0293
         LA    @01,@AL00001                                        0293
         BALR  @14,@15                                             0293
*       RESPECIFY                                                  0294
*         RTNREG RSTD;                                             0294
*       TESTRC=RTNREG;                                             0295
         LR    TESTRC,RTNREG                                       0295
*       RESPECIFY                                                  0296
*         RTNREG UNRSTD;            /*                       @Z40LB38*/
*                                                                  0296
*       /*************************************************************/
*       /*                                                           */
*       /* TEST FOR SUCCESSFUL RETURN CODES OF 0 OR 12 FROM  @Z40LB38*/
*       /* USSC. ALSO TEST IF THE ACTIVE OR INACTIVE PARAMETERS WERE */
*       /* SPECIFIED. IF YES, ISSUE MESSAGE IDC01190I INDICATING THAT*/
*       /* A CARTRIDGE WAS RETURNED TO THE SCRATCH CARTRIDGE LIST.   */
*       /*                                                   @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0297
*       IF(TESTRC=0×TESTRC=12)&(ADDR(ACT)^=0×ADDR(INACT)^=0) THEN  0297
*                                                                  0297
         LTR   TESTRC,TESTRC                                       0297
         BZ    @GL00001                                            0297
         C     TESTRC,@CF00567                                     0297
         BNE   @RF00297                                            0297
@GL00001 SLR   @02,@02                                             0297
         L     @15,@PC00001+4                                      0297
         C     @02,FDTPTR(,@15)                                    0297
         BNE   @RT00297                                            0297
         C     @02,FDTPTR+4(,@15)                                  0297
         BE    @RF00297                                            0297
@RT00297 DS    0H                                                  0298
*         /***********************************************************/
*         /*                                                         */
*         /* IF BOTH CARTRIDGES WERE SPECIFIED AS MISSING,   @ZA11671*/
*         /* DO NOT ISSUE MSG IDC01190I SINCE NO CARTRIDGES WERE     */
*         /* RETURNED TO SCRATCH STATUS.                     @ZA11671*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0298
*         IF ADDR(SEQ1)^=NULLPTR&ADDR(SEQ2)^=NULLPTR/*       @ZA11671*/
*           THEN                                                   0298
         SLR   @02,@02                                             0298
         L     @15,@PC00001+4                                      0298
         C     @02,FDTPTR+24(,@15)                                 0298
         BE    @RF00298                                            0298
         C     @02,FDTPTR+28(,@15)                                 0298
         BNE   @RT00298                                            0298
*           ;                       /*                       @ZA11671*/
*         ELSE                      /*                       @ZA11671*/
*           DO;                     /*                       @Z40LB38*/
@RF00298 DS    0H                                                  0301
*             PRINTAB=''B;          /*                       @Z40LB38*/
         XC    PRINTAB(20),PRINTAB                                 0301
*             NULMPTR=ECBLEN+MSGPTR;/*                       @Z40LB38*/
         LA    NULMPTR,4                                           0302
         AL    NULMPTR,MSGPTR                                      0302
*             DARGSMOD=NCOMSG;      /*                       @Z40LB38*/
         L     @15,DDSTRU                                          0303
         MVC   DARGSMOD(3,@15),@CC01091                            0303
*             DARGSENT=MSG0119I;    /*                       @Z40LB38*/
*                                                                  0304
         MVI   DARGSENT(@15),X'01'                                 0304
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK FOR A VALID CSN1 NULLIFIED.           @ZDR2055*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0305
*             IF ADDR(SEQ2)^=NULLPTR×ADDR(NVOL)^=NULLPTR THEN      0305
         SLR   @15,@15                                             0305
         L     @14,@PC00001+4                                      0305
         C     @15,FDTPTR+28(,@14)                                 0305
         BNE   @RT00305                                            0305
         C     @15,FDTPTR+32(,@14)                                 0305
         BE    @RF00305                                            0305
@RT00305 DS    0H                                                  0306
*               DO;                 /*                       @ZDR2055*/
*                 DARGDBP=ADDR(NMCSN1);/*                    @ZDR2055*/
         L     @15,DDSTRU                                          0307
         LA    @14,NMCSN1(,NULMPTR)                                0307
         ST    @14,DARGDBP(,@15)                                   0307
*                 DARGILP=LENGTH(NMCSN1);/*                  @ZDR2055*/
         MVC   DARGILP(2,@15),@CH00567                             0308
*                 CALL AMSTP011(GDTTBL,PRTFILE,DDSTRU);/*    @Z40LB38*/
         L     @15,@PC00001                                        0309
         ST    @15,@AL00001                                        0309
         LA    @14,@CF00114                                        0309
         ST    @14,@AL00001+4                                      0309
         LA    @14,DDSTRU                                          0309
         ST    @14,@AL00001+8                                      0309
         MVI   @AL00001+8,X'80'                                    0309
         L     @15,GDTPRT(,@15)                                    0309
         LA    @01,@AL00001                                        0309
         BALR  @14,@15                                             0309
*               END;                /*                       @ZDR2055*/
*                                                                  0310
*             /*******************************************************/
*             /*                                                     */
*             /* TEST FOR A SECOND CARTRIDGE MADE INTO A     @ZDR2055*/
*             /* SCRATCH CARTRIDGE.                          @ZDR2055*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0311
*             IF ADDR(NVOL)^=NULLPTR×ADDR(SEQ1)^=NULLPTR THEN      0311
@RF00305 SLR   @15,@15                                             0311
         L     @14,@PC00001+4                                      0311
         C     @15,FDTPTR+32(,@14)                                 0311
         BNE   @RT00311                                            0311
         C     @15,FDTPTR+24(,@14)                                 0311
         BE    @RF00311                                            0311
@RT00311 DS    0H                                                  0312
*               DO;                 /*                       @ZDR2055*/
*                 DARGDBP=ADDR(NMCSN2);/*                    @ZDR2055*/
         L     @15,DDSTRU                                          0313
         LA    @14,NMCSN2(,NULMPTR)                                0313
         ST    @14,DARGDBP(,@15)                                   0313
*                 DARGILP=LENGTH(NMCSN2);/*                  @ZDR2055*/
         MVC   DARGILP(2,@15),@CH00567                             0314
*                 CALL AMSTP011(GDTTBL,PRTFILE,DDSTRU);/*    @ZDR2055*/
         L     @02,@PC00001                                        0315
         ST    @02,@AL00001                                        0315
         LA    @15,@CF00114                                        0315
         ST    @15,@AL00001+4                                      0315
         LA    @15,DDSTRU                                          0315
         ST    @15,@AL00001+8                                      0315
         MVI   @AL00001+8,X'80'                                    0315
         L     @15,GDTPRT(,@02)                                    0315
         LA    @01,@AL00001                                        0315
         BALR  @14,@15                                             0315
*               END;                /*                       @ZDR2055*/
*                                                                  0316
*             /*******************************************************/
*             /*                                                     */
*             /* TEST IF THE RETURN CODE IS 12. IF YES, SET LASTCOND */
*             /*                                             @Z40LB38*/
*             /* TO 4.                                       @Z40LB38*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0317
*             IF TESTRC=12 THEN                                    0317
@RF00311 C     TESTRC,@CF00567                                     0317
         BNE   @RF00317                                            0317
*               LASTCOND=LASTCC04;  /*                       @Z40LB38*/
         L     @02,@PC00001+8                                      0318
         MVC   LASTCOND(2,@02),@CH00041                            0318
*           END;                    /*                       @Z40LB38*/
*       ELSE                                                       0320
*         DO;                       /*                       @Z40LB38*/
*                                                                  0320
         B     @RC00297                                            0320
@RF00297 DS    0H                                                  0321
*           /*********************************************************/
*           /*                                                       */
*           /* TEST IF THE RETURN CODE IS 4. IF YES, A FAILURE       */
*           /* OCCURRED AND SSCMSG IS CALLED TO PRINT THE MESSAGE AND*/
*           /* REASON .                                      @Z40LB38*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0321
*           IF TESTRC=4 THEN                                       0321
         C     TESTRC,@CF00041                                     0321
         BNE   @RF00321                                            0321
*             DO;                   /*                       @Z40LB38*/
*               CALL SSCMSG(REASONCD,ECBCODE);/*             @Z40LB38*/
*                                                                  0323
         LA    @02,REASONCD                                        0323
         ST    @02,@AL00001                                        0323
         LA    @02,ECBCODE                                         0323
         ST    @02,@AL00001+4                                      0323
         LA    @01,@AL00001                                        0323
         BAL   @14,SSCMSG                                          0323
*               /*****************************************************/
*               /*                                                   */
*               /* TEST IF THE REASON CODE IS '200', '208' OR 209'   */
*               /* INDICATING AN ERROR OCCURRED DURING MSVC          */
*               /* PROCESSING. IF YES, SET A RETURN CODE OF '08' TO  */
*               /* INDICATE THAT THE MSC TABLES WERE UPDATED BUT THE */
*               /* MSVI DATA SET WAS NOT. IF NO, SET RETURN CODE '12'*/
*               /* TO INDICATE THAT NO UPDATES TOOK PLACE.   @Z40LB38*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0324
*               LASTCOND=LASTCC12;  /*                       @Z40LB38*/
         L     @02,@PC00001+8                                      0324
         MVC   LASTCOND(2,@02),@CH00567                            0324
*             END;                  /*                       @Z40LB38*/
*                                                                  0325
*           /*********************************************************/
*           /*                                                       */
*           /* TEST IF THE RETURN CODE IS 8 INDICATING THAT  @Z40LB38*/
*           /* STORAGE WAS NOT AVAILABLE FOR THE MESSAGE AREA. IF    */
*           /* YES, SET LASTCOND TO 12.                      @Z40LB38*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0326
*           IF TESTRC=LASTCC08 THEN                                0326
@RF00321 C     TESTRC,@CF00178                                     0326
         BNE   @RF00326                                            0326
*             LASTCOND=LASTCC12;    /*                       @Z40LB38*/
*                                                                  0327
         L     @02,@PC00001+8                                      0327
         MVC   LASTCOND(2,@02),@CH00567                            0327
*           /*********************************************************/
*           /*                                                       */
*           /* TEST IF THE RETURN CODE IS 12 INDICATING THAT AN      */
*           /*                                               @Z40LB38*/
*           /* ERROR WAS ENCOUNTERED WHEN WRITING THE UPDATED MSVI   */
*           /* RECORD TO THE MSVI DATA SET. IF YES, SET LASTCOND TO  */
*           /* 04.                                           @Z40LB38*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0328
*           IF TESTRC=12 THEN                                      0328
@RF00326 C     TESTRC,@CF00567                                     0328
         BNE   @RF00328                                            0328
*             LASTCOND=LASTCC04;    /*                       @Z40LB38*/
*                                                                  0329
         L     @02,@PC00001+8                                      0329
         MVC   LASTCOND(2,@02),@CH00041                            0329
*           /*********************************************************/
*           /*                                                       */
*           /* TEST IF THE RETURN CODE IS 0. IF YES, SET LASTCOND    */
*           /*                                               @Z40LB38*/
*           /* TO 0.                                         @Z40LB38*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0330
*           IF TESTRC=LASTCC00 THEN                                0330
@RF00328 SLR   @02,@02                                             0330
         CR    TESTRC,@02                                          0330
         BNE   @RF00330                                            0330
*             LASTCOND=LASTCC00;    /*                       @Z40LB38*/
         L     @15,@PC00001+8                                      0331
         STH   @02,LASTCOND(,@15)                                  0331
*         END;                      /*                       @Z40LB38*/
*                                                                  0332
@RF00330 DS    0H                                                  0333
*       /*************************************************************/
*       /*                                                           */
*       /* TEST IF THE RETURN CODE FROM USSC IS 0 OR 12. IF  @Z40LB38*/
*       /* YES, A MESSAGE WAS RETURNED. ISSUE THE UFSPACE MACRO TO   */
*       /* FREE THE MESSAGE AREA.                            @Z40LB38*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0333
*       IF TESTRC=0×TESTRC=12 THEN                                 0333
@RC00297 LTR   TESTRC,TESTRC                                       0333
         BZ    @RT00333                                            0333
         C     TESTRC,@CF00567                                     0333
         BNE   @RF00333                                            0333
@RT00333 DS    0H                                                  0334
*         CALL IDCSAFS0(GDTTBL,MSGPTR);/*                    @Z40LB38*/
         L     @15,@PC00001                                        0334
         ST    @15,@AL00001                                        0334
         LA    @14,MSGPTR                                          0334
         ST    @14,@AL00001+4                                      0334
         L     @15,GDTFSP(,@15)                                    0334
         LA    @01,@AL00001                                        0334
         BALR  @14,@15                                             0334
*     END;                          /*                       @Z40LB38*/
*   ELSE                                                           0336
*     LASTCOND=LASTCC12;            /*                       @Z40LB38*/
         B     @RC00254                                            0336
@RF00254 L     @15,@PC00001+8                                      0336
         MVC   LASTCOND(2,@15),@CH00567                            0336
*   PRINTAB=''B;                    /*                       @Z40LB38*/
@RC00254 XC    PRINTAB(20),PRINTAB                                 0337
*   DARGSMOD=UNIVMSG;               /*                       @Z40LB38*/
         L     @15,DDSTRU                                          0338
         MVC   DARGSMOD(3,@15),@CC01089                            0338
*   DARGDBP=ADDR(LASTCOND);         /*                       @Z40LB38*/
         L     @14,@PC00001+8                                      0339
         ST    @14,DARGDBP(,@15)                                   0339
*   DARGILP=LENGTH(LASTCOND);       /*                       @Z40LB38*/
         MVC   DARGILP(2,@15),@CH00152                             0340
*   IF LASTCOND=LASTCC12 THEN                                      0341
         CLC   LASTCOND(2,@14),@CH00567                            0341
         BNE   @RF00341                                            0341
*     DARGSENT=MSG3003I;            /*                       @Z40LB38*/
         MVI   DARGSENT(@15),X'03'                                 0342
*   ELSE                                                           0343
*     DARGSENT=MSG0001I;            /*                       @Z40LB38*/
         B     @RC00341                                            0343
@RF00341 L     @01,DDSTRU                                          0343
         MVI   DARGSENT(@01),X'01'                                 0343
*   CALL AMSTP011(GDTTBL,PRTFILE,DDSTRU);/*                  @Z40LB38*/
*                                                                  0344
@RC00341 L     @15,@PC00001                                        0344
         ST    @15,@AL00001                                        0344
         LA    @14,@CF00114                                        0344
         ST    @14,@AL00001+4                                      0344
         LA    @14,DDSTRU                                          0344
         ST    @14,@AL00001+8                                      0344
         MVI   @AL00001+8,X'80'                                    0344
         L     @15,GDTPRT(,@15)                                    0344
         LA    @01,@AL00001                                        0344
         BALR  @14,@15                                             0344
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP FOR A FULL REGION DUMP AND RETURN TO AMS       @Z40LB38*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0345
*   IF GDTDBG=NULLPTR THEN                                         0345
         L     @15,@PC00001                                        0345
         L     @15,GDTDBG(,@15)                                    0345
         LTR   @15,@15                                             0345
         BZ    @RT00345                                            0345
*     ;                                                            0346
*   ELSE                                                           0347
*     CALL IDCDB010(GDTTBL,'NCAZ'); /*                       @Z40LB38*/
         L     @15,@PC00001                                        0347
         ST    @15,@AL00001                                        0347
         LA    @14,@CC01101                                        0347
         ST    @14,@AL00001+4                                      0347
         MVI   @AL00001+4,X'80'                                    0347
         L     @15,GDTDBG(,@15)                                    0347
         LA    @01,@AL00001                                        0347
         BALR  @14,@15                                             0347
*   CALL IDCSAEP0(GDTTBL,MODID,LASTCOND);/*                  @Z40LB38*/
@RT00345 L     @15,@PC00001                                        0348
         ST    @15,@AL00001                                        0348
         LA    @14,MODID                                           0348
         ST    @14,@AL00001+4                                      0348
         L     @14,@PC00001+8                                      0348
         ST    @14,@AL00001+8                                      0348
         MVI   @AL00001+8,X'80'                                    0348
         L     @15,GDTEPL(,@15)                                    0348
         LA    @01,@AL00001                                        0348
         BALR  @14,@15                                             0348
*                                                                  0349
*/***********************************************************@Y30LB39*/
*/* PROCEDURE NAME - SSCMSG                                  @Y30LB39*/
*/*                                                          @Y30LB39*/
*/* FUNCTION - THIS ROUTINE PRINTS MESSAGES                  @Y30LB39*/
*/*   FROM IDCTSSS0 OR IDCTSCM0 AS DICTATED BY THE MSSC      @Y30LB39*/
*/*   REASON CODE OR THE ECB POST CODE, EITHER ONE PASSED AS @Y30LB39*/
*/*   INPUT ARGUMENTS.                                       @Y30LB39*/
*/*                                                          @Y30LB39*/
*/*   THE REASON CODE IS PASSED TO THIS ROUTINE FROM THE     @Y30LB39*/
*/*   CALLER IN SSRCODE, AND THE ECB POST CODE IS PASSED     @Y30LB39*/
*/*   IN SSECBCD.                                            @Y30LB39*/
*/*                                                          @Y30LB39*/
*/*   ONLY ONE MESSAGE IS PRINTED. IF THE REASON CODE        @Y30LB39*/
*/*   CONTAINS A NUMBER GREATER THAN ZERO, IT IS USED AS     @Y30LB39*/
*/*   THE INDICATION TO CALL UPRINT TO READ IN THE FIRST     @Y30LB39*/
*/*   STATIC TEXT ENTRY FROM IDCTSSS0.  THAT ENTRY CONTAINS  @Y30LB39*/
*/*   AN ARRAY OF THE MESSAGE INDICES USED TO PRINT THE      @Y30LB39*/
*/*   MSSC REASON CODE MESSAGE. THE ARRAY IS SCANNED FOR THE @Y30LB39*/
*/*   REASON CODE THAT WAS PASSED AS THE FIRST PARAMETER.    @Y30LB39*/
*/*   IF THE ARRAY CONTAINS AN ENTRY WITH THAT VALUE, THE    @Y30LB39*/
*/*   ARRAY INDEX IS USED TO PRINT THE MESSAGE.  IF THE      @Y30LB39*/
*/*   REASON CODE IS NOT FOUND IN THE ARRAY, THE REASON      @Y30LB39*/
*/*   CODE IS USED AS BLOCK DATA WHEN PRINTING THE "LAST"    @Y30LB39*/
*/*   STATIC TEXT ENTRY IN THE TEXT MODULE.                  @Y30LB39*/
*/*                                                          @Y30LB39*/
*/*   IF THE REASON CODE FIELD IS ZERO, THE ECB POST CODE    @Y30LB39*/
*/*   IS INSERTED AS BLOCK DATA INTO A GENERAL MESSAGE IN    @Y30LB39*/
*/*   STATIC TEXT MODULE IDCTSCM0.                           @Y30LB39*/
*/*                                                          @Y30LB39*/
*/* INPUT - REASON CODE AS FIRST ARGUMENT, OPTIONALLY THE    @Y30LB39*/
*/*         ECB CODE AS THE SECOND ARGUMENT.                 @Y30LB39*/
*/*                                                          @Y30LB39*/
*/* OUTPUT - PRINTED MESSAGE AND RETURN CODE OF ZERO.        @Y30LB39*/
*/*                                                          @Y30LB39*/
*/***********************************************************@Y30LB39*/
*                                                                  0349
*                                   /*                       @Y30LB39*/
*SSCMSG:                                                           0349
*   PROCEDURE(SSRCODE,              /* SSC RETURN CODE       @Y30LB39*/
*       SSECBCD);                   /* ECB POST CODE         @Y30LB39
*                                                            @Y30LB39*/
@EL00001 L     @13,4(,@13)                                         0349
@EF00001 L     @00,@SIZDATD                                        0349
         LR    @01,@11                                             0349
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0349
         BR    @14                                                 0349
SSCMSG   STM   @14,@12,@SA00002                                    0349
         MVC   @PC00002(8),0(@01)                                  0349
*                                   /*                       @Y30LB39*/
*                                                                  0350
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* DECLARATIONS FOR THE SSCMSG PROCEDURE                 @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0350
*                                   /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0350
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE NEXT TWO DECLARES ARE FOR THE TWO INPUT           @Y30LB39*/
*   /* ARGUMENTS. 1ST - MSSC REASON CODE OR                  @Y30LB39*/
*   /* 2ND - MSSC POST CODE                                  @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0350
*                                   /*                       @Y30LB39*/
*   DCL                                                            0350
*     1 SSRCODE FIXED(31),          /*                       @Y30LB39*/
*       3 * FIXED(15),              /*                       @Y30LB39*/
*       3 SSRHALF FIXED(15);        /* 1ST ARG REASON CODE   @Y30LB39*/
*   DCL                                                            0351
*     SSECBCD PTR(8);               /* 2ND ARG POST CODE     @Y30LB39
*                                                            @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0351
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* DECLARE THE DYNAMIC AREA NEEDED TO POINT TO AND       @Y30LB39*/
*   /* CONTAIN THE "LOCAL" PRINT ARGUMENT LIST               @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0352
*                                   /*                       @Y30LB39*/
*   DCL                                                            0352
*     SSDLPTR PTR(31);              /*                       @Y30LB39*/
*   DCL                                                            0353
*     SSDRGLT CHAR(LENGTH(DARGLIST));/*                      @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0353
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE NEXT DECLARE IS FOR THE INDEX WHICH IS            @Y30LB39*/
*   /* INCREMENTED WHILE SEARCHING THE ARRAY OF              @Y30LB39*/
*   /* REASON CODES AND, UPON FINDING THE CORRECT            @Y30LB39*/
*   /* REASON CODE, IS PASSED TO PRINT MODULE AS THE         @Y30LB39*/
*   /* INDEX OF THE MESSAGE NUMBER TO BE PRINTED.            @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0354
*                                   /*                       @Y30LB39*/
*   DECLARE                                                        0354
*     ENTRYNUM FIXED(8) UNSIGNED;   /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0354
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE NEXT DECLARE IS FOR THE COMMON MESSAGE            @Y30LB39*/
*   /* NUMBER TO IDENTIFY THE ECB POST CODE                  @Y30LB39*/
*   /* MESSAGE CONTAINED IN STATIC TEXT MODULE               @Y30LB39*/
*   /* IDCTSCM0.                                             @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0355
*                                   /*                       @Y30LB39*/
*   DECLARE                                                        0355
*     SSMSGNUM FIXED(8) STATIC LOCAL INIT(56);/*             @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0355
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE NEXT DECLARE IS FOR THE ARRAY WHICH IS            @Y30LB39*/
*   /* SEARCHED FOR THE REASON CODE CORRESPONDING            @Y30LB39*/
*   /* TO THE MESSAGE INDEX AND ULTIMATELY, THE              @Y30LB39*/
*   /* MESSAGE TEXT TO BE PRINTED TO THE USER TELLING        @Y30LB39*/
*   /* HIM OF THE EXACT REASON FOR THE MSSC FAILURE.         @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0356
*                                   /*                       @Y30LB39*/
*   DECLARE                                                        0356
*     1 SSINXLST BDY(WORD),         /*                       @Y30LB39*/
*       3 SSARRAY(60) FIXED(15);    /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0356
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE NEXT DECLARATION IS FOR THE MESSAGE ID            @Y30LB39*/
*   /* USED BY THE STATIC TEXT MODULE - IDCTSSS0.            @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0357
*                                   /*                       @Y30LB39*/
*   DECLARE                                                        0357
*     SSMODSS0 CHAR(3) STATIC INIT('SS0');/*                 @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0357
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE NEXT DECLARATION IS FOR THE MESSAGE ID            @Y30LB39*/
*   /* USED BY THE STATIC TEXT MODULE - IDCTSCMO.            @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0358
*                                   /*                       @Y30LB39*/
*   DECLARE                                                        0358
*     SSMODCM0 CHAR(3) STATIC INIT('CM0');/*                 @Y30LB39
*                                                            @Y30LB39*/
*                                   /*                       @Y30LB39*/
*                                                                  0359
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UTRACE MACRO TO PROVIDE A TRACK OF FLOW         @Y30LB39*/
*   /* ON CONTROL WITHIN THE SSMSG MODULE.                   @Y30LB39*/
*   /* THIS WILL PLACE THE IDENTIFIER SPECIFIED IN           @Y30LB39*/
*   /* A SEPARATE INTRA-MODULE TRACE TABLE.                  @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0359
*                                   /*                       @Y30LB39*/
*   OLDERID2=NEWERID2;                                             0359
         L     @15,@PC00001                                        0359
         L     @14,GDTTR2(,@15)                                    0359
         MVC   @TS00001(95),NEWERID2(@14)                          0359
         MVC   OLDERID2(95,@14),@TS00001                           0359
*   NEWID2='SSAA';                  /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0360
         MVC   NEWID2(4,@14),@CC01123                              0360
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* ESTABLISH ADDRESSABILITY TO THE DYNAMIC               @Y30LB39*/
*   /* ARGUMENT LIST.                                        @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0361
*                                   /*                       @Y30LB39*/
*   SSDLPTR=ADDR(SSDRGLT);          /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0361
         LA    @14,SSDRGLT                                         0361
         ST    @14,SSDLPTR                                         0361
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* IF THE REASON CODE IS NOT ZERO, READ IN THE           @Y30LB39*/
*   /* ARRAY FROM THE STATIC TEXT MODULE - IDCTSSS0.         @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0362
*                                   /*                       @Y30LB39*/
*   IF SSRCODE>0 THEN                                              0362
         L     @09,@PC00002                                        0362
         L     @09,SSRCODE(,@09)                                   0362
         LTR   @09,@09                                             0362
         BNP   @RF00362                                            0362
*     DO;                           /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0363
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @Y30LB39*/
*       /* CLEAR THE DYNAMIC ARGUMENT LIST AND               @Y30LB39*/
*       /* INITIALIZE THE PRINT ARGUMENT LIST TO READ        @Y30LB39*/
*       /* IN THE ARRAY WHICH CONTAINS THE MSSC REASON       @Y30LB39*/
*       /* CODES.                                            @Y30LB39*/
*       /*                                                   @Y30LB39*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0364
*                                   /*                       @Y30LB39*/
*       SSDRGLT=''B;                /*                       @Y30LB39*/
         XC    SSDRGLT(20),SSDRGLT                                 0364
*       SSDLPTR->DARGRETP=ADDR(SSINXLST);/*                  @Y30LB39*/
         LA    @03,SSINXLST                                        0365
         ST    @03,DARGRETP(,@14)                                  0365
*       SSDLPTR->DARGSMOD=SSMODSS0; /*                       @Y30LB39*/
         MVC   DARGSMOD(3,@14),SSMODSS0                            0366
*       SSDLPTR->DARGSENT=1;        /*                       @Y30LB39*/
         MVI   DARGSENT(@14),X'01'                                 0367
*       SSDLPTR->DARGRETL=LENGTH(SSINXLST);/*                @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0368
         MVC   DARGRETL(2,@14),@CH01145                            0368
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @Y30LB39*/
*       /* ISSUE UPRINT MACRO TO READ IN THE SEARCH          @Y30LB39*/
*       /* ARRAY.                                            @Y30LB39*/
*       /*                                                   @Y30LB39*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0369
*                                   /*                       @Y30LB39*/
*       CALL AMSTP011(GDTTBL,PRTFILE,SSDLPTR);/*             @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0369
         ST    @15,@AL00001                                        0369
         LA    @03,@CF00114                                        0369
         ST    @03,@AL00001+4                                      0369
         LA    @03,SSDLPTR                                         0369
         ST    @03,@AL00001+8                                      0369
         MVI   @AL00001+8,X'80'                                    0369
         L     @15,GDTPRT(,@15)                                    0369
         LA    @01,@AL00001                                        0369
         BALR  @14,@15                                             0369
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @Y30LB39*/
*       /* BEGIN DO LOOP TO SEARCH FOR THE MESSAGE           @Y30LB39*/
*       /* INDEX CORRESPONDING TO THE REASON CODE            @Y30LB39*/
*       /* PASSED AS THE FIRST ARGUMENT.                     @Y30LB39*/
*       /* THE DO LOOP BEGINS WITH THE SECOND ARRAY          @Y30LB39*/
*       /* ENTRY SINCE THE FIRST IS REQUIRED BY THE          @Y30LB39*/
*       /* SEARCH ARRAY ITSELF.                              @Y30LB39*/
*       /* THE SEARCH CONTINUES UNTIL THE REASON CODE        @Y30LB39*/
*       /* IS FOUND, AT WHICH TIME THE SEARCH INDEX          @Y30LB39*/
*       /* IS PASSED TO THE PRINT MODULE TO PRINT            @Y30LB39*/
*       /* THE MESSAGE ASSOCIATED WITH THAT PARTICULAR       @Y30LB39*/
*       /* REASON CODE.                                      @Y30LB39*/
*       /* IF THERE IS NO MATCH FOUND IN THE ARRAY,          @Y30LB39*/
*       /* THEN THE INDEX WILL BE THE LAST POSITION IN       @Y30LB39*/
*       /* ARRAY. THIS WILL BE THE INDICATION THAT           @Y30LB39*/
*       /* THE REASON CODE ITSELF SHOULD BE PRINTED.         @Y30LB39*/
*       /*                                                   @Y30LB39*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0370
*                                   /*                       @Y30LB39*/
*       ENTRYNUM=1;                 /*                       @Y30LB39*/
         LA    ENTRYNUM,1                                          0370
*       DO UNTIL(SSRHALF=SSARRAY(ENTRYNUM)×SSARRAY(ENTRYNUM)=0);   0371
@DL00371 DS    0H                                                  0372
*         ENTRYNUM=ENTRYNUM+1;      /*                       @Y30LB39*/
         AL    ENTRYNUM,@CF00218                                   0372
*       END;                        /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0373
@DE00371 L     @03,@PC00002                                        0373
         LR    @15,ENTRYNUM                                        0373
         ALR   @15,@15                                             0373
         LH    @15,SSARRAY-2(@15)                                  0373
         CH    @15,SSRHALF(,@03)                                   0373
         BE    @DC00371                                            0373
         SLR   @14,@14                                             0373
         CR    @15,@14                                             0373
         BNE   @DL00371                                            0373
@DC00371 DS    0H                                                  0374
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @Y30LB39*/
*       /* THE CORRECT INDEX HAS BEEN FOUND                  @Y30LB39*/
*       /*                                                   @Y30LB39*/
*       /* CLEAR THE DYNAMIC ARGUMENT LIST AND FILL          @Y30LB39*/
*       /* OUT THE PRINT ARGUMENT FIELDS WITH EITHER:        @Y30LB39*/
*       /* 1) THE INDEX CORRESPONDING TO THE REASON          @Y30LB39*/
*       /* CODE OR                                           @Y30LB39*/
*       /* 2) THE LAST INDEX AND THE REASON CODE             @Y30LB39*/
*       /* ITSELF AS A STATIC TEXT INSERT.                   @Y30LB39*/
*       /*                                                   @Y30LB39*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0374
*                                   /*                       @Y30LB39*/
*       SSDRGLT=''B;                /*                       @Y30LB39*/
         XC    SSDRGLT(20),SSDRGLT                                 0374
*       SSDLPTR->DARGSMOD=SSMODSS0; /*                       @Y30LB39*/
         L     @09,SSDLPTR                                         0375
         MVC   DARGSMOD(3,@09),SSMODSS0                            0375
*       SSDLPTR->DARGSENT=ENTRYNUM; /*                       @Y30LB39*/
         STC   ENTRYNUM,DARGSENT(,@09)                             0376
*       IF SSARRAY(ENTRYNUM)=0 THEN /*                       @Y30LB39*/
         CR    @15,@14                                             0377
         BNE   @RF00377                                            0377
*         DO;                       /*                       @Y30LB39*/
*           SSDLPTR->DARGDBP=ADDR(SSRCODE);/*                @Y30LB39*/
         ST    @03,DARGDBP(,@09)                                   0379
*           SSDLPTR->DARGILP=LENGTH(SSRCODE);/*              @Y30LB39*/
         MVC   DARGILP(2,@09),@CH00041                             0380
*         END;                      /*                       @Y30LB39*/
*     END;                          /*                       @Y30LB39*/
*                                   /*                       @Y30LB39*/
*                                                                  0383
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* THE FIRST ARGUMENT WAS ZERO, INDICATING THAT          @Y30LB39*/
*   /* THIS ROUTINE IS TO PRINT OUT THE ECB POST             @Y30LB39*/
*   /* CODE. THEREFORE, CLEAR THE DYNAMIC ARGUMENT           @Y30LB39*/
*   /* LIST AND FILL OUT THE PRINT ARGUMENT FIELDS           @Y30LB39*/
*   /* SO THE STATIC TEXT MODULE, IDCTSCM0, WILL             @Y30LB39*/
*   /* PRINT OUT THE MESSAGE ASSOCIATED WITH THE             @Y30LB39*/
*   /* POST CODE.                                            @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0383
*                                   /*                       @Y30LB39*/
*   ELSE                            /*                       @Y30LB39*/
*     DO;                           /*                       @Y30LB39*/
         B     @RC00362                                            0383
@RF00362 DS    0H                                                  0384
*       SSDRGLT=''B;                /*                       @Y30LB39*/
         XC    SSDRGLT(20),SSDRGLT                                 0384
*       SSDLPTR->DARGSMOD=SSMODCM0; /*                       @Y30LB39*/
         L     @15,SSDLPTR                                         0385
         MVC   DARGSMOD(3,@15),SSMODCM0                            0385
*       SSDLPTR->DARGSENT=SSMSGNUM; /*                       @Y30LB39*/
         MVC   DARGSENT(1,@15),SSMSGNUM                            0386
*       SSDLPTR->DARGDBP=ADDR(SSECBCD);/*                    @Y30LB39*/
         L     @14,@PC00002+4                                      0387
         ST    @14,DARGDBP(,@15)                                   0387
*       SSDLPTR->DARGILP=LENGTH(SSECBCD);/*                  @Y30LB39*/
         MVC   DARGILP(2,@15),@CH00218                             0388
*     END;                          /*                       @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0389
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* ISSUE UPRINT MACRO TO PRINT THE REASON                @Y30LB39*/
*   /* CODE MESSAGE OR THE ECB POST CODE MESSAGE.            @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0390
*                                   /*                       @Y30LB39*/
*   CALL AMSTP011(GDTTBL,PRTFILE,SSDLPTR);/*                 @Y30LB39
*                                                            @Y30LB39*/
*                                                                  0390
@RC00362 L     @15,@PC00001                                        0390
         ST    @15,@AL00001                                        0390
         LA    @14,@CF00114                                        0390
         ST    @14,@AL00001+4                                      0390
         LA    @14,SSDLPTR                                         0390
         ST    @14,@AL00001+8                                      0390
         MVI   @AL00001+8,X'80'                                    0390
         L     @15,GDTPRT(,@15)                                    0390
         LA    @01,@AL00001                                        0390
         BALR  @14,@15                                             0390
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @Y30LB39*/
*   /* RETURN TO CALLER WITH A RETURN CODE OF ZERO           @Y30LB39*/
*   /*                                                       @Y30LB39*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0391
*                                   /*                       @Y30LB39
*                                                            @Y30LB39*/
*   RETURN CODE(0);                 /*                       @Y30LB39
*                                                            @Y30LB39*/
         SLR   @15,@15                                             0391
         L     @14,@SA00002                                        0391
         LM    @00,@12,@SA00002+8                                  0391
         BR    @14                                                 0391
*   END SSCMSG;                     /*                       @Y30LB39*/
*/****************************************************************** */
*/*                                                          @Y30LB32*/
*/*  PROCEDURE NAME - CKCSNLEN (FSR SUBROUTINE)              @Y30LB32*/
*/*                                                          @Y30LB32*/
*/*  FUNCTION - CHECKS LENGTH OF CARTRIDGE SERIAL NUMBER     @Y30LB32*/
*/*             IF THE LENGTH OF THE CSN IS LESS THEN ELEVEN,@Y30LB32*/
*/*             ISSUES MESSAGE IDC2099I, IF CSN IS ELEVEN    @Y30LB32*/
*/*             A BLANK CHARACTER IS INSERTED AS THE FOURTH  @Y30LB32*/
*/*             CHARACTER                                    @Y30LB32*/
*/*                                                          @Y30LB32*/
*/*  INPUT - CSN, LENGTH OF CSN                              @Y30LB32*/
*/*                                                          @Y30LB32*/
*/*  OUTPUT - CSN, RETURN CODE IN REGISTER 15(RETURN CODE    @Y30LB32*/
*/*           ZERO IF CSN VALID AND FOUR IF CSN INVALID)     @Y30LB32*/
*/*                                                          @Y30LB32*/
*/********************************************************************/
*                                                                  0393
*CKCSNLEN:                          /*                       @Y30LB32*/
*   PROCEDURE(CKCSNVAL,             /* CSN VALUE             @Y30LB32*/
*       CKLENGTH)                   /* LENGTH OF CSN         @Y30LB32*/
*       OPTIONS(NOSAVE,NOSAVEAREA); /*                       @Y30LB32*/
*                                                                  0393
CKCSNLEN MVC   @PC00003(8),0(@01)                                  0393
*   /*****************************************************************/
*   /*                                                               */
*   /* DECLARATIONS FOR CKCSNLEN SUBROUTINE                  @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0394
*   DCL                                                            0394
*     CKCSNVAL CHAR(12);            /* CSN VALUE             @Y30LB32*/
*   DCL                                                            0395
*     CKCSNADJ CHAR(12);            /* FOR ADJUSTED CSN      @Y30LB32*/
*   DCL                                                            0396
*     CKLENGTH FIXED(8);            /* LENGTH OF CSN         @Y30LB32*/
*   DCL                                                            0397
*     CKRETPTR PTR(31);             /* SAVE RETURN ADDR      @Y30LB32*/
*   DCL                                                            0398
*     CKSAVPTR PTR(31);             /* TO SAVE POINTER       @Y30LB32*/
*   DCL                                                            0399
*     CKPRTTAB CHAR(20) BDY(WORD);  /* PRINT TABLE AREA      @Y30LB32*/
*   DCL                                                            0400
*     CKCOND FIXED(15);                                            0400
*                                                                  0400
*   /*****************************************************************/
*   /*                                                               */
*   /* DECLARATIONS OF CONSTANTS                             @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0401
*   DCL                                                            0401
*     CKBLANK CHAR(1) CONSTANT(' ');/* BLANK TO INSERT IN    @Y30LB32
*                                      CSN                   @Y30LB32*/
*   DCL                                                            0402
*     CKELEVEN BIT(8) CONSTANT('0B'X);/* TO CHECK LENGTH     @Y30LB32
*                                      OF CSN AGAINST        @Y30LB32*/
*   DCL                                                            0403
*     CKMSGID CHAR(3) CONSTANT('CM0');/* MODULE MESSAGE ID   @Y30LB32*/
*   DCL                                                            0404
*     MSG2099I PTR(8) CONSTANT(1);  /* INVALID CSN MSG       @Y30LB32*/
*                                                                  0405
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS IS THE START OF THE CHECK CSN SUBROUTINE         @Y30LB32*/
*   /* THE CALLERS RETURN ADDRESS IS SAVED                   @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0405
*   CKRETPTR=REG14;                 /*                       @Y30LB32*/
         LR    CKRETPTR,REG14                                      0405
*   OLDERID2=NEWERID2;                                             0406
         L     @02,@PC00001                                        0406
         L     @02,GDTTR2(,@02)                                    0406
         MVC   @TS00001(95),NEWERID2(@02)                          0406
         MVC   OLDERID2(95,@02),@TS00001                           0406
*   NEWID2='CKLN';                  /*                       @Y30LB32*/
*                                                                  0407
         MVC   NEWID2(4,@02),@CC01143                              0407
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE POINTER TO CALLERS PRINT TABLE,                  @Y30LB32*/
*   /* INITIALIZE THE PRINT ARGUMENT LIST                    @Y30LB32*/
*   /* AND CONDITION CODE TO ZEROES                          @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0408
*   CKSAVPTR=DDSTRU;                /*                       @Y30LB32*/
         L     CKSAVPTR,DDSTRU                                     0408
*   DDSTRU=ADDR(CKPRTTAB);          /*                       @Y30LB32*/
         LA    @02,CKPRTTAB                                        0409
         ST    @02,DDSTRU                                          0409
*   CKPRTTAB=''B;                   /*                       @Y30LB32*/
         XC    CKPRTTAB(20),CKPRTTAB                               0410
*   CKCOND=''B;                     /*                       @Y30LB32*/
*                                                                  0411
         SLR   CKCOND,CKCOND                                       0411
*   /*****************************************************************/
*   /*                                                               */
*   /* CSN IS CHECKED FOR LENGTH OF ELEVEN CHARACTERS        @Y30LB32*/
*   /* OR MORE                                               @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0412
*   IF CKLENGTH>=CKELEVEN THEN      /*                       @Y30LB32*/
*                                                                  0412
         L     @02,@PC00003+4                                      0412
         CLI   CKLENGTH(@02),11                                    0412
         BL    @RF00412                                            0412
*     /***************************************************************/
*     /*                                                             */
*     /* CSN IS CHECKED FOR LENGTH OF ELEVEN AND IF IT IS    @Y30LB32*/
*     /* ELEVEN A BLANK CHARACTER IS INSERTED AS FOURTH      @Y30LB32*/
*     /* CHARACTER                                           @Y30LB32*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  0413
*     IF CKLENGTH=CKELEVEN THEN     /*                       @Y30LB32*/
         CLI   CKLENGTH(@02),11                                    0413
         BNE   @RF00413                                            0413
*       DO;                         /*                       @Y30LB32*/
*         CKCSNADJ(4:4)=CKBLANK;    /*                       @Y30LB32*/
         MVI   CKCSNADJ+3,C' '                                     0415
*         CKCSNADJ(5:12)=CKCSNVAL(4:11);/*                   @Y30LB32*/
         L     @02,@PC00003                                        0416
         MVC   CKCSNADJ+4(8),CKCSNVAL+3(@02)                       0416
*         CKCSNVAL(4:12)=CKCSNADJ(4:12);/*                   @Y30LB32*/
         MVC   CKCSNVAL+3(9,@02),CKCSNADJ+3                        0417
*       END;                        /*                       @Y30LB32*/
*     ELSE                                                         0419
*       ;                           /*                       @Y30LB32*/
*                                                                  0419
@RF00413 DS    0H                                                  0420
*   /*****************************************************************/
*   /*                                                               */
*   /* IF CSN IS LESS THEN ELEVEN CHARACTERS ERROR           @Y30LB32*/
*   /* MESSAGE IDC2099I IS WRITTEN AND CONDITION CODE SET    @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0420
*   ELSE                            /*                       @Y30LB32*/
*     DO;                           /*                       @Y30LB32*/
         B     @RC00412                                            0420
@RF00412 DS    0H                                                  0421
*       DARGSMOD=CKMSGID;           /*                       @Y30LB32*/
         L     @02,DDSTRU                                          0421
         MVC   DARGSMOD(3,@02),@CC01122                            0421
*       DARGSENT=MSG2099I;          /*                       @Y30LB32*/
         MVI   DARGSENT(@02),X'01'                                 0422
*       DARGDBP=ADDR(CKCSNVAL);     /*                       @Y30LB32*/
         L     @15,@PC00003                                        0423
         ST    @15,DARGDBP(,@02)                                   0423
*       DARGILP=LENGTH(CKCSNVAL);   /*                       @Y30LB32*/
         MVC   DARGILP(2,@02),@CH00567                             0424
*       DARGRETP=''B;               /*                       @Y30LB32*/
         SLR   @15,@15                                             0425
         ST    @15,DARGRETP(,@02)                                  0425
*       CALL AMSTP011(GDTTBL,PRTFILE,DDSTRU);/*              @Y30LB32*/
         L     @02,@PC00001                                        0426
         ST    @02,@AL00001                                        0426
         LA    @15,@CF00114                                        0426
         ST    @15,@AL00001+4                                      0426
         LA    @15,DDSTRU                                          0426
         ST    @15,@AL00001+8                                      0426
         MVI   @AL00001+8,X'80'                                    0426
         L     @15,GDTPRT(,@02)                                    0426
         LA    @01,@AL00001                                        0426
         BALR  @14,@15                                             0426
*       CKCOND=4;                   /*                       @Y30LB32*/
         LA    CKCOND,4                                            0427
*     END;                          /*                       @Y30LB32*/
*                                                                  0428
*   /*****************************************************************/
*   /*                                                               */
*   /* RESTORE PRINT AREA POINTER AND RETURN ADDRESS AND     @Y30LB32*/
*   /* RETURN CONTROL TO CALLING FSR                         @Y30LB32*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0429
*   DDSTRU=CKSAVPTR;                /*                       @Y30LB32*/
@RC00412 ST    CKSAVPTR,DDSTRU                                     0429
*   REG14=CKRETPTR;                 /*                       @Y30LB32*/
         LR    REG14,CKRETPTR                                      0430
*   RETURN CODE(CKCOND);            /*                       @Y30LB32*/
         LR    @15,CKCOND                                          0431
@EL00003 DS    0H                                                  0431
@EF00003 DS    0H                                                  0431
@ER00003 BR    @14                                                 0431
*   END CKCSNLEN;                   /*                       @Y30LB32*/
*   END IDCNC01                     /*                       @Z40LB38*/
*                                                                  0433
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (AMSDF01 )                                       */
*/*%INCLUDE SYSLIB  (AMSDF00 )                                       */
*/*@INCLUDE SYSLIB  (AMSDF02 )                                       */
*/*%INCLUDE SYSLIB  (IDCDF04 )                                       */
*/*%INCLUDE SYSLIB  (IDCCSNC )                                       */
*/*%INCLUDE SYSLIB  (IDCDF52 )                                       */
*/*%INCLUDE SYSLIB  (IDCDF50 )                                       */
*                                                                  0433
*       ;                                                          0433
@DATA    DS    0H
@CH00152 DC    H'2'
@CH00783 DC    H'44'
@CH01145 DC    H'120'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    3F
@PC00003 DS    2F
@SA00002 DS    15F
@PC00002 DS    2F
@AL00001 DS    6A
@AFTEMPS DS    1F
IDCNC01  CSECT
         DS    0F
@CF00114 DC    F'0'
@CF00218 DC    F'1'
@CH00218 EQU   @CF00218+2
@CF00041 DC    F'4'
@CH00041 EQU   @CF00041+2
@CF00178 DC    F'8'
@CF00567 DC    F'12'
@CH00567 EQU   @CF00567+2
@CF00473 DC    F'16'
@DATD    DSECT
         DS    0D
LISTSCAN DS    A
IOCSPTR  DS    A
OPNPTR   DS    A
DDSTRU   DS    A
FSADDR   DS    A
ERCNVADR DS    A
CCMSGPTR DS    A
CMMSGPTR DS    A
CTMSGPTR DS    A
ELEMENT  DS    F
NULLCPTR DS    A
REASONCD DS    F
MSGPTR   DS    A
SSDLPTR  DS    A
LISTPTR  DS    A
SETRC    DS    H
ECBCODE  DS    FL1
CSNL     DS    FL1
LISTLN   DS    FL1
@TS00001 DS    CL95
PRINTAB  DS    CL20
NULLCA   DS    CL44
CSNNAME  DS    CL12
DMPSTG   DS    CL17
SSDRGLT  DS    CL20
         DS    CL3
SSINXLST DS    CL120
         ORG   SSINXLST
SSARRAY  DS    60H
         ORG   SSINXLST+120
CKCSNADJ DS    CL12
CKPRTTAB DS    CL20
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IDCNC01  CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
SSMSGNUM DC    AL1(56)
@CC01097 DC    C'NULLCA'
@CC01094 DC    C'NCAA'
@CC01099 DC    C'NCAB'
@CC01101 DC    C'NCAZ'
@CC01123 DC    C'SSAA'
@CC01143 DC    C'CKLN'
@CC01089 DC    C'UV0'
@CC01091 DC    C'NC0'
@CC01122 DC    C'CM0'
ALL      DC    CL3'ALL'
FORMAT   DC    CL4'FORM'
HSECOND  DC    CL4'HSEC'
CLOCK    DC    CL4'KLOK'
SETZERO  DC    CL4'ZERO'
SETBLANK DC    CL4'BLNK'
NOSET    DC    CL4'NSET'
OVERRIDE DC    CL4'OVRD'
ACQUIRE  DC    CL8'ACQUIRE '
RELINQ   DC    CL8'RELINQ  '
MOUNT    DC    CL8'MOUNT   '
DEMOUNT  DC    CL8'DEMOUNT '
DEFINE   DC    CL8'DEFINE  '
MOVE     DC    CL8'MOVE    '
TRACEQ   DC    CL8'TRACEQ  '
COPYTABL DC    CL8'COPYTABL'
COPYCRTG DC    CL8'COPYCRTG'
COPYVOL  DC    CL8'COPYVOL '
VVIC     DC    CL8'VVIC    '
TUNE     DC    CL8'TUNE    '
NAMES    DC    CL4'NAME'
UNIT     DC    CL4'UNIT'
SHR      DC    CL4'SHR '
EXCL     DC    CL4'EXCL'
NOWAIT   DC    CL4'NWAI'
WAIT     DC    CL4'WAIT'
SECCHECK DC    CL8'SECCHECK'
SCRVTOC  DC    CL8'SCRVTOC '
GETVTOC  DC    CL8'GETVTOC '
PUTVTOC  DC    CL8'PUTVTOC '
RECATLG  DC    CL8'RECATLG '
INITVOL  DC    CL8'INITVOL '
CHECK    DC    CL8'CHECK   '
POSTUCB  DC    CL8'POSTUCB '
GET      DC    CL8'GET     '
PUT      DC    CL8'PUT     '
CLOSE    DC    CL8'CLOSE   '
OPEN     DC    CL8'OPEN    '
PUTLABEL DC    CL8'PUTLABEL'
GETLABEL DC    CL8'GETLABEL'
CANCEL   DC    CL8'CANCEL  '
SET      DC    CL8'SET     '
SELECTX  DC    CL8'SELECTX '
CHANGEX  DC    CL8'CHANGEX '
SELECTDD DC    CL8'SELECTDD'
SELECTDS DC    CL8'SELECTDS'
TBLREST  DC    CL8'TBLREST '
NULLIFYC DC    CL8'NULLIFYC'
RDMSC    DC    CL8'RDMSC   '
RDMSCTBL DC    CL8'RDMSCTBL'
RDCARTLB DC    CL8'RDCARTLB'
AUDITCEL DC    CL8'AUDITCEL'
RDSTGAD  DC    CL8'RDSTGAD '
FIXAREA  DS    CL150
         ORG   FIXAREA
@NM00087 DC    150X'00'
         ORG   FIXAREA+150
MODID    DC    CL4'NC01'
SSMODSS0 DC    CL3'SS0'
SSMODCM0 DC    CL3'CM0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
CKCOND   EQU   @03
CKSAVPTR EQU   @05
CKRETPTR EQU   @04
ENTRYNUM EQU   @02
NULMPTR  EQU   @02
DMPINDEX EQU   @02
TESTRC   EQU   @03
REG10    EQU   @10
REG12    EQU   @12
RTNREG   EQU   @15
REG14    EQU   @14
NULBR1   EQU   @01
REG0     EQU   @00
REG1     EQU   @01
REG11    EQU   @11
REG13    EQU   @13
REG15    EQU   @15
REG2     EQU   @02
REG3     EQU   @03
REG4     EQU   @04
REG5     EQU   @05
REG6     EQU   @06
REG7     EQU   @07
REG8     EQU   @08
REG9     EQU   @09
IDCSAEP0 EQU   0
IDCSAFS0 EQU   0
IDCSASS0 EQU   0
TRACE1   EQU   0
OLDERID1 EQU   TRACE1
TRACE2   EQU   0
OLDERID2 EQU   TRACE2
NEWID2   EQU   TRACE2+95
NEWERID2 EQU   5
CIRAGL   EQU   0
CIRTYPE  EQU   CIRAGL
ALLAGL   EQU   0
ALLSTS   EQU   ALLAGL+24
ALLDSP   EQU   ALLAGL+25
ALLORG   EQU   ALLAGL+26
ALLOPT   EQU   ALLAGL+28
UNITABL  EQU   0
UNITADR  EQU   UNITABL+4
@NM00010 EQU   UNITADR
UNITSTAT EQU   UNITABL+6
IOCSTR   EQU   0
IOCDSO   EQU   IOCSTR+16
IOCRFM   EQU   IOCSTR+17
IOCMAC   EQU   IOCSTR+18
IOCMAC2  EQU   IOCSTR+19
IOCCHP   EQU   IOCSTR+20
IOCMSG   EQU   IOCSTR+21
IOCRBA   EQU   IOCSTR+40
IOCTTR   EQU   IOCRBA
IOCMEM   EQU   IOCSTR+44
IOCNWM   EQU   IOCSTR+48
OPNAGL   EQU   0
OPNOPT   EQU   OPNAGL
OPNRFM   EQU   OPNAGL+1
OPNTYP   EQU   OPNAGL+2
OPNMOD   EQU   OPNAGL+3
OPNDEV   EQU   OPNAGL+24
OPNDSO   EQU   OPNAGL+41
OPNOPT2  EQU   OPNAGL+42
IOINFOPT EQU   0
UVOLLIST EQU   0
UVOLENT  EQU   UVOLLIST+2
AMSTP011 EQU   0
DARGLIST EQU   0
DARGDBP  EQU   DARGLIST
DARGRETP EQU   DARGLIST+4
DARGSTID EQU   DARGLIST+8
DARGSMOD EQU   DARGSTID
DARGSENT EQU   DARGSTID+3
DARGILP  EQU   DARGLIST+12
DARGRETL EQU   DARGLIST+16
DARGARY  EQU   DARGLIST+20
DARGINS  EQU   DARGARY
DARGINL  EQU   DARGARY+2
FMTLIST  EQU   0
FMTFLGS  EQU   FMTLIST
FMTSPF   EQU   FMTLIST+2
FMTRFNO  EQU   FMTSPF
FMTILEN  EQU   FMTRFNO
FMTIOFF  EQU   FMTLIST+4
FMTTRBC  EQU   FMTIOFF
FMTSTO   EQU   FMTTRBC
FMTOCOL  EQU   FMTLIST+6
FMTCNVF  EQU   FMTLIST+10
ERCNVTAB EQU   0
ERTYPE   EQU   ERCNVTAB
EROPER   EQU   ERCNVTAB+1
EROSOPER EQU   ERCNVTAB+2
IDCDB010 EQU   0
DMPITM   EQU   0
DMPITMNM EQU   DMPITM
DMPITMPT EQU   DMPITM+8
DMPITMLN EQU   DMPITM+12
DMPITMTP EQU   DMPITM+14
DMPARY   EQU   0
DMPTRM   EQU   0
CCMSG    EQU   0
CMMSG    EQU   0
CMVOLFLG EQU   CMMSG+6
CTMSG    EQU   0
CTARRAY  EQU   CTMSG+4
MDAGL    EQU   0
MDFLAGS  EQU   MDAGL+30
MDVTOC   EQU   MDAGL+32
PUAGL    EQU   0
CKAGL    EQU   0
CKFLAGS  EQU   CKAGL+28
EXCLAGL  EQU   0
EXCLFLAG EQU   EXCLAGL+22
EXOARG   EQU   0
EXOPT    EQU   EXOARG+32
EXFLG    EQU   EXOARG+33
EXGARG   EQU   0
EXPARG   EQU   0
EXPDATA  EQU   EXPARG+12
EXPDATAB EQU   0
EXPARRAY EQU   EXPDATAB+4
VS2AGL   EQU   0
VSLABOPT EQU   VS2AGL+28
VS2MSG   EQU   VS2AGL+35
VS2RESOP EQU   VS2AGL+36
VS1AGL   EQU   0
VSSECOPT EQU   VS1AGL+68
VSVTOPT  EQU   VS1AGL+69
VSCATOPT EQU   VS1AGL+70
VSRETURN EQU   VS1AGL+71
VSMSG    EQU   VS1AGL+72
VSRESOPT EQU   VS1AGL+73
RCTAGL   EQU   0
RCTOPT   EQU   RCTAGL+8
STAEPARM EQU   0
STARCVY  EQU   STAEPARM+52
STARETRY EQU   STAEPARM+53
VOLLABEL EQU   0
SV82LIST EQU   0
@NM00066 EQU   SV82LIST+4
SV82DCBP EQU   @NM00066
@NM00067 EQU   SV82LIST+12
SV82WRKP EQU   @NM00067
SRTAGL   EQU   0
LCTINFO  EQU   0
LCTFLAGS EQU   LCTINFO+32
UCTAGL   EQU   0
UCTFLAGS EQU   UCTAGL+68
SELAGL   EQU   0
SELFLAGS EQU   SELAGL+22
DATESAGL EQU   0
DATESOPT EQU   DATESAGL+20
VS3AGL   EQU   0
VS3FLAGS EQU   VS3AGL+58
VSDVTOC  EQU   0
VSDSTAT  EQU   0
VSDSFLG1 EQU   VSDSTAT+16
VSDFLG2  EQU   VSDSTAT+17
VSDSCR   EQU   0
VSDSCRFL EQU   VSDSCR+4
VSDUSAGE EQU   0
VSDDORG  EQU   VSDUSAGE+9
VSDALLOC EQU   VSDUSAGE+10
VSDUSEF  EQU   VSDUSAGE+11
VSDDSORG EQU   VSDUSAGE+16
VSDBLOCK EQU   0
VSDSPACE EQU   VSDBLOCK+12
VSDARRAY EQU   VSDBLOCK+16
VSDVARY  EQU   VSDARRAY+48
ACT      EQU   0
INACT    EQU   0
SCRC     EQU   0
CART     EQU   0
CARTLEN  EQU   CART
CARTVAL  EQU   CART+1
VOL      EQU   0
VOLVAL   EQU   VOL+1
SEQ1     EQU   0
SEQ2     EQU   0
NVOL     EQU   0
NULLCX   EQU   0
NULFLAGA EQU   NULLCX+6
NULVOL   EQU   NULFLAGA
NULTRAN  EQU   NULFLAGA
NULSCRC  EQU   NULFLAGA
NULCART1 EQU   NULFLAGA
NULCART2 EQU   NULFLAGA
NULVOLID EQU   NULLCX+8
NULCSN   EQU   NULLCX+20
NULMSG   EQU   0
NMCSN1   EQU   NULMSG+8
NMCSN2   EQU   NULMSG+20
AMSTP041 EQU   0
AMSTP042 EQU   0
AMSTP043 EQU   0
AMSTP044 EQU   0
IDCIOCL0 EQU   0
IDCIOCO0 EQU   0
IDCIOGT0 EQU   0
IDCIOIT0 EQU   0
IDCIOOP0 EQU   0
IDCIOPO0 EQU   0
IDCIOPT0 EQU   0
IDCIOSI0 EQU   0
IDCIOST0 EQU   0
IDCIOTM0 EQU   0
IDCIOVY0 EQU   0
IDCIO050 EQU   0
IDCSAAL0 EQU   0
IDCSACA0 EQU   0
IDCSACL0 EQU   0
IDCSACR0 EQU   0
IDCSADE0 EQU   0
IDCSADL0 EQU   0
IDCSADQ0 EQU   0
IDCSAFP0 EQU   0
IDCSAGP0 EQU   0
IDCSAGS0 EQU   0
IDCSAID0 EQU   0
IDCSALC0 EQU   0
IDCSALD0 EQU   0
IDCSALK0 EQU   0
IDCSANQ0 EQU   0
IDCSAPR0 EQU   0
IDCSAPT0 EQU   0
IDCSAQL0 EQU   0
IDCSARC0 EQU   0
IDCSARV0 EQU   0
IDCSASC0 EQU   0
IDCSASI0 EQU   0
IDCSASN0 EQU   0
IDCSAST0 EQU   0
IDCSATI0 EQU   0
IDCSAUC0 EQU   0
IDCSAWO0 EQU   0
IDCSA060 EQU   0
IDCST010 EQU   0
IDCTPER0 EQU   0
LISTTEST EQU   0
NEWERID1 EQU   5
GDTTBL   EQU   0
GDTTR1   EQU   GDTTBL+8
GDTTR2   EQU   GDTTBL+12
GDTDBG   EQU   GDTTBL+40
GDTSTC   EQU   GDTTBL+44
GDTPRT   EQU   GDTTBL+48
GDTESS   EQU   GDTTBL+52
GDTESA   EQU   GDTTBL+56
GDTRST   EQU   GDTTBL+60
GDTRES   EQU   GDTTBL+64
GDTCAL   EQU   GDTTBL+68
GDTGSP   EQU   GDTTBL+72
GDTFSP   EQU   GDTTBL+76
GDTGPL   EQU   GDTTBL+80
GDTFPL   EQU   GDTTBL+84
GDTLOD   EQU   GDTTBL+88
GDTDEL   EQU   GDTTBL+92
GDTPRL   EQU   GDTTBL+96
GDTEPL   EQU   GDTTBL+100
GDTTIM   EQU   GDTTBL+104
GDTIIO   EQU   GDTTBL+108
GDTTIO   EQU   GDTTBL+112
GDTOPN   EQU   GDTTBL+124
GDTCLS   EQU   GDTTBL+128
GDTGET   EQU   GDTTBL+132
GDTPUT   EQU   GDTTBL+136
GDTPOS   EQU   GDTTBL+140
GDTCPY   EQU   GDTTBL+144
GDTCAT   EQU   GDTTBL+148
GDTSNP   EQU   GDTTBL+164
GDTVFY   EQU   GDTTBL+172
GDTUID   EQU   GDTTBL+192
GDTPMT   EQU   GDTTBL+196
GDTCIR   EQU   GDTTBL+200
GDTLNK   EQU   GDTTBL+204
GDTALC   EQU   GDTTBL+208
GDTDLC   EQU   GDTTBL+212
GDTQAL   EQU   GDTTBL+216
GDTSTW   EQU   GDTTBL+220
GDTSSC   EQU   GDTTBL+224
GDTENQ   EQU   GDTTBL+228
GDTRSV   EQU   GDTTBL+232
GDTDEQ   EQU   GDTTBL+236
GDTSFO   EQU   GDTTBL+240
GDTWTO   EQU   GDTTBL+244
GDTSCR   EQU   GDTTBL+248
GDTUNT   EQU   GDTTBL+252
GDTRCT   EQU   GDTTBL+256
GDTIFO   EQU   GDTTBL+260
GDTEXP   EQU   GDTTBL+264
GDTSTA   EQU   GDTTBL+268
GDTERR   EQU   GDTTBL+272
GDTUNC   EQU   GDTTBL+276
GDTLOC   EQU   GDTTBL+280
FDTTBL   EQU   0
FDTPTR   EQU   FDTTBL+8
LASTCOND EQU   0
SSRCODE  EQU   0
SSRHALF  EQU   SSRCODE+2
SSECBCD  EQU   0
CKCSNVAL EQU   0
CKLENGTH EQU   0
*                                      START UNREFERENCED COMPONENTS
@NM00088 EQU   SSRCODE
FDTVERB  EQU   FDTTBL
GDTECT   EQU   GDTTBL+188
GDTPSB   EQU   GDTTBL+184
GDTUPT   EQU   GDTTBL+180
GDTCMB   EQU   GDTTBL+176
GDTSPR   EQU   GDTTBL+168
@NM00001 EQU   GDTTBL+160
GDTABH   EQU   GDTTBL+156
GDTABT   EQU   GDTTBL+152
GDTTOH   EQU   GDTTBL+120
GDTRIP   EQU   GDTTBL+116
GDTIOH   EQU   GDTTBL+36
GDTSAH   EQU   GDTTBL+32
GDTTPH   EQU   GDTTBL+28
GDTRIH   EQU   GDTTBL+24
GDTSTH   EQU   GDTTBL+20
GDTDBH   EQU   GDTTBL+16
GDTPRM   EQU   GDTTBL+4
GDTHDR   EQU   GDTTBL
NMRES    EQU   NULMSG+6
NMVOLID  EQU   NULMSG
NULRES2  EQU   NULLCX+32
NULECB   EQU   NULLCX+16
NULASID  EQU   NULLCX+14
@NM00086 EQU   NULFLAGA
@NM00085 EQU   NULFLAGA
NULRES1  EQU   NULLCX+5
NULORDER EQU   NULLCX+4
NULENGTH EQU   NULLCX
VOLLEN   EQU   VOL
VSDDSN   EQU   VSDARRAY+4
VSDVOLCT EQU   VSDARRAY
VSDFMT0  EQU   VSDBLOCK+8
VSDVTOCS EQU   VSDBLOCK+4
VSDELEM  EQU   VSDBLOCK
VSDFREE  EQU   VSDUSAGE+24
VSDALLC  EQU   VSDUSAGE+19
VSDDSOR3 EQU   VSDDSORG+2
@NM00084 EQU   VSDDSORG
VSDSCAL  EQU   VSDUSAGE+12
@NM00083 EQU   VSDUSEF
VSDCALFR EQU   VSDUSEF
@NM00082 EQU   VSDALLOC
VSDABSTR EQU   VSDALLOC
VSDABLK  EQU   VSDALLOC
VSDATRK  EQU   VSDALLOC
VSDACYL  EQU   VSDALLOC
@NM00081 EQU   VSDDORG
VSDOU    EQU   VSDDORG
VSDOIS   EQU   VSDDORG
VSDODA   EQU   VSDDORG
VSDOUN   EQU   VSDDORG
VSDOPS   EQU   VSDDORG
VSDOPO   EQU   VSDDORG
VSDEXTS  EQU   VSDUSAGE+8
VSDSECAL EQU   VSDUSAGE+4
VSDFTRK  EQU   VSDUSAGE+2
VSDTRKS  EQU   VSDUSAGE
@NM00080 EQU   VSDSCR+5
@NM00079 EQU   VSDSCRFL
VSDVSAM  EQU   VSDSCRFL
VSDCATLC EQU   VSDSCRFL
VSDACBPT EQU   VSDSCR
VSDPRTC  EQU   VSDSTAT+25
VSDCAT   EQU   VSDSTAT+22
VSDEXP   EQU   VSDSTAT+20
VSDCRE   EQU   VSDSTAT+18
@NM00078 EQU   VSDFLG2
VSDERROR EQU   VSDFLG2
VSDPROT  EQU   VSDFLG2
VSDPWW   EQU   VSDFLG2
VSDPWR   EQU   VSDFLG2
@NM00077 EQU   VSDSFLG1
VSDCVSAM EQU   VSDSFLG1
VSDCATLG EQU   VSDSFLG1
VSDVSAME EQU   VSDSFLG1
VSDVSAMC EQU   VSDSFLG1
VSDVTOCE EQU   VSDSFLG1
VSDVTOCC EQU   VSDSFLG1
VSDOWNER EQU   VSDSTAT+8
VSDEXPIR EQU   VSDSTAT+4
VSDCREAT EQU   VSDSTAT
VSDFRCCL EQU   VSDVTOC+21
@NM00076 EQU   VSDVTOC+20
VSDFREXT EQU   VSDVTOC+16
@NM00075 EQU   VSDVTOC+15
VSDFRTRK EQU   VSDVTOC+11
@NM00074 EQU   VSDVTOC+10
VSDFRCYL EQU   VSDVTOC+6
@NM00073 EQU   VSDVTOC
@NM00072 EQU   VS3FLAGS
VS3SYSNM EQU   VS3FLAGS
VS3UNCAT EQU   VS3FLAGS
VS3SCR   EQU   VS3FLAGS
VS3USAGE EQU   VS3FLAGS
VS3STAT  EQU   VS3FLAGS
VS3DD    EQU   VS3AGL+50
VS3VOL   EQU   VS3AGL+44
VS3POOL  EQU   VS3AGL+40
VS3DEV   EQU   VS3AGL+36
VS3UCBP  EQU   VS3AGL+32
VS3CREAT EQU   VS3AGL+28
VS3EXPIR EQU   VS3AGL+24
VS3AST   EQU   VS3AGL+22
VS3LEVLN EQU   VS3AGL+20
VS3LEVP  EQU   VS3AGL+16
VS3EXDSP EQU   VS3AGL+12
VS3LISTP EQU   VS3AGL+8
VS3HEAD  EQU   VS3AGL
@NM00071 EQU   DATESOPT
DATDAYOP EQU   DATESOPT
DATDTEOP EQU   DATESOPT
DATSUB   EQU   DATESOPT
DATADD   EQU   DATESOPT
DATRETRN EQU   DATESAGL+16
DATDAYS  EQU   DATESAGL+12
DATDATE  EQU   DATESAGL+8
DATHEAD  EQU   DATESAGL
@NM00070 EQU   SELFLAGS
SELVOL   EQU   SELAGL+16
SELDDNP  EQU   SELAGL+12
SELUCBP  EQU   SELAGL+8
SELHEAD  EQU   SELAGL
@NM00069 EQU   UCTFLAGS
UCTVSCAT EQU   UCTFLAGS
UCTDD    EQU   UCTAGL+60
UCTVOLP  EQU   UCTAGL+56
UCTACBP  EQU   UCTAGL+52
UCTDSN   EQU   UCTAGL+8
UCTHEAD  EQU   UCTAGL
@NM00068 EQU   LCTFLAGS
LCTVSCAT EQU   LCTFLAGS
LCTOWNER EQU   LCTINFO+24
LCTEXPIR EQU   LCTINFO+20
LCTCREAT EQU   LCTINFO+16
LCTACBP  EQU   LCTINFO+12
LCTMULVC EQU   LCTINFO+8
LCTHEAD  EQU   LCTINFO
SRTWORKP EQU   SRTAGL+28
SRTFLDLN EQU   SRTAGL+24
SRTPOSIT EQU   SRTAGL+20
SRTLEN   EQU   SRTAGL+16
SRTNUM   EQU   SRTAGL+12
SRTADDR  EQU   SRTAGL+8
SRTHEAD  EQU   SRTAGL
SV82DEBP EQU   SV82WRKP
SV82TTRP EQU   SV82LIST+8
SV82VOLP EQU   SV82DCBP
SV82UCBP EQU   SV82LIST+1
SV82CODE EQU   SV82LIST
VOLRESV3 EQU   VOLLABEL+55
VOLOWNER EQU   VOLLABEL+45
VOLRESV1 EQU   VOLLABEL+20
VOLVTOC  EQU   VOLLABEL+15
VOLSECTY EQU   VOLLABEL+14
VOLSERNO EQU   VOLLABEL+8
VOLNO    EQU   VOLLABEL+7
VOLLABI  EQU   VOLLABEL+4
VOLKEY   EQU   VOLLABEL
STAVTTR  EQU   STAEPARM+54
@NM00065 EQU   STARETRY
STAVTOC  EQU   STARETRY
STAOFF   EQU   STARETRY
STAIO05  EQU   STARETRY
@NM00064 EQU   STARCVY
STACLEAR EQU   STARCVY
STAVPOST EQU   STARCVY
STAVENQ  EQU   STARCVY
STAVDMNT EQU   STARCVY
STAVMNT  EQU   STARCVY
STATCB   EQU   STAEPARM+48
STARTADD EQU   STAEPARM+44
STAEXSAV EQU   STAEPARM+40
STARTSAV EQU   STAEPARM+36
STARTTR  EQU   STAEPARM+32
@NM00063 EQU   STAEPARM+30
STARVOL  EQU   STAEPARM+24
STARUCB  EQU   STAEPARM+20
@NM00062 EQU   STAEPARM+18
STAVVOL  EQU   STAEPARM+12
STAVUCB  EQU   STAEPARM+8
STAHEAD  EQU   STAEPARM
RCTDSET  EQU   RCTAGL+32
RCTNVOL  EQU   RCTAGL+26
RCTOVOL  EQU   RCTAGL+20
RCTNDEV  EQU   RCTAGL+16
RCTODEV  EQU   RCTAGL+12
@NM00061 EQU   RCTAGL+10
@NM00060 EQU   RCTOPT
RCTVOL   EQU   RCTOPT
RCTDEV   EQU   RCTOPT
RCTHEAD  EQU   RCTAGL
@NM00059 EQU   VSRESOPT
VSREAL   EQU   VSRESOPT
VSRES    EQU   VSRESOPT
@NM00058 EQU   VSMSG
VSTOV    EQU   VSMSG
VSFROMV  EQU   VSMSG
@NM00057 EQU   VSRETURN
VSUCAT   EQU   VSRETURN
VSVSAM   EQU   VSRETURN
@NM00056 EQU   VSCATOPT
VSLIST   EQU   VSCATOPT
VSSERIAL EQU   VSCATOPT
VSDEVICE EQU   VSCATOPT
@NM00055 EQU   VSVTOPT
VSVSFLAG EQU   VSVTOPT
VSALTTRK EQU   VSVTOPT
VSTIME   EQU   VSVTOPT
VSUCMAST EQU   VSSECOPT
VSOPCAT  EQU   VSSECOPT
VSUCTEST EQU   VSSECOPT
VSWRITE  EQU   VSSECOPT
VSREAD   EQU   VSSECOPT
VSNONONV EQU   VSSECOPT
VSMASTER EQU   VSSECOPT
VSNOVSAM EQU   VSSECOPT
VSODEVP  EQU   VS1AGL+64
VSOSERP  EQU   VS1AGL+60
VSDEVP   EQU   VS1AGL+56
VSSERP   EQU   VS1AGL+52
VSPFILEP EQU   VS1AGL+48
VSPSWDP  EQU   VS1AGL+44
VSCATDDP EQU   VS1AGL+40
VSACBP   EQU   VS1AGL+36
VSCATP   EQU   VS1AGL+32
VSNXTATP EQU   VS1AGL+28
VSNUMATP EQU   VS1AGL+24
VSIOP    EQU   VS1AGL+20
VSFILEP  EQU   VS1AGL+16
VSVOLP   EQU   VS1AGL+12
VSUCBP   EQU   VS1AGL+8
VSHEAD   EQU   VS1AGL
VSVTOCPT EQU   VS2AGL+48
@NM00054 EQU   VS2AGL+45
VSDDNAME EQU   VS2AGL+37
@NM00053 EQU   VS2RESOP
VS2REAL  EQU   VS2RESOP
VS2RES   EQU   VS2RESOP
@NM00052 EQU   VS2MSG
VS2TOV   EQU   VS2MSG
VSVOLUME EQU   VS2AGL+29
@NM00051 EQU   VSLABOPT
VSNOVTOC EQU   VSLABOPT
VSVOLSER EQU   VSLABOPT
VSOWNER  EQU   VSLABOPT
VSIOBKPT EQU   VS2AGL+24
VSVOLPTR EQU   VS2AGL+20
VSOWNPTR EQU   VS2AGL+16
VSVTOCSZ EQU   VS2AGL+12
VSUCBPTR EQU   VS2AGL+8
VS2HEAD  EQU   VS2AGL
EXPDATAL EQU   EXPARRAY+6
@NM00050 EQU   EXPARRAY+5
EXPKEYLN EQU   EXPARRAY+4
EXPDATAP EQU   EXPARRAY
EXPRECNO EQU   EXPDATAB
EXPCCHHR EQU   EXPARG+16
EXPCTLBK EQU   EXPARG+8
EXPHEAD  EQU   EXPARG
EXGDATAL EQU   EXGARG+30
@NM00049 EQU   EXGARG+29
EXGKEYLN EQU   EXGARG+28
EXGDATAP EQU   EXGARG+24
EXGRECNO EQU   EXGARG+20
EXGCCHH2 EQU   EXGARG+16
EXGCCHH1 EQU   EXGARG+12
EXGCTLBK EQU   EXGARG+8
EXGHEAD  EQU   EXGARG
@NM00048 EQU   EXFLG
EXOREAD  EQU   EXFLG
@NM00047 EQU   EXOPT
EXOVTOC  EQU   EXOPT
EXONEW   EQU   EXOPT
EXOPASS  EQU   EXOPT
EXOLAB   EQU   EXOPT
EXOTAB   EQU   EXOPT
EXOCTLBK EQU   EXOARG+28
EXOEXT   EQU   EXOARG+24
EXOUCB   EQU   EXOARG+20
EXOVSN   EQU   EXOARG+16
EXODSN   EQU   EXOARG+12
EXODDN   EQU   EXOARG+8
EXOHEAD  EQU   EXOARG
@NM00046 EQU   EXCLFLAG
EXCLMNT  EQU   EXCLFLAG
EXCLVOL  EQU   EXCLAGL+16
EXCLDDP  EQU   EXCLAGL+12
EXCLUCBP EQU   EXCLAGL+8
EXCLHEAD EQU   EXCLAGL
@NM00045 EQU   CKFLAGS
CKDMTABL EQU   CKFLAGS
CKRETTYP EQU   CKFLAGS
CKTESTVT EQU   CKFLAGS
CKLABELP EQU   CKAGL+24
CKDATYPE EQU   CKAGL+20
CKDDNAME EQU   CKAGL+12
CKUCBPTR EQU   CKAGL+8
CKHEAD   EQU   CKAGL
PULABELP EQU   PUAGL+16
PUTTRPTR EQU   PUAGL+12
PUUCBPTR EQU   PUAGL+8
PUHEAD   EQU   PUAGL
MDR      EQU   MDVTOC+4
MDHH     EQU   MDVTOC+2
MDCC     EQU   MDVTOC
@NM00044 EQU   MDAGL+31
MDVTOCTR EQU   MDFLAGS
MDFORCE  EQU   MDFLAGS
MDDEQ    EQU   MDFLAGS
MDENQ    EQU   MDFLAGS
MDWAIT   EQU   MDFLAGS
MDPOST   EQU   MDFLAGS
MDCLEAR  EQU   MDFLAGS
MDNEWVOL EQU   MDFLAGS
MDLABEL  EQU   MDAGL+24
MDPUAGL  EQU   MDAGL+20
MDDDNAME EQU   MDAGL+12
MDUCBPTR EQU   MDAGL+8
MDHEAD   EQU   MDAGL
CTTBLRR  EQU   CTARRAY+3
CTTBLHH  EQU   CTARRAY+2
CTTBLCC  EQU   CTARRAY+1
CTTBLID  EQU   CTARRAY
CTREALH  EQU   CTMSG+3
CTREALCC EQU   CTMSG+1
@NM00043 EQU   CTMSG
CMCSN2   EQU   CMMSG+28
CMCSN1   EQU   CMMSG+16
CMNUMCRT EQU   CMMSG+15
@NM00042 EQU   CMMSG+14
CMNEWVOL EQU   CMMSG+8
@NM00041 EQU   CMMSG+7
@NM00040 EQU   CMVOLFLG
CMRONLY  EQU   CMVOLFLG
CMBIND   EQU   CMVOLFLG
CMSCRCRT EQU   CMVOLFLG
CMEXCL   EQU   CMVOLFLG
CMDERAS  EQU   CMVOLFLG
CMSCRVOL EQU   CMVOLFLG
CMCECART EQU   CMVOLFLG
CMOLDVOL EQU   CMMSG
CCOLDCSN EQU   CCMSG+24
CCNEWCSN EQU   CCMSG+12
@NM00039 EQU   CCMSG+10
CCVOL    EQU   CCMSG+4
@NM00038 EQU   CCMSG+2
CCEJCODE EQU   CCMSG+1
CCPSTCDE EQU   CCMSG
@NM00037 EQU   DMPARY+15
DMPARYTP EQU   DMPARY+14
DMPARYEX EQU   DMPARY+12
DMPARYIC EQU   DMPARY+10
DMPARYSZ EQU   DMPARY+8
DMPARYNM EQU   DMPARY
@NM00036 EQU   DMPITM+15
@NM00035 EQU   ERCNVTAB+24
ERCPLPT  EQU   ERCNVTAB+20
ERCATRC  EQU   ERCNVTAB+16
ERDSNM   EQU   ERCNVTAB+12
@NM00034 EQU   ERCNVTAB+4
@NM00033 EQU   ERCNVTAB+3
@NM00032 EQU   EROSOPER
EROSUCDX EQU   EROSOPER
EROSCATL EQU   EROSOPER
@NM00031 EQU   EROPER
ERCATAL  EQU   EROPER
ERCATDL  EQU   EROPER
ERCATDE  EQU   EROPER
ERCATLC  EQU   EROPER
@NM00030 EQU   ERTYPE
EROSCAT  EQU   ERTYPE
ERCATLG  EQU   ERTYPE
@NM00029 EQU   FMTCNVF+1
FMTAR    EQU   FMTCNVF+1
FMTBS    EQU   FMTCNVF+1
FMTSS    EQU   FMTCNVF+1
FMTAL    EQU   FMTCNVF+1
FMTZS    EQU   FMTCNVF+1
@NM00028 EQU   FMTCNVF
FMTPU    EQU   FMTCNVF
FMTBD    EQU   FMTCNVF
FMTBHD   EQU   FMTCNVF
FMTBHA   EQU   FMTCNVF
FMTBH    EQU   FMTCNVF
FMTOLEN  EQU   FMTLIST+8
FMTRIO   EQU   FMTOCOL
FMTSPT   EQU   FMTSTO
FMTSTL   EQU   FMTILEN
@NM00027 EQU   FMTFLGS+1
FMTHDF   EQU   FMTFLGS
FMTDFF   EQU   FMTFLGS
FMTSTF   EQU   FMTFLGS
FMTREPF  EQU   FMTFLGS
FMTBDF   EQU   FMTFLGS
FMTIDF   EQU   FMTFLGS
FMTSCF   EQU   FMTFLGS
FMTEOLF  EQU   FMTFLGS
DARGDTM  EQU   DARGARY+4
DARGPCT  EQU   DARGINL
DARGREP  EQU   DARGINS
@NM00026 EQU   DARGLIST+19
DARGIND  EQU   DARGLIST+18
DARGCNT  EQU   DARGLIST+14
UVOLVOL  EQU   UVOLENT+4
UVOLDEV  EQU   UVOLENT
UVOLCNT  EQU   UVOLLIST
@NM00025 EQU   IOINFOPT
IOINFTMS EQU   IOINFOPT
IOINFSUP EQU   IOINFOPT
IOINFDSN EQU   IOINFOPT
IOINFVOL EQU   IOINFOPT
IOINFDVT EQU   IOINFOPT
OPNVOL   EQU   OPNAGL+44
@NM00024 EQU   OPNAGL+43
@NM00023 EQU   OPNOPT2
OPNOPTJM EQU   OPNOPT2
@NM00022 EQU   OPNOPT2
OPNOPTAS EQU   OPNOPT2
@NM00021 EQU   OPNDSO
OPNDSOPO EQU   OPNDSO
OPNDSOIS EQU   OPNDSO
OPNDSOPS EQU   OPNDSO
OPNDSOAM EQU   OPNDSO
OPNKYL   EQU   OPNAGL+40
OPNBLK   EQU   OPNAGL+36
OPNREC   EQU   OPNAGL+32
OPNDEVIX EQU   OPNDEV+4
OPNDEVDT EQU   OPNDEV
OPNCBP   EQU   OPNAGL+20
OPNDSN   EQU   OPNAGL+16
OPNPWA   EQU   OPNAGL+12
OPNDDN   EQU   OPNAGL+8
OPNIOC   EQU   OPNAGL+4
OPNMODRP EQU   OPNMOD
OPNMODUB EQU   OPNMOD
OPNMODRS EQU   OPNMOD
OPNMODAX EQU   OPNMOD
OPNMODRR EQU   OPNMOD
OPNMODRC EQU   OPNMOD
OPNMODAC EQU   OPNMOD
OPNMODPD EQU   OPNMOD
@NM00020 EQU   OPNTYP
OPNTYPRV EQU   OPNTYP
OPNTYPEX EQU   OPNTYP
OPNTYPRA EQU   OPNTYP
OPNTYPXM EQU   OPNTYP
OPNTYPCI EQU   OPNTYP
OPNTYPSO EQU   OPNTYP
OPNTYPSI EQU   OPNTYP
@NM00019 EQU   OPNRFM
OPNRFMBK EQU   OPNRFM
OPNRFMSF EQU   OPNRFM
OPNRFMUN EQU   OPNRFM
OPNRFMVR EQU   OPNRFM
OPNRFMFX EQU   OPNRFM
OPNOPTSK EQU   OPNOPT
OPNOPTDR EQU   OPNOPT
OPNOPTCR EQU   OPNOPT
OPNOPTKS EQU   OPNOPT
OPNOPTBK EQU   OPNOPT
OPNOPTUP EQU   OPNOPT
OPNOPTOT EQU   OPNOPT
OPNOPTIN EQU   OPNOPT
IOCEXT   EQU   IOCSTR+64
IOCREL   EQU   IOCSTR+60
IOCWORK  EQU   IOCSTR+56
IOCRRN   EQU   IOCSTR+52
IOCPNM   EQU   IOCNWM+2
IOCPTL   EQU   IOCNWM
IOCKYA   EQU   IOCMEM
IOCVRC   EQU   IOCTTR
IOCCBP   EQU   IOCSTR+36
IOCDSN   EQU   IOCSTR+32
IOCHURBA EQU   IOCSTR+28
IOCVOLSR EQU   IOCSTR+22
@NM00018 EQU   IOCMSG
IOCMSGAE EQU   IOCMSG
IOCMSGCE EQU   IOCMSG
IOCMSGOE EQU   IOCMSG
IOCMSGOP EQU   IOCMSG
@NM00017 EQU   IOCMSG
IOCCHPSY EQU   IOCCHP
IOCCHPAS EQU   IOCCHP
IOCCHPBK EQU   IOCCHP
IOCCHPCR EQU   IOCCHP
IOCCHPKS EQU   IOCCHP
IOCCHPSK EQU   IOCCHP
IOCCHPDR EQU   IOCCHP
IOCCHPSQ EQU   IOCCHP
@NM00016 EQU   IOCMAC2
IOCMACPA EQU   IOCMAC2
@NM00015 EQU   IOCMAC2
IOCMACCP EQU   IOCMAC2
IOCMACRR EQU   IOCMAC2
IOCMACAS EQU   IOCMAC2
IOCMACSK EQU   IOCMAC2
@NM00014 EQU   IOCMAC
IOCMACCC EQU   IOCMAC
IOCMACDR EQU   IOCMAC
IOCMACBK EQU   IOCMAC
IOCMACCR EQU   IOCMAC
IOCMACUP EQU   IOCMAC
IOCMACOT EQU   IOCMAC
IOCMACIN EQU   IOCMAC
@NM00013 EQU   IOCRFM
IOCRFMBK EQU   IOCRFM
IOCRFMSF EQU   IOCRFM
IOCRFMUN EQU   IOCRFM
IOCRFMVR EQU   IOCRFM
IOCRFMFX EQU   IOCRFM
@NM00012 EQU   IOCDSO
IOCDSOPO EQU   IOCDSO
IOCDSOIS EQU   IOCDSO
IOCDSOPS EQU   IOCDSO
IOCDSOAM EQU   IOCDSO
IOCRKP   EQU   IOCSTR+13
IOCKYL   EQU   IOCSTR+12
IOCTRN   EQU   IOCSTR+8
IOCDLN   EQU   IOCSTR+4
IOCDAD   EQU   IOCSTR
UNITVTOC EQU   UNITABL+7
@NM00011 EQU   UNITSTAT
UNITUSHR EQU   UNITSTAT
UNITXSHR EQU   UNITSTAT
UNITISHR EQU   UNITSTAT
UNITUA   EQU   @NM00010+1
UNITCHA  EQU   @NM00010
UNITUCB  EQU   UNITABL
ALLUNCNT EQU   ALLAGL+30
ALLVLCNT EQU   ALLAGL+29
@NM00009 EQU   ALLOPT
ALLOPTUN EQU   ALLOPT
ALLOPTPV EQU   ALLOPT
ALLOPTDS EQU   ALLOPT
ALLOPTVL EQU   ALLOPT
@NM00008 EQU   ALLORG+1
ALLORGVS EQU   ALLORG+1
@NM00007 EQU   ALLORG+1
ALLORGGS EQU   ALLORG+1
ALLORGUN EQU   ALLORG
ALLORGPO EQU   ALLORG
ALLORGMQ EQU   ALLORG
ALLORGCQ EQU   ALLORG
ALLORGCX EQU   ALLORG
ALLORGDA EQU   ALLORG
ALLORGPS EQU   ALLORG
ALLORGIS EQU   ALLORG
ALLDSPUN EQU   ALLDSP
ALLDSPCG EQU   ALLDSP
ALLDSPDE EQU   ALLDSP
ALLDSPKP EQU   ALLDSP
@NM00006 EQU   ALLDSP
ALLSTSOD EQU   ALLSTS
ALLSTSMD EQU   ALLSTS
ALLSTSNW EQU   ALLSTS
ALLSTSSR EQU   ALLSTS
@NM00005 EQU   ALLSTS
ALLPWD   EQU   ALLAGL+20
ALLVLP   EQU   ALLAGL+16
ALLULP   EQU   ALLAGL+12
ALLDDN   EQU   ALLAGL+4
ALLDSN   EQU   ALLAGL
CIRPID   EQU   CIRAGL+28
CIRPWD   EQU   CIRAGL+24
CIRCAT   EQU   CIRAGL+20
CIRWKP   EQU   CIRAGL+16
CIRTLR   EQU   CIRAGL+12
CIRHDR   EQU   CIRAGL+8
CIRTLN   EQU   CIRAGL+6
CIRHLN   EQU   CIRAGL+4
@NM00004 EQU   CIRAGL+1
@NM00003 EQU   CIRTYPE
CIRTYPAQ EQU   CIRTYPE
CIRTYP1Q EQU   CIRTYPE
NEWID1   EQU   TRACE1+95
CALLID   EQU   OLDERID1+90
@NM00002 EQU   OLDERID1
*                                      END UNREFERENCED COMPONENTS
@RT00298 EQU   @RC00297
@RF00317 EQU   @RC00297
@RF00333 EQU   @RC00254
@RF00377 EQU   @RC00362
@PB00003 EQU   @EL00001
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IDCNC01,(C'PLS1211',0603,76201)
