         TITLE 'IDCRD02: IDCAMS REPAIRV FUNCTION SUPPORT ROUTINE       *
                        '
        MACRO
        GETMAIN &R,&LV=
        L     REG15,0(REG1)           GDTTBL ADDRESS
        L     REG15,GDTPRL(REG15)     PROL ROUTINE ADDRESS
        CNOP  2,4                     BOUNDARY ALIGNMENT
        LA    REG14,*+14              RETURN ADDRESS
        BALR  REG1,REG15              LINKAGE TO PROL ROUTINE
        DC    A(MODID)                MODULE ID ADDRESS
        DC    A(@SIZDATD)             AUTOMATIC STORAGE SIZE ADDRESS
        MEND
IDCRD02  CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'IDCRD02   77.241'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @09,0                                               0002
@PSTART  LA    @10,4095(,@09)                                      0002
         USING @PSTART,@09                                         0002
         USING @PSTART+4095,@10                                    0002
         L     @00,@SIZDATD                                        0002
         GETMAIN  R,LV=(0)
         LR    @12,@01                                             0002
         USING @DATD,@12                                           0002
         ST    @13,@SA00001+4                                      0002
         LM    @00,@01,20(@13)                                     0002
         ST    @12,8(,@13)                                         0002
         LR    @13,@12                                             0002
         MVC   @PC00001(12),0(@01)                                 0002
*                                                                  0348
*   /*****************************************************************/
*   /*                                                               */
*   /* SET TRACE AND DUMP POINTS                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0349
*   IF GDTDBG=NULLPTR THEN                                         0349
         L     @11,@PC00001                                        0349
         L     @11,GDTDBG(,@11)                                    0349
         LTR   @11,@11                                             0349
         BZ    @RT00349                                            0349
*     ;                                                            0350
*   ELSE                                                           0351
*     CALL IDCDB010(GDTTBL,'RD20');                                0351
         L     @11,@PC00001                                        0351
         ST    @11,@AL00001                                        0351
         LA    @06,@CC01861                                        0351
         ST    @06,@AL00001+4                                      0351
         MVI   @AL00001+4,X'80'                                    0351
         L     @15,GDTDBG(,@11)                                    0351
         LA    @01,@AL00001                                        0351
         BALR  @14,@15                                             0351
*   OLDERID2=NEWERID2;                                             0352
@RT00349 L     @11,@PC00001                                        0352
         L     @11,GDTTR2(,@11)                                    0352
         MVC   @TS00001(95),NEWERID2(@11)                          0352
         MVC   OLDERID2(95,@11),@TS00001                           0352
*   NEWID2='RD21';                                                 0353
*                                                                  0353
         MVC   NEWID2(4,@11),@CC01862                              0353
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL DISPLAY ROUTINE                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0354
*   CALL IDCRD020;                                                 0354
*                                                                  0354
         BAL   @14,IDCRD020                                        0354
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE RETURN CODE FROM DISPLAY ROUTINE                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0355
*   RESPECIFY                                                      0355
*     RTNREG RSTD;                                                 0355
*   TESTRC=RTNREG;                                                 0356
         LR    TESTRC,RTNREG                                       0356
*   RESPECIFY                                                      0357
*     RTNREG UNRSTD;                                               0357
*                                                                  0357
*   /*****************************************************************/
*   /*                                                               */
*   /* SET DISPLAY ROUTINE CODE IN LASTCC                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0358
*   LASTCC=TESTRC;                                                 0358
*                                                                  0358
         STH   TESTRC,LASTCC                                       0358
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UEPIL TO FREE STORAGE AND RETURN TO IDCRD01             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0359
*   CALL IDCSAEP0(GDTTBL,MODID,LASTCC);                            0359
         L     @11,@PC00001                                        0359
         ST    @11,@AL00001                                        0359
         LA    @06,MODID                                           0359
         ST    @06,@AL00001+4                                      0359
         LA    @06,LASTCC                                          0359
         ST    @06,@AL00001+8                                      0359
         MVI   @AL00001+8,X'80'                                    0359
         L     @15,GDTEPL(,@11)                                    0359
         LA    @01,@AL00001                                        0359
         BALR  @14,@15                                             0359
*IDCRD020:                                                         0360
*   PROCEDURE;                                                     0360
*                                                                  0360
@EL00001 L     @13,4(,@13)                                         0360
@EF00001 L     @00,@SIZDATD                                        0360
         LR    @01,@12                                             0360
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0360
         BR    @14                                                 0360
IDCRD020 STM   @14,@12,@SA00002                                    0360
*   /*****************************************************************/
*   /*                                                               */
*   /* OPENING THE ALTERNATE REPORT FILE DETERMINE IF ALTERNATE      */
*   /* REPORT FILE IS SPECIFIED                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0361
*   IF ADDR(DOUTF)^=NULLPTR×ADDR(DOTDS)^=NULLPTR THEN              0361
         SLR   @11,@11                                             0361
         L     @06,@PC00001+4                                      0361
         C     @11,FDTPTR+48(,@06)                                 0361
         BNE   @RT00361                                            0361
         C     @11,FDTPTR+52(,@06)                                 0361
         BE    @RF00361                                            0361
@RT00361 DS    0H                                                  0362
*     DO;                                                          0362
*                                                                  0362
*       /*************************************************************/
*       /*                                                           */
*       /* CONSTRUCT THE OPNAGL FOR THE ALTERNATE REPORT FILE        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0363
*       OPNPTR=REPOPAGL;                                           0363
         L     @11,@PC00001+8                                      0363
         L     OPNPTR,REPOPAGL(,@11)                               0363
*       OPNAGL=''B;                                                0364
         XC    OPNAGL(48,OPNPTR),OPNAGL(OPNPTR)                    0364
*       OPNOPTOT=ON;                                               0365
         OI    OPNOPTOT(OPNPTR),B'01000000'                        0365
*       OPNIOC=ADDR(REPARFIO);                                     0366
         LA    @11,REPARFIO(,@11)                                  0366
         ST    @11,OPNIOC(,OPNPTR)                                 0366
*       OPNMODAC=ON;                                               0367
         OI    OPNMODAC(OPNPTR),B'01000000'                        0367
*       IF ADDR(DOTDS)^=NULLPTR THEN                               0368
         L     @11,@PC00001+4                                      0368
         L     @11,FDTPTR+52(,@11)                                 0368
         LTR   @11,@11                                             0368
         BZ    @RF00368                                            0368
*         OPNDSN=ADDR(DOTDSVAL);                                   0369
         LA    @11,DOTDSVAL(,@11)                                  0369
         ST    @11,OPNDSN(,OPNPTR)                                 0369
*       ELSE                                                       0370
*         OPNDDN=ADDR(DOUTFVAL);                                   0370
*                                                                  0370
         B     @RC00368                                            0370
@RF00368 L     @11,@PC00001+4                                      0370
         L     @11,FDTPTR+48(,@11)                                 0370
         LA    @11,DOUTFVAL(,@11)                                  0370
         ST    @11,OPNDDN(,OPNPTR)                                 0370
*       /*************************************************************/
*       /*                                                           */
*       /* OPEN THE ALTERNATE REPORT FILE                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0371
*       CALL IDCIOOP0(GDTTBL,OPNAGL);                              0371
*                                                                  0371
@RC00368 L     @11,@PC00001                                        0371
         ST    @11,@AL00001                                        0371
         ST    OPNPTR,@AL00001+4                                   0371
         MVI   @AL00001+4,X'80'                                    0371
         L     @15,GDTOPN(,@11)                                    0371
         LA    @01,@AL00001                                        0371
         BALR  @14,@15                                             0371
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM UOPEN                               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0372
*       RESPECIFY                                                  0372
*         RTNREG RSTD;                                             0372
*       TESTRC=RTNREG;                                             0373
         LR    TESTRC,RTNREG                                       0373
*       RESPECIFY                                                  0374
*         RTNREG UNRSTD;                                           0374
*                                                                  0374
*       /*************************************************************/
*       /*                                                           */
*       /* IF UOPEN FAILS, RETURN TO IDCRD02 WITH RC = 12            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0375
*       IF TESTRC^=0 THEN                                          0375
         LTR   TESTRC,TESTRC                                       0375
         BZ    @RF00375                                            0375
*         RETURN CODE(LASTCC12);                                   0376
         LA    @15,12                                              0376
         L     @14,@SA00002                                        0376
         LM    @00,@12,@SA00002+8                                  0376
         BR    @14                                                 0376
*     END;                                                         0377
@RF00375 DS    0H                                                  0378
*                                                                  0378
*   /*****************************************************************/
*   /*                                                               */
*   /* DISPLAYING THE FIRST TRACK OF THE VTOC (VTOCHEADER) DETERMINE */
*   /* IF VTOCHEADER PROCESSING IS SPECIFIED                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0378
*   IF ADDR(DPVTC)^=NULLPTR THEN                                   0378
@RF00361 L     @11,@PC00001+4                                      0378
         L     @11,FDTPTR+116(,@11)                                0378
         LTR   @11,@11                                             0378
         BZ    @RF00378                                            0378
*     DO;                                                          0379
*                                                                  0379
*       /*************************************************************/
*       /*                                                           */
*       /* CALL IDCRDDS TO RESERVE AND OPEN THE VTOC                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0380
*       CALL IDCRDDS(NULLBYTE,NULLPARM);                           0380
*                                                                  0380
         L     @15,@CV01809                                        0380
         LA    @01,@AL00380                                        0380
         BALR  @14,@15                                             0380
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM IDCRDDS                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0381
*       RESPECIFY                                                  0381
*         RTNREG RSTD;                                             0381
*       TESTRC=RTNREG;                                             0382
         LR    TESTRC,RTNREG                                       0382
*       RESPECIFY                                                  0383
*         RTNREG UNRSTD;                                           0383
*                                                                  0383
*       /*************************************************************/
*       /*                                                           */
*       /* IF IDCRDDS FAILS, PREPARE TO RETURN TO IDCRD02 WITH RC =  */
*       /* 12                                                        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0384
*       IF TESTRC^=0 THEN                                          0384
         SLR   @11,@11                                             0384
         CR    TESTRC,@11                                          0384
         BE    @RF00384                                            0384
*         DO;                                                      0385
*                                                                  0385
*           /*********************************************************/
*           /*                                                       */
*           /* CLOSE THE ALTERNATE REPORT FILE                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0386
*           IF REPARFIO^=NULLPTR THEN                              0386
         L     @06,@PC00001+8                                      0386
         C     @11,REPARFIO(,@06)                                  0386
         BE    @RF00386                                            0386
*             DO;                                                  0387
*               CALL IDCIOCL0(GDTTBL,REPARFIO);                    0388
         L     @11,@PC00001                                        0388
         ST    @11,@AL00001                                        0388
         LA    @06,REPARFIO(,@06)                                  0388
         ST    @06,@AL00001+4                                      0388
         MVI   @AL00001+4,X'80'                                    0388
         L     @15,GDTCLS(,@11)                                    0388
         LA    @01,@AL00001                                        0388
         BALR  @14,@15                                             0388
*               REPARFIO=NULLPTR;                                  0389
         L     @11,@PC00001+8                                      0389
         SLR   @06,@06                                             0389
         ST    @06,REPARFIO(,@11)                                  0389
*             END;                                                 0390
*                                                                  0390
*           /*********************************************************/
*           /*                                                       */
*           /* RETURN TO IDCRD02 WITH RC = 12                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0391
*           RETURN CODE(LASTCC12);                                 0391
@RF00386 LA    @15,12                                              0391
         L     @14,@SA00002                                        0391
         LM    @00,@12,@SA00002+8                                  0391
         BR    @14                                                 0391
*         END;                                                     0392
*                                                                  0392
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE INDEX FOR EXTENT TABLE                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0393
*       I=1;                                                       0393
*                                                                  0393
@RF00384 L     @11,@PC00001+8                                      0393
         MVI   I(@11),X'01'                                        0393
*       /*************************************************************/
*       /*                                                           */
*       /* CALL IDCRDDC TO DISPLAY FIRST TRACK OF VTOC               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0394
*       CALL IDCRDDC;                                              0394
*                                                                  0394
         L     @15,@CV01810                                        0394
         BALR  @14,@15                                             0394
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM IDCRDDC                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0395
*       RESPECIFY                                                  0395
*         RTNREG RSTD;                                             0395
*       TESTRC=RTNREG;                                             0396
         LR    TESTRC,RTNREG                                       0396
*       RESPECIFY                                                  0397
*         RTNREG UNRSTD;                                           0397
*                                                                  0397
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE IN REPCB FOR FUTURE REFERENCE            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0398
*       REPRC=TESTRC;                                              0398
*                                                                  0398
         L     @11,@PC00001+8                                      0398
         STH   TESTRC,REPRC(,@11)                                  0398
*       /*************************************************************/
*       /*                                                           */
*       /* CLOSE THE VTOC                                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0399
*       CALL IDCIO050(GDTTBL,CLOSE,REPIDSOP);                      0399
*                                                                  0399
         L     @06,@PC00001                                        0399
         ST    @06,@AL00001                                        0399
         LA    @15,CLOSE                                           0399
         ST    @15,@AL00001+4                                      0399
         LA    @11,REPIDSOP(,@11)                                  0399
         ST    @11,@AL00001+8                                      0399
         MVI   @AL00001+8,X'80'                                    0399
         L     @15,GDTEXP(,@06)                                    0399
         LA    @01,@AL00001                                        0399
         BALR  @14,@15                                             0399
*       /*************************************************************/
*       /*                                                           */
*       /* WRITE THE RECORDS PROCESSED MESSAGE                       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0400
*       DO;                                                        0400
*         CKREQ=CKREQ&&CKREQ;                                      0401
         L     @11,@PC00001+8                                      0401
         XC    CKREQ(44,@11),CKREQ(@11)                            0401
*         CKRERN=MSG92;                                            0402
         MVC   CKRERN(2,@11),@CH01350                              0402
*         CKRMVAR(1)=ADDR(REPRCDCT);                               0403
         LA    @06,REPRCDCT(,@11)                                  0403
         ST    @06,CKRMVAR(,@11)                                   0403
*         CALL IDCRDER;                                            0404
         L     @15,@CV01811                                        0404
         BALR  @14,@15                                             0404
*       END;                                                       0405
*                                                                  0405
*       /*************************************************************/
*       /*                                                           */
*       /* CLOSE THE ALTERNATE REPORT FILE                           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0406
*       IF REPARFIO^=NULLPTR THEN                                  0406
         L     @11,@PC00001+8                                      0406
         L     @06,REPARFIO(,@11)                                  0406
         LTR   @06,@06                                             0406
         BZ    @RF00406                                            0406
*         DO;                                                      0407
*           CALL IDCIOCL0(GDTTBL,REPARFIO);                        0408
         L     @06,@PC00001                                        0408
         ST    @06,@AL00001                                        0408
         LA    @11,REPARFIO(,@11)                                  0408
         ST    @11,@AL00001+4                                      0408
         MVI   @AL00001+4,X'80'                                    0408
         L     @15,GDTCLS(,@06)                                    0408
         LA    @01,@AL00001                                        0408
         BALR  @14,@15                                             0408
*           REPARFIO=NULLPTR;                                      0409
         L     @11,@PC00001+8                                      0409
         SLR   @06,@06                                             0409
         ST    @06,REPARFIO(,@11)                                  0409
*         END;                                                     0410
*                                                                  0410
*       /*************************************************************/
*       /*                                                           */
*       /* FREE THE BUFFERS                                          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0411
*       CALL IDCSAFP0(GDTTBL,RD01,ALL);                            0411
*                                                                  0411
@RF00406 MVC   @AL00001+4(8),@AL00411                              0411
         L     @11,@PC00001                                        0411
         ST    @11,@AL00001                                        0411
         L     @15,GDTFPL(,@11)                                    0411
         LA    @01,@AL00001                                        0411
         BALR  @14,@15                                             0411
*       /*************************************************************/
*       /*                                                           */
*       /* RETURN TO IDCRD02 WITH APPROPRIATE RETURN CODE            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0412
*       IF REPRC^=0 THEN                                           0412
         L     @11,@PC00001+8                                      0412
         LH    @11,REPRC(,@11)                                     0412
         N     @11,@CF01878                                        0412
         LTR   @11,@11                                             0412
         BZ    @RF00412                                            0412
*         RETURN CODE(LASTCC12);                                   0413
         LA    @15,12                                              0413
         L     @14,@SA00002                                        0413
         LM    @00,@12,@SA00002+8                                  0413
         BR    @14                                                 0413
*       ELSE                                                       0414
*         RETURN CODE(LASTCC00);                                   0414
@RF00412 SLR   @15,@15                                             0414
         L     @14,@SA00002                                        0414
         LM    @00,@12,@SA00002+8                                  0414
         BR    @14                                                 0414
*     END;                                                         0415
*                                                                  0416
*   /*****************************************************************/
*   /*                                                               */
*   /* DISPLAYING A VTOC, OR USER DATA SET, OR STAGING PACK SET TRACE*/
*   /* POINT                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0416
*   OLDERID2=NEWERID2;                                             0416
@RF00378 L     @11,@PC00001                                        0416
         L     @11,GDTTR2(,@11)                                    0416
         MVC   @TS00001(95),NEWERID2(@11)                          0416
         MVC   OLDERID2(95,@11),@TS00001                           0416
*   NEWID2='RD22';                                                 0417
*                                                                  0417
         MVC   NEWID2(4,@11),@CC01868                              0417
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE IF VTOC, OR USER DATA SET, OR STAGING PACK IS       */
*   /* SPECIFIED                                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0418
*   IF ADDR(DSRNG)^=NULLPTR×ADDR(STAGR)^=NULLPTR THEN              0418
         SLR   @11,@11                                             0418
         L     @06,@PC00001+4                                      0418
         C     @11,FDTPTR+24(,@06)                                 0418
         BNE   @RT00418                                            0418
         C     @11,FDTPTR+32(,@06)                                 0418
         BE    @RF00418                                            0418
@RT00418 DS    0H                                                  0419
*     DO;                                                          0419
*                                                                  0419
*       /*************************************************************/
*       /*                                                           */
*       /* CALL IDCRDDS TO OPEN EITHER VTOC, USER DATA SET, OR       */
*       /* STAGING PACK                                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0420
*       CALL IDCRDDS(INPUT,NULLPARM);                              0420
*                                                                  0420
         L     @15,@CV01809                                        0420
         LA    @01,@AL00420                                        0420
         BALR  @14,@15                                             0420
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM IDCRDDS                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0421
*       RESPECIFY                                                  0421
*         RTNREG RSTD;                                             0421
*       TESTRC=RTNREG;                                             0422
         LR    TESTRC,RTNREG                                       0422
*       RESPECIFY                                                  0423
*         RTNREG UNRSTD;                                           0423
*                                                                  0423
*       /*************************************************************/
*       /*                                                           */
*       /* IF IDCRDDS FAILS, PREPARE TO RETURN TO IDCRD02 WITH RC =  */
*       /* 12                                                        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0424
*       IF TESTRC^=0 THEN                                          0424
         SLR   @11,@11                                             0424
         CR    TESTRC,@11                                          0424
         BE    @RF00424                                            0424
*         DO;                                                      0425
*                                                                  0425
*           /*********************************************************/
*           /*                                                       */
*           /* CLOSE THE ALTERNATE REPORT FILE                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0426
*           IF REPARFIO^=NULLPTR THEN                              0426
         L     @06,@PC00001+8                                      0426
         C     @11,REPARFIO(,@06)                                  0426
         BE    @RF00426                                            0426
*             DO;                                                  0427
*               CALL IDCIOCL0(GDTTBL,REPARFIO);                    0428
         L     @11,@PC00001                                        0428
         ST    @11,@AL00001                                        0428
         LA    @06,REPARFIO(,@06)                                  0428
         ST    @06,@AL00001+4                                      0428
         MVI   @AL00001+4,X'80'                                    0428
         L     @15,GDTCLS(,@11)                                    0428
         LA    @01,@AL00001                                        0428
         BALR  @14,@15                                             0428
*               REPARFIO=NULLPTR;                                  0429
         L     @11,@PC00001+8                                      0429
         SLR   @06,@06                                             0429
         ST    @06,REPARFIO(,@11)                                  0429
*             END;                                                 0430
*                                                                  0430
*           /*********************************************************/
*           /*                                                       */
*           /* RETURN TO IDCRD02 WITH RC = 12                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0431
*           RETURN CODE(LASTCC12);                                 0431
@RF00426 LA    @15,12                                              0431
         L     @14,@SA00002                                        0431
         LM    @00,@12,@SA00002+8                                  0431
         BR    @14                                                 0431
*         END;                                                     0432
*                                                                  0432
*       /*************************************************************/
*       /*                                                           */
*       /* SETUP EXTENT TABLE ADDRESSABILITY                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0433
*       RESPECIFY                                                  0433
*         XTNTTBL BASED(REPIXTNT);                                 0433
*                                                                  0433
@RF00424 DS    0H                                                  0434
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE INDEX FOR EXTENT TABLE (XTNTTBL)               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0434
*       I=1;                                                       0434
*                                                                  0434
         L     @11,@PC00001+8                                      0434
         MVI   I(@11),X'01'                                        0434
*       /*************************************************************/
*       /*                                                           */
*       /* STEP THROUGH THE EXTENT TABLE, ONE ENTRY AT A TIME, TO    */
*       /* DISPLAY THE REQUESTED RANGE                               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0435
*       DO WHILE XTNTENT(I)^=LASTENT;                              0435
*                                                                  0435
         B     @DE00435                                            0435
@DL00435 DS    0H                                                  0436
*         /***********************************************************/
*         /*                                                         */
*         /* CALL IDCRDDC FOR EACH ENTRY IN THE EXTENT TABLE         */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0436
*         CALL IDCRDDC;                                            0436
*                                                                  0436
         L     @15,@CV01810                                        0436
         BALR  @14,@15                                             0436
*         /***********************************************************/
*         /*                                                         */
*         /* SAVE RETURN CODE FROM IDCRDDC                           */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0437
*         RESPECIFY                                                0437
*           RTNREG RSTD;                                           0437
*         TESTRC=RTNREG;                                           0438
         LR    TESTRC,RTNREG                                       0438
*         RESPECIFY                                                0439
*           RTNREG UNRSTD;                                         0439
*                                                                  0439
*         /***********************************************************/
*         /*                                                         */
*         /* IF IDCRDDC FAILS, PREPARE TO RETURN TO IDCRD02 WITH RC =*/
*         /* 12                                                      */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0440
*         IF TESTRC^=0 THEN                                        0440
         LTR   TESTRC,TESTRC                                       0440
         BZ    @RF00440                                            0440
*           DO;                                                    0441
*                                                                  0441
*             /*******************************************************/
*             /*                                                     */
*             /* CLOSE THE CURRENT EXTENT TABLE ENTRY                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0442
*             CALL IDCIO050(GDTTBL,CLOSE,REPIDSOP);                0442
*                                                                  0442
         L     @11,@PC00001                                        0442
         ST    @11,@AL00001                                        0442
         LA    @06,CLOSE                                           0442
         ST    @06,@AL00001+4                                      0442
         L     @06,@PC00001+8                                      0442
         LA    @06,REPIDSOP(,@06)                                  0442
         ST    @06,@AL00001+8                                      0442
         MVI   @AL00001+8,X'80'                                    0442
         L     @15,GDTEXP(,@11)                                    0442
         LA    @01,@AL00001                                        0442
         BALR  @14,@15                                             0442
*             /*******************************************************/
*             /*                                                     */
*             /* DEQ STAGING PACK                                    */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0443
*             IF ADDR(STAGR)^=NULLPTR THEN                         0443
         L     @11,@PC00001+4                                      0443
         L     @11,FDTPTR+32(,@11)                                 0443
         LTR   @11,@11                                             0443
         BZ    @RF00443                                            0443
*               CALL IDCSADQ0(GDTTBL,SPQNAME,SPRNAME);             0444
*                                                                  0444
         L     @11,@PC00001                                        0444
         ST    @11,@AL00001                                        0444
         L     @06,@PC00001+8                                      0444
         L     @06,REPQRPTR(,@06)                                  0444
         ST    @06,@AL00001+4                                      0444
         LA    @06,SPRNAME(,@06)                                   0444
         ST    @06,@AL00001+8                                      0444
         MVI   @AL00001+8,X'80'                                    0444
         L     @15,GDTDEQ(,@11)                                    0444
         LA    @01,@AL00001                                        0444
         BALR  @14,@15                                             0444
*             /*******************************************************/
*             /*                                                     */
*             /* WRITE THE RECORDS PROCESSED MESSAGE                 */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0445
*             DO;                                                  0445
@RF00443 DS    0H                                                  0446
*               CKREQ=CKREQ&&CKREQ;                                0446
         L     @11,@PC00001+8                                      0446
         XC    CKREQ(44,@11),CKREQ(@11)                            0446
*               CKRERN=MSG92;                                      0447
         MVC   CKRERN(2,@11),@CH01350                              0447
*               CKRMVAR(1)=ADDR(REPRCDCT);                         0448
         LA    @06,REPRCDCT(,@11)                                  0448
         ST    @06,CKRMVAR(,@11)                                   0448
*               CALL IDCRDER;                                      0449
         L     @15,@CV01811                                        0449
         BALR  @14,@15                                             0449
*             END;                                                 0450
*                                                                  0450
*             /*******************************************************/
*             /*                                                     */
*             /* CLOSE THE ALTERNATE REPORT FILE                     */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0451
*             IF REPARFIO^=NULLPTR THEN                            0451
         L     @11,@PC00001+8                                      0451
         L     @06,REPARFIO(,@11)                                  0451
         LTR   @06,@06                                             0451
         BZ    @RF00451                                            0451
*               DO;                                                0452
*                 CALL IDCIOCL0(GDTTBL,REPARFIO);                  0453
         L     @06,@PC00001                                        0453
         ST    @06,@AL00001                                        0453
         LA    @11,REPARFIO(,@11)                                  0453
         ST    @11,@AL00001+4                                      0453
         MVI   @AL00001+4,X'80'                                    0453
         L     @15,GDTCLS(,@06)                                    0453
         LA    @01,@AL00001                                        0453
         BALR  @14,@15                                             0453
*                 REPARFIO=NULLPTR;                                0454
         L     @11,@PC00001+8                                      0454
         SLR   @06,@06                                             0454
         ST    @06,REPARFIO(,@11)                                  0454
*               END;                                               0455
*                                                                  0455
*             /*******************************************************/
*             /*                                                     */
*             /* FREE THE BUFFERS                                    */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0456
*             CALL IDCSAFP0(GDTTBL,RD01,ALL);                      0456
*                                                                  0456
@RF00451 MVC   @AL00001+4(8),@AL00456                              0456
         L     @11,@PC00001                                        0456
         ST    @11,@AL00001                                        0456
         L     @15,GDTFPL(,@11)                                    0456
         LA    @01,@AL00001                                        0456
         BALR  @14,@15                                             0456
*             /*******************************************************/
*             /*                                                     */
*             /* RETURN TO IDCRD02 WITH RC = 12                      */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0457
*             RETURN CODE(LASTCC12);                               0457
         LA    @15,12                                              0457
         L     @14,@SA00002                                        0457
         LM    @00,@12,@SA00002+8                                  0457
         BR    @14                                                 0457
*           END;                                                   0458
*                                                                  0458
*         /***********************************************************/
*         /*                                                         */
*         /* CLOSE THE CURRENT EXTENT TABLE ENTRY                    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0459
*         CALL IDCIO050(GDTTBL,CLOSE,REPIDSOP);                    0459
*                                                                  0459
@RF00440 L     @11,@PC00001                                        0459
         ST    @11,@AL00001                                        0459
         LA    @06,CLOSE                                           0459
         ST    @06,@AL00001+4                                      0459
         L     @06,@PC00001+8                                      0459
         LA    @06,REPIDSOP(,@06)                                  0459
         ST    @06,@AL00001+8                                      0459
         MVI   @AL00001+8,X'80'                                    0459
         L     @15,GDTEXP(,@11)                                    0459
         LA    @01,@AL00001                                        0459
         BALR  @14,@15                                             0459
*         /***********************************************************/
*         /*                                                         */
*         /* INCREMENT INDEX TO NEXT EXTENT TABLE ENTRY              */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0460
*         I=I+1;                                                   0460
*                                                                  0460
         L     @11,@PC00001+8                                      0460
         LA    @06,1                                               0460
         SLR   @15,@15                                             0460
         IC    @15,I(,@11)                                         0460
         ALR   @06,@15                                             0460
         STC   @06,I(,@11)                                         0460
*         /***********************************************************/
*         /*                                                         */
*         /* IF NOT LAST ENTRY, OPEN NEXT EXTENT TABLE ENTRY         */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0461
*         IF XTNTENT(I)^=LASTENT THEN                              0461
         MH    @06,@CH01876                                        0461
         L     @15,REPIXTNT(,@11)                                  0461
         ST    @06,@TF00001                                        0461
         ALR   @06,@15                                             0461
         CLC   XTNTENT-78(78,@06),LASTENT                          0461
         BE    @RF00461                                            0461
*           DO;                                                    0462
*                                                                  0462
*             /*******************************************************/
*             /*                                                     */
*             /* SETUP EXOARG ADDRESSABILITY                         */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0463
*             RESPECIFY                                            0463
*               EXOARG BASED(REPEXOAR);                            0463
*                                                                  0463
*             /*******************************************************/
*             /*                                                     */
*             /* UPDATE THE EXOEXT FIELD ONLY                        */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0464
*             EXOEXT=ADDR(XTNTCHR1(I));                            0464
*                                                                  0464
         L     @11,REPEXOAR(,@11)                                  0464
         L     @06,@TF00001                                        0464
         LA    @06,XTNTCHR1-78(@06,@15)                            0464
         ST    @06,EXOEXT(,@11)                                    0464
*             /*******************************************************/
*             /*                                                     */
*             /* OPEN THE CURRENT EXTENT TABLE ENTRY                 */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0465
*             CALL IDCIO050(GDTTBL,OPENR,EXOARG);                  0465
*                                                                  0465
         L     @06,@PC00001                                        0465
         ST    @06,@AL00001                                        0465
         LA    @02,OPENR                                           0465
         ST    @02,@AL00001+4                                      0465
         ST    @11,@AL00001+8                                      0465
         MVI   @AL00001+8,X'80'                                    0465
         L     @15,GDTEXP(,@06)                                    0465
         LA    @01,@AL00001                                        0465
         BALR  @14,@15                                             0465
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE RETURN CODE FROM UEXCP                         */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0466
*             RESPECIFY                                            0466
*               RTNREG RSTD;                                       0466
*             TESTRC=RTNREG;                                       0467
         LR    TESTRC,RTNREG                                       0467
*             RESPECIFY                                            0468
*               RTNREG UNRSTD;                                     0468
*                                                                  0468
*             /*******************************************************/
*             /*                                                     */
*             /* IF UEXCP FAILS, PREPARE TO RETURN TO IDCRD02 WITH RC*/
*             /* = 12                                                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0469
*             IF TESTRC^=0 THEN                                    0469
         LTR   TESTRC,TESTRC                                       0469
         BZ    @RF00469                                            0469
*               DO;                                                0470
*                                                                  0470
*                 /***************************************************/
*                 /*                                                 */
*                 /* WRITE THE RECORDS PROCESSED MESSAGE             */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0471
*                 DO;                                              0471
*                   CKREQ=CKREQ&&CKREQ;                            0472
         L     @11,@PC00001+8                                      0472
         XC    CKREQ(44,@11),CKREQ(@11)                            0472
*                   CKRERN=MSG92;                                  0473
         MVC   CKRERN(2,@11),@CH01350                              0473
*                   CKRMVAR(1)=ADDR(REPRCDCT);                     0474
         LA    @06,REPRCDCT(,@11)                                  0474
         ST    @06,CKRMVAR(,@11)                                   0474
*                   CALL IDCRDER;                                  0475
         L     @15,@CV01811                                        0475
         BALR  @14,@15                                             0475
*                 END;                                             0476
*                                                                  0476
*                 /***************************************************/
*                 /*                                                 */
*                 /* CLOSE THE ALTERNATE REPORT FILE                 */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0477
*                 IF REPARFIO^=NULLPTR THEN                        0477
         L     @11,@PC00001+8                                      0477
         L     @06,REPARFIO(,@11)                                  0477
         LTR   @06,@06                                             0477
         BZ    @RF00477                                            0477
*                   DO;                                            0478
*                     CALL IDCIOCL0(GDTTBL,REPARFIO);              0479
         L     @06,@PC00001                                        0479
         ST    @06,@AL00001                                        0479
         LA    @11,REPARFIO(,@11)                                  0479
         ST    @11,@AL00001+4                                      0479
         MVI   @AL00001+4,X'80'                                    0479
         L     @15,GDTCLS(,@06)                                    0479
         LA    @01,@AL00001                                        0479
         BALR  @14,@15                                             0479
*                     REPARFIO=NULLPTR;                            0480
         L     @11,@PC00001+8                                      0480
         SLR   @06,@06                                             0480
         ST    @06,REPARFIO(,@11)                                  0480
*                   END;                                           0481
*                                                                  0481
*                 /***************************************************/
*                 /*                                                 */
*                 /* FREE THE BUFFERS                                */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0482
*                 CALL IDCSAFP0(GDTTBL,RD01,ALL);                  0482
*                                                                  0482
@RF00477 MVC   @AL00001+4(8),@AL00482                              0482
         L     @11,@PC00001                                        0482
         ST    @11,@AL00001                                        0482
         L     @15,GDTFPL(,@11)                                    0482
         LA    @01,@AL00001                                        0482
         BALR  @14,@15                                             0482
*                 /***************************************************/
*                 /*                                                 */
*                 /* RETURN TO IDCRD02 WITH RC = 12                  */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0483
*                 RETURN CODE(LASTCC12);                           0483
         LA    @15,12                                              0483
         L     @14,@SA00002                                        0483
         LM    @00,@12,@SA00002+8                                  0483
         BR    @14                                                 0483
*               END;                                               0484
*           END;                                                   0485
@RF00469 DS    0H                                                  0486
*       END;                                                       0486
*                                                                  0486
@RF00461 DS    0H                                                  0486
@DE00435 L     @11,@PC00001+8                                      0486
         SLR   @06,@06                                             0486
         IC    @06,I(,@11)                                         0486
         MH    @06,@CH01876                                        0486
         L     @15,REPIXTNT(,@11)                                  0486
         ALR   @06,@15                                             0486
         CLC   XTNTENT-78(78,@06),LASTENT                          0486
         BNE   @DL00435                                            0486
*       /*************************************************************/
*       /*                                                           */
*       /* DETERMINE IF ALL RECORDS HAVE BEEN DISPLAYED              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0487
*       RESPECIFY                                                  0487
*         RDARG BASED(REPIDSAR);                                   0487
*       IF XTNHCHR2>RDCHR&REPRC=RC30 THEN                          0488
         L     @06,REPIDSAR(,@11)                                  0488
         CLC   XTNHCHR2(5,@15),RDCHR(@06)                          0488
         BNH   @RF00488                                            0488
         LH    @06,REPRC(,@11)                                     0488
         N     @06,@CF01878                                        0488
         CH    @06,RC30                                            0488
         BNE   @RF00488                                            0488
*         DO;                                                      0489
*                                                                  0489
*           /*********************************************************/
*           /*                                                       */
*           /* IF ALL RECORDS HAVE NOT BEEN DISPLAYED, ISSUE MESSAGE */
*           /* IDC01215I ISSUE MESSAGE IDC01215I FOR STAGING PACK    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0490
*           IF ADDR(STAGR)^=NULLPTR THEN                           0490
         L     @06,@PC00001+4                                      0490
         L     @06,FDTPTR+32(,@06)                                 0490
         LTR   @06,@06                                             0490
         BZ    @RF00490                                            0490
*             DO;                                                  0491
*               CKREQ=CKREQ&&CKREQ;                                0492
         XC    CKREQ(44,@11),CKREQ(@11)                            0492
*               CKRERN=MSG15;                                      0493
         MVC   CKRERN(2,@11),@CH00227                              0493
*               CKRMVAR(1)=ADDR(STNGPK);                           0494
         LA    @06,STNGPK                                          0494
         ST    @06,CKRMVAR(,@11)                                   0494
*               CALL IDCRDER;                                      0495
         L     @15,@CV01811                                        0495
         BALR  @14,@15                                             0495
*             END;                                                 0496
*                                                                  0496
*           /*********************************************************/
*           /*                                                       */
*           /* ISSUE MESSAGE IDC01215I FOR VTOC                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0497
*           ELSE                                                   0497
*             IF XTNHDSN=FMT4DSN THEN                              0497
         B     @RC00490                                            0497
@RF00490 L     @11,@PC00001+8                                      0497
         L     @06,REPIXTNT(,@11)                                  0497
         CLC   XTNHDSN(44,@06),FMT4DSN                             0497
         BNE   @RF00497                                            0497
*               DO;                                                0498
*                 CKREQ=CKREQ&&CKREQ;                              0499
         XC    CKREQ(44,@11),CKREQ(@11)                            0499
*                 CKRERN=MSG15;                                    0500
         MVC   CKRERN(2,@11),@CH00227                              0500
*                 CKRMVAR(1)=ADDR(FMT4DSCB);                       0501
         LA    @06,FMT4DSCB                                        0501
         ST    @06,CKRMVAR(,@11)                                   0501
*                 CALL IDCRDER;                                    0502
         L     @15,@CV01811                                        0502
         BALR  @14,@15                                             0502
*               END;                                               0503
*                                                                  0503
*           /*********************************************************/
*           /*                                                       */
*           /* ISSUE MESSAGE IDC01215I FOR DATA SET                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0504
*             ELSE                                                 0504
*               DO;                                                0504
         B     @RC00497                                            0504
@RF00497 DS    0H                                                  0505
*                 CKREQ=CKREQ&&CKREQ;                              0505
         L     @11,@PC00001+8                                      0505
         XC    CKREQ(44,@11),CKREQ(@11)                            0505
*                 CKRERN=MSG15;                                    0506
         MVC   CKRERN(2,@11),@CH00227                              0506
*                 CKRMVAR(1)=ADDR(XTNHDSN);                        0507
         L     @06,REPIXTNT(,@11)                                  0507
         LA    @06,XTNHDSN(,@06)                                   0507
         ST    @06,CKRMVAR(,@11)                                   0507
*                 CALL IDCRDER;                                    0508
         L     @15,@CV01811                                        0508
         BALR  @14,@15                                             0508
*               END;                                               0509
*         END;                                                     0510
*                                                                  0510
@RC00497 DS    0H                                                  0510
@RC00490 DS    0H                                                  0511
*       /*************************************************************/
*       /*                                                           */
*       /* ALL EXTENT ENTRIES HAVE BEEN PROCESSED. PREPARE TO RETURN */
*       /* TO IDCRD02 WITH RC = 00 DEQ STAGING PACK                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0511
*       IF ADDR(STAGR)^=NULLPTR THEN                               0511
@RF00488 L     @11,@PC00001+4                                      0511
         L     @11,FDTPTR+32(,@11)                                 0511
         LTR   @11,@11                                             0511
         BZ    @RF00511                                            0511
*         CALL IDCSADQ0(GDTTBL,SPQNAME,SPRNAME);                   0512
*                                                                  0512
         L     @11,@PC00001                                        0512
         ST    @11,@AL00001                                        0512
         L     @06,@PC00001+8                                      0512
         L     @06,REPQRPTR(,@06)                                  0512
         ST    @06,@AL00001+4                                      0512
         LA    @06,SPRNAME(,@06)                                   0512
         ST    @06,@AL00001+8                                      0512
         MVI   @AL00001+8,X'80'                                    0512
         L     @15,GDTDEQ(,@11)                                    0512
         LA    @01,@AL00001                                        0512
         BALR  @14,@15                                             0512
*       /*************************************************************/
*       /*                                                           */
*       /* WRITE THE RECORDS PROCESSED MESSAGE                       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0513
*       DO;                                                        0513
@RF00511 DS    0H                                                  0514
*         CKREQ=CKREQ&&CKREQ;                                      0514
         L     @11,@PC00001+8                                      0514
         XC    CKREQ(44,@11),CKREQ(@11)                            0514
*         CKRERN=MSG92;                                            0515
         MVC   CKRERN(2,@11),@CH01350                              0515
*         CKRMVAR(1)=ADDR(REPRCDCT);                               0516
         LA    @06,REPRCDCT(,@11)                                  0516
         ST    @06,CKRMVAR(,@11)                                   0516
*         CALL IDCRDER;                                            0517
         L     @15,@CV01811                                        0517
         BALR  @14,@15                                             0517
*       END;                                                       0518
*                                                                  0518
*       /*************************************************************/
*       /*                                                           */
*       /* CLOSE THE ALTERNATE REPORT FILE                           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0519
*       IF REPARFIO^=NULLPTR THEN                                  0519
         L     @11,@PC00001+8                                      0519
         L     @06,REPARFIO(,@11)                                  0519
         LTR   @06,@06                                             0519
         BZ    @RF00519                                            0519
*         DO;                                                      0520
*           CALL IDCIOCL0(GDTTBL,REPARFIO);                        0521
         L     @06,@PC00001                                        0521
         ST    @06,@AL00001                                        0521
         LA    @11,REPARFIO(,@11)                                  0521
         ST    @11,@AL00001+4                                      0521
         MVI   @AL00001+4,X'80'                                    0521
         L     @15,GDTCLS(,@06)                                    0521
         LA    @01,@AL00001                                        0521
         BALR  @14,@15                                             0521
*           REPARFIO=NULLPTR;                                      0522
         L     @11,@PC00001+8                                      0522
         SLR   @06,@06                                             0522
         ST    @06,REPARFIO(,@11)                                  0522
*         END;                                                     0523
*                                                                  0523
*       /*************************************************************/
*       /*                                                           */
*       /* FREE THE BUFFERS                                          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0524
*       CALL IDCSAFP0(GDTTBL,RD01,ALL);                            0524
*                                                                  0524
@RF00519 MVC   @AL00001+4(8),@AL00524                              0524
         L     @11,@PC00001                                        0524
         ST    @11,@AL00001                                        0524
         L     @15,GDTFPL(,@11)                                    0524
         LA    @01,@AL00001                                        0524
         BALR  @14,@15                                             0524
*       /*************************************************************/
*       /*                                                           */
*       /* RETURN TO IDCRD02 WITH RC = 00                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0525
*       RETURN CODE(LASTCC00);                                     0525
         SLR   @15,@15                                             0525
         L     @14,@SA00002                                        0525
         LM    @00,@12,@SA00002+8                                  0525
         BR    @14                                                 0525
*     END;                                                         0526
*                                                                  0527
*   /*****************************************************************/
*   /*                                                               */
*   /* DISPLAYING A REPAIR WORKFILE SET TRACE POINT                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0527
*   OLDERID2=NEWERID2;                                             0527
@RF00418 L     @11,@PC00001                                        0527
         L     @11,GDTTR2(,@11)                                    0527
         MVC   @TS00001(95),NEWERID2(@11)                          0527
         MVC   OLDERID2(95,@11),@TS00001                           0527
*   NEWID2='RD23';                                                 0528
*                                                                  0528
         MVC   NEWID2(4,@11),@CC01872                              0528
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE IF REPAIR WORKFILE IS SPECIFIED                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0529
*   IF ADDR(FULLR)^=NULLPTR×ADDR(DRRNG)^=NULLPTR THEN              0529
         SLR   @11,@11                                             0529
         L     @06,@PC00001+4                                      0529
         C     @11,FDTPTR+20(,@06)                                 0529
         BNE   @RT00529                                            0529
         C     @11,FDTPTR+28(,@06)                                 0529
         BE    @RF00529                                            0529
@RT00529 DS    0H                                                  0530
*     DO;                                                          0530
*                                                                  0530
*       /*************************************************************/
*       /*                                                           */
*       /* CALL IDCRDRF TO OPEN THE REPAIR WORKFILE                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0531
*       CALL IDCRDRF(INPUT);                                       0531
*                                                                  0531
         L     @15,@CV01814                                        0531
         LA    @01,@AL00531                                        0531
         BALR  @14,@15                                             0531
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM IDCRDRF                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0532
*       RESPECIFY                                                  0532
*         RTNREG RSTD;                                             0532
*       TESTRC=RTNREG;                                             0533
         LR    TESTRC,RTNREG                                       0533
*       RESPECIFY                                                  0534
*         RTNREG UNRSTD;                                           0534
*                                                                  0534
*       /*************************************************************/
*       /*                                                           */
*       /* IF IDCRDRF FAILS, PREPARE TO RETURN TO IDCRD02 WITH RC =  */
*       /* 12                                                        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0535
*       IF TESTRC^=0 THEN                                          0535
         SLR   @11,@11                                             0535
         CR    TESTRC,@11                                          0535
         BE    @RF00535                                            0535
*         DO;                                                      0536
*                                                                  0536
*           /*********************************************************/
*           /*                                                       */
*           /* CLOSE THE ALTERNATE REPORT FILE                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0537
*           IF REPARFIO^=NULLPTR THEN                              0537
         L     @06,@PC00001+8                                      0537
         C     @11,REPARFIO(,@06)                                  0537
         BE    @RF00537                                            0537
*             DO;                                                  0538
*               CALL IDCIOCL0(GDTTBL,REPARFIO);                    0539
         L     @11,@PC00001                                        0539
         ST    @11,@AL00001                                        0539
         LA    @06,REPARFIO(,@06)                                  0539
         ST    @06,@AL00001+4                                      0539
         MVI   @AL00001+4,X'80'                                    0539
         L     @15,GDTCLS(,@11)                                    0539
         LA    @01,@AL00001                                        0539
         BALR  @14,@15                                             0539
*               REPARFIO=NULLPTR;                                  0540
         L     @11,@PC00001+8                                      0540
         SLR   @06,@06                                             0540
         ST    @06,REPARFIO(,@11)                                  0540
*             END;                                                 0541
*                                                                  0541
*           /*********************************************************/
*           /*                                                       */
*           /* FREE THE BUFFERS                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0542
*           CALL IDCSAFP0(GDTTBL,RD01,ALL);                        0542
*                                                                  0542
@RF00537 MVC   @AL00001+4(8),@AL00542                              0542
         L     @11,@PC00001                                        0542
         ST    @11,@AL00001                                        0542
         L     @15,GDTFPL(,@11)                                    0542
         LA    @01,@AL00001                                        0542
         BALR  @14,@15                                             0542
*           /*********************************************************/
*           /*                                                       */
*           /* RETURN TO IDCRD02 WITH RC = 12                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0543
*           RETURN CODE(LASTCC12);                                 0543
         LA    @15,12                                              0543
         L     @14,@SA00002                                        0543
         LM    @00,@12,@SA00002+8                                  0543
         BR    @14                                                 0543
*         END;                                                     0544
*                                                                  0544
*       /*************************************************************/
*       /*                                                           */
*       /* GET REPAIR WORKFILE DATA SET NAME                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0545
*       IOCSPTR=REPIRWIO;                                          0545
@RF00535 L     @11,@PC00001+8                                      0545
         L     IOCSPTR,REPIRWIO(,@11)                              0545
*       RWFDSN=IOCRWDSN;                                           0546
         L     @11,REPRWINA(,@11)                                  0546
         L     @06,IOCDSN(,IOCSPTR)                                0546
         MVC   RWFDSN(44,@11),IOCRWDSN(@06)                        0546
*                                                                  0547
*       /*************************************************************/
*       /*                                                           */
*       /* DISPLAY REPAIR WORKFILE WITH FULLREPAIR OPTION DETERMINE  */
*       /* IF FULLREPAIR OPTION IS SPECIFIED                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0547
*       IF ADDR(FULLR)^=NULLPTR THEN                               0547
         L     @11,@PC00001+4                                      0547
         L     @11,FDTPTR+20(,@11)                                 0547
         LTR   @11,@11                                             0547
         BZ    @RF00547                                            0547
*         DO;                                                      0548
*                                                                  0548
*           /*********************************************************/
*           /*                                                       */
*           /* DISPLAY EACH RECORD UNTIL END-OF-FILE IS REACHED      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0549
*           DO UNTIL REPRC=16;                                     0549
*                                                                  0549
@DL00549 DS    0H                                                  0550
*             /*******************************************************/
*             /*                                                     */
*             /* ISSUE GETRCD FOR EACH RECORD IN THE REPAIR WORKFILE */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0550
*             DO;                                                  0550
*               WFREQ=''B;                                         0551
         L     @11,@PC00001+8                                      0551
         XC    WFREQ(2,@11),WFREQ(@11)                             0551
*               WFRGET=ON;          /* GETRCD                        */
         OI    WFRGET(@11),B'00100000'                             0552
*               WFRIN=ON;           /* INPUT DS                      */
         OI    WFRIN(@11),B'10000000'                              0553
*               CALL IDCRDIO;                                      0554
         L     @15,@CV01812                                        0554
         BALR  @14,@15                                             0554
*               RFY                                                0555
*                 RTNREG RSTD;                                     0555
*               TESTRC=RTNREG;                                     0556
         LR    TESTRC,RTNREG                                       0556
*               RFY                                                0557
*                 RTNREG UNRSTD;                                   0557
*             END;                                                 0558
*                                                                  0558
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE RETURN CODE FROM GETRCD                        */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0559
*             RESPECIFY                                            0559
*               RTNREG RSTD;                                       0559
*             TESTRC=RTNREG;                                       0560
         LR    TESTRC,RTNREG                                       0560
*             RESPECIFY                                            0561
*               RTNREG UNRSTD;                                     0561
*                                                                  0561
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE RETURN CODE IN REPCB FOR FUTURE REFERENCE      */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0562
*             REPRC=TESTRC;                                        0562
*                                                                  0562
         L     @11,@PC00001+8                                      0562
         STH   TESTRC,REPRC(,@11)                                  0562
*             /*******************************************************/
*             /*                                                     */
*             /* IF GETRCD SUCCEEDS, PROCESS RECORD                  */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0563
*             IF TESTRC=0 THEN                                     0563
         SLR   @06,@06                                             0563
         CR    TESTRC,@06                                          0563
         BNE   @RF00563                                            0563
*               DO;                                                0564
*                                                                  0564
*                 /***************************************************/
*                 /*                                                 */
*                 /* SETUP REPAIR WORKFILE HEADER ADDRESSABILITY     */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0565
*                 RESPECIFY                                        0565
*                   RWFHDR BASED(REPRWHDI);                        0565
*                                                                  0565
*                 /***************************************************/
*                 /*                                                 */
*                 /* SETUP REPAIR WORKFILE RECORD ADDRESSABILITY     */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0566
*                 RESPECIFY                                        0566
*                   RWFR BASED(WFIODAD);                           0566
*                                                                  0566
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF NOT A DEBLOCKED R'1 RECORD, AND IF A GOOD    */
*                 /* RECORD AND THE 'ALL' KEYWORD IS SPECIFIED OR IF */
*                 /* AN ERROR RECORD, DISPLAY THE RECORD             */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0567
*                 IF((RWFRF1^=DEBLOCK)&((RWFRF2=RC01&ADDR(ALLA)^=  0567
*                     NULLPTR)×(RWFRF2^=RC01))) THEN               0567
         L     @11,WFIODAD(,@11)                                   0567
         CLI   RWFRF1(@11),240                                     0567
         BE    @RF00567                                            0567
         LH    @11,RWFRF2(,@11)                                    0567
         N     @11,@CF01878                                        0567
         CH    @11,RC01                                            0567
         BNE   @GL00006                                            0567
         L     @11,@PC00001+4                                      0567
         C     @06,FDTPTR+8(,@11)                                  0567
         BNE   @RT00567                                            0567
@GL00006 L     @11,@PC00001+8                                      0567
         L     @11,WFIODAD(,@11)                                   0567
         LH    @11,RWFRF2(,@11)                                    0567
         N     @11,@CF01878                                        0567
         CH    @11,RC01                                            0567
         BE    @RF00567                                            0567
@RT00567 DS    0H                                                  0568
*                   DO;                                            0568
*                                                                  0568
*                     /***********************************************/
*                     /*                                             */
*                     /* CONSTRUCT SRPRTARG                          */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0569
*                     SRPRTARG=''B;                                0569
         L     @11,@PC00001+8                                      0569
         L     @06,REPSPRIT(,@11)                                  0569
         XC    SRPRTARG(44,@06),SRPRTARG(@06)                      0569
*                     SRVRECL=WFIODLN-LENGTH(RKEY)-COUNTLEN;       0570
*                                                                  0570
         L     @15,WFIODLN(,@11)                                   0570
         SL    @15,@CF00309                                        0570
         ST    @15,SRVRECL(,@06)                                   0570
*                     /***********************************************/
*                     /*                                             */
*                     /* IF THE VSAM RECORD LENGTH IS 0      @ZA25908*/
*                     /* WE MUST HAVE GOTTEN A RECORD        @ZA25908*/
*                     /* RESEMBLING AN END OF FILE           @ZA25908*/
*                     /* RECORD. IN ORDER TO PUT OUT         @ZA25908*/
*                     /* A CORRECT FORMAT 4 RECORD WE        @ZA25908*/
*                     /* CHANGE THE RECORD LENGTH TO 9,      @ZA25908*/
*                     /* PASS AN ERROR CODE OF 29, AND       @ZA25908*/
*                     /* IF THE RECORD WAS GOOD, SET         @ZA25908*/
*                     /* THE FLAG TO 29.                     @ZA25908*/
*                     /*                                             */
*                     /***********************************************/
*                                                                  0571
*                     IF SRVRECL=NULLPTR THEN/*              @ZA25908*/
         LTR   @15,@15                                             0571
         BNZ   @RF00571                                            0571
*                       DO;         /*                       @ZA25908*/
*                         SRVRECL=EOFMSGLN;/*                @ZA25908*/
         MVC   SRVRECL(4,@06),@CF00035                             0573
*                         SRERCODE=ADDR(RC29);/*             @ZA25908*/
         LA    @15,RC29                                            0574
         ST    @15,SRERCODE(,@06)                                  0574
*                         IF RWFRF2=RC01 THEN/*              @ZA25908*/
         L     @11,WFIODAD(,@11)                                   0575
         LH    @06,RWFRF2(,@11)                                    0575
         N     @06,@CF01878                                        0575
         CH    @06,RC01                                            0575
         BNE   @RF00575                                            0575
*                           RWFRF2=RC29;/*                   @ZA25908*/
         LH    @06,RC29                                            0576
         STH   @06,RWFRF2(,@11)                                    0576
*                       END;        /*                       @ZA25908*/
@RF00575 DS    0H                                                  0578
*                     SRVREPTR=WFIODAD;                            0578
@RF00571 L     @11,@PC00001+8                                      0578
         L     @06,REPSPRIT(,@11)                                  0578
         L     @02,WFIODAD(,@11)                                   0578
         ST    @02,SRVREPTR(,@06)                                  0578
*                     SRDSNHDR=ADDR(RWFHDSNU);                     0579
         L     @02,REPRWHDI(,@11)                                  0579
         LA    @02,RWFHDSNU(,@02)                                  0579
         ST    @02,SRDSNHDR(,@06)                                  0579
*                     SRVOLPTR=WFIOKYA;                            0580
         L     @02,WFIOKYA(,@11)                                   0580
         ST    @02,SRVOLPTR(,@06)                                  0580
*                     SRRWFDSN=ADDR(RWFDSN);                       0581
         L     @11,REPRWINA(,@11)                                  0581
         LA    @11,RWFDSN(,@11)                                    0581
         ST    @11,SRRWFDSN(,@06)                                  0581
*                     SRRWFKEY=WFIOKYA;                            0582
*                                                                  0582
         ST    @02,SRRWFKEY(,@06)                                  0582
*                     /***********************************************/
*                     /*                                             */
*                     /* CALL IDCRDPT TO DISPLAY THE RECORD          */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0583
*                     CALL IDCRDPT;                                0583
*                                                                  0583
         L     @15,@CV01813                                        0583
         BALR  @14,@15                                             0583
*                     /***********************************************/
*                     /*                                             */
*                     /* SAVE RETURN CODE FROM IDCRDPT               */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0584
*                     RESPECIFY                                    0584
*                       RTNREG RSTD;                               0584
*                     TESTRC=RTNREG;                               0585
         LR    TESTRC,RTNREG                                       0585
*                     RESPECIFY                                    0586
*                       RTNREG UNRSTD;                             0586
*                                                                  0586
*                     /***********************************************/
*                     /*                                             */
*                     /* IF IDCRDPT FAILS, PREPARE TO RETURN TO      */
*                     /* IDCRD02 WITH RC = 12                        */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0587
*                     IF TESTRC^=0 THEN                            0587
         LTR   TESTRC,TESTRC                                       0587
         BZ    @RF00587                                            0587
*                       DO;                                        0588
*                                                                  0588
*                         /*******************************************/
*                         /*                                         */
*                         /* CLOSE THE REPAIR WORKFILE               */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0589
*                         CALL IDCIOCL0(GDTTBL,REPIRWIO);          0589
*                                                                  0589
         L     @11,@PC00001                                        0589
         ST    @11,@AL00001                                        0589
         L     @06,@PC00001+8                                      0589
         LA    @06,REPIRWIO(,@06)                                  0589
         ST    @06,@AL00001+4                                      0589
         MVI   @AL00001+4,X'80'                                    0589
         L     @15,GDTCLS(,@11)                                    0589
         LA    @01,@AL00001                                        0589
         BALR  @14,@15                                             0589
*                         /*******************************************/
*                         /*                                         */
*                         /* WRITE THE RECORDS PROCESSED MESSAGE     */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0590
*                         DO;                                      0590
*                           CKREQ=CKREQ&&CKREQ;                    0591
         L     @11,@PC00001+8                                      0591
         XC    CKREQ(44,@11),CKREQ(@11)                            0591
*                           CKRERN=MSG92;                          0592
         MVC   CKRERN(2,@11),@CH01350                              0592
*                           CKRMVAR(1)=ADDR(REPRCDCT);             0593
         LA    @06,REPRCDCT(,@11)                                  0593
         ST    @06,CKRMVAR(,@11)                                   0593
*                           CALL IDCRDER;                          0594
         L     @15,@CV01811                                        0594
         BALR  @14,@15                                             0594
*                         END;                                     0595
*                                                                  0595
*                         /*******************************************/
*                         /*                                         */
*                         /* CLOSE THE ALTERNATE REPORT FILE         */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0596
*                         IF REPARFIO^=NULLPTR THEN                0596
         L     @11,@PC00001+8                                      0596
         L     @06,REPARFIO(,@11)                                  0596
         LTR   @06,@06                                             0596
         BZ    @RF00596                                            0596
*                           DO;                                    0597
*                             CALL IDCIOCL0(GDTTBL,REPARFIO);      0598
         L     @06,@PC00001                                        0598
         ST    @06,@AL00001                                        0598
         LA    @11,REPARFIO(,@11)                                  0598
         ST    @11,@AL00001+4                                      0598
         MVI   @AL00001+4,X'80'                                    0598
         L     @15,GDTCLS(,@06)                                    0598
         LA    @01,@AL00001                                        0598
         BALR  @14,@15                                             0598
*                             REPARFIO=NULLPTR;                    0599
         L     @11,@PC00001+8                                      0599
         SLR   @06,@06                                             0599
         ST    @06,REPARFIO(,@11)                                  0599
*                           END;                                   0600
*                                                                  0600
*                         /*******************************************/
*                         /*                                         */
*                         /* FREE THE BUFFERS                        */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0601
*                         CALL IDCSAFP0(GDTTBL,RD01,ALL);          0601
*                                                                  0601
@RF00596 MVC   @AL00001+4(8),@AL00601                              0601
         L     @11,@PC00001                                        0601
         ST    @11,@AL00001                                        0601
         L     @15,GDTFPL(,@11)                                    0601
         LA    @01,@AL00001                                        0601
         BALR  @14,@15                                             0601
*                         /*******************************************/
*                         /*                                         */
*                         /* RETURN TO IDCRD02 WITH RC = 12          */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0602
*                         RETURN CODE(LASTCC12);                   0602
         LA    @15,12                                              0602
         L     @14,@SA00002                                        0602
         LM    @00,@12,@SA00002+8                                  0602
         BR    @14                                                 0602
*                       END;                                       0603
*                                                                  0603
*                     /***********************************************/
*                     /*                                             */
*                     /* IF IDCRDPT IS SUCCESSFUL, INCREMENT THE     */
*                     /* RECORDS PROCESSED COUNTER                   */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0604
*                     ELSE                                         0604
*                       REPRCDCT=REPRCDCT+1;                       0604
@RF00587 L     @11,@PC00001+8                                      0604
         LA    @06,1                                               0604
         AL    @06,REPRCDCT(,@11)                                  0604
         ST    @06,REPRCDCT(,@11)                                  0604
*                   END;                                           0605
*               END;                                               0606
*                                                                  0606
*             /*******************************************************/
*             /*                                                     */
*             /* IF GETRCD IS NOT SUCCESSFUL (RC ^= 0), DETERMINE IF */
*             /* AT END-OF-FILE (RC = 16)                            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0607
*             ELSE                                                 0607
*               IF TESTRC^=16 THEN                                 0607
         B     @RC00563                                            0607
@RF00563 C     TESTRC,@CF00472                                     0607
         BE    @RF00607                                            0607
*                 DO;                                              0608
*                                                                  0608
*                   /*************************************************/
*                   /*                                               */
*                   /* NOT AT END-OF-FILE, RC = 04, PREPARE TO RETURN*/
*                   /* TO IDCRD02 WITH RC = 12 CLOSE THE REPAIR      */
*                   /* WORKFILE                                      */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0609
*                   CALL IDCIOCL0(GDTTBL,REPIRWIO);                0609
*                                                                  0609
         L     @11,@PC00001                                        0609
         ST    @11,@AL00001                                        0609
         L     @06,@PC00001+8                                      0609
         LA    @06,REPIRWIO(,@06)                                  0609
         ST    @06,@AL00001+4                                      0609
         MVI   @AL00001+4,X'80'                                    0609
         L     @15,GDTCLS(,@11)                                    0609
         LA    @01,@AL00001                                        0609
         BALR  @14,@15                                             0609
*                   /*************************************************/
*                   /*                                               */
*                   /* WRITE THE RECORDS PROCESSED MESSAGE           */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0610
*                   DO;                                            0610
*                     CKREQ=CKREQ&&CKREQ;                          0611
         L     @11,@PC00001+8                                      0611
         XC    CKREQ(44,@11),CKREQ(@11)                            0611
*                     CKRERN=MSG92;                                0612
         MVC   CKRERN(2,@11),@CH01350                              0612
*                     CKRMVAR(1)=ADDR(REPRCDCT);                   0613
         LA    @06,REPRCDCT(,@11)                                  0613
         ST    @06,CKRMVAR(,@11)                                   0613
*                     CALL IDCRDER;                                0614
         L     @15,@CV01811                                        0614
         BALR  @14,@15                                             0614
*                   END;                                           0615
*                                                                  0615
*                   /*************************************************/
*                   /*                                               */
*                   /* CLOSE THE ALTERNATE REPORT FILE               */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0616
*                   IF REPARFIO^=NULLPTR THEN                      0616
         L     @11,@PC00001+8                                      0616
         L     @06,REPARFIO(,@11)                                  0616
         LTR   @06,@06                                             0616
         BZ    @RF00616                                            0616
*                     DO;                                          0617
*                       CALL IDCIOCL0(GDTTBL,REPARFIO);            0618
         L     @06,@PC00001                                        0618
         ST    @06,@AL00001                                        0618
         LA    @11,REPARFIO(,@11)                                  0618
         ST    @11,@AL00001+4                                      0618
         MVI   @AL00001+4,X'80'                                    0618
         L     @15,GDTCLS(,@06)                                    0618
         LA    @01,@AL00001                                        0618
         BALR  @14,@15                                             0618
*                       REPARFIO=NULLPTR;                          0619
         L     @11,@PC00001+8                                      0619
         SLR   @06,@06                                             0619
         ST    @06,REPARFIO(,@11)                                  0619
*                     END;                                         0620
*                                                                  0620
*                   /*************************************************/
*                   /*                                               */
*                   /* FREE THE BUFFERS                              */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0621
*                   CALL IDCSAFP0(GDTTBL,RD01,ALL);                0621
*                                                                  0621
@RF00616 MVC   @AL00001+4(8),@AL00621                              0621
         L     @11,@PC00001                                        0621
         ST    @11,@AL00001                                        0621
         L     @15,GDTFPL(,@11)                                    0621
         LA    @01,@AL00001                                        0621
         BALR  @14,@15                                             0621
*                   /*************************************************/
*                   /*                                               */
*                   /* RETURN TO IDCRD02 WITH RC = 12                */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0622
*                   RETURN CODE(LASTCC12);                         0622
         LA    @15,12                                              0622
         L     @14,@SA00002                                        0622
         LM    @00,@12,@SA00002+8                                  0622
         BR    @14                                                 0622
*                 END;                                             0623
*           END;                                                   0624
*                                                                  0624
@RF00607 DS    0H                                                  0624
@RC00563 DS    0H                                                  0624
@DE00549 L     @11,@PC00001+8                                      0624
         CLC   REPRC(2,@11),@CH00472                               0624
         BNE   @DL00549                                            0624
*           /*********************************************************/
*           /*                                                       */
*           /* AT END-OF-FILE FOR REPAIR WORKFILE, RC = 16, PREPARE  */
*           /* TO RETURN TO IDCRD02 WITH RC = 00 CLOSE THE REPAIR    */
*           /* WORKFILE                                              */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0625
*           CALL IDCIOCL0(GDTTBL,REPIRWIO);                        0625
*                                                                  0625
         L     @06,@PC00001                                        0625
         ST    @06,@AL00001                                        0625
         LA    @11,REPIRWIO(,@11)                                  0625
         ST    @11,@AL00001+4                                      0625
         MVI   @AL00001+4,X'80'                                    0625
         L     @15,GDTCLS(,@06)                                    0625
         LA    @01,@AL00001                                        0625
         BALR  @14,@15                                             0625
*           /*********************************************************/
*           /*                                                       */
*           /* WRITE THE RECORDS PROCESSED MESSAGE                   */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0626
*           DO;                                                    0626
*             CKREQ=CKREQ&&CKREQ;                                  0627
         L     @11,@PC00001+8                                      0627
         XC    CKREQ(44,@11),CKREQ(@11)                            0627
*             CKRERN=MSG92;                                        0628
         MVC   CKRERN(2,@11),@CH01350                              0628
*             CKRMVAR(1)=ADDR(REPRCDCT);                           0629
         LA    @06,REPRCDCT(,@11)                                  0629
         ST    @06,CKRMVAR(,@11)                                   0629
*             CALL IDCRDER;                                        0630
         L     @15,@CV01811                                        0630
         BALR  @14,@15                                             0630
*           END;                                                   0631
*                                                                  0631
*           /*********************************************************/
*           /*                                                       */
*           /* CLOSE THE ALTERNATE REPORT FILE                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0632
*           IF REPARFIO^=NULLPTR THEN                              0632
         L     @11,@PC00001+8                                      0632
         L     @06,REPARFIO(,@11)                                  0632
         LTR   @06,@06                                             0632
         BZ    @RF00632                                            0632
*             DO;                                                  0633
*               CALL IDCIOCL0(GDTTBL,REPARFIO);                    0634
         L     @06,@PC00001                                        0634
         ST    @06,@AL00001                                        0634
         LA    @11,REPARFIO(,@11)                                  0634
         ST    @11,@AL00001+4                                      0634
         MVI   @AL00001+4,X'80'                                    0634
         L     @15,GDTCLS(,@06)                                    0634
         LA    @01,@AL00001                                        0634
         BALR  @14,@15                                             0634
*               REPARFIO=NULLPTR;                                  0635
         L     @11,@PC00001+8                                      0635
         SLR   @06,@06                                             0635
         ST    @06,REPARFIO(,@11)                                  0635
*             END;                                                 0636
*                                                                  0636
*           /*********************************************************/
*           /*                                                       */
*           /* FREE THE BUFFERS                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0637
*           CALL IDCSAFP0(GDTTBL,RD01,ALL);                        0637
*                                                                  0637
@RF00632 MVC   @AL00001+4(8),@AL00637                              0637
         L     @11,@PC00001                                        0637
         ST    @11,@AL00001                                        0637
         L     @15,GDTFPL(,@11)                                    0637
         LA    @01,@AL00001                                        0637
         BALR  @14,@15                                             0637
*           /*********************************************************/
*           /*                                                       */
*           /* RETURN TO IDCRD02 WITH RC = 00                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0638
*           RETURN CODE(LASTCC00);                                 0638
         SLR   @15,@15                                             0638
         L     @14,@SA00002                                        0638
         LM    @00,@12,@SA00002+8                                  0638
         BR    @14                                                 0638
*         END;                                                     0639
*                                                                  0640
*       /*************************************************************/
*       /*                                                           */
*       /* DISPLAY REPAIR WORKFILE WITH REPAIRRANGE OPTION           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0640
*       ELSE                                                       0640
*         DO;                                                      0640
*                                                                  0640
@RF00547 DS    0H                                                  0641
*           /*********************************************************/
*           /*                                                       */
*           /* DETERMINE IF 'TO CCHHR' IS ZERO                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0641
*           IF ADDR(RRCHH)=NULLPTR THEN                            0641
         L     @11,@PC00001+4                                      0641
         L     @06,FDTPTR+100(,@11)                                0641
         LTR   @06,@06                                             0641
         BNZ   @RF00641                                            0641
*             DO;                                                  0642
*                                                                  0642
*               /*****************************************************/
*               /*                                                   */
*               /* CONSTRUCT BEGINNING KEY AND ENDING KEY            */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0643
*               RWFKVOL1=VOLRRVAL;                                 0643
         L     @06,@PC00001+8                                      0643
         L     @06,REPRWINA(,@06)                                  0643
         L     @01,FDTPTR+92(,@11)                                 0643
         MVC   RWFKVOL1(6,@06),VOLRRVAL(@01)                       0643
*               RWFKCHR1=RRCHRVAL;                                 0644
         L     @11,FDTPTR+96(,@11)                                 0644
         MVC   RWFKCHR1(5,@06),RRCHRVAL(@11)                       0644
*               RWFKEY2=RWFKEY1;                                   0645
         MVC   RWFKEY2(11,@06),RWFKEY1(@06)                        0645
*             END;                                                 0646
*                                                                  0646
*           /*********************************************************/
*           /*                                                       */
*           /* 'TO CCHHR' NOT ZERO                                   */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0647
*           ELSE                                                   0647
*             DO;                                                  0647
*                                                                  0647
         B     @RC00641                                            0647
@RF00641 DS    0H                                                  0648
*               /*****************************************************/
*               /*                                                   */
*               /* IF 'TO CCHHR' GT 'FROM CCHHR', PREPARE TO RETURN  */
*               /* TO IDCRD02 WITH RC = 12                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0648
*               IF RRCHRVAL>RRCHHVAL THEN                          0648
         L     @11,@PC00001+4                                      0648
         L     @06,FDTPTR+96(,@11)                                 0648
         L     @11,FDTPTR+100(,@11)                                0648
         CLC   RRCHRVAL(5,@06),RRCHHVAL(@11)                       0648
         BNH   @RF00648                                            0648
*                 DO;                                              0649
*                                                                  0649
*                   /*************************************************/
*                   /*                                               */
*                   /* WRITE ERROR MESSAGE IDC31201I                 */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0650
*                   DO;                                            0650
*                     CKREQ=CKREQ&&CKREQ;                          0651
         L     @15,@PC00001+8                                      0651
         XC    CKREQ(44,@15),CKREQ(@15)                            0651
*                     CKRERN=MSG01;                                0652
         MVC   CKRERN(2,@15),@CH00218                              0652
*                     CKRMVAR(1)=ADDR(RRCHRVAL);                   0653
         LA    @06,RRCHRVAL(,@06)                                  0653
         ST    @06,CKRMVAR(,@15)                                   0653
*                     CKRMVAR(2)=ADDR(RRCHHVAL);                   0654
         LA    @11,RRCHHVAL(,@11)                                  0654
         ST    @11,CKRMVAR+4(,@15)                                 0654
*                     CKRMVAR(3)=ADDR(RWFDSN);                     0655
         L     @11,REPRWINA(,@15)                                  0655
         LA    @11,RWFDSN(,@11)                                    0655
         ST    @11,CKRMVAR+8(,@15)                                 0655
*                     CALL IDCRDER;                                0656
         L     @15,@CV01811                                        0656
         BALR  @14,@15                                             0656
*                   END;                                           0657
*                                                                  0657
*                   /*************************************************/
*                   /*                                               */
*                   /* CLOSE THE REPAIR WORKFILE                     */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0658
*                   CALL IDCIOCL0(GDTTBL,REPIRWIO);                0658
*                                                                  0658
         L     @11,@PC00001                                        0658
         ST    @11,@AL00001                                        0658
         L     @06,@PC00001+8                                      0658
         LA    @06,REPIRWIO(,@06)                                  0658
         ST    @06,@AL00001+4                                      0658
         MVI   @AL00001+4,X'80'                                    0658
         L     @15,GDTCLS(,@11)                                    0658
         LA    @01,@AL00001                                        0658
         BALR  @14,@15                                             0658
*                   /*************************************************/
*                   /*                                               */
*                   /* CLOSE THE ALTERNATE REPORT FILE               */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0659
*                   IF REPARFIO^=NULLPTR THEN                      0659
         L     @11,@PC00001+8                                      0659
         L     @06,REPARFIO(,@11)                                  0659
         LTR   @06,@06                                             0659
         BZ    @RF00659                                            0659
*                     DO;                                          0660
*                       CALL IDCIOCL0(GDTTBL,REPARFIO);            0661
         L     @06,@PC00001                                        0661
         ST    @06,@AL00001                                        0661
         LA    @11,REPARFIO(,@11)                                  0661
         ST    @11,@AL00001+4                                      0661
         MVI   @AL00001+4,X'80'                                    0661
         L     @15,GDTCLS(,@06)                                    0661
         LA    @01,@AL00001                                        0661
         BALR  @14,@15                                             0661
*                       REPARFIO=NULLPTR;                          0662
         L     @11,@PC00001+8                                      0662
         SLR   @06,@06                                             0662
         ST    @06,REPARFIO(,@11)                                  0662
*                     END;                                         0663
*                                                                  0663
*                   /*************************************************/
*                   /*                                               */
*                   /* FREE THE BUFFERS                              */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0664
*                   CALL IDCSAFP0(GDTTBL,RD01,ALL);                0664
*                                                                  0664
@RF00659 MVC   @AL00001+4(8),@AL00664                              0664
         L     @11,@PC00001                                        0664
         ST    @11,@AL00001                                        0664
         L     @15,GDTFPL(,@11)                                    0664
         LA    @01,@AL00001                                        0664
         BALR  @14,@15                                             0664
*                   /*************************************************/
*                   /*                                               */
*                   /* RETURN TO IDCRD02 WITH RC = 12                */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0665
*                   RETURN CODE(LASTCC12);                         0665
         LA    @15,12                                              0665
         L     @14,@SA00002                                        0665
         LM    @00,@12,@SA00002+8                                  0665
         BR    @14                                                 0665
*                 END;                                             0666
*                                                                  0666
*               /*****************************************************/
*               /*                                                   */
*               /* CONSTRUCT BEGINNING KEY                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0667
*               RWFKVOL1=VOLRRVAL;                                 0667
@RF00648 L     @11,@PC00001+8                                      0667
         L     @11,REPRWINA(,@11)                                  0667
         L     @06,@PC00001+4                                      0667
         L     @15,FDTPTR+92(,@06)                                 0667
         MVC   RWFKVOL1(6,@11),VOLRRVAL(@15)                       0667
*               RWFKCHR1=RRCHRVAL;                                 0668
*                                                                  0668
         L     @01,FDTPTR+96(,@06)                                 0668
         MVC   RWFKCHR1(5,@11),RRCHRVAL(@01)                       0668
*               /*****************************************************/
*               /*                                                   */
*               /* CONSTRUCT ENDING KEY                              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0669
*               RWFKVOL2=VOLRRVAL;                                 0669
         MVC   RWFKVOL2(6,@11),VOLRRVAL(@15)                       0669
*               RWFKCHR2=RRCHHVAL;                                 0670
         L     @06,FDTPTR+100(,@06)                                0670
         MVC   RWFKCHR2(5,@11),RRCHHVAL(@06)                       0670
*             END;                                                 0671
*                                                                  0671
*           /*********************************************************/
*           /*                                                       */
*           /* GET ADDRESS OF FIRST KEY IN REPAIRRANGE               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0672
*           WFIOKYA=ADDR(RWFKEY1);                                 0672
*                                                                  0672
@RC00641 L     @11,@PC00001+8                                      0672
         L     @06,REPRWINA(,@11)                                  0672
         LA    @06,RWFKEY1(,@06)                                   0672
         ST    @06,WFIOKYA(,@11)                                   0672
*           /*********************************************************/
*           /*                                                       */
*           /* POSITION TO FIRST KEY IN REPAIRRANGE                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0673
*           DO;                                                    0673
*             WFREQ=''B;                                           0674
         XC    WFREQ(2,@11),WFREQ(@11)                             0674
*             WFRPOS=ON;            /* POSRCD                        */
         OI    WFRPOS(@11),B'00001000'                             0675
*             WFRIN=ON;             /* INPUT DS                      */
         OI    WFRIN(@11),B'10000000'                              0676
*             CALL IDCRDIO;                                        0677
         L     @15,@CV01812                                        0677
         BALR  @14,@15                                             0677
*             RFY                                                  0678
*               RTNREG RSTD;                                       0678
*             TESTRC=RTNREG;                                       0679
         LR    TESTRC,RTNREG                                       0679
*             RFY                                                  0680
*               RTNREG UNRSTD;                                     0680
*           END;                                                   0681
*                                                                  0681
*           /*********************************************************/
*           /*                                                       */
*           /* SAVE RETURN CODE FROM UPOSIT                          */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0682
*           RESPECIFY                                              0682
*             RTNREG RSTD;                                         0682
*           TESTRC=RTNREG;                                         0683
         LR    TESTRC,RTNREG                                       0683
*           RESPECIFY                                              0684
*             RTNREG UNRSTD;                                       0684
*                                                                  0684
*           /*********************************************************/
*           /*                                                       */
*           /* IF UPOSIT FAILS, (RECORD NOT FOUND), PREPARE TO RETURN*/
*           /* TO IDCRD02 WITH RC = 12                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0685
*           IF TESTRC=8 THEN                                       0685
         C     TESTRC,@CF00178                                     0685
         BNE   @RF00685                                            0685
*             DO;                                                  0686
*                                                                  0686
*               /*****************************************************/
*               /*                                                   */
*               /* WRITE ERROR MESSAGE IDC31202I                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0687
*               DO;                                                0687
*                 CKREQ=CKREQ&&CKREQ;                              0688
         L     @11,@PC00001+8                                      0688
         XC    CKREQ(44,@11),CKREQ(@11)                            0688
*                 CKRERN=MSG02;                                    0689
         MVC   CKRERN(2,@11),@CH00152                              0689
*                 CKRMVAR(1)=ADDR(RWFKVOL1);                       0690
         L     @06,REPRWINA(,@11)                                  0690
         LA    @15,RWFKVOL1(,@06)                                  0690
         ST    @15,CKRMVAR(,@11)                                   0690
*                 CKRMVAR(2)=ADDR(RWFKCHR1);                       0691
         LA    @15,RWFKCHR1(,@06)                                  0691
         ST    @15,CKRMVAR+4(,@11)                                 0691
*                 CKRMVAR(3)=ADDR(RWFDSN);                         0692
         LA    @06,RWFDSN(,@06)                                    0692
         ST    @06,CKRMVAR+8(,@11)                                 0692
*                 CALL IDCRDER;                                    0693
         L     @15,@CV01811                                        0693
         BALR  @14,@15                                             0693
*               END;                                               0694
*                                                                  0694
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE REPAIR WORKFILE                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0695
*               CALL IDCIOCL0(GDTTBL,REPIRWIO);                    0695
*                                                                  0695
         L     @11,@PC00001                                        0695
         ST    @11,@AL00001                                        0695
         L     @06,@PC00001+8                                      0695
         LA    @06,REPIRWIO(,@06)                                  0695
         ST    @06,@AL00001+4                                      0695
         MVI   @AL00001+4,X'80'                                    0695
         L     @15,GDTCLS(,@11)                                    0695
         LA    @01,@AL00001                                        0695
         BALR  @14,@15                                             0695
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE ALTERNATE REPORT FILE                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0696
*               IF REPARFIO^=NULLPTR THEN                          0696
         L     @11,@PC00001+8                                      0696
         L     @06,REPARFIO(,@11)                                  0696
         LTR   @06,@06                                             0696
         BZ    @RF00696                                            0696
*                 DO;                                              0697
*                   CALL IDCIOCL0(GDTTBL,REPARFIO);                0698
         L     @06,@PC00001                                        0698
         ST    @06,@AL00001                                        0698
         LA    @11,REPARFIO(,@11)                                  0698
         ST    @11,@AL00001+4                                      0698
         MVI   @AL00001+4,X'80'                                    0698
         L     @15,GDTCLS(,@06)                                    0698
         LA    @01,@AL00001                                        0698
         BALR  @14,@15                                             0698
*                   REPARFIO=NULLPTR;                              0699
         L     @11,@PC00001+8                                      0699
         SLR   @06,@06                                             0699
         ST    @06,REPARFIO(,@11)                                  0699
*                 END;                                             0700
*                                                                  0700
*               /*****************************************************/
*               /*                                                   */
*               /* FREE THE BUFFERS                                  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0701
*               CALL IDCSAFP0(GDTTBL,RD01,ALL);                    0701
*                                                                  0701
@RF00696 MVC   @AL00001+4(8),@AL00701                              0701
         L     @11,@PC00001                                        0701
         ST    @11,@AL00001                                        0701
         L     @15,GDTFPL(,@11)                                    0701
         LA    @01,@AL00001                                        0701
         BALR  @14,@15                                             0701
*               /*****************************************************/
*               /*                                                   */
*               /* RETURN TO IDCRD02 WITH RC = 12                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0702
*               RETURN CODE(LASTCC12);                             0702
         LA    @15,12                                              0702
         L     @14,@SA00002                                        0702
         LM    @00,@12,@SA00002+8                                  0702
         BR    @14                                                 0702
*             END;                                                 0703
*                                                                  0703
*           /*********************************************************/
*           /*                                                       */
*           /* IF UPOSIT FAILS, (I/O ERROR OR EOF), PREPARE TO RETURN*/
*           /* TO IDCRD02 WITH RC = 12                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0704
*           IF TESTRC^=0 THEN                                      0704
@RF00685 LTR   TESTRC,TESTRC                                       0704
         BZ    @RF00704                                            0704
*             DO;                                                  0705
*                                                                  0705
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE REPAIR WORKFILE                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0706
*               CALL IDCIOCL0(GDTTBL,REPIRWIO);                    0706
*                                                                  0706
         L     @11,@PC00001                                        0706
         ST    @11,@AL00001                                        0706
         L     @06,@PC00001+8                                      0706
         LA    @06,REPIRWIO(,@06)                                  0706
         ST    @06,@AL00001+4                                      0706
         MVI   @AL00001+4,X'80'                                    0706
         L     @15,GDTCLS(,@11)                                    0706
         LA    @01,@AL00001                                        0706
         BALR  @14,@15                                             0706
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE ALTERNATE REPORT FILE                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0707
*               IF REPARFIO^=NULLPTR THEN                          0707
         L     @11,@PC00001+8                                      0707
         L     @06,REPARFIO(,@11)                                  0707
         LTR   @06,@06                                             0707
         BZ    @RF00707                                            0707
*                 DO;                                              0708
*                   CALL IDCIOCL0(GDTTBL,REPARFIO);                0709
         L     @06,@PC00001                                        0709
         ST    @06,@AL00001                                        0709
         LA    @11,REPARFIO(,@11)                                  0709
         ST    @11,@AL00001+4                                      0709
         MVI   @AL00001+4,X'80'                                    0709
         L     @15,GDTCLS(,@06)                                    0709
         LA    @01,@AL00001                                        0709
         BALR  @14,@15                                             0709
*                   REPARFIO=NULLPTR;                              0710
         L     @11,@PC00001+8                                      0710
         SLR   @06,@06                                             0710
         ST    @06,REPARFIO(,@11)                                  0710
*                 END;                                             0711
*                                                                  0711
*               /*****************************************************/
*               /*                                                   */
*               /* FREE THE BUFFERS                                  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0712
*               CALL IDCSAFP0(GDTTBL,RD01,ALL);                    0712
*                                                                  0712
@RF00707 MVC   @AL00001+4(8),@AL00712                              0712
         L     @11,@PC00001                                        0712
         ST    @11,@AL00001                                        0712
         L     @15,GDTFPL(,@11)                                    0712
         LA    @01,@AL00001                                        0712
         BALR  @14,@15                                             0712
*               /*****************************************************/
*               /*                                                   */
*               /* RETURN TO IDCRD02 WITH RC = 12                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0713
*               RETURN CODE(LASTCC12);                             0713
         LA    @15,12                                              0713
         L     @14,@SA00002                                        0713
         LM    @00,@12,@SA00002+8                                  0713
         BR    @14                                                 0713
*             END;                                                 0714
*                                                                  0714
*           /*********************************************************/
*           /*                                                       */
*           /* ISSUE GETRCD FOR FIRST RECORD IN REPAIRRANGE          */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0715
*           DO;                                                    0715
@RF00704 DS    0H                                                  0716
*             WFREQ=''B;                                           0716
         L     @11,@PC00001+8                                      0716
         XC    WFREQ(2,@11),WFREQ(@11)                             0716
*             WFRGET=ON;            /* GETRCD                        */
         OI    WFRGET(@11),B'00100000'                             0717
*             WFRIN=ON;             /* INPUT DS                      */
         OI    WFRIN(@11),B'10000000'                              0718
*             CALL IDCRDIO;                                        0719
         L     @15,@CV01812                                        0719
         BALR  @14,@15                                             0719
*             RFY                                                  0720
*               RTNREG RSTD;                                       0720
*             TESTRC=RTNREG;                                       0721
         LR    TESTRC,RTNREG                                       0721
*             RFY                                                  0722
*               RTNREG UNRSTD;                                     0722
*           END;                                                   0723
*                                                                  0723
*           /*********************************************************/
*           /*                                                       */
*           /* SAVE RETURN CODE FROM GETRCD                          */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0724
*           RESPECIFY                                              0724
*             RTNREG RSTD;                                         0724
*           TESTRC=RTNREG;                                         0725
         LR    TESTRC,RTNREG                                       0725
*           RESPECIFY                                              0726
*             RTNREG UNRSTD;                                       0726
*                                                                  0726
*           /*********************************************************/
*           /*                                                       */
*           /* IF GETRCD FAILS, PREPARE TO RETURN TO IDCRD02 WITH RC */
*           /* = 12                                                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0727
*           IF TESTRC^=0 THEN                                      0727
         LTR   TESTRC,TESTRC                                       0727
         BZ    @RF00727                                            0727
*             DO;                                                  0728
*                                                                  0728
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE REPAIR WORKFILE                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0729
*               CALL IDCIOCL0(GDTTBL,REPIRWIO);                    0729
*                                                                  0729
         L     @11,@PC00001                                        0729
         ST    @11,@AL00001                                        0729
         L     @06,@PC00001+8                                      0729
         LA    @06,REPIRWIO(,@06)                                  0729
         ST    @06,@AL00001+4                                      0729
         MVI   @AL00001+4,X'80'                                    0729
         L     @15,GDTCLS(,@11)                                    0729
         LA    @01,@AL00001                                        0729
         BALR  @14,@15                                             0729
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE ALTERNATE REPORT FILE                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0730
*               IF REPARFIO^=NULLPTR THEN                          0730
         L     @11,@PC00001+8                                      0730
         L     @06,REPARFIO(,@11)                                  0730
         LTR   @06,@06                                             0730
         BZ    @RF00730                                            0730
*                 DO;                                              0731
*                   CALL IDCIOCL0(GDTTBL,REPARFIO);                0732
         L     @06,@PC00001                                        0732
         ST    @06,@AL00001                                        0732
         LA    @11,REPARFIO(,@11)                                  0732
         ST    @11,@AL00001+4                                      0732
         MVI   @AL00001+4,X'80'                                    0732
         L     @15,GDTCLS(,@06)                                    0732
         LA    @01,@AL00001                                        0732
         BALR  @14,@15                                             0732
*                   REPARFIO=NULLPTR;                              0733
         L     @11,@PC00001+8                                      0733
         SLR   @06,@06                                             0733
         ST    @06,REPARFIO(,@11)                                  0733
*                 END;                                             0734
*                                                                  0734
*               /*****************************************************/
*               /*                                                   */
*               /* FREE THE BUFFERS                                  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0735
*               CALL IDCSAFP0(GDTTBL,RD01,ALL);                    0735
*                                                                  0735
@RF00730 MVC   @AL00001+4(8),@AL00735                              0735
         L     @11,@PC00001                                        0735
         ST    @11,@AL00001                                        0735
         L     @15,GDTFPL(,@11)                                    0735
         LA    @01,@AL00001                                        0735
         BALR  @14,@15                                             0735
*               /*****************************************************/
*               /*                                                   */
*               /* RETURN TO IDCRD02 WITH RC = 12                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0736
*               RETURN CODE(LASTCC12);                             0736
         LA    @15,12                                              0736
         L     @14,@SA00002                                        0736
         LM    @00,@12,@SA00002+8                                  0736
         BR    @14                                                 0736
*             END;                                                 0737
*                                                                  0737
*           /*********************************************************/
*           /*                                                       */
*           /* SETUP REPAIR WORKFILE RECORD ADDRESSABILITY           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0738
*           RESPECIFY                                              0738
*             RWFR BASED(WFIOKYA);                                 0738
*                                                                  0738
@RF00727 DS    0H                                                  0739
*           /*********************************************************/
*           /*                                                       */
*           /* DISPLAY EACH RECORD UNTIL END-OF-RANGE IS REACHED     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0739
*           DO UNTIL(RWFRKEY>RWFKEY2)×(TESTRC^=0);                 0739
*                                                                  0739
@DL00739 DS    0H                                                  0740
*             /*******************************************************/
*             /*                                                     */
*             /* IF NOT A DEBLOCKED R'1 RECORD, AND IF A GOOD RECORD */
*             /* AND THE 'ALL' KEYWORD IS SPECIFIED OR IF AN ERROR   */
*             /* RECORD , DISPLAY THE RECORD                         */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0740
*             IF((RWFRF1^=DEBLOCK)&((RWFRF2=RC01&ADDR(ALLA)^=NULLPTR)×(
*                 RWFRF2^=RC01))) THEN                             0740
         L     @11,@PC00001+8                                      0740
         L     @11,WFIOKYA(,@11)                                   0740
         CLI   RWFRF1(@11),240                                     0740
         BE    @RF00740                                            0740
         LH    @11,RWFRF2(,@11)                                    0740
         N     @11,@CF01878                                        0740
         CH    @11,RC01                                            0740
         BNE   @GL00009                                            0740
         L     @11,@PC00001+4                                      0740
         L     @11,FDTPTR+8(,@11)                                  0740
         LTR   @11,@11                                             0740
         BNZ   @RT00740                                            0740
@GL00009 L     @11,@PC00001+8                                      0740
         L     @11,WFIOKYA(,@11)                                   0740
         LH    @11,RWFRF2(,@11)                                    0740
         N     @11,@CF01878                                        0740
         CH    @11,RC01                                            0740
         BE    @RF00740                                            0740
@RT00740 DS    0H                                                  0741
*               DO;                                                0741
*                                                                  0741
*                 /***************************************************/
*                 /*                                                 */
*                 /* CONSTRUCT SRPRTARG                              */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0742
*                 SRPRTARG=''B;                                    0742
         L     @11,@PC00001+8                                      0742
         L     @06,REPSPRIT(,@11)                                  0742
         XC    SRPRTARG(44,@06),SRPRTARG(@06)                      0742
*                 SRVRECL=WFIODLN-LENGTH(RKEY)-COUNTLEN;           0743
*                                                                  0743
         L     @15,WFIODLN(,@11)                                   0743
         SL    @15,@CF00309                                        0743
         ST    @15,SRVRECL(,@06)                                   0743
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF THE VSAM RECORD LENGTH IS 0          @ZA25908*/
*                 /* WE MUST HAVE GOTTEN A RECORD            @ZA25908*/
*                 /* RESEMBLING AN END OF FILE               @ZA25908*/
*                 /* RECORD. IN ORDER TO PUT OUT             @ZA25908*/
*                 /* A CORRECT FORMAT 4 RECORD WE            @ZA25908*/
*                 /* CHANGE THE RECORD LENGTH TO 9,          @ZA25908*/
*                 /* PASS AN ERROR CODE OF 29, AND           @ZA25908*/
*                 /* IF THE RECORD WAS GOOD, SET             @ZA25908*/
*                 /* THE FLAG TO 29.                         @ZA25908*/
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0744
*                 IF SRVRECL=NULLPTR THEN/*                  @ZA25908*/
         LTR   @15,@15                                             0744
         BNZ   @RF00744                                            0744
*                   DO;             /*                       @ZA25908*/
*                     SRVRECL=EOFMSGLN;/*                    @ZA25908*/
         MVC   SRVRECL(4,@06),@CF00035                             0746
*                     SRERCODE=ADDR(RC29);/*                 @ZA25908*/
         LA    @15,RC29                                            0747
         ST    @15,SRERCODE(,@06)                                  0747
*                     IF RWFRF2=RC01 THEN/*                  @ZA25908*/
         L     @11,WFIOKYA(,@11)                                   0748
         LH    @06,RWFRF2(,@11)                                    0748
         N     @06,@CF01878                                        0748
         CH    @06,RC01                                            0748
         BNE   @RF00748                                            0748
*                       RWFRF2=RC29;/*                       @ZA25908*/
         LH    @06,RC29                                            0749
         STH   @06,RWFRF2(,@11)                                    0749
*                   END;            /*                       @ZA25908*/
@RF00748 DS    0H                                                  0751
*                 SRVREPTR=WFIODAD;                                0751
@RF00744 L     @11,@PC00001+8                                      0751
         L     @06,REPSPRIT(,@11)                                  0751
         L     @02,WFIODAD(,@11)                                   0751
         ST    @02,SRVREPTR(,@06)                                  0751
*                 SRDSNHDR=ADDR(RWFHDSNU);                         0752
         L     @02,REPRWHDI(,@11)                                  0752
         LA    @02,RWFHDSNU(,@02)                                  0752
         ST    @02,SRDSNHDR(,@06)                                  0752
*                 SRVOLPTR=WFIOKYA;                                0753
         L     @02,WFIOKYA(,@11)                                   0753
         ST    @02,SRVOLPTR(,@06)                                  0753
*                 SRRWFDSN=ADDR(RWFDSN);                           0754
         L     @11,REPRWINA(,@11)                                  0754
         LA    @11,RWFDSN(,@11)                                    0754
         ST    @11,SRRWFDSN(,@06)                                  0754
*                 SRRWFKEY=WFIOKYA;                                0755
*                                                                  0755
         ST    @02,SRRWFKEY(,@06)                                  0755
*                 /***************************************************/
*                 /*                                                 */
*                 /* CALL IDCRDPT TO DISPLAY THE RECORD              */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0756
*                 CALL IDCRDPT;                                    0756
*                                                                  0756
         L     @15,@CV01813                                        0756
         BALR  @14,@15                                             0756
*                 /***************************************************/
*                 /*                                                 */
*                 /* SAVE RETURN CODE FORM IDCRDPT                   */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0757
*                 RESPECIFY                                        0757
*                   RTNREG RSTD;                                   0757
*                 TESTRC=RTNREG;                                   0758
         LR    TESTRC,RTNREG                                       0758
*                 RESPECIFY                                        0759
*                   RTNREG UNRSTD;                                 0759
*                                                                  0759
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF IDCRDPT FAILS, PREPARE TO RETURN TO IDCRD02  */
*                 /* WITH RC = 12                                    */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0760
*                 IF TESTRC^=0 THEN                                0760
         LTR   TESTRC,TESTRC                                       0760
         BZ    @RF00760                                            0760
*                   DO;                                            0761
*                                                                  0761
*                     /***********************************************/
*                     /*                                             */
*                     /* CLOSE THE REPAIR WORKFILE                   */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0762
*                     CALL IDCIOCL0(GDTTBL,REPIRWIO);              0762
*                                                                  0762
         L     @11,@PC00001                                        0762
         ST    @11,@AL00001                                        0762
         L     @06,@PC00001+8                                      0762
         LA    @06,REPIRWIO(,@06)                                  0762
         ST    @06,@AL00001+4                                      0762
         MVI   @AL00001+4,X'80'                                    0762
         L     @15,GDTCLS(,@11)                                    0762
         LA    @01,@AL00001                                        0762
         BALR  @14,@15                                             0762
*                     /***********************************************/
*                     /*                                             */
*                     /* WRITE THE RECORDS PROCESSED MESSAGE         */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0763
*                     DO;                                          0763
*                       CKREQ=CKREQ&&CKREQ;                        0764
         L     @11,@PC00001+8                                      0764
         XC    CKREQ(44,@11),CKREQ(@11)                            0764
*                       CKRERN=MSG92;                              0765
         MVC   CKRERN(2,@11),@CH01350                              0765
*                       CKRMVAR(1)=ADDR(REPRCDCT);                 0766
         LA    @06,REPRCDCT(,@11)                                  0766
         ST    @06,CKRMVAR(,@11)                                   0766
*                       CALL IDCRDER;                              0767
         L     @15,@CV01811                                        0767
         BALR  @14,@15                                             0767
*                     END;                                         0768
*                                                                  0768
*                     /***********************************************/
*                     /*                                             */
*                     /* CLOSE THE ALTERNATE REPORT FILE             */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0769
*                     IF REPARFIO^=NULLPTR THEN                    0769
         L     @11,@PC00001+8                                      0769
         L     @06,REPARFIO(,@11)                                  0769
         LTR   @06,@06                                             0769
         BZ    @RF00769                                            0769
*                       DO;                                        0770
*                         CALL IDCIOCL0(GDTTBL,REPARFIO);          0771
         L     @06,@PC00001                                        0771
         ST    @06,@AL00001                                        0771
         LA    @11,REPARFIO(,@11)                                  0771
         ST    @11,@AL00001+4                                      0771
         MVI   @AL00001+4,X'80'                                    0771
         L     @15,GDTCLS(,@06)                                    0771
         LA    @01,@AL00001                                        0771
         BALR  @14,@15                                             0771
*                         REPARFIO=NULLPTR;                        0772
         L     @11,@PC00001+8                                      0772
         SLR   @06,@06                                             0772
         ST    @06,REPARFIO(,@11)                                  0772
*                       END;                                       0773
*                                                                  0773
*                     /***********************************************/
*                     /*                                             */
*                     /* FREE THE BUFFERS                            */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0774
*                     CALL IDCSAFP0(GDTTBL,RD01,ALL);              0774
*                                                                  0774
@RF00769 MVC   @AL00001+4(8),@AL00774                              0774
         L     @11,@PC00001                                        0774
         ST    @11,@AL00001                                        0774
         L     @15,GDTFPL(,@11)                                    0774
         LA    @01,@AL00001                                        0774
         BALR  @14,@15                                             0774
*                     /***********************************************/
*                     /*                                             */
*                     /* RETURN TO IDCRD02 WITH RC = 12              */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0775
*                     RETURN CODE(LASTCC12);                       0775
         LA    @15,12                                              0775
         L     @14,@SA00002                                        0775
         LM    @00,@12,@SA00002+8                                  0775
         BR    @14                                                 0775
*                   END;                                           0776
*                                                                  0776
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF IDCRDPT IS SUCCESSFUL, INCREMENT THE RECORDS */
*                 /* PROCESSED COUNTER                               */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0777
*                 ELSE                                             0777
*                   REPRCDCT=REPRCDCT+1;                           0777
@RF00760 L     @11,@PC00001+8                                      0777
         LA    @06,1                                               0777
         AL    @06,REPRCDCT(,@11)                                  0777
         ST    @06,REPRCDCT(,@11)                                  0777
*               END;                                               0778
*                                                                  0778
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE KEY OF RECORD JUST PROCESSED                   */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0779
*             LASTKEY=RWFRKEY;                                     0779
*                                                                  0779
@RF00740 L     @11,@PC00001+8                                      0779
         L     @06,WFIOKYA(,@11)                                   0779
         MVC   LASTKEY(11),RWFRKEY(@06)                            0779
*             /*******************************************************/
*             /*                                                     */
*             /* ISSUE GETRCD TO READ NEXT RECORD IN REPAIRRANGE     */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0780
*             DO;                                                  0780
*               WFREQ=''B;                                         0781
         XC    WFREQ(2,@11),WFREQ(@11)                             0781
*               WFRGET=ON;          /* GETRCD                        */
         OI    WFRGET(@11),B'00100000'                             0782
*               WFRIN=ON;           /* INPUT DS                      */
         OI    WFRIN(@11),B'10000000'                              0783
*               CALL IDCRDIO;                                      0784
         L     @15,@CV01812                                        0784
         BALR  @14,@15                                             0784
*               RFY                                                0785
*                 RTNREG RSTD;                                     0785
*               TESTRC=RTNREG;                                     0786
         LR    TESTRC,RTNREG                                       0786
*               RFY                                                0787
*                 RTNREG UNRSTD;                                   0787
*             END;                                                 0788
*                                                                  0788
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE RETURN CODE FROM GETRCD                        */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0789
*             RESPECIFY                                            0789
*               RTNREG RSTD;                                       0789
*             TESTRC=RTNREG;                                       0790
         LR    TESTRC,RTNREG                                       0790
*             RESPECIFY                                            0791
*               RTNREG UNRSTD;                                     0791
*           END;                                                   0792
*                                                                  0792
@DE00739 L     @11,@PC00001+8                                      0792
         L     @06,WFIOKYA(,@11)                                   0792
         L     @02,REPRWINA(,@11)                                  0792
         CLC   RWFRKEY(11,@06),RWFKEY2(@02)                        0792
         BH    @DC00739                                            0792
         LTR   TESTRC,TESTRC                                       0792
         BZ    @DL00739                                            0792
@DC00739 DS    0H                                                  0793
*           /*********************************************************/
*           /*                                                       */
*           /* KEY OF LAST RECORD READ IS GREATER THAN THE ENDING KEY*/
*           /* OR GETRCD RETURNED A NON-ZERO RETURN CODE             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0793
*           IF LASTKEY<RWFKEY2&TESTRC=4 THEN                       0793
         CLC   LASTKEY(11),RWFKEY2(@02)                            0793
         BNL   @RF00793                                            0793
         C     TESTRC,@CF00041                                     0793
         BNE   @RF00793                                            0793
*             DO;                                                  0794
*                                                                  0794
*               /*****************************************************/
*               /*                                                   */
*               /* GETRCD FAILED WITH I/O ERROR. PREPARE TO RETURN TO*/
*               /* IDCRD02 WITH RC = 12 CLOSE THE REPAIR WORKFILE    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0795
*               CALL IDCIOCL0(GDTTBL,REPIRWIO);                    0795
*                                                                  0795
         L     @06,@PC00001                                        0795
         ST    @06,@AL00001                                        0795
         LA    @11,REPIRWIO(,@11)                                  0795
         ST    @11,@AL00001+4                                      0795
         MVI   @AL00001+4,X'80'                                    0795
         L     @15,GDTCLS(,@06)                                    0795
         LA    @01,@AL00001                                        0795
         BALR  @14,@15                                             0795
*               /*****************************************************/
*               /*                                                   */
*               /* WRITE THE RECORDS PROCESSED MESSAGE               */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0796
*               DO;                                                0796
*                 CKREQ=CKREQ&&CKREQ;                              0797
         L     @11,@PC00001+8                                      0797
         XC    CKREQ(44,@11),CKREQ(@11)                            0797
*                 CKRERN=MSG92;                                    0798
         MVC   CKRERN(2,@11),@CH01350                              0798
*                 CKRMVAR(1)=ADDR(REPRCDCT);                       0799
         LA    @06,REPRCDCT(,@11)                                  0799
         ST    @06,CKRMVAR(,@11)                                   0799
*                 CALL IDCRDER;                                    0800
         L     @15,@CV01811                                        0800
         BALR  @14,@15                                             0800
*               END;                                               0801
*                                                                  0801
*               /*****************************************************/
*               /*                                                   */
*               /* CLOSE THE ALTERNATE REPORT FILE                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0802
*               IF REPARFIO^=NULLPTR THEN                          0802
         L     @11,@PC00001+8                                      0802
         L     @06,REPARFIO(,@11)                                  0802
         LTR   @06,@06                                             0802
         BZ    @RF00802                                            0802
*                 DO;                                              0803
*                   CALL IDCIOCL0(GDTTBL,REPARFIO);                0804
         L     @06,@PC00001                                        0804
         ST    @06,@AL00001                                        0804
         LA    @11,REPARFIO(,@11)                                  0804
         ST    @11,@AL00001+4                                      0804
         MVI   @AL00001+4,X'80'                                    0804
         L     @15,GDTCLS(,@06)                                    0804
         LA    @01,@AL00001                                        0804
         BALR  @14,@15                                             0804
*                   REPARFIO=NULLPTR;                              0805
         L     @11,@PC00001+8                                      0805
         SLR   @06,@06                                             0805
         ST    @06,REPARFIO(,@11)                                  0805
*                 END;                                             0806
*                                                                  0806
*               /*****************************************************/
*               /*                                                   */
*               /* FREE THE BUFFERS                                  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0807
*               CALL IDCSAFP0(GDTTBL,RD01,ALL);                    0807
*                                                                  0807
@RF00802 MVC   @AL00001+4(8),@AL00807                              0807
         L     @11,@PC00001                                        0807
         ST    @11,@AL00001                                        0807
         L     @15,GDTFPL(,@11)                                    0807
         LA    @01,@AL00001                                        0807
         BALR  @14,@15                                             0807
*               /*****************************************************/
*               /*                                                   */
*               /* RETURN TO IDCRD02 WITH RC = 12                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0808
*               RETURN CODE(LASTCC12);                             0808
         LA    @15,12                                              0808
         L     @14,@SA00002                                        0808
         LM    @00,@12,@SA00002+8                                  0808
         BR    @14                                                 0808
*             END;                                                 0809
*           IF LASTKEY<RWFKEY2 THEN                                0810
*                                                                  0810
@RF00793 L     @11,@PC00001+8                                      0810
         L     @06,REPRWINA(,@11)                                  0810
         CLC   LASTKEY(11),RWFKEY2(@06)                            0810
         BNL   @RF00810                                            0810
*             /*******************************************************/
*             /*                                                     */
*             /* WRITE WARNING MESSAGE IDC01215I                     */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0811
*             DO;                                                  0811
*               CKREQ=CKREQ&&CKREQ;                                0812
         XC    CKREQ(44,@11),CKREQ(@11)                            0812
*               CKRERN=MSG15;                                      0813
         MVC   CKRERN(2,@11),@CH00227                              0813
*               CKRMVAR(1)=ADDR(RWFDSN);                           0814
         LA    @06,RWFDSN(,@06)                                    0814
         ST    @06,CKRMVAR(,@11)                                   0814
*               CALL IDCRDER;                                      0815
         L     @15,@CV01811                                        0815
         BALR  @14,@15                                             0815
*             END;                                                 0816
*                                                                  0816
*           /*********************************************************/
*           /*                                                       */
*           /* CLOSE THE REPAIR WORKFILE                             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0817
*           CALL IDCIOCL0(GDTTBL,REPIRWIO);                        0817
*                                                                  0817
@RF00810 L     @11,@PC00001                                        0817
         ST    @11,@AL00001                                        0817
         L     @06,@PC00001+8                                      0817
         LA    @06,REPIRWIO(,@06)                                  0817
         ST    @06,@AL00001+4                                      0817
         MVI   @AL00001+4,X'80'                                    0817
         L     @15,GDTCLS(,@11)                                    0817
         LA    @01,@AL00001                                        0817
         BALR  @14,@15                                             0817
*           /*********************************************************/
*           /*                                                       */
*           /* WRITE THE RECORDS PROCESSED MESSAGE                   */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0818
*           DO;                                                    0818
*             CKREQ=CKREQ&&CKREQ;                                  0819
         L     @11,@PC00001+8                                      0819
         XC    CKREQ(44,@11),CKREQ(@11)                            0819
*             CKRERN=MSG92;                                        0820
         MVC   CKRERN(2,@11),@CH01350                              0820
*             CKRMVAR(1)=ADDR(REPRCDCT);                           0821
         LA    @06,REPRCDCT(,@11)                                  0821
         ST    @06,CKRMVAR(,@11)                                   0821
*             CALL IDCRDER;                                        0822
         L     @15,@CV01811                                        0822
         BALR  @14,@15                                             0822
*           END;                                                   0823
*                                                                  0823
*           /*********************************************************/
*           /*                                                       */
*           /* CLOSE THE ALTERNATE REPORT FILE                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0824
*           IF REPARFIO^=NULLPTR THEN                              0824
         L     @11,@PC00001+8                                      0824
         L     @06,REPARFIO(,@11)                                  0824
         LTR   @06,@06                                             0824
         BZ    @RF00824                                            0824
*             DO;                                                  0825
*               CALL IDCIOCL0(GDTTBL,REPARFIO);                    0826
         L     @06,@PC00001                                        0826
         ST    @06,@AL00001                                        0826
         LA    @11,REPARFIO(,@11)                                  0826
         ST    @11,@AL00001+4                                      0826
         MVI   @AL00001+4,X'80'                                    0826
         L     @15,GDTCLS(,@06)                                    0826
         LA    @01,@AL00001                                        0826
         BALR  @14,@15                                             0826
*               REPARFIO=NULLPTR;                                  0827
         L     @11,@PC00001+8                                      0827
         SLR   @06,@06                                             0827
         ST    @06,REPARFIO(,@11)                                  0827
*             END;                                                 0828
*                                                                  0828
*           /*********************************************************/
*           /*                                                       */
*           /* FREE THE BUFFERS                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0829
*           CALL IDCSAFP0(GDTTBL,RD01,ALL);                        0829
*                                                                  0829
@RF00824 MVC   @AL00001+4(8),@AL00829                              0829
         L     @11,@PC00001                                        0829
         ST    @11,@AL00001                                        0829
         L     @15,GDTFPL(,@11)                                    0829
         LA    @01,@AL00001                                        0829
         BALR  @14,@15                                             0829
*           /*********************************************************/
*           /*                                                       */
*           /* RETURN TO IDCRD02 WITH RC = 00                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0830
*           RETURN CODE(LASTCC00);                                 0830
         SLR   @15,@15                                             0830
         L     @14,@SA00002                                        0830
         LM    @00,@12,@SA00002+8                                  0830
         BR    @14                                                 0830
*         END;                                                     0831
*     END;                                                         0832
*   END IDCRD020;                                                  0833
@EL00002 DS    0H                                                  0833
@EF00002 DS    0H                                                  0833
@ER00002 LM    @14,@12,@SA00002                                    0833
         BR    @14                                                 0833
*   END IDCRD02                                                    0834
*                                                                  0834
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (AMSDF01 )                                       */
*/*%INCLUDE SYSLIB  (AMSDF00 )                                       */
*/*@INCLUDE SYSLIB  (AMSDF02 )                                       */
*/*%INCLUDE SYSLIB  (IDCDF04 )                                       */
*/*%INCLUDE SYSLIB  (IDCCSRD )                                       */
*/*%INCLUDE SYSLIB  (IDCDF65 )                                       */
*/*%INCLUDE SYSLIB  (IDCDF66 )                                       */
*                                                                  0834
*       ;                                                          0834
@DATA    DS    0H
@CH00114 DC    H'0'
@CH00218 DC    H'1'
@CH00152 DC    H'2'
@CH00227 DC    H'15'
@CH01876 DC    H'78'
@CH01350 DC    H'92'
         DS    0F
@AL00380 DC    A(@CH00114+1)           LIST WITH   2 ARGUMENT(S)
         DC    A(NULLPARM)
@AL00411 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00456 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00482 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00524 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00542 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00601 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00621 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00637 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00664 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00701 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00712 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00735 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00774 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00807 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00829 DC    A(RD01)                 LIST WITH   2 ARGUMENT(S)
         DC    AL1(X'80')
         DC    AL3(ALL)
@AL00420 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00531 DC    A(INPUT)                LIST WITH   1 ARGUMENT(S)
         DC    A(NULLPARM)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    3F
@SA00002 DS    15F
@AL00001 DS    3A
@TF00001 DS    F
IDCRD02  CSECT
         DS    0F
@CF00041 DC    F'4'
@CF00178 DC    F'8'
@CF00035 DC    F'9'
@CF00472 DC    F'16'
@CH00472 EQU   @CF00472+2
@CF00309 DC    F'24'
@CF01878 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
LISTSCAN DS    A
DDSTRU   DS    A
FSADDR   DS    A
ERCNVADR DS    A
DMPINDEX DS    A
CCMSGPTR DS    A
CMMSGPTR DS    A
CTMSGPTR DS    A
ELEMENT  DS    F
LISTPTR  DS    A
LASTCC   DS    H
SETRC    DS    H
LISTLN   DS    FL1
@TS00001 DS    CL95
LASTKEY  DS    CL11
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IDCRD02  CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV01809 DC    V(IDCRDDS)
@CV01810 DC    V(IDCRDDC)
@CV01811 DC    V(IDCRDER)
@CV01812 DC    V(IDCRDIO)
@CV01813 DC    V(IDCRDPT)
@CV01814 DC    V(IDCRDRF)
         DS    0D
RC01     DC    H'1'
RC29     DC    H'29'
RC30     DC    H'30'
@CC01861 DC    C'RD20'
@CC01862 DC    C'RD21'
@CC01868 DC    C'RD22'
@CC01872 DC    C'RD23'
ALL      DC    CL3'ALL'
FORMAT   DC    CL4'FORM'
HSECOND  DC    CL4'HSEC'
CLOCK    DC    CL4'KLOK'
SETZERO  DC    CL4'ZERO'
SETBLANK DC    CL4'BLNK'
NOSET    DC    CL4'NSET'
OVERRIDE DC    CL4'OVRD'
ACQUIRE  DC    CL8'ACQUIRE '
RELINQ   DC    CL8'RELINQ  '
MOUNT    DC    CL8'MOUNT   '
DEMOUNT  DC    CL8'DEMOUNT '
DEFINE   DC    CL8'DEFINE  '
MOVE     DC    CL8'MOVE    '
TRACEQ   DC    CL8'TRACEQ  '
COPYTABL DC    CL8'COPYTABL'
COPYCRTG DC    CL8'COPYCRTG'
COPYVOL  DC    CL8'COPYVOL '
VVIC     DC    CL8'VVIC    '
TUNE     DC    CL8'TUNE    '
NAMES    DC    CL4'NAME'
UNIT     DC    CL4'UNIT'
SHR      DC    CL4'SHR '
EXCL     DC    CL4'EXCL'
NOWAIT   DC    CL4'NWAI'
WAIT     DC    CL4'WAIT'
SECCHECK DC    CL8'SECCHECK'
SCRVTOC  DC    CL8'SCRVTOC '
GETVTOC  DC    CL8'GETVTOC '
PUTVTOC  DC    CL8'PUTVTOC '
RECATLG  DC    CL8'RECATLG '
INITVOL  DC    CL8'INITVOL '
CHECK    DC    CL8'CHECK   '
POSTUCB  DC    CL8'POSTUCB '
GET      DC    CL8'GET     '
PUT      DC    CL8'PUT     '
CLOSE    DC    CL8'CLOSE   '
OPEN     DC    CL8'OPEN    '
RVOPENR  DC    CL8'OPENR   '
RVRDCNT  DC    CL8'READCNT '
RVREADKD DC    CL8'READKD  '
RVSPACCR DC    CL8'SPACCR  '
RVFWRITE DC    CL8'FWRITE  '
RVWRITER DC    CL8'WRITEREC'
PUTLABEL DC    CL8'PUTLABEL'
GETLABEL DC    CL8'GETLABEL'
CANCEL   DC    CL8'CANCEL  '
SET      DC    CL8'SET     '
SELECTX  DC    CL8'SELECTX '
CHANGEX  DC    CL8'CHANGEX '
SELECTDD DC    CL8'SELECTDD'
SELECTDS DC    CL8'SELECTDS'
TBLREST  DC    CL8'TBLREST '
NULLIFYC DC    CL8'NULLIFYC'
RDMSC    DC    CL8'RDMSC   '
RDMSCTBL DC    CL8'RDMSCTBL'
RDCARTLB DC    CL8'RDCARTLB'
AUDITCEL DC    CL8'AUDITCEL'
RDSTGAD  DC    CL8'RDSTGAD '
MODID    DC    CL4'RD02'
RD01     DC    CL4'RD01'
INPUT    DC    CL1'I'
OPENR    DC    CL8'OPENR   '
NULLPARM DC    X'0000000000'
LASTENT  DS    CL78
         ORG   LASTENT
@NM00126 DC    78X'FF'
         ORG   LASTENT+78
STNGPK   DC    CL44'STAGING PACK'
FMT4DSCB DC    CL44'FORMAT4.DSCB'
FMT4DSN  DS    CL44
         ORG   FMT4DSN
@NM00127 DC    44X'04'
         ORG   FMT4DSN+44
UPATCHIT DS    CL1024
         ORG   UPATCHIT
@NM00128 DS    CL256
         ORG   @NM00128
@NM00129 DC    256X'00'
         ORG   UPATCHIT+256
@NM00130 DS    CL256
         ORG   @NM00130
@NM00131 DC    256X'00'
         ORG   UPATCHIT+512
@NM00132 DS    CL256
         ORG   @NM00132
@NM00133 DC    256X'00'
         ORG   UPATCHIT+768
@NM00134 DS    CL256
         ORG   @NM00134
@NM00135 DC    256X'00'
         ORG   UPATCHIT+1024
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
OPNPTR   EQU   @02
IOCSPTR  EQU   @02
TESTRC   EQU   @03
RTNREG   EQU   @15
REG7     EQU   @07
REG8     EQU   @08
REG0     EQU   @00
REG1     EQU   @01
REG10    EQU   @10
REG11    EQU   @11
REG12    EQU   @12
REG13    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
REG2     EQU   @02
REG3     EQU   @03
REG4     EQU   @04
REG5     EQU   @05
REG6     EQU   @06
REG9     EQU   @09
IDCSAEP0 EQU   0
IDCSAFP0 EQU   0
IDCSADQ0 EQU   0
TRACE1   EQU   0
OLDERID1 EQU   TRACE1
TRACE2   EQU   0
OLDERID2 EQU   TRACE2
NEWID2   EQU   TRACE2+95
NEWERID2 EQU   5
CIRAGL   EQU   0
CIRTYPE  EQU   CIRAGL
ALLAGL   EQU   0
ALLSTS   EQU   ALLAGL+24
ALLDSP   EQU   ALLAGL+25
ALLORG   EQU   ALLAGL+26
ALLOPT   EQU   ALLAGL+28
UNITABL  EQU   0
UNITADR  EQU   UNITABL+4
@NM00010 EQU   UNITADR
UNITSTAT EQU   UNITABL+6
IDCIOOP0 EQU   0
IDCIOCL0 EQU   0
IDCIO050 EQU   0
IOCSTR   EQU   0
IOCDSO   EQU   IOCSTR+16
IOCRFM   EQU   IOCSTR+17
IOCMAC   EQU   IOCSTR+18
IOCMAC2  EQU   IOCSTR+19
IOCCHP   EQU   IOCSTR+20
IOCMSG   EQU   IOCSTR+21
IOCDSN   EQU   IOCSTR+32
IOCRBA   EQU   IOCSTR+40
IOCTTR   EQU   IOCRBA
IOCMEM   EQU   IOCSTR+44
IOCNWM   EQU   IOCSTR+48
OPNAGL   EQU   0
OPNOPT   EQU   OPNAGL
OPNOPTOT EQU   OPNOPT
OPNRFM   EQU   OPNAGL+1
OPNTYP   EQU   OPNAGL+2
OPNMOD   EQU   OPNAGL+3
OPNMODAC EQU   OPNMOD
OPNIOC   EQU   OPNAGL+4
OPNDDN   EQU   OPNAGL+8
OPNDSN   EQU   OPNAGL+16
OPNDEV   EQU   OPNAGL+24
OPNDSO   EQU   OPNAGL+41
OPNOPT2  EQU   OPNAGL+42
IOINFOPT EQU   0
UVOLLIST EQU   0
UVOLENT  EQU   UVOLLIST+2
DARGLIST EQU   0
DARGSTID EQU   DARGLIST+8
DARGARY  EQU   DARGLIST+20
DARGINS  EQU   DARGARY
DARGINL  EQU   DARGARY+2
FMTLIST  EQU   0
FMTFLGS  EQU   FMTLIST
FMTSPF   EQU   FMTLIST+2
FMTRFNO  EQU   FMTSPF
FMTILEN  EQU   FMTRFNO
FMTIOFF  EQU   FMTLIST+4
FMTTRBC  EQU   FMTIOFF
FMTSTO   EQU   FMTTRBC
FMTOCOL  EQU   FMTLIST+6
FMTCNVF  EQU   FMTLIST+10
ERCNVTAB EQU   0
ERTYPE   EQU   ERCNVTAB
EROPER   EQU   ERCNVTAB+1
EROSOPER EQU   ERCNVTAB+2
IDCDB010 EQU   0
DMPITM   EQU   0
DMPARY   EQU   0
CCMSG    EQU   0
CMMSG    EQU   0
CMVOLFLG EQU   CMMSG+6
CTMSG    EQU   0
CTARRAY  EQU   CTMSG+4
MDAGL    EQU   0
MDFLAGS  EQU   MDAGL+30
MDVTOC   EQU   MDAGL+32
PUAGL    EQU   0
CKAGL    EQU   0
CKFLAGS  EQU   CKAGL+28
EXCLAGL  EQU   0
EXCLFLAG EQU   EXCLAGL+22
EXOARG   EQU   0
EXOEXT   EQU   EXOARG+24
EXOPT    EQU   EXOARG+32
EXFLG    EQU   EXOARG+33
EXGARG   EQU   0
EXWRARG  EQU   0
EXRWCHR  EQU   EXWRARG+26
EXSPACE  EQU   EXWRARG+36
EXPARG   EQU   0
EXPDATA  EQU   EXPARG+12
EXPDATAB EQU   0
EXPARRAY EQU   EXPDATAB+4
VS2AGL   EQU   0
VSLABOPT EQU   VS2AGL+28
VS2MSG   EQU   VS2AGL+35
VS2RESOP EQU   VS2AGL+36
VS1AGL   EQU   0
VSSECOPT EQU   VS1AGL+68
VSVTOPT  EQU   VS1AGL+69
VSCATOPT EQU   VS1AGL+70
VSRETURN EQU   VS1AGL+71
VSMSG    EQU   VS1AGL+72
VSRESOPT EQU   VS1AGL+73
RCTAGL   EQU   0
RCTOPT   EQU   RCTAGL+8
STAEPARM EQU   0
STARCVY  EQU   STAEPARM+52
STARETRY EQU   STAEPARM+53
VOLLABEL EQU   0
SV82LIST EQU   0
@NM00072 EQU   SV82LIST+4
SV82DCBP EQU   @NM00072
@NM00073 EQU   SV82LIST+12
SV82WRKP EQU   @NM00073
SRTAGL   EQU   0
LCTINFO  EQU   0
LCTFLAGS EQU   LCTINFO+32
UCTAGL   EQU   0
UCTFLAGS EQU   UCTAGL+68
SELAGL   EQU   0
SELFLAGS EQU   SELAGL+22
DATESAGL EQU   0
DATESOPT EQU   DATESAGL+20
VS3AGL   EQU   0
VS3FLAGS EQU   VS3AGL+58
VSDVTOC  EQU   0
VSDSTAT  EQU   0
VSDSFLG1 EQU   VSDSTAT+16
VSDFLG2  EQU   VSDSTAT+17
VSDSCR   EQU   0
VSDSCRFL EQU   VSDSCR+4
VSDUSAGE EQU   0
VSDDORG  EQU   VSDUSAGE+9
VSDALLOC EQU   VSDUSAGE+10
VSDUSEF  EQU   VSDUSAGE+11
VSDDSORG EQU   VSDUSAGE+16
VSDBLOCK EQU   0
VSDSPACE EQU   VSDBLOCK+12
VSDARRAY EQU   VSDBLOCK+16
VSDVARY  EQU   VSDARRAY+48
ALLA     EQU   0
INFIL    EQU   0
INDS     EQU   0
INDSFLG  EQU   INDS+10
FULLR    EQU   0
DSRNG    EQU   0
DRRNG    EQU   0
STAGR    EQU   0
DOUTF    EQU   0
DOUTFVAL EQU   DOUTF+10
DOTDS    EQU   0
DOTDSFLG EQU   DOTDS+10
DOTDSVAL EQU   DOTDS+21
VOLSR    EQU   0
VOLSRFLG EQU   VOLSR+10
DCCHR    EQU   0
DREC     EQU   0
VOLDS    EQU   0
VOLDSFLG EQU   VOLDS+10
DSCHR    EQU   0
DSCHH    EQU   0
VOLRR    EQU   0
VOLRRFLG EQU   VOLRR+10
VOLRRVAL EQU   VOLRR+21
RRCHR    EQU   0
RRCHRVAL EQU   RRCHR+1
RRCHH    EQU   0
RRCHHVAL EQU   RRCHH+1
DKEYL    EQU   0
DATAL    EQU   0
DPVTC    EQU   0
DVTCS    EQU   0
DVTCSFLG EQU   DVTCS+10
CINFL    EQU   0
CINDS    EQU   0
CINDSFLG EQU   CINDS+10
COFIL    EQU   0
CCATL    EQU   0
CCATLFLG EQU   CCATL+10
CVOLD    EQU   0
CVOLDFLG EQU   CVOLD+10
CDCHR    EQU   0
CDHHR    EQU   0
CVOLS    EQU   0
CVOLSFLG EQU   CVOLS+10
CCCHR    EQU   0
CRECR    EQU   0
CKEYL    EQU   0
CDATL    EQU   0
CVTCS    EQU   0
CVTCSFLG EQU   CVTCS+10
DBFIL    EQU   0
DBDS     EQU   0
DBDSFLG  EQU   DBDS+10
DBVOL    EQU   0
DBVOLFLG EQU   DBVOL+10
DBCCH    EQU   0
DBHHH    EQU   0
DBKEY    EQU   0
DBDAT    EQU   0
MNCNT    EQU   0
MINFL    EQU   0
MINDS    EQU   0
MINDSFLG EQU   MINDS+10
MOUTF    EQU   0
MODS     EQU   0
MODSFLG  EQU   MODS+10
MVTCS    EQU   0
MVTCSFLG EQU   MVTCS+10
MVTCR    EQU   0
MIRVO    EQU   0
MIRVOFLG EQU   MIRVO+10
MIRCH    EQU   0
MIDVO    EQU   0
MIDVOFLG EQU   MIDVO+10
MIDCH    EQU   0
MRRVO    EQU   0
MRRVOFLG EQU   MRRVO+10
MRRCH    EQU   0
MRRHH    EQU   0
MNDOF    EQU   0
MNDST    EQU   0
MNKOF    EQU   0
MNKST    EQU   0
MORVO    EQU   0
MORVOFLG EQU   MORVO+10
MORCH    EQU   0
MODVO    EQU   0
MODVOFLG EQU   MODVO+10
MODCH    EQU   0
RWFHDR   EQU   0
RWFHDSNU EQU   RWFHDR+55
SRPRTARG EQU   0
SRVRECL  EQU   SRPRTARG
SRVREPTR EQU   SRPRTARG+4
SRDSNHDR EQU   SRPRTARG+8
SRVOLPTR EQU   SRPRTARG+12
SRRWFDSN EQU   SRPRTARG+16
SRRWFKEY EQU   SRPRTARG+20
SRERCODE EQU   SRPRTARG+24
RWFINFO  EQU   0
RWFDSN   EQU   RWFINFO+8
RWFKEY1  EQU   RWFINFO+82
RWFKVOL1 EQU   RWFKEY1
RWFKCHR1 EQU   RWFKEY1+6
RWFKEY2  EQU   RWFINFO+93
RWFKVOL2 EQU   RWFKEY2
RWFKCHR2 EQU   RWFKEY2+6
RWHDRINF EQU   0
RDARG    EQU   0
RDCHR    EQU   RDARG+26
RDSPACE  EQU   RDARG+36
RDSPKL   EQU   RDARG+47
INFOAREA EQU   0
INFODSN  EQU   0
INFOVOL  EQU   0
DEVAREA  EQU   0
DEVDEVTP EQU   DEVAREA
DEVTBYT2 EQU   DEVDEVTP+1
@NM00107 EQU   DEVAREA+8
DEVWORD3 EQU   DEVAREA+12
DEVBOH   EQU   DEVWORD3+2
DEVWORD4 EQU   DEVAREA+16
DEV4B1   EQU   DEVWORD4+1
XTNTTBL2 EQU   0
XTN2ENT  EQU   XTNTTBL2
XTN2CHR1 EQU   XTN2ENT+44
XTN2CHR2 EQU   XTN2ENT+48
XTNTTBL  EQU   0
XTNTHDR  EQU   XTNTTBL
XTNHDSN  EQU   XTNTHDR+8
XTNHCHR1 EQU   XTNTHDR+68
XTNHCHR2 EQU   XTNTHDR+76
XTNTENT  EQU   XTNTTBL+88
XTNTCHR1 EQU   XTNTENT+62
XTNTCHR2 EQU   XTNTENT+70
SPLIST   EQU   0
SPQNAME  EQU   SPLIST
SPRNAME  EQU   SPLIST+8
RWFR     EQU   0
RWFRKEY  EQU   RWFR
RWFRCNT  EQU   RWFR+16
LOCTAB   EQU   0
RIOAREA  EQU   0
RIOHDR   EQU   RIOAREA
RPREV    EQU   RIOHDR+2
RKEY     EQU   0
RKEYCHR  EQU   RKEY+6
RKEYFLG  EQU   RKEY+11
RBUF     EQU   0
RBUFCNT  EQU   RBUF
RBCCHHR  EQU   RBUFCNT
WIOAREA  EQU   0
WBUF     EQU   0
WBUFCNT  EQU   WBUF
WBCCHHR  EQU   WBUFCNT
IOCRWDSN EQU   0
AMSTP011 EQU   0
AMSTP041 EQU   0
AMSTP042 EQU   0
AMSTP043 EQU   0
AMSTP044 EQU   0
CDATLPTR EQU   0
CDSRG    EQU   0
CHARA    EQU   0
CKEYLPTR EQU   0
CLEN     EQU   0
CLENCNT  EQU   0
COPY     EQU   0
CSRNG    EQU   0
CVTOC    EQU   0
DATALPTR EQU   0
DBDATPTR EQU   0
DBKEYPTR EQU   0
DBLOC    EQU   0
DBLST    EQU   0
DBLSTCNT EQU   0
DBRNG    EQU   0
DISPL    EQU   0
DKEYLPTR EQU   0
DLENG    EQU   0
DLENGCNT EQU   0
DMPTRM   EQU   0
DUMP     EQU   0
ERROR    EQU   0
FREC     EQU   0
HEXA     EQU   0
IDCIOCO0 EQU   0
IDCIOGT0 EQU   0
IDCIOIT0 EQU   0
IDCIOPO0 EQU   0
IDCIOPT0 EQU   0
IDCIOSI0 EQU   0
IDCIOST0 EQU   0
IDCIOTM0 EQU   0
IDCIOVY0 EQU   0
IDCSAAL0 EQU   0
IDCSACA0 EQU   0
IDCSACL0 EQU   0
IDCSACR0 EQU   0
IDCSADE0 EQU   0
IDCSADL0 EQU   0
IDCSAFS0 EQU   0
IDCSAGP0 EQU   0
IDCSAGS0 EQU   0
IDCSAID0 EQU   0
IDCSALC0 EQU   0
IDCSALD0 EQU   0
IDCSALK0 EQU   0
IDCSANQ0 EQU   0
IDCSAPR0 EQU   0
IDCSAPT0 EQU   0
IDCSAQL0 EQU   0
IDCSARC0 EQU   0
IDCSARV0 EQU   0
IDCSASC0 EQU   0
IDCSASI0 EQU   0
IDCSASN0 EQU   0
IDCSASS0 EQU   0
IDCSAST0 EQU   0
IDCSATI0 EQU   0
IDCSAUC0 EQU   0
IDCSAWO0 EQU   0
IDCSA060 EQU   0
IDCST010 EQU   0
IDCTPER0 EQU   0
IDONL    EQU   0
LISTTEST EQU   0
MIDSA    EQU   0
MIRK     EQU   0
MIRNG    EQU   0
MNDAT    EQU   0
MNKEY    EQU   0
MODIF    EQU   0
MODSA    EQU   0
MORK     EQU   0
MOVFL    EQU   0
MVTOC    EQU   0
NEWERID1 EQU   5
GDTTBL   EQU   0
GDTTR1   EQU   GDTTBL+8
GDTTR2   EQU   GDTTBL+12
GDTDBG   EQU   GDTTBL+40
GDTSTC   EQU   GDTTBL+44
GDTPRT   EQU   GDTTBL+48
GDTESS   EQU   GDTTBL+52
GDTESA   EQU   GDTTBL+56
GDTRST   EQU   GDTTBL+60
GDTRES   EQU   GDTTBL+64
GDTCAL   EQU   GDTTBL+68
GDTGSP   EQU   GDTTBL+72
GDTFSP   EQU   GDTTBL+76
GDTGPL   EQU   GDTTBL+80
GDTFPL   EQU   GDTTBL+84
GDTLOD   EQU   GDTTBL+88
GDTDEL   EQU   GDTTBL+92
GDTPRL   EQU   GDTTBL+96
GDTEPL   EQU   GDTTBL+100
GDTTIM   EQU   GDTTBL+104
GDTIIO   EQU   GDTTBL+108
GDTTIO   EQU   GDTTBL+112
GDTOPN   EQU   GDTTBL+124
GDTCLS   EQU   GDTTBL+128
GDTGET   EQU   GDTTBL+132
GDTPUT   EQU   GDTTBL+136
GDTPOS   EQU   GDTTBL+140
GDTCPY   EQU   GDTTBL+144
GDTCAT   EQU   GDTTBL+148
GDTSNP   EQU   GDTTBL+164
GDTVFY   EQU   GDTTBL+172
GDTUID   EQU   GDTTBL+192
GDTPMT   EQU   GDTTBL+196
GDTCIR   EQU   GDTTBL+200
GDTLNK   EQU   GDTTBL+204
GDTALC   EQU   GDTTBL+208
GDTDLC   EQU   GDTTBL+212
GDTQAL   EQU   GDTTBL+216
GDTSTW   EQU   GDTTBL+220
GDTSSC   EQU   GDTTBL+224
GDTENQ   EQU   GDTTBL+228
GDTRSV   EQU   GDTTBL+232
GDTDEQ   EQU   GDTTBL+236
GDTSFO   EQU   GDTTBL+240
GDTWTO   EQU   GDTTBL+244
GDTSCR   EQU   GDTTBL+248
GDTUNT   EQU   GDTTBL+252
GDTRCT   EQU   GDTTBL+256
GDTIFO   EQU   GDTTBL+260
GDTEXP   EQU   GDTTBL+264
GDTSTA   EQU   GDTTBL+268
GDTERR   EQU   GDTTBL+272
GDTUNC   EQU   GDTTBL+276
GDTLOC   EQU   GDTTBL+280
FDTTBL   EQU   0
FDTPTR   EQU   FDTTBL+8
REPTBL   EQU   0
REPCB    EQU   REPTBL
REPARFIO EQU   REPCB+12
REPIRWIO EQU   REPCB+16
REPIDSOP EQU   REPCB+24
REPIDSAR EQU   REPCB+32
REPSPRIT EQU   REPCB+40
REPRWHDI EQU   REPCB+60
REPIXTNT EQU   REPCB+80
REPRWHAR EQU   REPCB+100
REPRWINA EQU   REPCB+104
REPQRPTR EQU   REPCB+132
REPEXOAR EQU   REPCB+140
REPOPAGL EQU   REPCB+144
REPCBEXT EQU   REPTBL+156
REPSRPR  EQU   REPCBEXT+4
REPRC    EQU   REPCBEXT+6
REPRCDCT EQU   REPCBEXT+8
I        EQU   REPCBEXT+12
CKREQ    EQU   REPCBEXT+16
CKRERN   EQU   CKREQ
CKRMVAR  EQU   CKREQ+4
WFAREA   EQU   REPCBEXT+76
WFIODAD  EQU   WFAREA
WFIODLN  EQU   WFAREA+4
WFIOKYA  EQU   WFAREA+8
WFREQ    EQU   WFAREA+12
WFRTYP   EQU   WFREQ
WFRGET   EQU   WFRTYP
WFRPOS   EQU   WFRTYP
WFROPT   EQU   WFREQ+1
WFRIN    EQU   WFROPT
RWDEF    EQU   RWFHDR
RWFRDE   EQU   RWFR
RWFRF1   EQU   RWFRDE+11
RWFRF2   EQU   RWFRDE+12
RDSPKLDL EQU   RDSPKL
*                                      START UNREFERENCED COMPONENTS
@NM00119 EQU   RWFRDE+15
RWFROV   EQU   RWFRDE+14
@NM00118 EQU   RWFRDE
RWFHKLN  EQU   RWDEF+92
RWFHDLN  EQU   RWDEF+90
RWFHFT   EQU   RWDEF+89
@NM00098 EQU   RWDEF
REPENQSW EQU   REPCBEXT+90
@NM00097 EQU   WFROPT
WFRUP    EQU   WFROPT
@NM00096 EQU   WFRTYP
WFRUPD   EQU   WFRTYP
WFRLD    EQU   WFRTYP
WFRADD   EQU   WFRTYP
@NM00095 EQU   REPCBEXT+75
WFIOGUK  EQU   REPCBEXT+64
RDCATRC  EQU   REPCBEXT+60
@NM00094 EQU   CKREQ+2
@NM00093 EQU   REPCBEXT+15
K        EQU   REPCBEXT+14
J        EQU   REPCBEXT+13
@NM00092 EQU   REPSRPR+1
@NM00091 EQU   REPSRPR
REPSRPRT EQU   REPSRPR
REPR1LN  EQU   REPCBEXT+2
REPR0LN  EQU   REPCBEXT
REPCDSOP EQU   REPCB+152
REPCPPTR EQU   REPCB+148
REPALLAG EQU   REPCB+136
REPODEVA EQU   REPCB+128
REPIDEVA EQU   REPCB+124
REPOLCPT EQU   REPCB+120
REPILCPT EQU   REPCB+116
REPOSYSI EQU   REPCB+112
REPISYSI EQU   REPCB+108
REPOINFO EQU   REPCB+96
REPIINFO EQU   REPCB+92
REPOXTNT EQU   REPCB+88
REPOXTN2 EQU   REPCB+84
REPIXTN2 EQU   REPCB+76
REPOUTCL EQU   REPCB+72
REPINCL  EQU   REPCB+68
REPRWHDO EQU   REPCB+64
REPBUFF1 EQU   REPCB+56
REPBUFF0 EQU   REPCB+52
REPOBFPT EQU   REPCB+48
REPIBFPT EQU   REPCB+44
REPODSAR EQU   REPCB+36
REPODSOP EQU   REPCB+28
REPORWIO EQU   REPCB+20
REPRESER EQU   REPCB
FDTVERB  EQU   FDTTBL
GDTECT   EQU   GDTTBL+188
GDTPSB   EQU   GDTTBL+184
GDTUPT   EQU   GDTTBL+180
GDTCMB   EQU   GDTTBL+176
GDTSPR   EQU   GDTTBL+168
@NM00001 EQU   GDTTBL+160
GDTABH   EQU   GDTTBL+156
GDTABT   EQU   GDTTBL+152
GDTTOH   EQU   GDTTBL+120
GDTRIP   EQU   GDTTBL+116
GDTIOH   EQU   GDTTBL+36
GDTSAH   EQU   GDTTBL+32
GDTTPH   EQU   GDTTBL+28
GDTRIH   EQU   GDTTBL+24
GDTSTH   EQU   GDTTBL+20
GDTDBH   EQU   GDTTBL+16
GDTPRM   EQU   GDTTBL+4
GDTHDR   EQU   GDTTBL
WKEYDAT  EQU   WBUF+8
WBDL     EQU   WBUFCNT+6
WBKL     EQU   WBUFCNT+5
WBREC    EQU   WBCCHHR+4
WBHH     EQU   WBCCHHR+2
WBCC     EQU   WBCCHHR
WBUFF    EQU   WIOAREA+4
WNUMREC  EQU   WIOAREA
RKEYDAT  EQU   RBUF+8
RBDL     EQU   RBUFCNT+6
RBKL     EQU   RBUFCNT+5
RBREC    EQU   RBCCHHR+4
RBHH     EQU   RBCCHHR+2
RBCC     EQU   RBCCHHR
@NM00125 EQU   RKEYFLG+4
RKEYFLG3 EQU   RKEYFLG+3
RKEYFLG2 EQU   RKEYFLG+1
RKEYFLG1 EQU   RKEYFLG
RKEYR    EQU   RKEYCHR+4
RKEYHH   EQU   RKEYCHR+2
RKEYCC   EQU   RKEYCHR
RKEYVOL  EQU   RKEY
RBUFF    EQU   RIOAREA+282
@NM00124 EQU   RIOHDR+26
@NM00123 EQU   RIOHDR+10
RNUMREC  EQU   RIOHDR+8
@NM00122 EQU   RIOHDR+7
RPREVR   EQU   RPREV+4
RPREVHH  EQU   RPREV+2
RPREVCC  EQU   RPREV
@NM00121 EQU   RIOHDR+1
RFIRST   EQU   RIOHDR
LOCDLEN  EQU   LOCTAB+18
LOCKLEN  EQU   LOCTAB+17
@NM00120 EQU   LOCTAB+16
LOCCNTFD EQU   LOCTAB+8
LOCRCKD  EQU   LOCTAB+6
LOCRCNT  EQU   LOCTAB+4
LOCADDR  EQU   LOCTAB
RWFRKD   EQU   RWFR+24
RWFRDLN  EQU   RWFRCNT+6
RWFRKLN  EQU   RWFRCNT+5
RWFRR    EQU   RWFRCNT+4
RWFRHH   EQU   RWFRCNT+2
RWFRCC   EQU   RWFRCNT
RWFRFLG  EQU   RWFR+11
SPRVOL   EQU   SPRNAME+1
SPRLEN   EQU   SPRNAME
@NM00117 EQU   XTNTENT+75
XTNTR2   EQU   XTNTCHR2+4
XTNTHH2  EQU   XTNTCHR2+2
XTNTCC2  EQU   XTNTCHR2
@NM00116 EQU   XTNTENT+67
XTNTR1   EQU   XTNTCHR1+4
XTNTHH1  EQU   XTNTCHR1+2
XTNTCC1  EQU   XTNTCHR1
@NM00115 EQU   XTNTENT+59
XTNTVOL  EQU   XTNTENT+53
XTNTVOLN EQU   XTNTENT+52
XTNTDSN  EQU   XTNTENT+8
XTNTDDN  EQU   XTNTENT
@NM00114 EQU   XTNTHDR+85
XTNHMODE EQU   XTNTHDR+84
@NM00113 EQU   XTNTHDR+81
XTNHR2   EQU   XTNHCHR2+4
XTNHHH2  EQU   XTNHCHR2+2
XTNHCC2  EQU   XTNHCHR2
@NM00112 EQU   XTNTHDR+73
XTNHR1   EQU   XTNHCHR1+4
XTNHHH1  EQU   XTNHCHR1+2
XTNHCC1  EQU   XTNHCHR1
XTNHPWD  EQU   XTNTHDR+60
@NM00111 EQU   XTNTHDR+59
XTNHVOL  EQU   XTNTHDR+53
XTNHVOLN EQU   XTNTHDR+52
XTNHDDN  EQU   XTNTHDR
XTN2HH2  EQU   XTN2CHR2+2
XTN2CC2  EQU   XTN2CHR2
XTN2HH1  EQU   XTN2CHR1+2
XTN2CC1  EQU   XTN2CHR1
XTN2DSN  EQU   XTN2ENT
DEVWORD5 EQU   DEVAREA+20
@NM00110 EQU   DEV4B1+1
@NM00109 EQU   DEV4B1
INF4FLG  EQU   DEV4B1
@NM00108 EQU   DEV4B1
DEVKC    EQU   DEVWORD4
DEVBOH2  EQU   DEVBOH+1
DEVBOH1  EQU   DEVBOH
DEVTC    EQU   DEVWORD3
DEVMAXHH EQU   @NM00107+2
DEVMAXCC EQU   @NM00107
DEVMAXBK EQU   DEVAREA+4
DEVTBYT4 EQU   DEVDEVTP+3
DEVTBYT3 EQU   DEVDEVTP+2
@NM00106 EQU   DEVTBYT2
DEVRVDEV EQU   DEVTBYT2
@NM00105 EQU   DEVTBYT2
DEVTBYT1 EQU   DEVDEVTP
INFVOL   EQU   INFOVOL+4
INFVOLLN EQU   INFOVOL+2
INFVOLID EQU   INFOVOL
INFDSN   EQU   INFODSN+4
INFDSNLN EQU   INFODSN+2
INFDSNID EQU   INFODSN
INFAREA  EQU   INFOAREA+4
INFDATAL EQU   INFOAREA+2
INFAREAL EQU   INFOAREA
RDDLEN   EQU   RDARG+56
RDKLEN   EQU   RDARG+52
RDLENTOT EQU   RDARG+50
RDSPDL   EQU   RDARG+48
RDFUNC   EQU   RDARG+46
@NM00104 EQU   RDSPACE+8
@NM00103 EQU   RDSPACE+6
@NM00102 EQU   RDSPACE+4
@NM00101 EQU   RDSPACE+1
@NM00100 EQU   RDSPACE
RDRWPKLN EQU   RDARG+32
RDDS     EQU   RDARG+31
RDRECNUM EQU   RDCHR+4
RDHH     EQU   RDCHR+2
RDCC     EQU   RDCHR
RDCCWCNT EQU   RDARG+24
RDLOCPTR EQU   RDARG+20
RDDARE   EQU   RDARG+16
RDIOAREA EQU   RDARG+12
RDCTLBK  EQU   RDARG+8
RDRES    EQU   RDARG
RWHDRDLN EQU   RWHDRINF+6
RWHDRKLN EQU   RWHDRINF+5
@NM00099 EQU   RWHDRINF+1
RWHDRFIX EQU   RWHDRINF
RWFVOL   EQU   RWFINFO+52
RWFDDN   EQU   RWFINFO
SRCCHHRP EQU   SRPRTARG+40
SRRECPTR EQU   SRPRTARG+36
SRSPRECL EQU   SRPRTARG+32
SRDSNPTR EQU   SRPRTARG+28
RWFHFM   EQU   RWFHDR+99
RWFHDSNR EQU   RWFHDR+11
RWFHKEY  EQU   RWFHDR
MODCHVAL EQU   MODCH+1
MODCHLEN EQU   MODCH
MODVOVAL EQU   MODVO+21
MODVOLEN EQU   MODVO+20
MODVOMEM EQU   MODVO+12
MODVOMLN EQU   MODVO+11
MODVOFUQ EQU   MODVOFLG
MODVOPOS EQU   MODVO+9
MODVOPAS EQU   MODVO+1
MODVOPLN EQU   MODVO
MORCHVAL EQU   MORCH+1
MORCHLEN EQU   MORCH
MORVOVAL EQU   MORVO+21
MORVOLEN EQU   MORVO+20
MORVOMEM EQU   MORVO+12
MORVOMLN EQU   MORVO+11
MORVOFUQ EQU   MORVOFLG
MORVOPOS EQU   MORVO+9
MORVOPAS EQU   MORVO+1
MORVOPLN EQU   MORVO
MNKSTVAL EQU   MNKST+1
MNKSTLEN EQU   MNKST
MNKOFVAL EQU   MNKOF
MNDSTVAL EQU   MNDST+1
MNDSTLEN EQU   MNDST
MNDOFVAL EQU   MNDOF
MRRHHVAL EQU   MRRHH+1
MRRHHLEN EQU   MRRHH
MRRCHVAL EQU   MRRCH+1
MRRCHLEN EQU   MRRCH
MRRVOVAL EQU   MRRVO+21
MRRVOLEN EQU   MRRVO+20
MRRVOMEM EQU   MRRVO+12
MRRVOMLN EQU   MRRVO+11
MRRVOFUQ EQU   MRRVOFLG
MRRVOPOS EQU   MRRVO+9
MRRVOPAS EQU   MRRVO+1
MRRVOPLN EQU   MRRVO
MIDCHVAL EQU   MIDCH+1
MIDCHLEN EQU   MIDCH
MIDVOVAL EQU   MIDVO+21
MIDVOLEN EQU   MIDVO+20
MIDVOMEM EQU   MIDVO+12
MIDVOMLN EQU   MIDVO+11
MIDVOFUQ EQU   MIDVOFLG
MIDVOPOS EQU   MIDVO+9
MIDVOPAS EQU   MIDVO+1
MIDVOPLN EQU   MIDVO
MIRCHVAL EQU   MIRCH+1
MIRCHLEN EQU   MIRCH
MIRVOVAL EQU   MIRVO+21
MIRVOLEN EQU   MIRVO+20
MIRVOMEM EQU   MIRVO+12
MIRVOMLN EQU   MIRVO+11
MIRVOFUQ EQU   MIRVOFLG
MIRVOPOS EQU   MIRVO+9
MIRVOPAS EQU   MIRVO+1
MIRVOPLN EQU   MIRVO
MVTCRVAL EQU   MVTCR+1
MVTCRLEN EQU   MVTCR
MVTCSVAL EQU   MVTCS+21
MVTCSLEN EQU   MVTCS+20
MVTCSMEM EQU   MVTCS+12
MVTCSMLN EQU   MVTCS+11
MVTCSFUQ EQU   MVTCSFLG
MVTCSPOS EQU   MVTCS+9
MVTCSPAS EQU   MVTCS+1
MVTCSPLN EQU   MVTCS
MODSVAL  EQU   MODS+21
MODSLEN  EQU   MODS+20
MODSMEM  EQU   MODS+12
MODSMLN  EQU   MODS+11
MODSFUQ  EQU   MODSFLG
MODSPOS  EQU   MODS+9
MODSPAS  EQU   MODS+1
MODSPLN  EQU   MODS
MOUTFVAL EQU   MOUTF+10
MOUTFLEN EQU   MOUTF+9
MOUTFPAS EQU   MOUTF+1
MOUTFPLN EQU   MOUTF
MINDSVAL EQU   MINDS+21
MINDSLEN EQU   MINDS+20
MINDSMEM EQU   MINDS+12
MINDSMLN EQU   MINDS+11
MINDSFUQ EQU   MINDSFLG
MINDSPOS EQU   MINDS+9
MINDSPAS EQU   MINDS+1
MINDSPLN EQU   MINDS
MINFLVAL EQU   MINFL+10
MINFLLEN EQU   MINFL+9
MINFLPAS EQU   MINFL+1
MINFLPLN EQU   MINFL
MNCNTVAL EQU   MNCNT+1
MNCNTLEN EQU   MNCNT
DBDATVAL EQU   DBDAT
DBKEYVAL EQU   DBKEY
DBHHHVAL EQU   DBHHH+1
DBHHHLEN EQU   DBHHH
DBCCHVAL EQU   DBCCH+1
DBCCHLEN EQU   DBCCH
DBVOLVAL EQU   DBVOL+21
DBVOLLEN EQU   DBVOL+20
DBVOLMEM EQU   DBVOL+12
DBVOLMLN EQU   DBVOL+11
DBVOLFUQ EQU   DBVOLFLG
DBVOLPOS EQU   DBVOL+9
DBVOLPAS EQU   DBVOL+1
DBVOLPLN EQU   DBVOL
DBDSVAL  EQU   DBDS+21
DBDSLEN  EQU   DBDS+20
DBDSMEM  EQU   DBDS+12
DBDSMLN  EQU   DBDS+11
DBDSFUQ  EQU   DBDSFLG
DBDSPOS  EQU   DBDS+9
DBDSPAS  EQU   DBDS+1
DBDSPLN  EQU   DBDS
DBFILVAL EQU   DBFIL+10
DBFILLEN EQU   DBFIL+9
DBFILPAS EQU   DBFIL+1
DBFILPLN EQU   DBFIL
CVTCSVAL EQU   CVTCS+21
CVTCSLEN EQU   CVTCS+20
CVTCSMEM EQU   CVTCS+12
CVTCSMLN EQU   CVTCS+11
CVTCSFUQ EQU   CVTCSFLG
CVTCSPOS EQU   CVTCS+9
CVTCSPAS EQU   CVTCS+1
CVTCSPLN EQU   CVTCS
CDATLVAL EQU   CDATL
CKEYLVAL EQU   CKEYL
CRECRVAL EQU   CRECR+1
CRECRLEN EQU   CRECR
CCCHRVAL EQU   CCCHR+1
CCCHRLEN EQU   CCCHR
CVOLSVAL EQU   CVOLS+21
CVOLSLEN EQU   CVOLS+20
CVOLSMEM EQU   CVOLS+12
CVOLSMLN EQU   CVOLS+11
CVOLSFUQ EQU   CVOLSFLG
CVOLSPOS EQU   CVOLS+9
CVOLSPAS EQU   CVOLS+1
CVOLSPLN EQU   CVOLS
CDHHRVAL EQU   CDHHR+1
CDHHRLEN EQU   CDHHR
CDCHRVAL EQU   CDCHR+1
CDCHRLEN EQU   CDCHR
CVOLDVAL EQU   CVOLD+21
CVOLDLEN EQU   CVOLD+20
CVOLDMEM EQU   CVOLD+12
CVOLDMLN EQU   CVOLD+11
CVOLDFUQ EQU   CVOLDFLG
CVOLDPOS EQU   CVOLD+9
CVOLDPAS EQU   CVOLD+1
CVOLDPLN EQU   CVOLD
CCATLVAL EQU   CCATL+21
CCATLLEN EQU   CCATL+20
CCATLMEM EQU   CCATL+12
CCATLMLN EQU   CCATL+11
CCATLFUQ EQU   CCATLFLG
CCATLPOS EQU   CCATL+9
CCATLPAS EQU   CCATL+1
CCATLPLN EQU   CCATL
COFILVAL EQU   COFIL+10
COFILLEN EQU   COFIL+9
COFILPAS EQU   COFIL+1
COFILPLN EQU   COFIL
CINDSVAL EQU   CINDS+21
CINDSLEN EQU   CINDS+20
CINDSMEM EQU   CINDS+12
CINDSMLN EQU   CINDS+11
CINDSFUQ EQU   CINDSFLG
CINDSPOS EQU   CINDS+9
CINDSPAS EQU   CINDS+1
CINDSPLN EQU   CINDS
CINFLVAL EQU   CINFL+10
CINFLLEN EQU   CINFL+9
CINFLPAS EQU   CINFL+1
CINFLPLN EQU   CINFL
DVTCSVAL EQU   DVTCS+21
DVTCSLEN EQU   DVTCS+20
DVTCSMEM EQU   DVTCS+12
DVTCSMLN EQU   DVTCS+11
DVTCSFUQ EQU   DVTCSFLG
DVTCSPOS EQU   DVTCS+9
DVTCSPAS EQU   DVTCS+1
DVTCSPLN EQU   DVTCS
DATALVAL EQU   DATAL
DKEYLVAL EQU   DKEYL
RRCHHLEN EQU   RRCHH
RRCHRLEN EQU   RRCHR
VOLRRLEN EQU   VOLRR+20
VOLRRMEM EQU   VOLRR+12
VOLRRMLN EQU   VOLRR+11
VOLRRFUQ EQU   VOLRRFLG
VOLRRPOS EQU   VOLRR+9
VOLRRPAS EQU   VOLRR+1
VOLRRPLN EQU   VOLRR
DSCHHVAL EQU   DSCHH+1
DSCHHLEN EQU   DSCHH
DSCHRVAL EQU   DSCHR+1
DSCHRLEN EQU   DSCHR
VOLDSVAL EQU   VOLDS+21
VOLDSLEN EQU   VOLDS+20
VOLDSMEM EQU   VOLDS+12
VOLDSMLN EQU   VOLDS+11
VOLDSFUQ EQU   VOLDSFLG
VOLDSPOS EQU   VOLDS+9
VOLDSPAS EQU   VOLDS+1
VOLDSPLN EQU   VOLDS
DRECVAL  EQU   DREC+1
DRECLEN  EQU   DREC
DCCHRVAL EQU   DCCHR+1
DCCHRLEN EQU   DCCHR
VOLSRVAL EQU   VOLSR+21
VOLSRLEN EQU   VOLSR+20
VOLSRMEM EQU   VOLSR+12
VOLSRMLN EQU   VOLSR+11
VOLSRFUQ EQU   VOLSRFLG
VOLSRPOS EQU   VOLSR+9
VOLSRPAS EQU   VOLSR+1
VOLSRPLN EQU   VOLSR
DOTDSLEN EQU   DOTDS+20
DOTDSMEM EQU   DOTDS+12
DOTDSMLN EQU   DOTDS+11
DOTDSFUQ EQU   DOTDSFLG
DOTDSPOS EQU   DOTDS+9
DOTDSPAS EQU   DOTDS+1
DOTDSPLN EQU   DOTDS
DOUTFLEN EQU   DOUTF+9
DOUTFPAS EQU   DOUTF+1
DOUTFPLN EQU   DOUTF
INDSVAL  EQU   INDS+21
INDSLEN  EQU   INDS+20
INDSMEM  EQU   INDS+12
INDSMLN  EQU   INDS+11
INDSFUQ  EQU   INDSFLG
INDSPOS  EQU   INDS+9
INDSPAS  EQU   INDS+1
INDSPLN  EQU   INDS
INFILVAL EQU   INFIL+10
INFILLEN EQU   INFIL+9
INFILPAS EQU   INFIL+1
INFILPLN EQU   INFIL
VSDDSN   EQU   VSDARRAY+4
VSDVOLCT EQU   VSDARRAY
VSDFMT0  EQU   VSDBLOCK+8
VSDVTOCS EQU   VSDBLOCK+4
VSDELEM  EQU   VSDBLOCK
VSDFREE  EQU   VSDUSAGE+24
VSDALLC  EQU   VSDUSAGE+19
VSDDSOR3 EQU   VSDDSORG+2
@NM00090 EQU   VSDDSORG
VSDSCAL  EQU   VSDUSAGE+12
@NM00089 EQU   VSDUSEF
VSDCALFR EQU   VSDUSEF
@NM00088 EQU   VSDALLOC
VSDABSTR EQU   VSDALLOC
VSDABLK  EQU   VSDALLOC
VSDATRK  EQU   VSDALLOC
VSDACYL  EQU   VSDALLOC
@NM00087 EQU   VSDDORG
VSDOU    EQU   VSDDORG
VSDOIS   EQU   VSDDORG
VSDODA   EQU   VSDDORG
VSDOUN   EQU   VSDDORG
VSDOPS   EQU   VSDDORG
VSDOPO   EQU   VSDDORG
VSDEXTS  EQU   VSDUSAGE+8
VSDSECAL EQU   VSDUSAGE+4
VSDFTRK  EQU   VSDUSAGE+2
VSDTRKS  EQU   VSDUSAGE
@NM00086 EQU   VSDSCR+5
@NM00085 EQU   VSDSCRFL
VSDVSAM  EQU   VSDSCRFL
VSDCATLC EQU   VSDSCRFL
VSDACBPT EQU   VSDSCR
VSDPRTC  EQU   VSDSTAT+25
VSDCAT   EQU   VSDSTAT+22
VSDEXP   EQU   VSDSTAT+20
VSDCRE   EQU   VSDSTAT+18
@NM00084 EQU   VSDFLG2
VSDERROR EQU   VSDFLG2
VSDPROT  EQU   VSDFLG2
VSDPWW   EQU   VSDFLG2
VSDPWR   EQU   VSDFLG2
@NM00083 EQU   VSDSFLG1
VSDCVSAM EQU   VSDSFLG1
VSDCATLG EQU   VSDSFLG1
VSDVSAME EQU   VSDSFLG1
VSDVSAMC EQU   VSDSFLG1
VSDVTOCE EQU   VSDSFLG1
VSDVTOCC EQU   VSDSFLG1
VSDOWNER EQU   VSDSTAT+8
VSDEXPIR EQU   VSDSTAT+4
VSDCREAT EQU   VSDSTAT
VSDFRCCL EQU   VSDVTOC+21
@NM00082 EQU   VSDVTOC+20
VSDFREXT EQU   VSDVTOC+16
@NM00081 EQU   VSDVTOC+15
VSDFRTRK EQU   VSDVTOC+11
@NM00080 EQU   VSDVTOC+10
VSDFRCYL EQU   VSDVTOC+6
@NM00079 EQU   VSDVTOC
@NM00078 EQU   VS3FLAGS
VS3SYSNM EQU   VS3FLAGS
VS3UNCAT EQU   VS3FLAGS
VS3SCR   EQU   VS3FLAGS
VS3USAGE EQU   VS3FLAGS
VS3STAT  EQU   VS3FLAGS
VS3DD    EQU   VS3AGL+50
VS3VOL   EQU   VS3AGL+44
VS3POOL  EQU   VS3AGL+40
VS3DEV   EQU   VS3AGL+36
VS3UCBP  EQU   VS3AGL+32
VS3CREAT EQU   VS3AGL+28
VS3EXPIR EQU   VS3AGL+24
VS3AST   EQU   VS3AGL+22
VS3LEVLN EQU   VS3AGL+20
VS3LEVP  EQU   VS3AGL+16
VS3EXDSP EQU   VS3AGL+12
VS3LISTP EQU   VS3AGL+8
VS3HEAD  EQU   VS3AGL
@NM00077 EQU   DATESOPT
DATDAYOP EQU   DATESOPT
DATDTEOP EQU   DATESOPT
DATSUB   EQU   DATESOPT
DATADD   EQU   DATESOPT
DATRETRN EQU   DATESAGL+16
DATDAYS  EQU   DATESAGL+12
DATDATE  EQU   DATESAGL+8
DATHEAD  EQU   DATESAGL
@NM00076 EQU   SELFLAGS
SELVOL   EQU   SELAGL+16
SELDDNP  EQU   SELAGL+12
SELUCBP  EQU   SELAGL+8
SELHEAD  EQU   SELAGL
@NM00075 EQU   UCTFLAGS
UCTVSCAT EQU   UCTFLAGS
UCTDD    EQU   UCTAGL+60
UCTVOLP  EQU   UCTAGL+56
UCTACBP  EQU   UCTAGL+52
UCTDSN   EQU   UCTAGL+8
UCTHEAD  EQU   UCTAGL
@NM00074 EQU   LCTFLAGS
LCTVSCAT EQU   LCTFLAGS
LCTOWNER EQU   LCTINFO+24
LCTEXPIR EQU   LCTINFO+20
LCTCREAT EQU   LCTINFO+16
LCTACBP  EQU   LCTINFO+12
LCTMULVC EQU   LCTINFO+8
LCTHEAD  EQU   LCTINFO
SRTWORKP EQU   SRTAGL+28
SRTFLDLN EQU   SRTAGL+24
SRTPOSIT EQU   SRTAGL+20
SRTLEN   EQU   SRTAGL+16
SRTNUM   EQU   SRTAGL+12
SRTADDR  EQU   SRTAGL+8
SRTHEAD  EQU   SRTAGL
SV82DEBP EQU   SV82WRKP
SV82TTRP EQU   SV82LIST+8
SV82VOLP EQU   SV82DCBP
SV82UCBP EQU   SV82LIST+1
SV82CODE EQU   SV82LIST
VOLRESV3 EQU   VOLLABEL+55
VOLOWNER EQU   VOLLABEL+45
VOLRESV1 EQU   VOLLABEL+20
VOLVTOC  EQU   VOLLABEL+15
VOLSECTY EQU   VOLLABEL+14
VOLSERNO EQU   VOLLABEL+8
VOLNO    EQU   VOLLABEL+7
VOLLABI  EQU   VOLLABEL+4
VOLKEY   EQU   VOLLABEL
STAVTTR  EQU   STAEPARM+54
@NM00071 EQU   STARETRY
STAVTOC  EQU   STARETRY
STAOFF   EQU   STARETRY
STAIO05  EQU   STARETRY
@NM00070 EQU   STARCVY
STACLEAR EQU   STARCVY
STAVPOST EQU   STARCVY
STAVENQ  EQU   STARCVY
STAVDMNT EQU   STARCVY
STAVMNT  EQU   STARCVY
STATCB   EQU   STAEPARM+48
STARTADD EQU   STAEPARM+44
STAEXSAV EQU   STAEPARM+40
STARTSAV EQU   STAEPARM+36
STARTTR  EQU   STAEPARM+32
@NM00069 EQU   STAEPARM+30
STARVOL  EQU   STAEPARM+24
STARUCB  EQU   STAEPARM+20
@NM00068 EQU   STAEPARM+18
STAVVOL  EQU   STAEPARM+12
STAVUCB  EQU   STAEPARM+8
STAHEAD  EQU   STAEPARM
RCTDSET  EQU   RCTAGL+32
RCTNVOL  EQU   RCTAGL+26
RCTOVOL  EQU   RCTAGL+20
RCTNDEV  EQU   RCTAGL+16
RCTODEV  EQU   RCTAGL+12
@NM00067 EQU   RCTAGL+10
@NM00066 EQU   RCTOPT
RCTVOL   EQU   RCTOPT
RCTDEV   EQU   RCTOPT
RCTHEAD  EQU   RCTAGL
@NM00065 EQU   VSRESOPT
VSREAL   EQU   VSRESOPT
VSRES    EQU   VSRESOPT
@NM00064 EQU   VSMSG
VSTOV    EQU   VSMSG
VSFROMV  EQU   VSMSG
@NM00063 EQU   VSRETURN
VSUCAT   EQU   VSRETURN
VSVSAM   EQU   VSRETURN
@NM00062 EQU   VSCATOPT
VSLIST   EQU   VSCATOPT
VSSERIAL EQU   VSCATOPT
VSDEVICE EQU   VSCATOPT
@NM00061 EQU   VSVTOPT
VSVSFLAG EQU   VSVTOPT
VSALTTRK EQU   VSVTOPT
VSTIME   EQU   VSVTOPT
VSUCMAST EQU   VSSECOPT
VSOPCAT  EQU   VSSECOPT
VSUCTEST EQU   VSSECOPT
VSWRITE  EQU   VSSECOPT
VSREAD   EQU   VSSECOPT
VSNONONV EQU   VSSECOPT
VSMASTER EQU   VSSECOPT
VSNOVSAM EQU   VSSECOPT
VSODEVP  EQU   VS1AGL+64
VSOSERP  EQU   VS1AGL+60
VSDEVP   EQU   VS1AGL+56
VSSERP   EQU   VS1AGL+52
VSPFILEP EQU   VS1AGL+48
VSPSWDP  EQU   VS1AGL+44
VSCATDDP EQU   VS1AGL+40
VSACBP   EQU   VS1AGL+36
VSCATP   EQU   VS1AGL+32
VSNXTATP EQU   VS1AGL+28
VSNUMATP EQU   VS1AGL+24
VSIOP    EQU   VS1AGL+20
VSFILEP  EQU   VS1AGL+16
VSVOLP   EQU   VS1AGL+12
VSUCBP   EQU   VS1AGL+8
VSHEAD   EQU   VS1AGL
VSVTOCPT EQU   VS2AGL+48
@NM00060 EQU   VS2AGL+45
VSDDNAME EQU   VS2AGL+37
@NM00059 EQU   VS2RESOP
VS2REAL  EQU   VS2RESOP
VS2RES   EQU   VS2RESOP
@NM00058 EQU   VS2MSG
VS2TOV   EQU   VS2MSG
VSVOLUME EQU   VS2AGL+29
@NM00057 EQU   VSLABOPT
VSNOVTOC EQU   VSLABOPT
VSVOLSER EQU   VSLABOPT
VSOWNER  EQU   VSLABOPT
VSIOBKPT EQU   VS2AGL+24
VSVOLPTR EQU   VS2AGL+20
VSOWNPTR EQU   VS2AGL+16
VSVTOCSZ EQU   VS2AGL+12
VSUCBPTR EQU   VS2AGL+8
VS2HEAD  EQU   VS2AGL
EXPDATAL EQU   EXPARRAY+6
@NM00056 EQU   EXPARRAY+5
EXPKEYLN EQU   EXPARRAY+4
EXPDATAP EQU   EXPARRAY
EXPRECNO EQU   EXPDATAB
EXPCCHHR EQU   EXPARG+16
EXPCTLBK EQU   EXPARG+8
EXPHEAD  EQU   EXPARG
EXRWFUN  EQU   EXWRARG+46
@NM00055 EQU   EXSPACE+8
@NM00054 EQU   EXSPACE+6
@NM00053 EQU   EXSPACE+4
@NM00052 EQU   EXSPACE+1
@NM00051 EQU   EXSPACE
EXRWKDLN EQU   EXWRARG+32
@NM00050 EQU   EXWRARG+31
EXRECNUM EQU   EXRWCHR+4
EXHH     EQU   EXRWCHR+2
EXCC     EQU   EXRWCHR
EXCCWCNT EQU   EXWRARG+24
EXLOCPTR EQU   EXWRARG+20
EXRWDARE EQU   EXWRARG+16
EXRWIOAR EQU   EXWRARG+12
EXRWCTBL EQU   EXWRARG+8
EXRWRES  EQU   EXWRARG
EXGDATAL EQU   EXGARG+30
@NM00049 EQU   EXGARG+29
EXGKEYLN EQU   EXGARG+28
EXGDATAP EQU   EXGARG+24
EXGRECNO EQU   EXGARG+20
EXGCCHH2 EQU   EXGARG+16
EXGCCHH1 EQU   EXGARG+12
EXGCTLBK EQU   EXGARG+8
EXGHEAD  EQU   EXGARG
EXOVTH   EQU   EXFLG
EXORVT   EQU   EXFLG
EXORDS   EQU   EXFLG
EXOSPK   EQU   EXFLG
EXORVS   EQU   EXFLG
@NM00048 EQU   EXFLG
EXOREAD  EQU   EXFLG
@NM00047 EQU   EXOPT
EXOREP   EQU   EXOPT
EXOVTOC  EQU   EXOPT
EXONEW   EQU   EXOPT
EXOPASS  EQU   EXOPT
EXOLAB   EQU   EXOPT
EXOTAB   EQU   EXOPT
EXOCTLBK EQU   EXOARG+28
EXOUCB   EQU   EXOARG+20
EXOVSN   EQU   EXOARG+16
EXODSN   EQU   EXOARG+12
EXODDN   EQU   EXOARG+8
EXOHEAD  EQU   EXOARG
@NM00046 EQU   EXCLFLAG
EXCLMNT  EQU   EXCLFLAG
EXCLVOL  EQU   EXCLAGL+16
EXCLDDP  EQU   EXCLAGL+12
EXCLUCBP EQU   EXCLAGL+8
EXCLHEAD EQU   EXCLAGL
@NM00045 EQU   CKFLAGS
CKDMTABL EQU   CKFLAGS
CKRETTYP EQU   CKFLAGS
CKTESTVT EQU   CKFLAGS
CKLABELP EQU   CKAGL+24
CKDATYPE EQU   CKAGL+20
CKDDNAME EQU   CKAGL+12
CKUCBPTR EQU   CKAGL+8
CKHEAD   EQU   CKAGL
PULABELP EQU   PUAGL+16
PUTTRPTR EQU   PUAGL+12
PUUCBPTR EQU   PUAGL+8
PUHEAD   EQU   PUAGL
MDR      EQU   MDVTOC+4
MDHH     EQU   MDVTOC+2
MDCC     EQU   MDVTOC
@NM00044 EQU   MDAGL+31
MDVTOCTR EQU   MDFLAGS
MDFORCE  EQU   MDFLAGS
MDDEQ    EQU   MDFLAGS
MDENQ    EQU   MDFLAGS
MDWAIT   EQU   MDFLAGS
MDPOST   EQU   MDFLAGS
MDCLEAR  EQU   MDFLAGS
MDNEWVOL EQU   MDFLAGS
MDLABEL  EQU   MDAGL+24
MDPUAGL  EQU   MDAGL+20
MDDDNAME EQU   MDAGL+12
MDUCBPTR EQU   MDAGL+8
MDHEAD   EQU   MDAGL
CTTBLRR  EQU   CTARRAY+3
CTTBLHH  EQU   CTARRAY+2
CTTBLCC  EQU   CTARRAY+1
CTTBLID  EQU   CTARRAY
CTREALH  EQU   CTMSG+3
CTREALCC EQU   CTMSG+1
@NM00043 EQU   CTMSG
CMCSN2   EQU   CMMSG+28
CMCSN1   EQU   CMMSG+16
CMNUMCRT EQU   CMMSG+15
@NM00042 EQU   CMMSG+14
CMNEWVOL EQU   CMMSG+8
@NM00041 EQU   CMMSG+7
@NM00040 EQU   CMVOLFLG
CMRONLY  EQU   CMVOLFLG
CMBIND   EQU   CMVOLFLG
CMSCRCRT EQU   CMVOLFLG
CMEXCL   EQU   CMVOLFLG
CMDERAS  EQU   CMVOLFLG
CMSCRVOL EQU   CMVOLFLG
CMCECART EQU   CMVOLFLG
CMOLDVOL EQU   CMMSG
CCOLDCSN EQU   CCMSG+24
CCNEWCSN EQU   CCMSG+12
@NM00039 EQU   CCMSG+10
CCVOL    EQU   CCMSG+4
@NM00038 EQU   CCMSG+2
CCEJCODE EQU   CCMSG+1
CCPSTCDE EQU   CCMSG
@NM00037 EQU   DMPARY+15
DMPARYTP EQU   DMPARY+14
DMPARYEX EQU   DMPARY+12
DMPARYIC EQU   DMPARY+10
DMPARYSZ EQU   DMPARY+8
DMPARYNM EQU   DMPARY
@NM00036 EQU   DMPITM+15
DMPITMTP EQU   DMPITM+14
DMPITMLN EQU   DMPITM+12
DMPITMPT EQU   DMPITM+8
DMPITMNM EQU   DMPITM
@NM00035 EQU   ERCNVTAB+24
ERCPLPT  EQU   ERCNVTAB+20
ERCATRC  EQU   ERCNVTAB+16
ERDSNM   EQU   ERCNVTAB+12
@NM00034 EQU   ERCNVTAB+4
@NM00033 EQU   ERCNVTAB+3
@NM00032 EQU   EROSOPER
EROSUCDX EQU   EROSOPER
EROSCATL EQU   EROSOPER
@NM00031 EQU   EROPER
ERCATAL  EQU   EROPER
ERCATDL  EQU   EROPER
ERCATDE  EQU   EROPER
ERCATLC  EQU   EROPER
@NM00030 EQU   ERTYPE
EROSCAT  EQU   ERTYPE
ERCATLG  EQU   ERTYPE
@NM00029 EQU   FMTCNVF+1
FMTAR    EQU   FMTCNVF+1
FMTBS    EQU   FMTCNVF+1
FMTSS    EQU   FMTCNVF+1
FMTAL    EQU   FMTCNVF+1
FMTZS    EQU   FMTCNVF+1
@NM00028 EQU   FMTCNVF
FMTPU    EQU   FMTCNVF
FMTBD    EQU   FMTCNVF
FMTBHD   EQU   FMTCNVF
FMTBHA   EQU   FMTCNVF
FMTBH    EQU   FMTCNVF
FMTOLEN  EQU   FMTLIST+8
FMTRIO   EQU   FMTOCOL
FMTSPT   EQU   FMTSTO
FMTSTL   EQU   FMTILEN
@NM00027 EQU   FMTFLGS+1
FMTHDF   EQU   FMTFLGS
FMTDFF   EQU   FMTFLGS
FMTSTF   EQU   FMTFLGS
FMTREPF  EQU   FMTFLGS
FMTBDF   EQU   FMTFLGS
FMTIDF   EQU   FMTFLGS
FMTSCF   EQU   FMTFLGS
FMTEOLF  EQU   FMTFLGS
DARGDTM  EQU   DARGARY+4
DARGPCT  EQU   DARGINL
DARGREP  EQU   DARGINS
@NM00026 EQU   DARGLIST+19
DARGIND  EQU   DARGLIST+18
DARGRETL EQU   DARGLIST+16
DARGCNT  EQU   DARGLIST+14
DARGILP  EQU   DARGLIST+12
DARGSENT EQU   DARGSTID+3
DARGSMOD EQU   DARGSTID
DARGRETP EQU   DARGLIST+4
DARGDBP  EQU   DARGLIST
UVOLVOL  EQU   UVOLENT+4
UVOLDEV  EQU   UVOLENT
UVOLCNT  EQU   UVOLLIST
@NM00025 EQU   IOINFOPT
IOINFTMS EQU   IOINFOPT
IOINFSUP EQU   IOINFOPT
IOINFDSN EQU   IOINFOPT
IOINFVOL EQU   IOINFOPT
IOINFDVT EQU   IOINFOPT
OPNVOL   EQU   OPNAGL+44
@NM00024 EQU   OPNAGL+43
@NM00023 EQU   OPNOPT2
OPNOPTJM EQU   OPNOPT2
@NM00022 EQU   OPNOPT2
OPNOPTAS EQU   OPNOPT2
@NM00021 EQU   OPNDSO
OPNDSOPO EQU   OPNDSO
OPNDSOIS EQU   OPNDSO
OPNDSOPS EQU   OPNDSO
OPNDSOAM EQU   OPNDSO
OPNKYL   EQU   OPNAGL+40
OPNBLK   EQU   OPNAGL+36
OPNREC   EQU   OPNAGL+32
OPNDEVIX EQU   OPNDEV+4
OPNDEVDT EQU   OPNDEV
OPNCBP   EQU   OPNAGL+20
OPNPWA   EQU   OPNAGL+12
OPNMODRP EQU   OPNMOD
OPNMODUB EQU   OPNMOD
OPNMODRS EQU   OPNMOD
OPNMODAX EQU   OPNMOD
OPNMODRR EQU   OPNMOD
OPNMODRC EQU   OPNMOD
OPNMODPD EQU   OPNMOD
@NM00020 EQU   OPNTYP
OPNTYPRV EQU   OPNTYP
OPNTYPEX EQU   OPNTYP
OPNTYPRA EQU   OPNTYP
OPNTYPXM EQU   OPNTYP
OPNTYPCI EQU   OPNTYP
OPNTYPSO EQU   OPNTYP
OPNTYPSI EQU   OPNTYP
@NM00019 EQU   OPNRFM
OPNRFMBK EQU   OPNRFM
OPNRFMSF EQU   OPNRFM
OPNRFMUN EQU   OPNRFM
OPNRFMVR EQU   OPNRFM
OPNRFMFX EQU   OPNRFM
OPNOPTSK EQU   OPNOPT
OPNOPTDR EQU   OPNOPT
OPNOPTCR EQU   OPNOPT
OPNOPTKS EQU   OPNOPT
OPNOPTBK EQU   OPNOPT
OPNOPTUP EQU   OPNOPT
OPNOPTIN EQU   OPNOPT
IOCEXT   EQU   IOCSTR+64
IOCREL   EQU   IOCSTR+60
IOCWORK  EQU   IOCSTR+56
IOCRRN   EQU   IOCSTR+52
IOCPNM   EQU   IOCNWM+2
IOCPTL   EQU   IOCNWM
IOCKYA   EQU   IOCMEM
IOCVRC   EQU   IOCTTR
IOCCBP   EQU   IOCSTR+36
IOCHURBA EQU   IOCSTR+28
IOCVOLSR EQU   IOCSTR+22
@NM00018 EQU   IOCMSG
IOCMSGAE EQU   IOCMSG
IOCMSGCE EQU   IOCMSG
IOCMSGOE EQU   IOCMSG
IOCMSGOP EQU   IOCMSG
@NM00017 EQU   IOCMSG
IOCCHPSY EQU   IOCCHP
IOCCHPAS EQU   IOCCHP
IOCCHPBK EQU   IOCCHP
IOCCHPCR EQU   IOCCHP
IOCCHPKS EQU   IOCCHP
IOCCHPSK EQU   IOCCHP
IOCCHPDR EQU   IOCCHP
IOCCHPSQ EQU   IOCCHP
@NM00016 EQU   IOCMAC2
IOCMACPA EQU   IOCMAC2
@NM00015 EQU   IOCMAC2
IOCMACCP EQU   IOCMAC2
IOCMACRR EQU   IOCMAC2
IOCMACAS EQU   IOCMAC2
IOCMACSK EQU   IOCMAC2
@NM00014 EQU   IOCMAC
IOCMACCC EQU   IOCMAC
IOCMACDR EQU   IOCMAC
IOCMACBK EQU   IOCMAC
IOCMACCR EQU   IOCMAC
IOCMACUP EQU   IOCMAC
IOCMACOT EQU   IOCMAC
IOCMACIN EQU   IOCMAC
@NM00013 EQU   IOCRFM
IOCRFMBK EQU   IOCRFM
IOCRFMSF EQU   IOCRFM
IOCRFMUN EQU   IOCRFM
IOCRFMVR EQU   IOCRFM
IOCRFMFX EQU   IOCRFM
@NM00012 EQU   IOCDSO
IOCDSOPO EQU   IOCDSO
IOCDSOIS EQU   IOCDSO
IOCDSOPS EQU   IOCDSO
IOCDSOAM EQU   IOCDSO
IOCRKP   EQU   IOCSTR+13
IOCKYL   EQU   IOCSTR+12
IOCTRN   EQU   IOCSTR+8
IOCDLN   EQU   IOCSTR+4
IOCDAD   EQU   IOCSTR
UNITVTOC EQU   UNITABL+7
@NM00011 EQU   UNITSTAT
UNITUSHR EQU   UNITSTAT
UNITXSHR EQU   UNITSTAT
UNITISHR EQU   UNITSTAT
UNITUA   EQU   @NM00010+1
UNITCHA  EQU   @NM00010
UNITUCB  EQU   UNITABL
ALLUNCNT EQU   ALLAGL+30
ALLVLCNT EQU   ALLAGL+29
@NM00009 EQU   ALLOPT
ALLOPTUN EQU   ALLOPT
ALLOPTPV EQU   ALLOPT
ALLOPTDS EQU   ALLOPT
ALLOPTVL EQU   ALLOPT
@NM00008 EQU   ALLORG+1
ALLORGVS EQU   ALLORG+1
@NM00007 EQU   ALLORG+1
ALLORGGS EQU   ALLORG+1
ALLORGUN EQU   ALLORG
ALLORGPO EQU   ALLORG
ALLORGMQ EQU   ALLORG
ALLORGCQ EQU   ALLORG
ALLORGCX EQU   ALLORG
ALLORGDA EQU   ALLORG
ALLORGPS EQU   ALLORG
ALLORGIS EQU   ALLORG
ALLDSPUN EQU   ALLDSP
ALLDSPCG EQU   ALLDSP
ALLDSPDE EQU   ALLDSP
ALLDSPKP EQU   ALLDSP
@NM00006 EQU   ALLDSP
ALLSTSOD EQU   ALLSTS
ALLSTSMD EQU   ALLSTS
ALLSTSNW EQU   ALLSTS
ALLSTSSR EQU   ALLSTS
@NM00005 EQU   ALLSTS
ALLPWD   EQU   ALLAGL+20
ALLVLP   EQU   ALLAGL+16
ALLULP   EQU   ALLAGL+12
ALLDDN   EQU   ALLAGL+4
ALLDSN   EQU   ALLAGL
CIRPID   EQU   CIRAGL+28
CIRPWD   EQU   CIRAGL+24
CIRCAT   EQU   CIRAGL+20
CIRWKP   EQU   CIRAGL+16
CIRTLR   EQU   CIRAGL+12
CIRHDR   EQU   CIRAGL+8
CIRTLN   EQU   CIRAGL+6
CIRHLN   EQU   CIRAGL+4
@NM00004 EQU   CIRAGL+1
@NM00003 EQU   CIRTYPE
CIRTYPAQ EQU   CIRTYPE
CIRTYP1Q EQU   CIRTYPE
NEWID1   EQU   TRACE1+95
CALLID   EQU   OLDERID1+90
@NM00002 EQU   OLDERID1
*                                      END UNREFERENCED COMPONENTS
@RF00567 EQU   @RC00563
@RF00529 EQU   @EL00002
@PB00002 EQU   @EL00001
@ENDDATA EQU   *
         END   IDCRD02,(C'PLS1831',0603,77241)
