)SET DD1 = NO
)SET STEPCAT = NO
)IM AMSJCL
)SEL &AMSOPTX = A
 DEFINE ALIAS (NAME (&ALIAS) -
        RELATE(&UCAT) ) -
)ENDSEL
)SEL &AMSOPTX = D
 DELETE &ALIAS ALIAS -
)ENDSEL
)SEL &MCATPSWD = &Z
 CATALOG(&MCAT)
)ENDSEL
)SEL &MCATPSWD ^= &Z
 CATALOG(&MCAT/&MCATPSWD)
)ENDSEL
