1
-Error reporting on change notice group &CHGROUP due to error:
)SEL &LCC = 8
0The change notice group does not exist
)ENDSEL
)SEL &LCC = 12
0The ISPF Table that contains the change notices is currently open.
0Try again later.
)ENDSEL
)SEL &LCC = 16
0The ISPF Table Dataset that contains the change notice tables is not
 currently allocated.
0Contact the AOST Administrator
)ENDSEL
)SEL &LCC = 20
0A Severe ISPF Dialog Error Has Occurred....!
0Contact the AOST Administrator
)ENDSEL
