&RJCARD1
//  TIME=2,MSGLEVEL=1,REGION=1024K,PRTY=7,
//  MSGCLASS=H,NOTIFY=&ZUSER
//*MAIN SYSTEM=ANY,USER=&ZUSER
)SEL &PUP = &Z
//PDSLOAD EXEC PGM=PDSLOAD
)ENDSEL
)SEL &PUP ^= &Z
//PDSLOAD EXEC PGM=PDSLOAD,
//   PARM='&PUP'
)ENDSEL
//STEPLIB  DD DSN=AOST.LOAD,DISP=SHR
//SYSUT1   DD DISP=SHR,DSN=&PIDSN
//SYSUT2   DD DISP=SHR,DSN=&PODSN
//SYSPRINT DD SYSOUT=*
