&RJCARD1
//     TIME=5,MSGLEVEL=1,REGION=4096K,MSGCLASS=T,NOTIFY=$A1238
<//*MAIN CLASS=&SMPEJBCL×>
//*
//STEP1   EXEC PGM=PELIST,PARM='&SMPETZN,&SMPEDZN'
//STEPLIB  DD  DISP=SHR,DSN=AOST.LOAD
//WRKDISK  DD  UNIT=SYSDA,SPACE=(CYL,(3,3)),DISP=(,PASS)
//DISKIN   DD  DISP=OLD,DSN=*.WRKDISK,VOL=REF=*.WRKDISK
//REPORT   DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//GLBLCSI  DD  DISP=SHR,DSN=&SMPEGZND
//TARGCSI  DD  DISP=SHR,DSN=&SMPETZND
//DISTCSI  DD  DISP=SHR,DSN=&SMPEDZND
