)SET PARM = ADDRESS=&MACADDR,MACRO=&MACMACRO

)SEL &MACDSECT ^= &Z
)SET PARM = &PARM.,DSECT=&MACDSECT
)ENDSEL

)SEL &MACASID ^= &Z
)SET PARM = &PARM.,ASID=&MACASID
)ENDSEL

)SEL &MACFROM ^= &Z
)SET PARM = &PARM.,FROM=&MACFROM
)ENDSEL

)SEL &MACTO ^= &Z
)SET PARM = &PARM.,TO=&MACTO
)ENDSEL

)SEL &MACCMNTS = YES
)SET PARM = &PARM.,COMMENTS
)ENDSEL

)SEL &MACHEX = YES
)SET PARM = &PARM.,HEX
)ENDSEL

MACLIB &PARM
