TO +
DAP(&DAP) LOC(&BDTTNODE)  +
)SEL &INTRDR = &Z
DSN('&BDTTDSN') +
)SEL &MEM2 = ONE && &DAP = SEQ
MBR(&MBR2) +
)ENDSEL
)SEL &VOL2 ^= &Z
VOLSER(&VOL2) +
)ENDSEL
)SEL &VOLREF2 ^= &Z
VOLREF(&VOLREF2) +
)ENDSEL
)SEL &TOUNIT ^= &Z
UNIT(&TOUNIT) +
)ENDSEL
)SEL  &BDTTDISP = NEW
DISP(&BDTTDSP2) +
)SEL &BDTDCBDS ^= &Z
DCBDS('&DCBDS') +
)SEL &RECFM ^= &Z
RECFM(&RECFM) +
)ENDSEL
)SEL &LRECL ^= &Z
LRECL(&LRECL) +
)ENDSEL
)SEL &BLKSIZE ^= &Z
BLKSIZE(&BLKSIZE) +
)ENDSEL
)ENDSEL
)SEL &BDTDCBDS = &Z
RECFM(&ZALRF) LRECL(&ZALLREC) BLKSIZE(&ZALBLK) +
)ENDSEL
SPACE(&ZAL1EX,&ZAL2EX) +
)SEL &UNIT ^= BLOCK
&UNIT +
)ENDSEL
)SEL &UNIT = BLOCK
&UNIT(&ZALBLK) +
)ENDSEL
)SEL &DAP = PDS
DIR(&ZALDIR) +
)ENDSEL
)SEL &RLSE = YES
RLSE +
)ENDSEL
)ENDSEL
&BDTTDISP +
)ENDSEL
)SEL &INTRDR ^= &Z
INTRDR +
BLKSIZE(80) +
)ENDSEL
PARM(MSG=&BDTMSG)
