)SEL &RTPSEL = 5
)SEL &RTPH1 = &Z
)BLANK
)ENDSEL
)SEL &RTPH1 ^= &Z
&RTPH1
)ENDSEL
)SEL &RTPH2 = &Z
)BLANK
)ENDSEL
)SEL &RTPH2 ^= &Z
&RTPH2
)ENDSEL
)SEL &RTPH3 = &Z
)BLANK
)ENDSEL
)SEL &RTPH3 ^= &Z
&RTPH3
)ENDSEL
)SEL &RTPH4 = &Z
)BLANK
)ENDSEL
)SEL &RTPH4 ^= &Z
&RTPH4
)ENDSEL
)SEL &RTPH5 = &Z
)BLANK
)ENDSEL
)SEL &RTPH5 ^= &Z
&RTPH5
)ENDSEL
)SEL &RTPH6 = &Z
)BLANK
)ENDSEL
)SEL &RTPH6 ^= &Z
&RTPH6
)ENDSEL
)SEL &RTPH7 = &Z
)BLANK
)ENDSEL
)SEL &RTPH7 ^= &Z
&RTPH7
)ENDSEL
)SEL &RTPH8 = &Z
)BLANK
)ENDSEL
)SEL &RTPH8 ^= &Z
&RTPH8
)ENDSEL
)SEL &RTPH9 = &Z
)BLANK
)ENDSEL
)SEL &RTPH9 ^= &Z
&RTPH9
)ENDSEL
)SEL &RTPH10 = &Z
)BLANK
)ENDSEL
)SEL &RTPH10 ^= &Z
&RTPH10
)ENDSEL
)SEL &RTPH11 = &Z
)BLANK
)ENDSEL
)SEL &RTPH11 ^= &Z
&RTPH11
)ENDSEL
)SEL &RTPH12 = &Z
)BLANK
)ENDSEL
)SEL &RTPH12 ^= &Z
&RTPH12
)ENDSEL
)SEL &RTPH13 = &Z
)BLANK
)ENDSEL
)SEL &RTPH13 ^= &Z
&RTPH13
)ENDSEL
)SEL &RTPH14 = &Z
)BLANK
)ENDSEL
)SEL &RTPH14 ^= &Z
&RTPH14
)ENDSEL
)SEL &RTPH15 = &Z
)BLANK
)ENDSEL
)SEL &RTPH15 ^= &Z
&RTPH15
)ENDSEL
)SEL &RTPH16 = &Z
)BLANK
)ENDSEL
)SEL &RTPH16 ^= &Z
&RTPH16
)ENDSEL
)SEL &RTPH17 = &Z
)BLANK
)ENDSEL
)SEL &RTPH17 ^= &Z
&RTPH17
)ENDSEL
)SEL &RTPH18 = &Z
)BLANK
)ENDSEL
)SEL &RTPH18 ^= &Z
&RTPH18
)ENDSEL
)SEL &RTPH19 = &Z
)BLANK
)ENDSEL
)SEL &RTPH19 ^= &Z
&RTPH19
)ENDSEL
)SEL &RTPH20 = &Z
)BLANK
)ENDSEL
)SEL &RTPH20 ^= &Z
&RTPH20
)ENDSEL
)ENDSEL
)SEL &RTPSEL = 6
)SEL &RTPI1 = &Z
)BLANK
)ENDSEL
)SEL &RTPI1 ^= &Z
&RTPI1
)ENDSEL
)SEL &RTPI2 = &Z
)BLANK
)ENDSEL
)SEL &RTPI2 ^= &Z
&RTPI2
)ENDSEL
)SEL &RTPI3 = &Z
)BLANK
)ENDSEL
)SEL &RTPI3 ^= &Z
&RTPI3
)ENDSEL
)SEL &RTPI4 = &Z
)BLANK
)ENDSEL
)SEL &RTPI4 ^= &Z
&RTPI4
)ENDSEL
)SEL &RTPI5 = &Z
)BLANK
)ENDSEL
)SEL &RTPI5 ^= &Z
&RTPI5
)ENDSEL
)SEL &RTPI6 = &Z
)BLANK
)ENDSEL
)SEL &RTPI6 ^= &Z
&RTPI6
)ENDSEL
)SEL &RTPI7 = &Z
)BLANK
)ENDSEL
)SEL &RTPI7 ^= &Z
&RTPI7
)ENDSEL
)SEL &RTPI8 = &Z
)BLANK
)ENDSEL
)SEL &RTPI8 ^= &Z
&RTPI8
)ENDSEL
)SEL &RTPI9 = &Z
)BLANK
)ENDSEL
)SEL &RTPI9 ^= &Z
&RTPI9
)ENDSEL
)SEL &RTPI10 = &Z
)BLANK
)ENDSEL
)SEL &RTPI10 ^= &Z
&RTPI10
)ENDSEL
)SEL &RTPI11 = &Z
)BLANK
)ENDSEL
)SEL &RTPI11 ^= &Z
&RTPI11
)ENDSEL
)SEL &RTPI12 = &Z
)BLANK
)ENDSEL
)SEL &RTPI12 ^= &Z
&RTPI12
)ENDSEL
)SEL &RTPI13 = &Z
)BLANK
)ENDSEL
)SEL &RTPI13 ^= &Z
&RTPI13
)ENDSEL
)SEL &RTPI14 = &Z
)BLANK
)ENDSEL
)SEL &RTPI14 ^= &Z
&RTPI14
)ENDSEL
)SEL &RTPI15 = &Z
)BLANK
)ENDSEL
)SEL &RTPI15 ^= &Z
&RTPI15
)ENDSEL
)SEL &RTPI16 = &Z
)BLANK
)ENDSEL
)SEL &RTPI16 ^= &Z
&RTPI16
)ENDSEL
)SEL &RTPI17 = &Z
)BLANK
)ENDSEL
)SEL &RTPI17 ^= &Z
&RTPI17
)ENDSEL
)SEL &RTPI18 = &Z
)BLANK
)ENDSEL
)SEL &RTPI18 ^= &Z
&RTPI18
)ENDSEL
)SEL &RTPI19 = &Z
)BLANK
)ENDSEL
)SEL &RTPI19 ^= &Z
&RTPI19
)ENDSEL
)SEL &RTPI20 = &Z
)BLANK
)ENDSEL
)SEL &RTPI20 ^= &Z
&RTPI20
)ENDSEL
)ENDSEL
)SEL &RTPSEL = 7
)SEL &RTPJ1 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ1 ^= &Z
&RTPJ1
)ENDSEL
)SEL &RTPJ2 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ2 ^= &Z
&RTPJ2
)ENDSEL
)SEL &RTPJ3 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ3 ^= &Z
&RTPJ3
)ENDSEL
)SEL &RTPJ4 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ4 ^= &Z
&RTPJ4
)ENDSEL
)SEL &RTPJ5 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ5 ^= &Z
&RTPJ5
)ENDSEL
)SEL &RTPJ6 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ6 ^= &Z
&RTPJ6
)ENDSEL
)SEL &RTPJ7 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ7 ^= &Z
&RTPJ7
)ENDSEL
)SEL &RTPJ8 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ8 ^= &Z
&RTPJ8
)ENDSEL
)SEL &RTPJ9 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ9 ^= &Z
&RTPJ9
)ENDSEL
)SEL &RTPJ10 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ10 ^= &Z
&RTPJ10
)ENDSEL
)SEL &RTPJ11 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ11 ^= &Z
&RTPJ11
)ENDSEL
)SEL &RTPJ12 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ12 ^= &Z
&RTPJ12
)ENDSEL
)SEL &RTPJ13 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ13 ^= &Z
&RTPJ13
)ENDSEL
)SEL &RTPJ14 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ14 ^= &Z
&RTPJ14
)ENDSEL
)SEL &RTPJ15 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ15 ^= &Z
&RTPJ15
)ENDSEL
)SEL &RTPJ16 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ16 ^= &Z
&RTPJ16
)ENDSEL
)SEL &RTPJ17 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ17 ^= &Z
&RTPJ17
)ENDSEL
)SEL &RTPJ18 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ18 ^= &Z
&RTPJ18
)ENDSEL
)SEL &RTPJ19 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ19 ^= &Z
&RTPJ19
)ENDSEL
)SEL &RTPJ20 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ20 ^= &Z
&RTPJ20
)ENDSEL
)SEL &RTPJ21 = &Z
)BLANK
)ENDSEL
)SEL &RTPJ21 ^= &Z
&RTPJ21
)ENDSEL
)ENDSEL
)SEL &RTPSEL = 8
)SEL &RTPK1 = &Z
)BLANK
)ENDSEL
)SEL &RTPK1 ^= &Z
&RTPK1
)ENDSEL
)SEL &RTPK2 = &Z
)BLANK
)ENDSEL
)SEL &RTPK2 ^= &Z
&RTPK2
)ENDSEL
)SEL &RTPK3 = &Z
)BLANK
)ENDSEL
)SEL &RTPK3 ^= &Z
&RTPK3
)ENDSEL
)SEL &RTPK4 = &Z
)BLANK
)ENDSEL
)SEL &RTPK4 ^= &Z
&RTPK4
)ENDSEL
)SEL &RTPK5 = &Z
)BLANK
)ENDSEL
)SEL &RTPK5 ^= &Z
&RTPK5
)ENDSEL
)SEL &RTPK6 = &Z
)BLANK
)ENDSEL
)SEL &RTPK6 ^= &Z
&RTPK6
)ENDSEL
)SEL &RTPK7 = &Z
)BLANK
)ENDSEL
)SEL &RTPK7 ^= &Z
&RTPK7
)ENDSEL
)SEL &RTPK8 = &Z
)BLANK
)ENDSEL
)SEL &RTPK8 ^= &Z
&RTPK8
)ENDSEL
)SEL &RTPK9 = &Z
)BLANK
)ENDSEL
)SEL &RTPK9 ^= &Z
&RTPK9
)ENDSEL
)SEL &RTPK10 = &Z
)BLANK
)ENDSEL
)SEL &RTPK10 ^= &Z
&RTPK10
)ENDSEL
)SEL &RTPK11 = &Z
)BLANK
)ENDSEL
)SEL &RTPK11 ^= &Z
&RTPK11
)ENDSEL
)SEL &RTPK12 = &Z
)BLANK
)ENDSEL
)SEL &RTPK12 ^= &Z
&RTPK12
)ENDSEL
)SEL &RTPK13 = &Z
)BLANK
)ENDSEL
)SEL &RTPK13 ^= &Z
&RTPK13
)ENDSEL
)SEL &RTPK14 = &Z
)BLANK
)ENDSEL
)SEL &RTPK14 ^= &Z
&RTPK14
)ENDSEL
)SEL &RTPK15 = &Z
)BLANK
)ENDSEL
)SEL &RTPK15 ^= &Z
&RTPK15
)ENDSEL
)SEL &RTPK16 = &Z
)BLANK
)ENDSEL
)SEL &RTPK16 ^= &Z
&RTPK16
)ENDSEL
)SEL &RTPK17 = &Z
)BLANK
)ENDSEL
)SEL &RTPK17 ^= &Z
&RTPK17
)ENDSEL
)ENDSEL
)SEL &RTPSEL = 9
)SEL &RTPL1 = &Z
)BLANK
)ENDSEL
)SEL &RTPL1 ^= &Z
&RTPL1
)ENDSEL
)SEL &RTPL2 = &Z
)BLANK
)ENDSEL
)SEL &RTPL2 ^= &Z
&RTPL2
)ENDSEL
)SEL &RTPL3 = &Z
)BLANK
)ENDSEL
)SEL &RTPL3 ^= &Z
&RTPL3
)ENDSEL
)SEL &RTPL4 = &Z
)BLANK
)ENDSEL
)SEL &RTPL4 ^= &Z
&RTPL4
)ENDSEL
)SEL &RTPL5 = &Z
)BLANK
)ENDSEL
)SEL &RTPL5 ^= &Z
&RTPL5
)ENDSEL
)SEL &RTPL6 = &Z
)BLANK
)ENDSEL
)SEL &RTPL6 ^= &Z
&RTPL6
)ENDSEL
)SEL &RTPL7 = &Z
)BLANK
)ENDSEL
)SEL &RTPL7 ^= &Z
&RTPL7
)ENDSEL
)SEL &RTPL8 = &Z
)BLANK
)ENDSEL
)SEL &RTPL8 ^= &Z
&RTPL8
)ENDSEL
)SEL &RTPL9 = &Z
)BLANK
)ENDSEL
)SEL &RTPL9 ^= &Z
&RTPL9
)ENDSEL
)SEL &RTPL10 = &Z
)BLANK
)ENDSEL
)SEL &RTPL10 ^= &Z
&RTPL10
)ENDSEL
)SEL &RTPL11 = &Z
)BLANK
)ENDSEL
)SEL &RTPL11 ^= &Z
&RTPL11
)ENDSEL
)SEL &RTPL12 = &Z
)BLANK
)ENDSEL
)SEL &RTPL12 ^= &Z
&RTPL12
)ENDSEL
)SEL &RTPL13 = &Z
)BLANK
)ENDSEL
)SEL &RTPL13 ^= &Z
&RTPL13
)ENDSEL
)SEL &RTPL14 = &Z
)BLANK
)ENDSEL
)SEL &RTPL14 ^= &Z
&RTPL14
)ENDSEL
)SEL &RTPL15 = &Z
)BLANK
)ENDSEL
)SEL &RTPL15 ^= &Z
&RTPL15
)ENDSEL
)SEL &RTPL16 = &Z
)BLANK
)ENDSEL
)SEL &RTPL16 ^= &Z
&RTPL16
)ENDSEL
)SEL &RTPL17 = &Z
)BLANK
)ENDSEL
)SEL &RTPL17 ^= &Z
&RTPL17
)ENDSEL
)ENDSEL
)SEL &RTPSEL = 11
)SEL &RTPN1 = &Z
)BLANK
)ENDSEL
)SEL &RTPN1 ^= &Z
&RTPN1
)ENDSEL
)SEL &RTPN2 = &Z
)BLANK
)ENDSEL
)SEL &RTPN2 ^= &Z
&RTPN2
)ENDSEL
)SEL &RTPN3 = &Z
)BLANK
)ENDSEL
)SEL &RTPN3 ^= &Z
&RTPN3
)ENDSEL
)SEL &RTPN4 = &Z
)BLANK
)ENDSEL
)SEL &RTPN4 ^= &Z
&RTPN4
)ENDSEL
)SEL &RTPN5 = &Z
)BLANK
)ENDSEL
)SEL &RTPN5 ^= &Z
&RTPN5
)ENDSEL
)SEL &RTPN6 = &Z
)BLANK
)ENDSEL
)SEL &RTPN6 ^= &Z
&RTPN6
)ENDSEL
)SEL &RTPN7 = &Z
)BLANK
)ENDSEL
)SEL &RTPN7 ^= &Z
&RTPN7
)ENDSEL
)SEL &RTPN8 = &Z
)BLANK
)ENDSEL
)SEL &RTPN8 ^= &Z
&RTPN8
)ENDSEL
)SEL &RTPN9 = &Z
)BLANK
)ENDSEL
)SEL &RTPN9 ^= &Z
&RTPN9
)ENDSEL
)SEL &RTPN10 = &Z
)BLANK
)ENDSEL
)SEL &RTPN10 ^= &Z
&RTPN10
)ENDSEL
)SEL &RTPN11 = &Z
)BLANK
)ENDSEL
)SEL &RTPN11 ^= &Z
&RTPN11
)ENDSEL
)SEL &RTPN12 = &Z
)BLANK
)ENDSEL
)SEL &RTPN12 ^= &Z
&RTPN12
)ENDSEL
)SEL &RTPN13 = &Z
)BLANK
)ENDSEL
)SEL &RTPN13 ^= &Z
&RTPN13
)ENDSEL
)SEL &RTPN14 = &Z
)BLANK
)ENDSEL
)SEL &RTPN14 ^= &Z
&RTPN14
)ENDSEL
)SEL &RTPN15 = &Z
)BLANK
)ENDSEL
)SEL &RTPN15 ^= &Z
&RTPN15
)ENDSEL
)SEL &RTPN16 = &Z
)BLANK
)ENDSEL
)SEL &RTPN16 ^= &Z
&RTPN16
)ENDSEL
)SEL &RTPN17 = &Z
)BLANK
)ENDSEL
)SEL &RTPN17 ^= &Z
&RTPN17
)ENDSEL
)SEL &RTPN18 = &Z
)BLANK
)ENDSEL
)SEL &RTPN18 ^= &Z
&RTPN18
)ENDSEL
)SEL &RTPN19 = &Z
)BLANK
)ENDSEL
)SEL &RTPN19 ^= &Z
&RTPN19
)ENDSEL
)SEL &RTPN20 = &Z
)BLANK
)ENDSEL
)SEL &RTPN20 ^= &Z
&RTPN20
)ENDSEL
)SEL &RTPN21 = &Z
)BLANK
)ENDSEL
)SEL &RTPN21 ^= &Z
&RTPN21
)ENDSEL
)SEL &RTPN22 = &Z
)BLANK
)ENDSEL
)SEL &RTPN22 ^= &Z
&RTPN22
)ENDSEL
)SEL &RTPN23 = &Z
)BLANK
)ENDSEL
)SEL &RTPN23 ^= &Z
&RTPN23
)ENDSEL
)SEL &RTPN24 = &Z
)BLANK
)ENDSEL
)SEL &RTPN24 ^= &Z
&RTPN24
)ENDSEL
)SEL &RTPN25 = &Z
)BLANK
)ENDSEL
)SEL &RTPN25 ^= &Z
&RTPN25
)ENDSEL
)SEL &RTPN26 = &Z
)BLANK
)ENDSEL
)SEL &RTPN26 ^= &Z
&RTPN26
)ENDSEL
)SEL &RTPN27 = &Z
)BLANK
)ENDSEL
)SEL &RTPN27 ^= &Z
&RTPN27
)ENDSEL
)SEL &RTPN28 = &Z
)BLANK
)ENDSEL
)SEL &RTPN28 ^= &Z
&RTPN28
)ENDSEL
)SEL &RTPN29 = &Z
)BLANK
)ENDSEL
)SEL &RTPN29 ^= &Z
&RTPN29
)ENDSEL
)SEL &RTPN30 = &Z
)BLANK
)ENDSEL
)SEL &RTPN30 ^= &Z
&RTPN30
)ENDSEL
)SEL &RTPN31 = &Z
)BLANK
)ENDSEL
)SEL &RTPN31 ^= &Z
&RTPN31
)ENDSEL
)SEL &RTPN32 = &Z
)BLANK
)ENDSEL
)SEL &RTPN32 ^= &Z
&RTPN32
)ENDSEL
)SEL &RTPN33 = &Z
)BLANK
)ENDSEL
)SEL &RTPN33 ^= &Z
&RTPN33
)ENDSEL
)SEL &RTPN34 = &Z
)BLANK
)ENDSEL
)SEL &RTPN34 ^= &Z
&RTPN34
)ENDSEL
)SEL &RTPN35 = &Z
)BLANK
)ENDSEL
)SEL &RTPN35 ^= &Z
&RTPN35
)ENDSEL
)SEL &RTPN36 = &Z
)BLANK
)ENDSEL
)SEL &RTPN36 ^= &Z
&RTPN36
)ENDSEL
)SEL &RTPN37 = &Z
)BLANK
)ENDSEL
)SEL &RTPN37 ^= &Z
&RTPN37
)ENDSEL
)SEL &RTPN38 = &Z
)BLANK
)ENDSEL
)SEL &RTPN38 ^= &Z
&RTPN38
)ENDSEL
)SEL &RTPN39 = &Z
)BLANK
)ENDSEL
)SEL &RTPN39 ^= &Z
&RTPN39
)ENDSEL
)SEL &RTPN40 = &Z
)BLANK
)ENDSEL
)SEL &RTPN40 ^= &Z
&RTPN40
)ENDSEL
)SEL &RTPN41 = &Z
)BLANK
)ENDSEL
)SEL &RTPN41 ^= &Z
&RTPN41
)ENDSEL
)SEL &RTPN42 = &Z
)BLANK
)ENDSEL
)SEL &RTPN42 ^= &Z
&RTPN42
)ENDSEL
)SEL &RTPN43 = &Z
)BLANK
)ENDSEL
)SEL &RTPN43 ^= &Z
&RTPN43
)ENDSEL
)SEL &RTPN44 = &Z
)BLANK
)ENDSEL
)SEL &RTPN44 ^= &Z
&RTPN44
)ENDSEL
)SEL &RTPN45 = &Z
)BLANK
)ENDSEL
)SEL &RTPN45 ^= &Z
&RTPN45
)ENDSEL
)SEL &RTPN46 = &Z
)BLANK
)ENDSEL
)SEL &RTPN46 ^= &Z
&RTPN46
)ENDSEL
)SEL &RTPN47 = &Z
)BLANK
)ENDSEL
)SEL &RTPN47 ^= &Z
&RTPN47
)ENDSEL
)SEL &RTPN48 = &Z
)BLANK
)ENDSEL
)SEL &RTPN48 ^= &Z
&RTPN48
)ENDSEL
)SEL &RTPN49 = &Z
)BLANK
)ENDSEL
)SEL &RTPN49 ^= &Z
&RTPN49
)ENDSEL
)SEL &RTPN50 = &Z
)BLANK
)ENDSEL
)SEL &RTPN50 ^= &Z
&RTPN50
)ENDSEL
)SEL &RTPN51 = &Z
)BLANK
)ENDSEL
)SEL &RTPN51 ^= &Z
&RTPN51
)ENDSEL
)SEL &RTPN52 = &Z
)BLANK
)ENDSEL
)SEL &RTPN52 ^= &Z
&RTPN52
)ENDSEL
)SEL &RTPN53 = &Z
)BLANK
)ENDSEL
)SEL &RTPN53 ^= &Z
&RTPN53
)ENDSEL
)SEL &RTPN54 = &Z
)BLANK
)ENDSEL
)SEL &RTPN54 ^= &Z
&RTPN54
)ENDSEL
)SEL &RTPN55 = &Z
)BLANK
)ENDSEL
)SEL &RTPN55 ^= &Z
&RTPN55
)ENDSEL
)SEL &RTPN56 = &Z
)BLANK
)ENDSEL
)SEL &RTPN56 ^= &Z
&RTPN56
)ENDSEL
)SEL &RTPN57 = &Z
)BLANK
)ENDSEL
)SEL &RTPN57 ^= &Z
&RTPN57
)ENDSEL
)SEL &RTPN58 = &Z
)BLANK
)ENDSEL
)SEL &RTPN58 ^= &Z
&RTPN58
)ENDSEL
)SEL &RTPN59 = &Z
)BLANK
)ENDSEL
)SEL &RTPN59 ^= &Z
&RTPN59
)ENDSEL
)SEL &RTPN60 = &Z
)BLANK
)ENDSEL
)SEL &RTPN60 ^= &Z
&RTPN60
)ENDSEL
)SEL &RTPN61 = &Z
)BLANK
)ENDSEL
)SEL &RTPN61 ^= &Z
&RTPN61
)ENDSEL
)SEL &RTPN62 = &Z
)BLANK
)ENDSEL
)SEL &RTPN62 ^= &Z
&RTPN62
)ENDSEL
)SEL &RTPN63 = &Z
)BLANK
)ENDSEL
)SEL &RTPN63 ^= &Z
&RTPN63
)ENDSEL
)SEL &RTPN64 = &Z
)BLANK
)ENDSEL
)SEL &RTPN64 ^= &Z
&RTPN64
)ENDSEL
)SEL &RTPN65 = &Z
)BLANK
)ENDSEL
)SEL &RTPN65 ^= &Z
&RTPN65
)ENDSEL
)SEL &RTPN66 = &Z
)BLANK
)ENDSEL
)SEL &RTPN66 ^= &Z
&RTPN66
)ENDSEL
)SEL &RTPN67 = &Z
)BLANK
)ENDSEL
)SEL &RTPN67 ^= &Z
&RTPN67
)ENDSEL
)SEL &RTPN68 = &Z
)BLANK
)ENDSEL
)SEL &RTPN68 ^= &Z
&RTPN68
)ENDSEL
)SEL &RTPN69 = &Z
)BLANK
)ENDSEL
)SEL &RTPN69 ^= &Z
&RTPN69
)ENDSEL
)ENDSEL
