//TS14G311 JOB (TS14,TS,1,1,0),'R A CLAUER',CLASS=A,TIME=(,5),
//   MSGCLASS=Z,
//   TYPRUN=HOLD,
//   PASSWORD=
/*ROUTE  PRINT RMT9
/*JOBPARM F=LOC1,T=1,QUEUE=FETCH
//GO     EXEC PGM=P50311
//SYSUDUMP   DD  SYSOUT=Z
//SYSPRINT   DD  SYSOUT=Z
//SYSOUT     DD  SYSOUT=Z
//REPORT     DD  SYSOUT=(J,,FPN1)
//SORTWK01   DD  UNIT=SYSDA,SPACE=(CYL,(5,5))
//SORTLIB    DD  DSN=SYS1.SORTLIB,DISP=SHR
//CLASSES    DD  *
TERMINAL
$TECHSER
