         TITLE 'ISTCFMMI - MESSAGE ISSUING ROUTINE                     *
                        '
ISTCFMMI CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTCFMMI  75.182'                                 0001
         DROP  @15
@PROLOG  BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
*                                                                  0042
*/********************************************************************/
*/*                                                                  */
*/*  ISTCFMMI - MAIN LINE CODE                                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0042
*   SAVERPH=R1;                     /* SAVE RPH ADDRESS              */
         LR    SAVERPH,R1                                          0042
*   BUFPTR=RPHWEA;                  /* GET ADDRESS OF MESSAGE        */
         L     BUFPTR,RPHWEA(,RPHPTR)                              0043
*   DO;                             /* LISATCVT                    0044
*                                      CVTBASE(PAGEABLE,(ATCVTPTR))  */
*     ATCVTPTR=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     ATCVTPTR,ATCLCPTR                                   0045
*   END;                            /* LISATCVT                      */
*   RFY                                                            0047
*     ISTATCVT BASED(ATCVTPTR);                                    0047
*   DO WHILE BUFPTR^=0;             /* LOOP UNTIL NO MORE MESSAGES TO
*                                      PROCESS                       */
         B     @DE00048                                            0048
@DL00048 DS    0H                                                  0049
*     R0=MSGCONID;                  /* GET CONSOLE ID                */
         L     R0,MSGCONID(,BUFPTR)                                0049
*     R1=ADDR(MSGWPL);              /* GET MESSAGE ADDRESS           */
         LA    R1,16                                               0050
         ALR   R1,BUFPTR                                           0050
*/***** IWTO ****                                                    */
*                                                                  0051
*     DO;                                                          0051
*       GEN;                                                       0052
         WTO   MF=(E,(1))
*     END;                          /* IWTO ISSUE MESSAGE TO CONSOLE */
*     R1=SAVERPH;                   /* SET UP FOR FREESTOR AND TPDEQ */
         LR    R1,SAVERPH                                          0054
*/*  FREESTOR SIZE(LENGTH(MSGBUF))AREA(BUFPTR)FETCHP(NO)             */
*                                                                  0055
*     DO;                                                          0055
*                                                                  0055
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */
*/* END OF ATBUILD                                                   */
*                                                                  0056
*       DCL                                                        0056
*         GPR00F FIXED(31) REG(00);                                0056
*       DCL                                                        0057
*         GPR00P PTR(31) REG(00);                                  0057
*       DCL                                                        0058
*         GPR01F FIXED(31) REG(01);                                0058
*       DCL                                                        0059
*         GPR01P PTR(31) REG(01);                                  0059
*       DCL                                                        0060
*         GPR02F FIXED(31) REG(02);                                0060
*       DCL                                                        0061
*         GPR02P PTR(31) REG(02);                                  0061
*       DCL                                                        0062
*         GPR03F FIXED(31) REG(03);                                0062
*       DCL                                                        0063
*         GPR03P PTR(31) REG(03);                                  0063
*       DCL                                                        0064
*         GPR04F FIXED(31) REG(04);                                0064
*       DCL                                                        0065
*         GPR04P PTR(31) REG(04);                                  0065
*       DCL                                                        0066
*         GPR05F FIXED(31) REG(05);                                0066
*       DCL                                                        0067
*         GPR05P PTR(31) REG(05);                                  0067
*       DCL                                                        0068
*         GPR06F FIXED(31) REG(06);                                0068
*       DCL                                                        0069
*         GPR06P PTR(31) REG(06);                                  0069
*       DCL                                                        0070
*         GPR07F FIXED(31) REG(07);                                0070
*       DCL                                                        0071
*         GPR07P PTR(31) REG(07);                                  0071
*       DCL                                                        0072
*         GPR08F FIXED(31) REG(08);                                0072
*       DCL                                                        0073
*         GPR08P PTR(31) REG(08);                                  0073
*       DCL                                                        0074
*         GPR09F FIXED(31) REG(09);                                0074
*       DCL                                                        0075
*         GPR09P PTR(31) REG(09);                                  0075
*       DCL                                                        0076
*         GPR10F FIXED(31) REG(10);                                0076
*       DCL                                                        0077
*         GPR10P PTR(31) REG(10);                                  0077
*       DCL                                                        0078
*         GPR11F FIXED(31) REG(11);                                0078
*       DCL                                                        0079
*         GPR11P PTR(31) REG(11);                                  0079
*       DCL                                                        0080
*         GPR12F FIXED(31) REG(12);                                0080
*       DCL                                                        0081
*         GPR12P PTR(31) REG(12);                                  0081
*       DCL                                                        0082
*         GPR13F FIXED(31) REG(13);                                0082
*       DCL                                                        0083
*         GPR13P PTR(31) REG(13);                                  0083
*       DCL                                                        0084
*         GPR14F FIXED(31) REG(14);                                0084
*       DCL                                                        0085
*         GPR14P PTR(31) REG(14);                                  0085
*       DCL                                                        0086
*         GPR15F FIXED(31) REG(15);                                0086
*       DCL                                                        0087
*         GPR15P PTR(31) REG(15);                                  0087
*       RFY                                                        0088
*        (GPR00P,                                                  0088
*         GPR01P,                                                  0088
*         GPR02P,                                                  0088
*         GPR03P) RSTD;                                            0088
*       RFY                                                        0089
*         ISTRPH BASED(GPR01P);                                    0089
*       GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P, 0090
*           GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) SETS(RPHWORK);     0090
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
*       GPR00F=LENGTH(MSGBUF);      /* SIZE IN REG0                  */
         LA    GPR00F,283                                          0091
*       DCL                                                        0092
*         1 CMZA0008 FIXED(31) STATIC LOCAL,                       0092
*          2 * FIXED(8) INIT(64),   /* OPTION FLAGS                  */
*          2 * FIXED(8) INIT(96),   /* STORAGE KEY                   */
*          2 * FIXED(8) INIT(241),  /* SUBPOOL NUMBER                */
*          2 * FIXED(8) INIT('01'X);/* REQUEST TYPE                  */
*       GPR03F=CMZA0008;                                           0093
         L     GPR03F,CMZA0008                                     0093
*       RFY                                                        0094
*        (GPR04P) RSTD;                                            0094
*       GPR04P=BUFPTR;              /* PUT FREEMAIN ADDR IN REG4     */
         LR    GPR04P,BUFPTR                                       0095
*       DO;                         /* LISATCVT                    0096
*                                      CVTBASE(PAGEABLE,(GPR02P))    */
*         GPR02P=ATCLCPTR;          /* SET UP ATCVT POINTER          */
         L     GPR02P,ATCLCPTR                                     0097
*       END;                        /* LISATCVT                      */
*       CALL GPR02P->ATCGTSTR;      /* CALL ISTORFSR                 */
         L     @15,ATCGTSTR(,GPR02P)                               0099
         BALR  @14,@15                                             0099
*       RFY                                                        0100
*        (GPR00P,                                                  0100
*         GPR01P,                                                  0100
*         GPR02P,                                                  0100
*         GPR03P,                                                  0100
*         GPR04P) UNRSTD;                                          0100
*     END;                          /* END OF FREESTOR               */
*/* TPDEQ (,ADDR(ATCTPMPB)->DYPPAB) RETPTR(BUFPTR)                   */
*                                                                  0102
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       DCL                                                        0103
*         FMZCA027 BIT(32) CONSTANT('80000000'X);                  0103
*       DCL                                                        0104
*         FMZCB027 BIT(32) CONSTANT('7FFFFFFF'X);                  0104
*       RFY                                                        0105
*        (GPR00P,                                                  0105
*         GPR01P,                                                  0105
*         GPR14P,                                                  0105
*         GPR15P) RSTD;                                            0105
*       RFY                                                        0106
*         ISTWKE;                                                  0106
*       GPR15P=ADDR(ADDR(ATCTPMPB)->DYPPAB);/* ADDRESS QUEUE POINTER */
         LA    GPR15P,DYPPAB+1512(,ATCVTPTR)                       0107
*       GPR14P=GPR15P->PABWEQA×FMZCA027;                           0108
         L     @11,@CF00072                                        0108
         L     GPR14P,PABWEQA(,GPR15P)                             0108
         OR    GPR14P,@11                                          0108
*       IF GPR14P=FMZCA027 THEN                                    0109
         CLR   GPR14P,@11                                          0109
         BE    @RT00109                                            0109
*         ;                                                        0110
*       ELSE                                                       0111
*         DO;                                                      0111
*FMZL1027:                                                         0112
*           ;                                                      0112
FMZL1027 DS    0H                                                  0113
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA027);                  0113
         B     @DE00113                                            0113
@DL00113 DS    0H                                                  0114
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0114
         LA    GPR15P,WKECHAIN(,GPR14P)                            0114
*             GPR14P=GPR15P->PABWEQA;                              0115
         L     GPR14P,PABWEQA(,GPR15P)                             0115
*           END;                                                   0116
@DE00113 L     @11,@CF00072                                        0116
         CL    @11,WKECHAIN(,GPR14P)                               0116
         BNE   @DL00113                                            0116
*           GPR00P=FMZCA027;                                       0117
         LR    GPR00P,@11                                          0117
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0118
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0118
*           BC(7,FMZL1027);                                        0119
         BC    7,FMZL1027                                          0119
*           GPR14P->WKECHAIN=0;                                    0120
         SLR   @11,@11                                             0120
         ST    @11,WKECHAIN(,GPR14P)                               0120
*         END;                                                     0121
*ISTA0027:                                                         0122
*       ;                                                          0122
@RT00109 DS    0H                                                  0122
ISTA0027 DS    0H                                                  0123
*       GPR14P=GPR14P&FMZCB027;                                    0123
         N     GPR14P,@CF00070                                     0123
*       BUFPTR=GPR14P;                                             0124
         LR    BUFPTR,GPR14P                                       0124
*       RFY                                                        0125
*        (GPR00P,                                                  0125
*         GPR01P,                                                  0125
*         GPR14P,                                                  0125
*         GPR15P) UNRSTD;                                          0125
*     END;                          /* END TPDEQ GENERATION GET NEXT
*                                      BUFFER                        */
*   END;                            /* END OF DO WHILE BUFPTR ^= 0   */
@DE00048 SLR   @06,@06                                             0127
         CR    BUFPTR,@06                                          0127
         BNE   @DL00048                                            0127
*   IF NOCORE=ON THEN               /* IF SOMEONE TRIED TO ISSUE A 0128
*                                      MESSAGE AND NO CORE WAS     0128
*                                      AVAILABLE,                    */
         TM    NOCORE(ATCVTPTR),B'01000000'                        0128
         BNO   @RF00128                                            0128
*     DO;                           /* ISSUE THE 'NO CORE AVAILABLE
*                                      FOR MESSAGE' MESSAGE          */
*       R0=0;                       /* ISSUE TO MASTER CONSOLE       */
         LR    R0,@06                                              0130
*       R1=ADDR(NOSTRMSG);          /* POINT TO ERROR MESSAGE        */
         L     @15,ATCMSGM(,ATCVTPTR)                              0131
         L     R1,NOSTRPTR(,@15)                                   0131
         LA    R1,NOSTRMSG(,R1)                                    0131
*/***** IWTO ****                                                    */
*                                                                  0132
*       DO;                                                        0132
*         GEN;                                                     0133
         WTO   MF=(E,(1))
*       END;                        /* IWTO ISSUE ERROR MESSAGE      */
*       NOCORE=OFF;                 /* TURN OFF NOCORE FLAG WITH CS
*                                      LOGIC                         */
         L     @15,NOCORE(,ATCVTPTR)                               0135
@GL00001 LR    @14,@15                                             0135
         N     @14,@CF00694                                        0135
         CS    @15,@14,NOCORE(ATCVTPTR)                            0135
         BNE   @GL00001                                            0135
*     END;                          /* END OF NO CORE MESSAGE      0136
*                                      PROCESSING                    */
*   R1=SAVERPH;                     /* GET RPH ADDRESS FOR EXIT      */
@RF00128 LR    R1,SAVERPH                                          0137
*/* TPEXIT  NORM                                                     */
*                                                                  0138
*   DO;                                                            0138
*     RESPECIFY                                                    0139
*       GPR15P RSTD;                                               0139
*                                                                  0139
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  0140
*     DO;                           /* LISATCVT                    0140
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0141
*     END;                          /* LISATCVT                      */
*     RESPECIFY                                                    0143
*       GPR00F RSTD;                                               0143
*     GPR00F=4;                     /* SET PARAMETER REGISTER TO 4   */
         LA    GPR00F,4                                            0144
*     GPR15P=GPR15P->ATCAP31;                                      0145
         L     GPR15P,ATCAP31(,GPR15P)                             0145
*     DCL                                                          0146
*       FMZL0032 BASED(GPR15P) LABEL VALUERANGE(*);                0146
*     CALL FMZL0032;                                               0147
         BALR  @14,@15                                             0147
*     RESPECIFY                                                    0148
*      (GPR00F,                                                    0148
*       GPR15P) UNRSTD;                                            0148
*   END;                            /* **** END OF TPEXIT            */
*/* TPEPILOG                                                         */
*                                                                  0150
*   GEN(PRINT OFF);                                                0150
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0151
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0151
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*   GEN(PRINT ON);                                                 0152
*                                                                  0152
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  0153
*   END ISTCFMMI;                                                  0153
@EL00001 DS    0H                                                  0153
@EF00001 DS    0H                                                  0153
@ER00001 BR    @14                                                 0153
@DATA    DS    0H
@DATD    DSECT
         DS    0F
ISTCFMMI CSECT
         DS    0F
@CF00070 DC    XL4'7FFFFFFF'
@CF00072 DC    XL4'80000000'
@CF00694 DC    BL4'10111111111111111111111111111111'
@DATD    DSECT
         DS    0D
@ENDDATD EQU   *
ISTCFMMI CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
CMZA0008 DS    FL4
         ORG   CMZA0008
@NM00018 DC    AL1(64)
@NM00019 DC    AL1(96)
@NM00020 DC    AL1(241)
@NM00021 DC    XL1'01'
         ORG   CMZA0008+4
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
BUFPTR   EQU   @07
SAVERPH  EQU   @09
ATCVTPTR EQU   @08
RPHPTR   EQU   @01
R0       EQU   @00
R1       EQU   @01
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR04F   EQU   @04
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR15F   EQU   @15
ATCLCPTR EQU   1032
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00002 EQU   LOKCHNG+2
ISTDYPAB EQU   0
DYPPAB   EQU   ISTDYPAB+16
ISTRPH   EQU   0
RPHFLAGS EQU   ISTRPH+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   ISTRPH+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCGTSTR EQU   ATCCOM+164
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCMSGM  EQU   ISTATCVT+348
ATCHPGM  EQU   ISTATCVT+384
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ATCTPMPB EQU   ATCAOSM+600
ATCTPMMI EQU   ATCAOSM+632
ISTWPL   EQU   0
WPLMCSF  EQU   ISTWPL+2
WPLMCSF1 EQU   WPLMCSF
WPLMCSF2 EQU   WPLMCSF+1
ISTPOHD  EQU   0
POHSTAT  EQU   ISTPOHD+1
ISTRWPL  EQU   0
RWPPRTR  EQU   ISTRWPL
RWPRECB  EQU   ISTRWPL+4
ISTPOWE  EQU   0
POWRTR   EQU   ISTPOWE+8
POWWPL   EQU   ISTPOWE+16
VTAMMSGS EQU   0
NOSTRPTR EQU   VTAMMSGS+4
@NM00012 EQU   0
NOSTRMSG EQU   @NM00012+6
MSGBUF   EQU   0
MSGCONID EQU   MSGBUF
MSGRWPL  EQU   0
MSGWPL   EQU   MSGRWPL
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
FMZL0032 EQU   0
MMISWS   EQU   ATCTPMMI
NOCORE   EQU   MMISWS
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00017 EQU   MMISWS
@NM00016 EQU   MMISWS
WKECHNGP EQU   WKECHAIN+1
@NM00023 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00022 EQU   ISTWKE
@NM00015 EQU   MSGBUF+8
MSGCHAIN EQU   MSGBUF+4
MSGCONSL EQU   MSGCONID+3
@NM00014 EQU   MSGCONID
@NM00013 EQU   @NM00012
BADIDPTR EQU   VTAMMSGS
POWHDR   EQU   POWRTR+4
POWDEB   EQU   POWRTR
POWPSSQ  EQU   ISTPOWE+4
POWRSVD  EQU   ISTPOWE+2
POWLNGTH EQU   ISTPOWE+1
POWCBID  EQU   ISTPOWE
RWPWPL   EQU   ISTRWPL+8
RWPSSECB EQU   RWPRECB
RWPRPTRA EQU   RWPPRTR+1
RWPLRLN  EQU   RWPPRTR
POHID    EQU   ISTPOHD+2
POHGEN   EQU   POHSTAT
POHRREQ  EQU   POHSTAT
POHRSVD2 EQU   POHSTAT
POHCNTRL EQU   POHSTAT
POHLBL   EQU   POHSTAT
POHDATA  EQU   POHSTAT
POHEND   EQU   POHSTAT
POHRSVD1 EQU   ISTPOHD
WPLTXT   EQU   ISTWPL+4
WPLRSV02 EQU   WPLMCSF2
WPLMCSFN EQU   WPLMCSF2
WPLRSV01 EQU   WPLMCSF2
WPLSTGFL EQU   WPLMCSF2
WPLMCSFJ EQU   WPLMCSF2
WPLMCSFI EQU   WPLMCSF2
WPLMCSFH EQU   WPLMCSF1
WPLMCSFG EQU   WPLMCSF1
WPLMCSFF EQU   WPLMCSF1
WPLMCSFE EQU   WPLMCSF1
WPLMCSFD EQU   WPLMCSF1
WPLMCSFC EQU   WPLMCSF1
WPLMCSFB EQU   WPLMCSF1
WPLMCSFA EQU   WPLMCSF1
WPLLGH   EQU   ISTWPL
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00011 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
ATCRPT26 EQU   ATCAOSM+332
ATCRPT25 EQU   ATCAOSM+328
ATCRPT24 EQU   ATCAOSM+324
ATCRPT23 EQU   ATCAOSM+320
ATCRPT22 EQU   ATCAOSM+316
ATCRPT21 EQU   ATCAOSM+312
ATCRPT20 EQU   ATCAOSM+308
ATCRPT19 EQU   ATCAOSM+304
ATCRPT18 EQU   ATCAOSM+300
ATCRPT17 EQU   ATCAOSM+296
ATCRPT16 EQU   ATCAOSM+292
ATCRPT15 EQU   ATCAOSM+288
ATCRPT14 EQU   ATCAOSM+284
ATCRPT13 EQU   ATCAOSM+280
ATCRPT12 EQU   ATCAOSM+276
ATCRPT11 EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCAP37  EQU   ATCAOSM+264
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP34  EQU   ATCAOSM+32
ATCAP32  EQU   ATCAOSM+28
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
ATCRSVBB EQU   ISTATCVT+908
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00010 EQU   ISTATCVT+818
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00009 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCCDFDN EQU   ISTATCVT+464
ATCCDFIN EQU   ISTATCVT+460
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCCDFND EQU   ISTATCVT+284
ATCCDDEL EQU   ISTATCVT+280
ATCCDADD EQU   ISTATCVT+276
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCCIDM  EQU   ATCCOM+266
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00008 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00007 EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHCRR   EQU   ISTRPH+32
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00006 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00005 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00004 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   ISTRPH+1
RPHTYPE  EQU   ISTRPH
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
LOKXCL   EQU   @NM00002
LOKPRY   EQU   @NM00002
@NM00003 EQU   @NM00002
@NM00001 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   ISTCFMMI,(C'PLS1400',0603,75182)
