//T1X11    JOB ALGOLF,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*
//*        ASSEMBLE ALGOL F COMPILER MODULE IEX11
//*
//*********************************************************************
//*
//*********************************************************************
//IEX11    EXEC ASMALGF,PROJECT=ALGOLF,M=IEX11
