//T1IOR   JOB ALGOLF,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*
//*        BUILD ALGOL F RUN TIME LIBRARY MODULE IHIIOR
//*
//*********************************************************************
//*
//IHIIOR   EXEC ASMXC,PROJECT=ALGOLFRT,M=IHIIOR,SOUT='*'
