//T1FSA    JOB ALGOLF,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*
//*        BUILD ALGOL F RUN TIME LIBRARY MODULE IHIFSA
//*
//*********************************************************************
//IHIFSA   EXEC ASMXC,PROJECT=ALGOLFRT,M=IHIFSA
