//T1ERM   JOB ALGOLF,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*
//*        BUILD ALGOL F RUN TIME LIBRARY MODULE IHIERM
//*
//*********************************************************************
//*
//IHIERM   EXEC ASMXC,PROJECT=ALGOLFRT,M=IHIERM
