//T1LSC   JOB ALGOLFRT,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*
//*        BUILD ALGOL F RUN TIME LIBRARY MODULE IHILSC
//*
//*********************************************************************
//*
//IHILSC   EXEC ASMXC,PROJECT=ALGOLFRT,M=IHILSC
