//T1LAT   JOB ALGOLFRT,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*
//*        BUILD ALGOL F RUN TIME LIBRARY MODULE IHILAT
//*
//*********************************************************************
//*
//IHILAT   EXEC ASMXC,PROJECT=ALGOLFRT,M=IHILAT
