//T1RTL    JOB ALGOL,T1,CLASS=S,MSGCLASS=C
//*
//*********************************************************************
//*                                                                   *
//*        ALLOCATE THE LOAD LIBRARY FOR THE ALGOL F RUN TIME LIBRARY *
//*                                                                   *
//*********************************************************************
//*
//DELETE   EXEC PGM=IEHPROGM
//SYSPRINT  DD DUMMY
//DEV000    DD UNIT=3350,VOL=SER=DEV000,DISP=SHR
//SYSIN     DD *
        SCRATCH DSNAME=SYSD.ALGOLFRT.LOADLIB,VOL=3350=DEV000
        UNCATLG DSNAME=SYSD.ALGOLFRT.LOADLIB
//*
//*
//********************************************************************
//*
//*        GENERATE LINKAGE EDITOR BANNER
//*
//********************************************************************
//*
//GENER   EXEC PGM=IEBGENER
//SYSPRINT  DD DUMMY
//SYSIN     DD DUMMY
//SYSUT2    DD SYSOUT=A,DCB=(RECFM=FA,BLKSIZE=80,LRECL=80)
//SYSUT1    DD *
1\\\LINKEDITRELEASELVL2.1LINK EDIT ALGOL F LIBRARY
/*
//*
//*********************************************************************
//*
//*        LINK EDIT ALGOL F RUN TIME LIBRARY
//*
//*********************************************************************
//*
//ALGOLRT EXEC PGM=IEWL,PARM='LIST,LET,MAP,NCAL',REGION=1024K
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  UNIT=VIO,SPACE=(TRK,(30,10))
//OBJECT   DD  DSN=SYSD.ALGOLFRT.OBJ,DISP=SHR
//SYSLMOD  DD  DSN=SYSD.ALGOLFRT.LOADLIB,
//             UNIT=3350,VOL=SER=DEV000,
//             SPACE=(CYL,(3,5,32)),
//             DISP=(,CATLG)
//SYSLIN   DD  *
         INCLUDE  OBJECT(IHIERR)
         INCLUDE  OBJECT(IHIERM)
         IDENTIFY IHIERROR('360SLM532 V02 M01 ALGOL F LIBRARY')
         IDENTIFY IHIERMSG('360SLM532 V02 M01 ALGOL F LIBRARY')
         ENTRY    IHIERROR
         ALIAS    IHIERROR
         NAME     IHIERR(R)
         INCLUDE  OBJECT(IHIFDD)
         IDENTIFY IHIFDDXP('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHIFDD(R)
         INCLUDE  OBJECT(IHIFDI)
         IDENTIFY IHIFDIXP('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHIFDI(R)
         INCLUDE  OBJECT(IHIFII)
         IDENTIFY IHIFIIXP('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHIFII(R)
         INCLUDE  OBJECT(IHIFRI)
         IDENTIFY IHIFRIXP('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHIFRI(R)
         INCLUDE  OBJECT(IHIFRR)
         IDENTIFY IHIFRRXP('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHIFRR(R)
         INCLUDE  OBJECT(IHIFSA)
         IDENTIFY IHIFSARA('360SLM532 V02 M01 ALGOL F LIBRARY')
         IDENTIFY IHIFSARB('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIFSAIN
         NAME     IHIFSA(R)
         INCLUDE  OBJECT(IHIGPR)
         IDENTIFY IHIGPRTN('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIGPRCL
         ALIAS    IHIGPRGT
         ALIAS    IHIGPRPT
         NAME     IHIGPR(R)
         INCLUDE  OBJECT(IHIIAR)
         IDENTIFY IHIIARTN('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIIARRT
         ALIAS    IHIIARRY
         NAME     IHIIAR(R)
         INCLUDE  OBJECT(IHIIBA)
         IDENTIFY IHIIBARR('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIIBARR
         NAME     IHIIBA(R)
         INCLUDE  OBJECT(IHIIBO)
         IDENTIFY IHIIBOOL('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIIBOAR
         ALIAS    IHIIBOOL
         NAME     IHIIBO(R)
         INCLUDE  OBJECT(IHIIDE)
         IDENTIFY IHIIDECM('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIIDEAI
         ALIAS    IHIIDEII
         ALIAS    IHIIDEIR
         NAME     IHIIDE(R)
         INCLUDE  OBJECT(IHIIOR)
         IDENTIFY IHIIORTN('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIIOREN
         ALIAS    IHIIOREV
         ALIAS    IHIIORNX
         ALIAS    IHIIOROP
         NAME     IHIIOR(R)
         INCLUDE  OBJECT(IHIISY)
         IDENTIFY IHIISYMB('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIISYMB
         NAME     IHIISY(R)
         INCLUDE  OBJECT(IHILAT)
         IDENTIFY IHILATAN('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHILAT(R)
         INCLUDE  OBJECT(IHILEX)
         IDENTIFY IHILEXPT('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHILEX(R)
         INCLUDE  OBJECT(IHILLO)
         IDENTIFY IHILLOGM('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHILLO(R)
         INCLUDE  OBJECT(IHILOR)
         IDENTIFY IHILOREA('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHILORAR
         ALIAS    IHILOREL
         NAME     IHILOR(R)
         INCLUDE  OBJECT(IHILSC)
         IDENTIFY IHILSCSN('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHILSCC
         ALIAS    IHILSCS
         NAME     IHILSC(R)
         INCLUDE  OBJECT(IHILSQ)
         IDENTIFY IHILSQRT('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHILSQ(R)
         INCLUDE  OBJECT(IHIOAR)
         IDENTIFY IHIOARRY('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOARRY
         NAME     IHIOAR(R)
         INCLUDE  OBJECT(IHIOBA)
         IDENTIFY IHIOBARR('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOBARR
         NAME     IHIOAR(R)
         INCLUDE  OBJECT(IHIOBO)
         IDENTIFY IHIOBOOL('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOBOAR
         ALIAS    IHIOBOOL
         NAME     IHIOBO(R)
         INCLUDE  OBJECT(IHIOIN)
         IDENTIFY IHIOINTE('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOINAR
         ALIAS    IHIOINTG
         NAME     IHIOIN(R)
         INCLUDE  OBJECT(IHIOST)
         IDENTIFY IHIOSTRG('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOSTRG
         NAME     IHIOST(R)
         INCLUDE  OBJECT(IHIOSY)
         IDENTIFY IHIOSYMB('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOSYMB
         NAME     IHIOSY(R)
         INCLUDE  OBJECT(IHIOTA)
         IDENTIFY IHIOTARR('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIOTARR
         NAME     IHIOTA(R)
         INCLUDE  OBJECT(IHIPTT)
         IDENTIFY IHIPTTAB('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHIPTTAB
         NAME     IHIPTT(R)
         INCLUDE  OBJECT(IHISAT)
         IDENTIFY IHISATAN('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHISAT(R)
         INCLUDE  OBJECT(IHISEX)
         IDENTIFY IHISEXPT('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHISEX(R)
         INCLUDE  OBJECT(IHISLO)
         NAME     IHISLO(R)
         INCLUDE  OBJECT(IHISOR)
         IDENTIFY IHISOREA('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHISORAR
         ALIAS    IHISOREL
         NAME     IHISOR(R)
         INCLUDE  OBJECT(IHISSC)
         IDENTIFY IHISSCSN('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHISSCS
         ALIAS    IHISSCC
         NAME     IHISSC(R)
         INCLUDE  OBJECT(IHISSQ)
         IDENTIFY IHISSQRT('360SLM532 V02 M01 ALGOL F LIBRARY')
         NAME     IHISSQ(R)
         INCLUDE  OBJECT(IHISYS)
         IDENTIFY IHISYSCT('360SLM532 V02 M01 ALGOL F LIBRARY')
         ALIAS    IHISYSCT
         NAME     IHISYS(R)
/*
//
