         TITLE 'IGG0CLBJ - VSAM GENDSP                                 *
                        '
IGG0CLBJ CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLBJ  75.012'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPGDSP'
         EJECT
         B     @PB00002                                            0086
IGGPGDSP DS    0H                                                  0087
         ENTRY IGGPGDSP
         DROP @15
Z003     DS    0H                                                  0089
Z003GDSP DS    0H                                                  0090
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
*                                                                  0096
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *  */
*/*                                                                  */
*/* IGGPGDSP - VSAM GENDSP                                           */
*/*                                                                  */
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *  */
*                                                                  0096
*   IF CCACD1=RCS THEN                                             0096
*                                                                  0096
         CLI   CCACD1(R11),0                                       0096
         BNE   @RF00096                                            0096
*     /***************************************************************/
*     /*                                                             */
*     /* INSURE MINIMUM SIZE WORKAREA PROVIDED BY CALLER             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0097
*     IF WKALEN1<LENGTH(USERWKA) THEN                              0097
*                                                                  0097
         L     @10,CCACPL(,R11)                                    0097
         L     @10,CTGWKA(,@10)                                    0097
         LH    @10,WKALEN1(,@10)                                   0097
         C     @10,@CF00064                                        0097
         BNL   @RF00097                                            0097
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='BJ', CCAREASN=RSN4, CCARETRN=RCVLSM         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0098
*       CCAPROB=IGGSEGID+(RSN4*K256)+RCVLSM;/* SET ERROR AND REASON
*                                      CODE TO - CALLER'S WORKAREA 0098
*                                      TOO SMALL- SIZE NOT IN WKALEN2
*                                                            @Y30SSJG*/
         MVC   CCAPROB(4,R11),@CF02765                             0098
*     ELSE                                                         0099
*       ;                           /* WORKAREA IS BIG ENOUGH        */
@RF00097 DS    0H                                                  0100
*   ELSE                                                           0100
*     ;                             /* LOCATE UNSUCCESSFUL           */
@RF00096 DS    0H                                                  0101
*   IF CCACD1=RCS THEN              /* IF GET/LOCATE SUCCESSFUL      */
         CLI   CCACD1(R11),0                                       0101
         BNE   @RF00101                                            0101
*     IF CTGFIELD(1)->CTGFLPT(1)->CDSNFLD(1:7)^='Z999999' THEN/* IF
*                                      UNIQUE DATA SET               */
*                                                                  0102
         L     @10,CCACPL(,R11)                                    0102
         L     @10,CTGFIELD(,@10)                                  0102
         L     @10,CTGFLPT(,@10)                                   0102
         CLC   CDSNFLD(7,@10),@CC02729                             0102
         BE    @RF00102                                            0102
*       /*************************************************************/
*       /*                                                           */
*       /* CALL UNIQUE DATA SET PROCESSING SEGMENT                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0103
*Z005GUDS:                                                         0103
*       CALL IGGPGUDS;                                             0103
Z005GUDS BAL   @14,IGGPGUDS                                        0103
*     ELSE                                                         0104
*       ;                           /* NON-UNIQUE DATA SET           */
@RF00102 DS    0H                                                  0105
*   ELSE                                                           0105
*     ;                             /* LOCATE UNSUCCESSFUL           */
@RF00101 DS    0H                                                  0106
*   IF CCACD1=RCS THEN              /* IF GET/LOCATE SUCCESSFUL      */
*                                                                  0106
         CLI   CCACD1(R11),0                                       0106
         BNE   @RF00106                                            0106
*     /***************************************************************/
*     /*                                                             */
*     /* SET UP CCA FOR EXTRACT OPERATION                            */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0107
*     DO;                                                          0107
*       CCACD2=N;                   /* CLEAR ERROR CODE FOR EXTRACTS
*                                      USE                           */
         MVI   CCACD2(R11),X'00'                                   0108
*       CCAREUSE=ON;                /* ALLOW EXTRACT TO RE-USE RECORD
*                                      AREA BLOCK                    */
         OI    CCAREUSE(R11),B'00000100'                           0109
*       CCAF2NVC=ON;                /* NO VALIDITY CHECKING OF FPL'S,
*                                      WORKAREAS, OR CPL TO BE DONE
*                                      BY EXTRACT                    */
         OI    CCAF2NVC(R11),B'01000000'                           0110
*       CCAR1UR=OFF;                /* ALLOW EXTRACT TO MODIFY       */
         NI    CCAR1UR(R11),B'01111111'                            0111
*       CCAR2UR=OFF;                /* RAB 1,2, AND 3                */
         NI    CCAR2UR(R11),B'01111111'                            0112
*       CCAR3UR=OFF;                                               0113
         NI    CCAR3UR(R11),B'01111111'                            0113
*       CCAR4UR=ON;                 /* PREVENT MODIFICATION OF       */
         OI    CCAR4UR(R11),B'10000000'                            0114
*       CCAR5UR=ON;                 /* RAB 4 AND 5 BY EXTRACT        */
         OI    CCAR5UR(R11),B'10000000'                            0115
*       CCARABB=ADDR(CCARAB1);      /* ADDRESS OF BASE RAB FOR     0116
*                                      EXTRACT                       */
         LA    @10,CCARAB1(,R11)                                   0116
         ST    @10,CCARABB(,R11)                                   0116
*       CCARABF=ADDR(CCARAB1);      /* ADDRESS OF FIRST RAB AND      */
         ST    @10,CCARABF(,R11)                                   0117
*       CCARABL=ADDR(CCARAB3);      /* LAST RAB OF THREE TO BE USED
*                                      BY EXTRACT                    */
         LA    @10,CCARAB3(,R11)                                   0118
         ST    @10,CCARABL(,R11)                                   0118
*       CCAEXT=ON;                  /* INDICATE EXTRACT REQUEST      */
*                                                                  0119
         OI    CCAEXT(R11),B'00000010'                             0119
*       /*************************************************************/
*       /*                                                           */
*       /* RECORD AREA 4 AND 5 USED AS WORKAREA BY GENDSP FOR        */
*       /* CONSTRUCTION OF CPL, FPL'S, FIELD VALUES, AND RETURN AREAS*/
*       /* CLEAR RECORD AREA                                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0120
*       GWARCL(1:256)=GWARCL(1:256)&&GWARCL(1:256);                0120
         L     @10,CCAR4REC(,R11)                                  0120
         XC    GWARCL(256,@10),GWARCL(@10)                         0120
*       GWARCL(257:512)=GWARCL(257:512)&&GWARCL(257:512);          0121
         XC    GWARCL+256(256,@10),GWARCL+256(@10)                 0121
*       GWARCL(513:768)=GWARCL(513:768)&&GWARCL(513:768);          0122
         XC    GWARCL+512(256,@10),GWARCL+512(@10)                 0122
*       GWARCL(769:1024)=GWARCL(769:1024)&&GWARCL(769:1024);       0123
         XC    GWARCL+768(256,@10),GWARCL+768(@10)                 0123
*       CCAXCPL=CCAR4REC;           /* SET ADDRESS OF EXTRACT CPL    */
         ST    @10,CCAXCPL(,R11)                                   0124
*       RFY                                                        0125
*         CTGPL BASED(CCAXCPL);     /* RESPECIFY BASE OF CPL MAPPING
*                                      STRUCTURE                     */
*                                                                  0125
*       /*************************************************************/
*       /*                                                           */
*       /* SET UP CPL FOR EXTRACT REQUEST                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0126
*       CTGWKA=ADDR(GSHGWKA);       /* SET ADDRESS OF WORK AREA FOR
*                                      SPACE HEADER EXTRACT          */
         LA    @05,108                                             0126
         ALR   @05,@10                                             0126
         LA    @15,GSHGWKA(,@05)                                   0126
         ST    @15,CTGWKA(,@10)                                    0126
*       WKALEN1=LENGTH(GWARCL)-LENGTH(GWAREA)-LENGTH(GSHGDSCB);/* SET
*                                      WORKAREA LENGTH TO REMAINDER
*                                      OF RECORD AREA                */
         MVC   WKALEN1(2,@15),@CH02767                             0127
*       CTGNOFLD=ONE;               /* SET NUMBER OF FPL CHAINS TO BE
*                                      ATTACHED TO THIS CPL          */
         MVI   CTGNOFLD(@10),X'01'                                 0128
*       CTGFIELD(1)=ADDR(GFPLS(1)); /* SET ADDRESS OF FIRST FPL IN 0129
*                                      CHAIN OFF CPL                 */
         LA    @15,GFPLS(,@10)                                     0129
         ST    @15,CTGFIELD(,@10)                                  0129
*       CCAFLPT=CTGFIELD(1);        /* ESTABLISH BASE FOR FPL        */
         ST    @15,CCAFLPT(,R11)                                   0130
*       RFY                                                        0131
*         CTGPL BASED(CCACPL);      /* SET BASE OF CPL BACK TO     0131
*                                      ORIGINAL STATE                */
*                                                                  0131
*       /*************************************************************/
*       /*                                                           */
*       /* SET UP FPL FOR FIELD TO BE EXTRACTED - SPACE HEADER       */
*       /* RELREPNO (1ST FPL)                                        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0132
*       CTGFLDNO=ONE;               /* SET NUMBER OF ELEMENTS IN   0132
*                                      CTGFLDAT ARRAY TO ONE         */
         MVI   CTGFLDNO(@15),X'01'                                 0132
*       CTGFLDGC=GSHGC;             /* SET GROUP CODE FOR RELREPNO 0133
*                                      REQUEST TO SPACE HEADER GROUP
*                                      NUMBER                        */
         MVI   CTGFLDGC(@15),X'06'                                 0133
*       CTGFLDNM=ADDR(RELREPNO);    /* SET ADDRESS OF NAME OF FIELD
*                                      TO BE EXTRACTED               */
         LA    @14,RELREPNO                                        0134
         ST    @14,CTGFLDNM(,@15)                                  0134
*       CTGFLCHN=ADDR(GFPLS(2));    /* SET ADDRESS OF SECOND FPL IN
*                                      CHAIN                         */
         LA    @10,GFPLS+24(,@10)                                  0135
         ST    @10,CTGFLCHN(,@15)                                  0135
*       CCAFLPT=CTGFLCHN;           /* ESTABLISH BASE FOR SECOND FPL */
*                                                                  0136
         ST    @10,CCAFLPT(,R11)                                   0136
*       /*************************************************************/
*       /*                                                           */
*       /* SET UP FPL FOR FIELD TO BE USED FOR TEST CONDITION ON     */
*       /* EXTRACT OF SPACE HEADER RELREPNO (2ND FPL)                */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0137
*       CTGFLDNO=ONE;               /* SET NUMBER OF ELEMENTS IN   0137
*                                      CTGFLDAT ARRAY TO ONE         */
         MVI   CTGFLDNO(@10),X'01'                                 0137
*       CTGFLDCD=CTGFLDEQ;          /* SET TEST CONDITION TO EQUAL   */
         MVI   CTGFLDCD(@10),X'80'                                 0138
*       CTGFLDNM=ADDR(DSCBTS);      /* SET ADDRESS OF NAME OF FIELD
*                                      TO TEST ON                    */
         LA    @15,DSCBTS                                          0139
         ST    @15,CTGFLDNM(,@10)                                  0139
*       CTGFLNG(1)=LENGTH(GSHGDSCB);/* SET LENGTH OF TEST VALUE      */
         MVC   CTGFLNG(4,@10),@CF00048                             0140
*       CTGFLPT(1)=ADDR(GSHGDSCB);  /* SET ADDRESS OF TEST VALUE     */
*                                                                  0141
         ST    @05,CTGFLPT(,@10)                                   0141
*       /*************************************************************/
*       /*                                                           */
*       /* CALCULATE DSCB TIME STAMP VALUE FROM DATA SPACE NAME      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0142
*       GSHGDSTA(1)=CTGFIELD(1)->CTGFLPT(1)->CDSNFLD(20:26);/* GET 0142
*                                      FIRST 7 CHARACTERS OF DATA  0142
*                                      SPACE NAME TIME               */
         L     @10,CCACPL(,R11)                                    0142
         L     @10,CTGFIELD(,@10)                                  0142
         L     @10,CTGFLPT(,@10)                                   0142
         MVC   GSHGDSTA(7,@05),CDSNFLD+19(@10)                     0142
*       GSHGDSTA(2)=CTGFIELD(1)->CTGFLPT(1)->CDSNFLD(29:35);/* GET 0143
*                                      SECOND 7 CHARACTERS           */
         MVC   GSHGDSTA+7(7,@05),CDSNFLD+28(@10)                   0143
*       GSHGDSTP='F0F0F0'X;         /* SET PAD AREA TO ZERO        0144
*                                      CHARACTERS                    */
         MVC   GSHGDSTP(3,@05),@CB02741                            0144
*       DSNTIME=ADDR(GSHGFLDS);     /* SET ADDRESS OF STRUCTURE    0145
*                                      CONTAINING VALUES TO CONVERT  */
         LR    DSNTIME,@05                                         0145
*       TRTBL=ADDR(TRANSTBL)-RELBGN;/* SET ADDRESS OF RELATIVE     0146
*                                      BEGINNING OF 256 BYTE       0146
*                                      TRANSLATION TABLE             */
         LA    TRTBL,TRANSTBL                                      0146
         SL    TRTBL,@CF02717                                      0146
*       GEN REFS(TRTBL,DSNTIME) SETS(GSHGDSTW);                    0147
         TR    GSHGDSTW(SIXTN,DSNTIME),0(TRTBL)    CONVERT ALPHAS
         PACK  GSHGDSTW+TWLV(FIVE,DSNTIME),GSHGDSTW+EIGHT(NINE,DSNTIME)
*       GSHGDSCB(5:8)=GSHGDSTW(13:16);/* TO TEST VALUE AREA          */
         LA    @10,108                                             0148
         AL    @10,CCAR4REC(,R11)                                  0148
         MVC   GSHGDSCB+4(4,@10),GSHGDSTW+12(@10)                  0148
*       GEN REFS(DSNTIME) SETS(GSHGDSTW);                          0149
         PACK  GSHGDSTW+FOUR(FIVE,DSNTIME),GSHGDSTW(NINE,DSNTIME)
*       GSHGDSCB(1:4)=GSHGDSTW(5:8);                               0150
*                                                                  0150
         LA    @10,108                                             0150
         AL    @10,CCAR4REC(,R11)                                  0150
         MVC   GSHGDSCB(4,@10),GSHGDSTW+4(@10)                     0150
*       /*************************************************************/
*       /*                                                           */
*       /* CALL EXTRACT SUBFUNCTION CALL TO MODULE IGG0CLAZ          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0151
*Z006EXT:                                                          0151
*       CALL IGGPEXT;                                              0151
Z006EXT  L     @15,@CV00036                                        0151
         BALR  @14,@15                                             0151
*       CCAURAB=ADDR(CCARAB1);      /* RE-SET RAB ADDRESS            */
         LA    @10,CCARAB1(,R11)                                   0152
         ST    @10,CCAURAB(,R11)                                   0152
*     END;                                                         0153
*   ELSE                                                           0154
*     ;                             /* GET LOCATE FAILED             */
@RF00106 DS    0H                                                  0155
*   IF CCACD1=RCS THEN              /* IF EXTRACT SUCCESSFUL         */
*                                                                  0155
         CLI   CCACD1(R11),0                                       0155
         BNE   @RF00155                                            0155
*     /***************************************************************/
*     /*                                                             */
*     /* PREPARE TO PROCESS DATA SET DIRECTORY GROUP OCCURRENCES     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0156
*     DO;                                                          0156
*       CCAFLPT=ADDR(GFPLS(1));     /* SET ADDRESS OF FIRST FPL INTO
*                                      BASE POINTER                  */
         L     @10,CCAR4REC(,R11)                                  0157
         LA    @05,GFPLS(,@10)                                     0157
         ST    @05,CCAFLPT(,R11)                                   0157
*       IF CTGFLNG(1)^=N            /* EXTRACT TEST SUCCESSFUL       */
*           &CTGFLPT(1)^=N THEN     /* SPACE HEADER SEQUENCE NO.     */
         SLR   @15,@15                                             0158
         C     @15,CTGFLNG(,@05)                                   0158
         BE    @RF00158                                            0158
         C     @15,CTGFLPT(,@05)                                   0158
         BE    @RF00158                                            0158
*         DO;                                                      0159
*                                                                  0159
*           /*********************************************************/
*           /*                                                       */
*           /* SAVE SPACE HEADER SEQUENCE NUMBER FOR USE IN SCANNING */
*           /* FIELD - DSSPSN IN DATA SET DIRECTORY GROUPS           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0160
*           GDSGSHSN=GSHGRELR;                                     0160
*                                                                  0160
         LA    @14,108                                             0160
         ALR   @14,@10                                             0160
         MVC   GDSGSHSN(2,@14),GSHGRELR(@14)                       0160
*           /*********************************************************/
*           /*                                                       */
*           /* SET UP FIRST FPL FOR EXTRACT OF DATA SET DIRECTORY    */
*           /* GROUP OCCURRENCES                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0161
*           CTGFLDGC=N;             /* CLEAR GROUP CODE              */
         MVI   CTGFLDGC(@05),X'00'                                 0161
*           CTGFLDNM=ADDR(DSDIRECT);/* SET ADDRESS OF DATA SET     0162
*                                      DIRECTORY GROUP COMBINATION 0162
*                                      FIELD NAME                    */
*                                                                  0162
         LA    @09,DSDIRECT                                        0162
         ST    @09,CTGFLDNM(,@05)                                  0162
*           /*********************************************************/
*           /*                                                       */
*           /* SET UP SECOND FPL FOR TEST FOR FIRST OCCURRENCE OF    */
*           /* DATA SET DIRECTORY GROUP                              */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0163
*           CCAFLPT=ADDR(GFPLS(2)); /* SET ADDRESS OF SECOND FPL INTO
*                                      BASE POINTER                  */
         LA    @05,GFPLS+24(,@10)                                  0163
         ST    @05,CCAFLPT(,R11)                                   0163
*           CTGFLDCD=CTGFLDGT;      /* SET TEST CONDITION TO GREATER
*                                      THAN GIVEN VALUE              */
         MVI   CTGFLDCD(@05),X'20'                                 0164
*           CTGFLDGC=GDSDGC;        /* SET GROUP CODE FOR RELREPNO 0165
*                                      REQUEST TO DATA SET DIRECTORY
*                                      GROUP NUMBER                  */
         MVI   CTGFLDGC(@05),X'08'                                 0165
*           CTGFLDNM=ADDR(RELREPNO);/* SET ADDRESS OF RELREPNO FIELD
*                                      NAME                          */
         LA    @09,RELREPNO                                        0166
         ST    @09,CTGFLDNM(,@05)                                  0166
*           CTGFLNG(1)=LENGTH(GDSGRELR);/* SET LENGTH OF RELREPNO  0167
*                                      FIELD VALUE                   */
         LA    @09,2                                               0167
         ST    @09,CTGFLNG(,@05)                                   0167
*           CTGFLPT(1)=ADDR(GDSGRELR);/* SET ADDRESS OF RELREPNO   0168
*                                      FIELD VALUE                   */
         LA    @08,GDSGRELR(,@14)                                  0168
         ST    @08,CTGFLPT(,@05)                                   0168
*           GDSGRELR=ZERO;          /* SET INITIAL VALUE OF RELREPNO
*                                      TEST VALUE                    */
         STCM  @15,3,GDSGRELR(@14)                                 0169
*           CTGFLCHN=ADDR(GFPLS(3));/* SET ADDRESS OF THIRD FPL IN 0170
*                                      CHAIN                         */
         LA    @08,GFPLS+48(,@10)                                  0170
         ST    @08,CTGFLCHN(,@05)                                  0170
*           CCAFLPT=CTGFLCHN;       /* ESTABLISH BASE FOR THIRD FPL  */
*                                                                  0171
         ST    @08,CCAFLPT(,R11)                                   0171
*           /*********************************************************/
*           /*                                                       */
*           /* SET UP FPL FOR FIELD TO BE USED FOR TEST CONDITION TO */
*           /* LIMIT EXTRACT TO THE RETURN OF ONE GROUP OCCURRENCE OF*/
*           /* THE DATA SET DIRECTORY GROUP - CNTREPNO (3RD FPL)     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0172
*           CTGFLDNO=ONE;           /* SET NUMBER OF ELEMENTS IN   0172
*                                      CTGFLDAT ARRAY TO ONE         */
         MVI   CTGFLDNO(@08),X'01'                                 0172
*           CTGFLDCD=CTGFLDEQ;      /* SET TEST CONDITION TO EQUAL   */
         MVI   CTGFLDCD(@08),X'80'                                 0173
*           CTGFLDNM=ADDR(CNTREPNO);/* SET ADDRESS OF NAME OF FIELD
*                                      TO TEST ON                    */
         LA    @05,CNTREPNO                                        0174
         ST    @05,CTGFLDNM(,@08)                                  0174
*           CTGFLNG(1)=LENGTH(GDSGCNTR);/* SET LENGTH OF CNTREPNO  0175
*                                      FIELD VALUE                   */
         ST    @09,CTGFLNG(,@08)                                   0175
*           CTGFLPT(1)=ADDR(GDSGCNTR);/* SET ADDRESS OF CNTREPNO TEST
*                                      VALUE                         */
         LA    @05,GDSGCNTR(,@14)                                  0176
         ST    @05,CTGFLPT(,@08)                                   0176
*           GDSGCNTR=ONE;           /* SET NUMBER OF GROUP OCCURRENCE
*                                      TO BE RETURNED BY EXTRACT TO 1*/
*                                                                  0177
         MVC   GDSGCNTR(2,@14),@CH00043                            0177
*           /*********************************************************/
*           /*                                                       */
*           /* PREPARE WORKAREA FOR RETURN TO EXTRACTED DATA SET     */
*           /* DIRECTORY GROUP OCCURRENCE                            */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0178
*           GCWAIX=ZERO;            /* INITIALIZE INDEX TO CALLER'S
*                                      WORKAREA                      */
         ST    @15,GCWAIX(,@10)                                    0178
*           WKALEN2=LENGTH(USERWKA)+LENGTH(GCATACBA)+LENGTH(GCIAREAL);
         L     @10,CCACPL(,R11)                                    0179
         L     @10,CTGWKA(,@10)                                    0179
         MVC   WKALEN2(2,@10),@CH00256                             0179
*                                   /* SET MINIMUM SIZE OF CALLER'S
*                                      WORKAREA REQUIRED             */
*           RFY                                                    0180
*             CTGPL BASED(CCAXCPL); /* RESPECIFY BASE OF CPL MAPPING
*                                      STRUCTURE                     */
*           CTGWKA=ADDR(GDSGWKA);   /* SET ADDRESS OF WORKAREA FOR 0181
*                                      DATA SET DIRECTORY EXTRACT    */
         L     @10,CCAXCPL(,R11)                                   0181
         LA    @05,GDSGWKA(,@14)                                   0181
         ST    @05,CTGWKA(,@10)                                    0181
*           WKALEN1=LENGTH(GWARCL)-LENGTH(GWAREA)-LENGTH(GDSGFLDA);/*
*                                      SET WORKAREA LENGTH TO      0182
*                                      REMAINDER OF RECORD AREA      */
         MVC   WKALEN1(2,@05),@CH02769                             0182
*           RFY                                                    0183
*             CTGPL BASED(CCACPL);  /* SET BASE OF CPL BACK TO TO  0183
*                                      ORIGINAL STATE                */
*         END;                                                     0184
*       ELSE                        /* EXTRACT TEST FAILED           */
*                                                                  0185
*         /***********************************************************/
*         /*                                                         */
*         /* SET CCAMODID='BJ', CCAREASN=RSN0, CCARETRN=RCDSNFND     */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0185
*         CCAPROB=IGGSEGID+(RSN0*K256)+RCDSNFND;/* SET ERROR AND   0185
*                                      REASON CODE - DATA SPACE    0185
*                                      HEADER NOT FOUND FOR DATA   0185
*                                      SPACE NAME VOLUME ENTRY     0185
*                                                            @Y30SSJG*/
         B     @RC00158                                            0185
@RF00158 MVC   CCAPROB(4,R11),@CF02770                             0185
*     END;                                                         0186
*   ELSE                                                           0187
*     ;                             /* EXTRACT FAILED                */
@RF00155 DS    0H                                                  0188
*   IF CCACD1=RCS THEN              /* IF EXTRACT FAILED             */
@RC00155 CLI   CCACD1(R11),0                                       0188
         BNE   @RF00188                                            0188
*     DO;                                                          0189
*                                                                  0189
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS DATA SET DIRECTORY GROUP OCCURRENCE               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0190
*       GDSGPROC=ON;                /* SET TO CAUSE PROCESSING       */
         L     @10,CCAR4REC(,R11)                                  0190
         OI    GDSGPROC+108(@10),B'10000000'                       0190
*       DO WHILE GDSGPROC=ON;                                      0191
*                                                                  0191
         B     @DE00191                                            0191
@DL00191 DS    0H                                                  0192
*         /***********************************************************/
*         /*                                                         */
*         /* CALL EXTRACT SUBFUNCTION CALL TO MODULE IGG0CLAZ        */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0192
*Z008EXT:                                                          0192
*         CALL IGGPEXT;                                            0192
Z008EXT  L     @15,@CV00036                                        0192
         BALR  @14,@15                                             0192
*         CCAURAB=ADDR(CCARAB1);    /* RE-SET RAB ADDRESS            */
         LA    @10,CCARAB1(,R11)                                   0193
         ST    @10,CCAURAB(,R11)                                   0193
*         IF CCACD1=RCS THEN        /* NO ERROR ON EXTRACT           */
         CLI   CCACD1(R11),0                                       0194
         BNE   @RF00194                                            0194
*           DO;                                                    0195
*             CCAFLPT=ADDR(GFPLS(1));/* SET BASE POINTER FOR 1ST FPL */
         L     @10,CCAR4REC(,R11)                                  0196
         LA    @05,GFPLS(,@10)                                     0196
         ST    @05,CCAFLPT(,R11)                                   0196
*             IF CTGFLNG(1)^=N&CTGFLPT(1)^=N THEN/* EXTRACT        0197
*                                      SUCCESSFUL FOR DATA SET     0197
*                                      DIRECTORY GROUP OCCURRENCE    */
         SLR   @15,@15                                             0197
         C     @15,CTGFLNG(,@05)                                   0197
         BE    @RF00197                                            0197
         C     @15,CTGFLPT(,@05)                                   0197
         BE    @RF00197                                            0197
*               DO;                                                0198
*                                                                  0198
*                 /***************************************************/
*                 /*                                                 */
*                 /* SCAN DATA SET DIRECTORY FOR SPACE HEADER        */
*                 /* SEQUENCE NUMBER                                 */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0199
*                 GTNSN=GLDSSPSN/LENGTH(GDSSPINF);/* DETERMINE THE 0199
*                                      NUMBER OF SPACE HEADER      0199
*                                      SEQUENCE NUMBERS IN DATA SET
*                                      DIRECTORY GROUP               */
         SLR   @01,@01                                             0199
         ICM   @01,3,GLDSSPSN+119(@10)                             0199
         SLR   @00,@00                                             0199
         D     @00,@CF00420                                        0199
         LR    GTNSN,@01                                           0199
*                 GDSGSNFD=OFF;     /* INITIALIZE FOUND BIT FOR THIS
*                                      SCAN                          */
         NI    GDSGSNFD+108(@10),B'10111111'                       0200
*                 DO GDSDSNIX=1 BY 1 TO GTNSN WHILE GDSGSNFD=OFF;  0201
*                                                                  0201
         LA    GDSDSNIX,1                                          0201
         B     @DE00201                                            0201
@DL00201 L     @10,CCAR4REC(,R11)                                  0201
         LA    @05,108                                             0201
         ALR   @05,@10                                             0201
         TM    GDSGSNFD(@05),B'01000000'                           0201
         BNZ   @DC00201                                            0201
*                   /*************************************************/
*                   /*                                               */
*                   /* SCAN THROUGH THE SEQUENCE NUMBERS USING       */
*                   /* GDSDSNIX AS AN INDEX. WHEN FOUND TURN GDSGSNFD*/
*                   /* ON                                            */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0202
*                   IF GDSSPSNE(GDSDSNIX)=GDSGSHSN THEN/* IF SEQUENCE
*                                      NUMBERS MATCH                 */
         LA    @15,3                                               0202
         LR    @01,GDSDSNIX                                        0202
         MR    @00,@15                                             0202
         LA    @14,119                                             0202
         ALR   @14,@10                                             0202
         ALR   @01,@14                                             0202
         CLC   GDSSPSNE-3(2,@01),GDSGSHSN(@05)                     0202
         BNE   @RF00202                                            0202
*                     DO;                                          0203
*                       GDSGSNFD=ON;/* TURN ON SEQUENCE NUMBER FOUND
*                                      INDICATOR                     */
         OI    GDSGSNFD(@05),B'01000000'                           0204
*                       GCWAIX=GCWAIX+ONE;/* INCREMENT COUNT OF DATA
*                                      SETS IN DATA SPACE AND INDEX
*                                      TO CALLER'S WORKAREA          */
         LA    @05,1                                               0205
         AL    @05,GCWAIX(,@10)                                    0205
         ST    @05,GCWAIX(,@10)                                    0205
*                       WKALEN2=WKALEN2+LENGTH(GDSIDNO);/* INCREMENT
*                                      SIZE OF WORKAREA NEEDED OR  0206
*                                      USED                          */
         L     @10,CCACPL(,R11)                                    0206
         L     @10,CTGWKA(,@10)                                    0206
         LH    @09,WKALEN2(,@10)                                   0206
         ALR   @09,@15                                             0206
         STH   @09,WKALEN2(,@10)                                   0206
*                       IF WKALEN2<=WKALEN1 THEN/* IF WORKAREA LARGE
*                                      ENOUGH                        */
*                                                                  0207
         CH    @09,WKALEN1(,@10)                                   0207
         BH    @RF00207                                            0207
*                         /*******************************************/
*                         /*                                         */
*                         /* MOVE DATA SET CI NUMBER TO CALLER'S     */
*                         /* WORKAREA                                */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0208
*                         GDSCIN(GCWAIX)=GDSIDNO;                  0208
         LR    @01,@05                                             0208
         MR    @00,@15                                             0208
         ALR   @10,@01                                             0208
         MVC   GDSCIN+1(3,@10),GDSIDNO(@14)                        0208
*                       ELSE                                       0209
*                         ;         /* WORKAREA TOO SMALL            */
@RF00207 DS    0H                                                  0210
*                     END;                                         0210
*                   ELSE                                           0211
*                     ;             /* NO SEQUENCE NO. MATCH         */
@RF00202 DS    0H                                                  0212
*                 END;                                             0212
         AL    GDSDSNIX,@CF00043                                   0212
@DE00201 CR    GDSDSNIX,GTNSN                                      0212
         BNH   @DL00201                                            0212
@DC00201 DS    0H                                                  0213
*                 CCAFLPT=ADDR(GFPLS(2));/* SET BASE POINTER FOR 2ND
*                                      FPL                           */
         L     @10,CCAR4REC(,R11)                                  0213
         LA    @05,GFPLS+24(,@10)                                  0213
         ST    @05,CCAFLPT(,R11)                                   0213
*                 GDSGRELR=GDSRELRE;/* SET RELREPNO VALUE OF TEST FPL
*                                      TO THE VALUE OF THE DATA SET
*                                      DIRECTORY GROUP JUST PROCESSED*/
         MVC   GDSGRELR+108(2,@10),GDSRELRE+119(@10)               0214
*               END;                                               0215
*             ELSE                  /* EXTRACT FAILED                */
*               DO;                                                0216
         B     @RC00197                                            0216
@RF00197 DS    0H                                                  0217
*                 GDSGPROC=OFF;     /* ALL DATA SET DIRECTORY GROUP
*                                      OCCURRENCES HAVE BEEN       0217
*                                      PROCESSED                     */
         L     @10,CCAR4REC(,R11)                                  0217
         NI    GDSGPROC+108(@10),B'01111111'                       0217
*                 CCAFLPT=CTGFIELD(1);/* SET ADDRESS OF CALLER'S FPL
*                                      IN FPL BASE POINTER           */
         L     @05,CCACPL(,R11)                                    0218
         L     @15,CTGFIELD(,@05)                                  0218
         ST    @15,CCAFLPT(,R11)                                   0218
*                 IF GCWAIX^=ZERO THEN/* DATA SET CI NUMBER WAS FOUND*/
         L     @10,GCWAIX(,@10)                                    0219
         LTR   @10,@10                                             0219
         BZ    @RF00219                                            0219
*                   IF WKALEN2<=WKALEN1 THEN/* SUFFICIENT WORKAREA 0220
*                                      SIZE WAS PROVIDED             */
         L     @05,CTGWKA(,@05)                                    0220
         LH    @14,WKALEN2(,@05)                                   0220
         CH    @14,WKALEN1(,@05)                                   0220
         BH    @RF00220                                            0220
*                     DO;                                          0221
*                       GCIAREAL=LENGTH(GDSCIN)*GCWAIX;/* SET LENGTH
*                                      OF CI NUMBER AREA             */
         AL    @05,@CF00064                                        0222
         MH    @10,@CH00420                                        0222
         STH   @10,GCIAREAL(,@05)                                  0222
*                       GCATACBA=CCAACB;/* SET ADDRESS OF CATALOG ACB
*                                      WHERE VOLUME SERIAL NUMBER  0223
*                                      FOUND                         */
         L     @14,CCAACB(,R11)                                    0223
         ST    @14,GCATACBA(,@05)                                  0223
*                       CTGFLNG(1)=GCIAREAL+LENGTH(GCATACBA)+LENGTH(
*                           GCIAREAL);/* SET LENGTH OF VARIABLE    0224
*                                      LENGTH FIELD                  */
         AL    @10,@CF00057                                        0224
         ST    @10,CTGFLNG(,@15)                                   0224
*                       CTGFLPT(1)=ADDR(GCIAREA);/* SET ADDRESS OF 0225
*                                      VARIABLE LENGTH FIELD         */
         ST    @05,CTGFLPT(,@15)                                   0225
*                     END;                                         0226
*                   ELSE            /* INSUFFICIENT WORKAREA         */
*                                                                  0227
*                     /***********************************************/
*                     /*                                             */
*                     /* SET CCAMODID='BJ', CCAREASN=RSN0,           */
*                     /* CCARETRN=RCVLSZ                             */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0227
*                     CCAPROB=IGGSEGID+(RSN0*K256)+RCVLSZ;/* SET   0227
*                                      ERROR AND REASON CODE TO -  0227
*                                      CALLER'S WORKAREA TOO SMALL -
*                                      SIZE NEEDED IN WKALEN2      0227
*                                                            @Y30SSJG*/
         B     @RC00220                                            0227
@RF00220 MVC   CCAPROB(4,R11),@CF02772                             0227
*                 ELSE              /* DATA SET CI NO. NOT FOUND     */
*                   DO;                                            0228
         B     @RC00219                                            0228
@RF00219 DS    0H                                                  0229
*                     CTGFLNG(1)=ZERO;/* SET LENGTH AND ADDRESS IN   */
         SLR   @10,@10                                             0229
         L     @05,CCAFLPT(,R11)                                   0229
         ST    @10,CTGFLNG(,@05)                                   0229
*                     CTGFLPT(1)=ZERO;/* CALLER'S FPL TO ZERO TO   0230
*                                      INDICATE NO DATA FOUND        */
         ST    @10,CTGFLPT(,@05)                                   0230
*                   END;                                           0231
*               END;                                               0232
*           END;                                                   0233
*         ELSE                      /* EXTRACT FAILED                */
*           GDSGPROC=OFF;           /* DISCONTINUE PROCESSING DUE TO
*                                      ERROR ON EXTRACT OPERATION    */
         B     @RC00194                                            0234
@RF00194 L     @10,CCAR4REC(,R11)                                  0234
         NI    GDSGPROC+108(@10),B'01111111'                       0234
*       END;                                                       0235
@RC00194 DS    0H                                                  0235
@DE00191 L     @10,CCAR4REC(,R11)                                  0235
         TM    GDSGPROC+108(@10),B'10000000'                       0235
         BO    @DL00191                                            0235
*     END;                                                         0236
*   ELSE                                                           0237
*     ;                             /* EXTRACT FAILED                */
*                                                                  0237
@RF00188 DS    0H                                                  0238
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF IGGPGDSP                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0238
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0238
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPGUDS');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPGUDS'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0241
@EF00002 DS    0H                                                  0241
@ER00002 BR    @14                                                 0241
@PB00002 DS    0H                                                  0242
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0243
*/********************************************************************/
*/*                                                                  */
*/*        IGGPGUDS  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0243
*IGGPGUDS:                                                         0243
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00003                                            0243
IGGPGUDS DS    0H                                                  0244
*Z010:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z010GUDS:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0244
*    (R5,                                                          0244
*     R6,                                                          0244
*     R7,                                                          0244
*     R8,                                                          0244
*     R9,                                                          0244
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z010     DS    0H                                                  0244
Z010GUDS DS    0H                                                  0245
*   RFY                                                            0245
*    (R2,                                                          0245
*     R3,                                                          0245
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*                                                                  0245
*   /*****************************************************************/
*   /*                                                               */
*   /* UNIQUE DATA SET PROCESSING                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0246
*   CCASRCH=CTGFIELD(1)->CTGFLPT(1)->CDSNFLD;/* SET SEARCH ARGUMENT
*                                      TO DATA SPACE / DATA SET NAME */
*                                                                  0246
         L     @10,CCACPL(,R11)                                    0246
         L     @10,CTGFIELD(,@10)                                  0246
         L     @10,CTGFLPT(,@10)                                   0246
         MVC   CCASRCH(44,R11),CDSNFLD(@10)                        0246
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL GET SUBFUNCTION                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0247
*   DO;                                                            0247
*     CCAF1KEY=ON;                  /* TRUE NAME GET                 */
*     CCAF1KGE=OFF;                 /* NOT GET NEXT                  */
*     CCAF1UP=OFF;                  /* NOT GET UPD                   */
         OI    CCAF1KEY(R11),B'00010000'                           0250
         NI    CCAF1KGE(R11),B'11110101'                           0250
*     CCAURAB=ADDR(CCARAB1);        /* SET RAB PTR                   */
*                                                                  0251
         LA    @10,CCARAB1(,R11)                                   0251
         ST    @10,CCAURAB(,R11)                                   0251
*     /***************************************************************/
*     /*                                                             */
*     /* CALL TO MODULE IGG0CLBI                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0252
*Z012GET:                                                          0252
*     CALL IGGPGET;                 /* GET RECORD                    */
Z012GET  L     @15,@CV00037                                        0252
         BALR  @14,@15                                             0252
*   END;                                                           0253
*   IF CCACD1=RCS THEN              /* IF GET SUCCESSFUL             */
         CLI   CCACD1(R11),0                                       0254
         BNE   @RF00254                                            0254
*     DO;                                                          0255
*       WKALEN2=LENGTH(USERWKA)+LENGTH(GCIAREA)+LENGTH(GDSCIN);/* SET
*                                      LENGTH OF REQUIRED WORKAREA   */
         L     @10,CCACPL(,R11)                                    0256
         L     @05,CTGWKA(,@10)                                    0256
         LA    @15,13                                              0256
         STH   @15,WKALEN2(,@05)                                   0256
*       IF WKALEN1>=WKALEN2 THEN    /* SUFFICIENT WORKAREA           */
         CH    @15,WKALEN1(,@05)                                   0257
         BH    @RF00257                                            0257
*         DO;                                                      0258
*           GDSCIN(1)=RCDCINO;      /* SET CI NUMBER OF UNIQUE DATA
*                                      SET / DATA SPACE              */
         AL    @05,@CF00064                                        0259
         L     @01,CCAURAB(,R11)                                   0259
         L     @01,CCACPE1(,@01)                                   0259
         MVC   GDSCIN(3,@05),RCDCINO(@01)                          0259
*           GCIAREAL=LENGTH(GDSCIN);/* SET LENGTH OF CI NUMBER AREA  */
         MVC   GCIAREAL(2,@05),@CH00420                            0260
*           GCATACBA=CCAACB;        /* SET ADDRESS OF CATALOG ACB  0261
*                                      WHERE VOLUME SERIAL AND DATA
*                                      SET NAME FOUND                */
         L     @15,CCAACB(,R11)                                    0261
         ST    @15,GCATACBA(,@05)                                  0261
*           CTGFIELD(1)->CTGFLNG(1)=LENGTH(GCIAREA)+LENGTH(GDSCIN);/*
*                                      SET LENGTH OF DATA RETURNED   */
         L     @10,CTGFIELD(,@10)                                  0262
         MVC   CTGFLNG(4,@10),@CF02773                             0262
*           CTGFIELD(1)->CTGFLPT(1)=ADDR(GCIAREA);/* SET ADDRESS OF
*                                      DATA RETURNED                 */
         ST    @05,CTGFLPT(,@10)                                   0263
*         END;                                                     0264
*       ELSE                        /* INSUFFICIENT WORKAREA         */
*                                                                  0265
*         /***********************************************************/
*         /*                                                         */
*         /* SET CCAMODID='BJ', CCAREASN=RSN0, CCARETRN=RCVLSZ       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0265
*         CCAPROB=IGGSEGID+(RSN0*K256)+RCVLSZ;/* SET ERROR AND REASON
*                                      CODE TO - CALLER'S WORKAREA 0265
*                                      TOO SMALL - SIZE NEEDED IN  0265
*                                      WKALEN2               @Y30SSJG*/
         B     @RC00257                                            0265
@RF00257 MVC   CCAPROB(4,R11),@CF02772                             0265
*     END;                                                         0266
*   ELSE                            /* GET FAILED                    */
*     IF CCACD1=RCENT THEN          /* IF ENTRY NOT FOUND            */
*                                                                  0267
         B     @RC00254                                            0267
@RF00254 CLI   CCACD1(R11),8                                       0267
         BNE   @RF00267                                            0267
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='BJ', CCAREASN=RSN0, CCARETRN=RCDSNFND       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0268
*       CCAPROB=IGGSEGID+(RSN0*K256)+RCDSNFND;/* SET ERROR AND REASON
*                                      CODE TO - SPACE / DATE SET  0268
*                                      NAME NOT FOUND        @Y30SSJG*/
*                                                                  0268
         MVC   CCAPROB(4,R11),@CF02770                             0268
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF IGGPGUDS                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0269
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RF00267 DS    0H                                                  0269
@RC00254 BAL   @14,EXIT                                            0269
*   END;                            /* END OF INNER PROCEDURE        */
@EL00003 DS    0H                                                  0270
@EF00003 DS    0H                                                  0270
@ER00003 BR    @14                                                 0270
@PB00003 DS    0H                                                  0271
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0272
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0272
*EXIT:                                                             0272
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00004                                            0272
EXIT     DS    0H                                                  0273
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            0276
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00004 DS    0H                                                  0277
@EF00004 DS    0H                                                  0277
@ER00004 BR    @14                                                 0277
*   END                                                            0278
*                                                                  0278
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*                                                                  0278
*       ;                                                          0278
@EL00001 DS    0H                                                  0278
@EF00001 DS    0H                                                  0278
@ER00001 BR    @14                                                 0278
@DATA    DS    0H
@CH00256 DC    H'10'
@CH02767 DC    H'908'
@CH02769 DC    H'909'
@DATD    DSECT
         DS    0F
IGG0CLBJ CSECT
         DS    0F
@CF00043 DC    F'1'
@CH00043 EQU   @CF00043+2
@CF00420 DC    F'3'
@CH00420 EQU   @CF00420+2
@CF00064 DC    F'4'
@CF00057 DC    F'6'
@CF00048 DC    F'8'
@CF02773 DC    F'9'
@CF02717 DC    F'193'
@CF02772 DC    F'-1026490328'
@CF02770 DC    F'-1026490188'
@CF02765 DC    F'-1026489300'
@DATD    DSECT
         DS    0D
IGG0CLBJ CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00036 DC    V(IGGPEXT)
@CV00037 DC    V(IGGPGET)
         DS    0D
@CC02729 DC    C'Z999999'
@CB02741 DC    X'F0F0F0'
RELREPNO DC    CL8'RELREPNO'
DSCBTS   DC    CL8'DSCBTS  '
DSDIRECT DC    CL8'DSDIRECT'
CNTREPNO DC    CL8'CNTREPNO'
TRANSTBL DC    XL1'FA'
         DC    XL1'FB'
         DC    XL1'FC'
         DC    XL1'FD'
         DC    XL1'FE'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'FF'
         DC    XL1'F0'
         DC    XL1'F1'
         DC    XL1'F2'
         DC    XL1'F3'
         DC    XL1'F4'
         DC    XL1'F5'
         DC    XL1'F6'
         DC    XL1'F7'
         DC    XL1'F8'
         DC    XL1'F9'
@DATD    DSECT
EIGHT    EQU   8                         CONSTANT EIGHT
FIVE     EQU   5                         CONSTANT FIVE
FOUR     EQU   4                         CONSTANT FOUR
NINE     EQU   9                         CONSTANT NINE
SIXTN    EQU   16                        CONSTANT SIXTEEN
TWLV     EQU   12                        CONSTANT TWELVE
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLBJ CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
TRTBL    EQU   @02
DSNTIME  EQU   @03
GTNSN    EQU   @03
GDSDSNIX EQU   @04
RWA      EQU   @02
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R0       EQU   @00
R1       EQU   @01
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCACD2   EQU   IGGCCA+13
CCAFLG1  EQU   IGGCCA+14
CCAF1KEY EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAFLG2  EQU   IGGCCA+15
CCAF2NVC EQU   CCAFLG2
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCAFLG4  EQU   IGGCCA+17
CCAFLG5  EQU   IGGCCA+18
CCAFLG6  EQU   IGGCCA+19
CCAREUSE EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1UR  EQU   CCAR1FLG
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2UR  EQU   CCAR2FLG
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3UR  EQU   CCAR3FLG
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4UR  EQU   CCAR4FLG
CCAR4REC EQU   CCARAB4+4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5UR  EQU   CCAR5FLG
CCAR5SEG EQU   CCARAB5+8
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAMSSPL EQU   IGGCCA+300
CCACMS   EQU   IGGCCA+316
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAFLPT  EQU   IGGCCA+364
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCARABB  EQU   IGGCCA+380
CCARABF  EQU   IGGCCA+384
CCARABL  EQU   IGGCCA+388
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCAIDPT3 EQU   IGGCCA+480
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCAFLG7  EQU   IGGCCA+552
CCAFLG8  EQU   IGGCCA+553
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFLGS EQU   CCAMNAT+240
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGNOFLD EQU   CTGPL+19
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFIELD EQU   CTGPL+28
CTGFL    EQU   0
CTGFLDNO EQU   CTGFL
CTGFLDCD EQU   CTGFL+1
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLCHN EQU   CTGFL+12
CTGFLDAT EQU   CTGFL+16
CTGFLNG  EQU   CTGFLDAT
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKALEN1  EQU   USERWKA
WKALEN2  EQU   USERWKA+2
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGOGC1 EQU   CATGOPT+3
CATGOSEQ EQU   CATGOPT+4
CATRCD   EQU   0
RCDCINO  EQU   CATRCD+1
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
VARFIELD EQU   0
CNTRLINF EQU   0
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXFLG3  EQU   IGGCAXWA+10
CAXCCR   EQU   IGGCAXWA+32
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
GWAREA   EQU   0
GCPL     EQU   GWAREA
GFPLS    EQU   GWAREA+32
GCWAIX   EQU   GWAREA+104
GFIELDA  EQU   GWAREA+108
GSHGFLDS EQU   0
GSHGDSCB EQU   GSHGFLDS
GSHGWKA  EQU   GSHGFLDS+8
GSHGRELR EQU   GSHGWKA+4
GSHGDSTW EQU   GSHGWKA+6
GSHGDSTA EQU   GSHGDSTW
GSHGDSTP EQU   GSHGDSTW+14
GDSGFLDS EQU   0
GDSGFLDA EQU   GDSGFLDS
GDSGSHSN EQU   GDSGFLDA
GDSGFLGS EQU   GDSGFLDA+2
GDSGPROC EQU   GDSGFLGS
GDSGSNFD EQU   GDSGFLGS
GDSGRELR EQU   GDSGFLDA+3
GDSGCNTR EQU   GDSGFLDA+5
GDSGWKA  EQU   GDSGFLDS+7
GDSGDSDI EQU   GDSGWKA+4
GDSDIREC EQU   0
GDSRELRE EQU   GDSDIREC
GDSIDNO  EQU   GDSDIREC+3
GLDSSPSN EQU   GDSDIREC+7
GDSSPSN  EQU   GDSDIREC+9
GDSSPINF EQU   GDSSPSN
GDSSPSNE EQU   GDSSPINF
CDSNFLD  EQU   0
GCIAREA  EQU   0
GCATACBA EQU   GCIAREA
GCIAREAL EQU   GCIAREA+4
GDSCIN   EQU   GCIAREA+6
CATSN    EQU   0
CI       EQU   0
CTGVLDSP EQU   0
FIELDNM  EQU   0
TNAM     EQU   0
@NM00037 EQU   CTGDDNM
CTGPROB  EQU   @NM00037
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
GWARCL   EQU   GWAREA
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00087 EQU   MCATDSTR+1
@NM00086 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
GDSSPNEX EQU   GDSSPINF+2
GDSDIRFL EQU   GDSDIREC+6
GNODSEXT EQU   GDSDIREC+2
GDSGWKAH EQU   GDSGWKA
@NM00097 EQU   GDSGFLGS
GSHGWKAH EQU   GSHGWKA
GCTGFLDA EQU   GFPLS+16
GCTGFL   EQU   GFPLS
GCTGFIEL EQU   GCPL+28
GCTGPL   EQU   GCPL
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00096 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00095 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVPWD EQU   CTGFV+84
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVATR EQU   CTGFV+60
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVVLT EQU   CTGFV+40
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVENT EQU   CTGFV+20
CTGFVIND EQU   CTGFV+16
CTGFVVCH EQU   CTGFV+12
CTGFVICH EQU   CTGFV+8
CTGFVDCH EQU   CTGFV+4
@NM00094 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00093 EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXCCA   EQU   IGGCAXWA+104
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00092 EQU   COPTS
CENLST   EQU   COPTS
@NM00091 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXUCB   EQU   IGGCAXWA+28
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00090 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00089 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2REC EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00088 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00085 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00084 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00083 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00082 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00081 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00080 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00079 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00078 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00077 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00076 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00051 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBRSV48 EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00050 EQU   TCB+296
TCBSCBQ  EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBRSV36 EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBRSV35 EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00049 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBRSV04 EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00048 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00047 EQU   CVTFIX+248
@NM00046 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
LENFIX   EQU   CNTRLINF+1
CNTVAR   EQU   CNTRLINF
VARINFO  EQU   VARFIELD+2
VARLEN   EQU   VARFIELD
REPGOPT  EQU   REPCNTRL+6
REPCNT   EQU   REPCNTRL+5
@NM00045 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
NREPLF   EQU   CATRCD+48
NREPCV   EQU   CATRCD+47
RCDSIZ   EQU   CATRCD+45
RCDID    EQU   CATRCD+44
@NM00044 EQU   CATRCD+26
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRADT EQU   CATRCD+14
RCDCRACI EQU   CATRCD+11
RCDCRAVL EQU   CATRCD+5
RCDRELID EQU   CATRCD+4
RCDKEYTY EQU   CATRCD
CATGOGC  EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOEXT EQU   CATGOGC1
CATGODSP EQU   CATGOCI+1
@NM00043 EQU   CATGOFLG
CCACPE4  EQU   CCARAB+16
CCACPE3  EQU   CCARAB+12
@NM00042 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00041 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
DIC2LC   EQU   DIC2ENT+2
DIC2ST   EQU   DIC2ENT+1
@NM00040 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2VAR  EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
DICTLC   EQU   DICTENT+2
DICTST   EQU   DICTENT+1
@NM00039 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
CTGFLDTS EQU   CTGFLDRE
@NM00038 EQU   CTGFLDRE
CTGPSWD  EQU   CTGJSCB
@NM00036 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGTYPE  EQU   CTGPL+18
@NM00035 EQU   CTGDSORG
CTGOPTNS EQU   CTGDSORG
@NM00034 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGFUNC  EQU   CTGOPTN3
@NM00033 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGNAME  EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1492
CCADGDGA EQU   IGGCCA+1488
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
@NM00032 EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00031 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
@NM00030 EQU   IGGCCA+1416
CCACUMPL EQU   IGGCCA+1412
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00029 EQU   CCAREGS
@NM00028 EQU   IGGCCA+1057
@NM00027 EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNADR EQU   CCAMNCAT+252
CCAMNLEN EQU   CCAMNCAT+249
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00026 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00025 EQU   CCAMNAT+1
@NM00024 EQU   MNATTOP
MNATFULL EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00023 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00022 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00021 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
@NM00020 EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCAGVEXT EQU   IGGCCA+488
CCANEVV  EQU   IGGCCA+486
CCAGVCT  EQU   IGGCCA+484
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00019 EQU   IGGCCA+400
CCASN1   EQU   CCASN
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCAMCPL  EQU   CCAXCPL
CCARABPT EQU   IGGCCA+368
CCATFLPT EQU   CCAFLPT
CCAILNG  EQU   IGGCCA+360
CCASL    EQU   IGGCCA+358
CCAGOPLN EQU   IGGCCA+356
CCACPE71 EQU   IGGCCA+352
CCAIDPT  EQU   CCACPE7
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCACMSWA EQU   CCACMS
CCARPRM  EQU   IGGCCA+312
@NM00018 EQU   CCAMSSPL+10
CCAMNSPL EQU   CCAMSSPL+9
@NM00017 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00016 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCI  EQU   IGGCCA+271
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCARPL1  EQU   IGGCCA+220
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
@NM00015 EQU   IGGCCA+212
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
CCAR5REC EQU   CCARAB5+4
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
CCAR3REC EQU   CCARAB3+4
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
CCAR1REC EQU   CCARAB1+4
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
CCAR0REC EQU   CCARAB0+4
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCASRCIN EQU   CCASRID
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAMOD   EQU   CCAFLG6
CCASUPFD EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNC  EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCAMODID EQU   CCAPROB
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
@NM00075 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00074 EQU   PSA+1040
PSAUSEND EQU   PSA+1040
PSARV062 EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00073 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00072 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00071 EQU   FLCFSA
@NM00070 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00069 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00068 EQU   FLCIOA
@NM00067 EQU   FLCMCLA+15
@NM00066 EQU   FLCMCLA+14
@NM00065 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00064 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00063 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00062 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00061 EQU   FLCPER
@NM00060 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00059 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00058 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00057 EQU   FLCPIILC
@NM00056 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00055 EQU   FLCSVILC
@NM00054 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00053 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00052 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00158 EQU   @RC00155
@RC00197 EQU   @RC00194
@RC00219 EQU   @RC00194
@RC00257 EQU   @RC00254
@PB00004 EQU   @EL00001
@RC00220 EQU   @RC00219
@ENDDATA EQU   *
         END   IGG0CLBJ,(C'PLS1036',0602,75012)
