/*JOBPARM N=1
//* ********************************************************
//* *  INSTALL THE 'OFFLINE' SUBCOMMAND OF EDIT            *
//* ********************************************************
//ASMH   EXEC ASFIASML,BANNER=OFFLINE,
//             PARM.ASM='LOAD,NODECK,TERM,XREF(SHORT),BATCH',
//             PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//ASM.SYSIN DD DSN=ASFI00U.FI110.TSOSRC(IKJE9OF),DISP=SHR
//ASM.SYSTERM DD SYSOUT=A,HOLD=YES
//LKED.SYSLMOD DD DSN=SYS1.LINKLOAD,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 ALIAS OFFLINE#
 NAME IKJE9OF(R)
/*
