//* ********************************************************
//* *  INSTALL THE 'NAME' SUBCOMMAND OF EDIT               *
//* ********************************************************
//ASSEMH EXEC ASMHCL,
//             PARM.ASM='NOSQUISH,LOAD,NODECK,TERM,XREF(SHORT)',
//             PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//SYSIN    DD DSN=ASFI00U.FI100.TSOSRC(IKJE9NA),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.LINKLOAD,DISP=SHR
//LKED.SYSIN DD *
 ALIAS NAME#
 NAME IKJE9NA(R)
/*
