//SMP210J1 JOB (9999,TTEC,999998ZT),ZZZZZ,CLASS=5,MSGCLASS=1,
//         NOTIFY=TECKJD,
//         USER=*
//*
//*  DFDS/RACF VOLUME ALLOCATION EXIT
//*
//PROC#1   EXEC TECPAN
++CONTROL 39
++USING PAN1T001
++WRITE WORK,SMP210
//PROC#2   EXEC TECASM,D1=SYSTMG,OPT='RENT'
//PROC#3   EXEC SMP4,SYS=G
//SMPCNTL   DD  *
  RESTORE S (SMP0210) DIS(NO).
  REJECT  S (SMP0210) .
  RECEIVE S (SMP0210) .
  APPLY   S (SMP0210) DIS(NO).
//SMPPTFIN  DD  *
++USERMOD (SMP0210) .    /* DFDS/RACF VOLUME ALLOCATION EXIT */
++VER (Z038) FMID(JDM1134) .
++MOD  (IGGPRE00) .
//          DD DSN=&LOADSET,DISP=(OLD,DELETE)
