DECO     TITLE 'DECOMP DUMMY'
***********************************************************************
*                                                                     *
*  called by PASS4                                                    *
*                                                                     *
***********************************************************************
DECOMP   CSECT
         USING *,15
         L     15,20(1)
         BR    13
         END
