//HANDOUT JOB (CCP64,1B),'QUANDRY HANDOUTS',NOTIFY=CCP11,REGION=64K
/*JOBPARM TIME=09,LINES=2K
/*ROUTE  PRINT LOCAL
/*OUTPUT 7201 FORMS=7201,COPIES=50
// EXEC TAPECOPY
//OLDFILE DD DSNAME=CCP11.Q2.TEXT,DISP=SHR
//* CCP11.Q2.TEXT IS LIKE Q.TEXT BUT SLID OVER ONE SPACE.
//NEWFILE DD SYSOUT=(A,,7201)
//
