BDTWAIT  $PROLOG R12
         PARM
         STIMER WAIT,DINTVL=WAITTIME
         $EPILOG 0
PARM     DS    0D
WAITTIME DC    CL8'00001500'
         END
