         MACRO
         IEPMACRO
IEPDSECT DSECT
IEPGLV   DS       F                SP & SIZE
IEPAUTH  DS       CL1              GROUP AUTHORITY
IEPFLAG1 DS       CL1              FLAG1
         DS       CL2              RESERVED
         MEND
