         MACRO                                                    -DGH-
         UJIMAP
***********************************************************************
*
*        MAP OF THE PARAMETER LIST PASSED TO IEFUJI IN R1
*
*        INSTALLED ON: 04/28/78; BY: DGH.
*
***********************************************************************
UJIMAP   DSECT
UJICEPA  DS    A             .ADDR OF COMMON EXIT PARAMETER AREA
UJIPGMRN DS    A             .ADDR OF 20-BYTE PGMR NAME FIELD
UJIPRTY  DS    A             .ADDR OF 1-BYTE JOB SELECTION PRIORIT
UJIJOBA  DS    A             .ADDR OF VAR-LENGTH JOB ACCTING INFO
         MEND
