         MACRO
&NAME    QCLNK
&NAME    L     R2,QCMD1PTR    LOAD CMDSBMON PARMLIST
         L     R15,0(0,R2)    CMDSBMON OUTPUT ROUTINE ENTRY ADDR
         BALR  R14,R15
         MEND
