         MACRO
         EXIT
.*              STRUCTURED MACRO TO EXIT IF STATEMENTS
.*                   02/09/78 TGA ... RNB
         MEXIT
         MEND
