//JOB1 JOB
//*****************************************************************
//*                                                               *
//*  THIS JOB DELETES UNUSED LOAD MODULES FROM SYSTEM LIBRARIES   *
//*  AFTER INSTALLING FDS1643                                     *
//*                                                               *
//*****************************************************************
//STEP1 EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=A
//*****************************************************************
//*                                                               *
//* THE FOLLOWING STATEMENT DEFINES THE VOLUME UPON WHICH         *
//* SYS1.LINKLIB RESIDES , UPDATE THE VOLUME SERIAL AND UNIT      *
//* PARAMETERS BEFORE EXECUTING THE JOB                           *
//*                                                               *
//*****************************************************************
//VOLUME DD DISP=OLD,VOL=SER=XXXXXX,UNIT=****
//SYSIN DD *
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKEX02,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKEX03,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKIO02,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKSA05,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKRI01,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKRIKT,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKRILT,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTP04,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTP05,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSEX0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSTP0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSTP1,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSSA0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSIO0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSRI0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSUV0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSCC0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSEF0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKTSDV0,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKCDIN,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKCDRF,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKCDIT,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKDAS1,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKIN01,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKIT01,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKRF01,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.LINKLIB,MEMBER=ICKVLBL,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.SAMPLIB,MEMBER=ICLSAV2,VOL=****=XXXXXX
  SCRATCH DSNAME=SYS1.SAMPLIB,MEMBER=SAMPL84,VOL=****=XXXXXX
/*
//JOB2 JOB
//*****************************************************************
//*                                                               *
//*  THIS JOB SUPPLIES THE UCLIN TO CORRECT THE CDS               *
//*  AFTER INSTALLING FDS1643                                     *
//*                                                               *
//*  NOTE THAT THE UNIT PARAMETER IN THE FOLLOWING JCL MAY HAVE   *
//*  TO BE CHANGED SPECIFIC TO USERS INSTALLATION, AND ADDITION-  *
//*  ALLY THE SPACE PARAMETERS MAY HAVE TO BE CHANGED.            *
//*                                                               *
//*****************************************************************
//STEP1   EXEC PGM=HMASMP,PARM='DATE=U',REGION=4000K
//SYSUT1  DD UNIT=3330,SPACE=(1700,(600,100))
//SYSUT2  DD UNIT=3330,SPACE=(1700,(600,100))
//SYSUT3  DD UNIT=3330,SPACE=(1700,(600,100))
//SMPWRK1 DD UNIT=3330,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//           LRECL=80)
//SMPWRK2 DD UNIT=3330,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//           LRECL=80)
//SMPWRK3 DD UNIT=3330,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//           LRECL=80)
//SMPWRK4 DD UNIT=3330,SPACE=(CYL,(5,10,84)),DCB=(BLKSIZE=3120,
//           LRECL=80)
//SMPWRK5 DD UNIT=3330,SPACE=(CYL,(30,10,250))
//SYSLIB  DD DUMMY
//SMPOUT  DD SYSOUT=A
//SYSPRINT DD SYSOUT=A
//SMPPTFIN DD DUMMY
//*****************************************************************
//*                                                               *
//*  NOTE THAT THE UNIT AND VOLUME SERIAL PARAMETERS MAY HAVE TO  *
//*  BE PROVIDED FOR THE FOLLOWING SMP DATA SETS.                 *
//*                                                               *
//*****************************************************************
//SMPLOG  DD DUMMY
//SMPCDS  DD DSN=SYS1.SMPCDS,DISP=OLD
//SMPCNTL DD *
   UCLIN CDS .
   REP MOD(ICKEX02) LMOD(ICKDSF).
   REP MOD(ICKEX03) LMOD(ICKDSF).
   REP MOD(ICKIO02) LMOD(ICKDSF).
   REP MOD(ICKSA05) LMOD(ICKDSF).
   REP MOD(ICKRI01) LMOD(ICKDSF).
   REP MOD(ICKRI02) LMOD(ICKDSF).
   REP MOD(ICKRI03) LMOD(ICKDSF).
   REP MOD(ICKRIKT) LMOD(ICKDSF).
   REP MOD(ICKRILT) LMOD(ICKDSF).
   REP MOD(ICKTP04) LMOD(ICKDSF).
   REP MOD(ICKTP05) LMOD(ICKDSF).
   REP MOD(ICKTSEX0) LMOD(ICKDSF).
   REP MOD(ICKTSTP0) LMOD(ICKDSF).
   REP MOD(ICKTSTP1) LMOD(ICKDSF).
   REP MOD(ICKTSSA0) LMOD(ICKDSF).
   REP MOD(ICKTSIO0) LMOD(ICKDSF).
   REP MOD(ICKTSRI0) LMOD(ICKDSF).
   REP MOD(ICKTSUV0) LMOD(ICKDSF).
   REP MOD(ICKTSCC0) LMOD(ICKDSF).
   REP MOD(ICKTSEF0) LMOD(ICKDSF).
   REP MOD(ICKTSDV0) LMOD(ICKDSF).
   REP MOD(ICKCDIN) LMOD(ICKDSF).
   REP MOD(ICKCDRF) LMOD(ICKDSF).
   REP MOD(ICKCDIT) LMOD(ICKDSF).
   REP MOD(ICKIN01) LMOD(ICKDSF).
   REP MOD(ICKIT01) LMOD(ICKDSF).
   REP MOD(ICKRF01) LMOD(ICKDSF).
   REP MOD(ICKTA01) LMOD(ICKDSF).
   REP MOD(ICKAA01) LMOD(ICKDSF).
   REP MOD(ICKRA01) LMOD(ICKDSF).
   REP MOD(ICKRD01) LMOD(ICKDSF).
   REP MOD(ICKRP01) LMOD(ICKDSF).
   REP MOD(ICKRT01) LMOD(ICKDSF).
   REP MOD(ICKVA01) LMOD(ICKDSF).
   REP MOD(ICKRL01) LMOD(ICKDSF).
   REP MOD(ICKWL01) LMOD(ICKDSF).
   REP MOD(ICKVV01) LMOD(ICKDSF).
   REP MOD(ICKCV01) LMOD(ICKDSF).
   REP MOD(ICKCL01) LMOD(ICKDSF).
   REP MOD(ICKWV01) LMOD(ICKDSF).
   REP MOD(ICKWI01) LMOD(ICKDSF).
   REP MOD(ICKVP01) LMOD(ICKDSF).
   REP MOD(ICKVD01) LMOD(ICKDSF).
   REP MOD(ICKBM01) LMOD(ICKDSF).
   REP MOD(ICKPP01) LMOD(ICKDSF).
   REP MOD(ICKVLBL) LMOD(ICKDSF).
   DEL LMOD(ICKEX02) .
   DEL LMOD(ICKEX03) .
   DEL LMOD(ICKIO02) .
   DEL LMOD(ICKSA05) .
   DEL LMOD(ICKRI01) .
   DEL LMOD(ICKRIKT) .
   DEL LMOD(ICKRILT) .
   DEL LMOD(ICKTP04) .
   DEL LMOD(ICKTP05) .
   DEL LMOD(ICKTSEX0) .
   DEL LMOD(ICKTSTP0) .
   DEL LMOD(ICKTSTP1) .
   DEL LMOD(ICKTSSA0) .
   DEL LMOD(ICKTSIO0) .
   DEL LMOD(ICKTSRI0) .
   DEL LMOD(ICKTSUV0) .
   DEL LMOD(ICKTSCC0) .
   DEL LMOD(ICKTSEF0) .
   DEL LMOD(ICKTSDV0) .
   DEL LMOD(ICKCDIN) .
   DEL LMOD(ICKCDRF) .
   DEL LMOD(ICKCDIT) .
   DEL LMOD(ICKDAS1) .
   DEL LMOD(ICKVLBL) .
   ENDUCL.
/*
