//SMP001R0 JOB 527TSO000S0006,TEC,CLASS=J,MSGCLASS=1
//*
//* THIS IS TO COPY IN THE RUNING VERSION OF JES2
//*
// EXEC IEBCOPY,SO=1
//LPALIB  DD VOL=SER=MVSRES,DISP=SHR,UNIT=DASD,DSN=SYS1.LPALIB
//LINKLIB DD DSN=SYS1.LINKLIB,DISP=SHR,UNIT=DASD,VOL=SER=MVSRES
//LINKLIO DD DSN=SYS1.LINKLIB,DISP=SHR,UNIT=DASD,VOL=SER=AAAAAA
//LPALIO  DD VOL=SER=AAAAAA,DISP=SHR,UNIT=DASD,DSN=SYS1.LPALIB
  COPY INDD=LINKLIB,OUTDD=LINKLIO
   S M=((HASJES20,,R))
  COPY INDD=LPALIB,OUTDD=LPALIO
   S M=((HASPSSSM,,R))
/*
