//SMP001R0 JOB 527TSO000S0003,TEC,CLASS=J,MSGCLASS=1
//STEP01 EXEC SMP8106
//SMPPTFIN DD *
++ USERMOD(CB00031) /* MOD TO MAKE PROFILE OF WTP IN EFFECT FOR ALL
         TSO USERS (BYPASS CHECK IF WTP BIT IS ON) */ .
++VER (Z038) FMID(EBB1102) PRE(UZ23950) .
++ ZAP (IGC0203E) .
 NAME IGC0203E
 VER 01FA 4780,B200
 VER 0206 47E0,B200
 REP 01FA 4700,B200
 REP 0206 4700,B200
/*
//SMPCNTL DD *
 RECEIVE S (CB00031).
 APPLY   S (CB00031) .
//
