//SMP001R0 JOB 527TEC000S0008,TEC,CLASS=J,MSGCLASS=1
/*JOBPARM S=A158
//  EXEC SMP8106
//SMPPTFIN DD *
++ USERMOD(CB00045) /* MOD TO ACTIVATE LAST DATE USED FROM SU60 */.
++VER (Z038) FMID(EDM1102) PRE(UZ30015) .
++ZAP  (IFG0194C) .
 NAME  IFG0194C
 VER   1414 4780,3048,45E0
 REP   1414 4700,3048
/*
//SMPCNTL DD *
 RECEIVE S (CB00045).
 APPLY   S (UZ30015) .
 APPLY   S (CB00045) DIS(WRITE) .
//
