//SMP001R0 JOB 527TEC000S0008,CAHILL,MSGCLASS=1,CLASS=B
//DOITTOIT EXEC SMPSP1
//SMPPTFIN DD *
++USERMOD(CB00062) /* ADD DFHCSVC TO IEANUC01
                      DFHCSVC IS THE CICS 1.5 TYPE 2 SVC
                      IGC252 */ .
++VER(Z038) FMID(JBB1126)  .
++MOD(DFHCSVC) DISTLIB(DLOADLIB) LKLIB(LOADLIB) .
//SMPCNTL DD *
 UCLIN CDS .
 ADD MOD(DFHCSVC) LMOD(IEANUC01) FMID(JBB1126) DISTLIB(DLOADLIB).
 ENDUCL .
 RECEIVE S(CB00062) .
 APPLY   S(CB00062) DIS(WRITE) .
//DLOADLIB DD DSN=CICS.V1R5M0.DLOADLIB,DISP=SHR
//LOADLIB DD DSN=CICS.V1R5M0.LOADLIB,DISP=SHR
