//SMP001R8 JOB 527TEC000T0008,FRANK,MSGCLASS=1,CLASS=B
//DOITTOIT EXEC SMPSP1
//SMPPTFIN DD *
++USERMOD(CB00065) /* ADD IGC232 TO IEANUC01
                      IGC232 IS THE IMS 1.5 TYPE 2 SVC
                      POOP   */ .
++VER(Z038) FMID(JBB1126)  .
++MOD(IGC232) DISTLIB(IMSVSRES) LKLIB(IMSVSRES) .
//SMPCNTL DD *
 UCLIN CDS .
 ADD MOD(IGC232) LMOD(IEANUC01) FMID(JBB1126) DISTLIB(IMSVSRES).
 ENDUCL .
 RECEIVE S(CB00065) .
 APPLY   S(CB00065) DIS(WRITE) .
//IMSVSRES DD DSN=TEC.IMSVS.RESLIB,DISP=SHR
