//SMP001R0 JOB 527TEC000S0008,CAHILL,MSGCLASS=1,CLASS=B
//DOITTOIT EXEC SMPSPLIT
//SMPPTFIN DD *
++USERMOD(CB00059) /* ZAP SO GTF WRITES ON EVERY REC */ .
++VER(Z038) FMID(EVT0108)  .
++ZAP(ISTORFPO)  .
 NAME ISTORFPO
 VER 0A10 0058,03E8
 REP 0A10 0058,0001
//SMPCNTL DD *
  RECEIVE S(CB00059) .
  APPLY   S(CB00059) DIS(WRITE) .
