//SMP001R0 JOB 527TEC000S0008,CASINGHINO,CLASS=J,MSGCLASS=1
//*
//* MOVE IN 2 APPENDAGES FOR THE AIRFOCE COPY PGM
// EXEC IEBCOPY,SO=1
//I DD DSN=SYS2.MLINKLIB,DISP=SHR
//O DD DSN=SYS1.SVCLIB,DISP=SHR,UNIT=DASD,VOL=SER=XXXXXX
  COPY I=I,O=O
  S M=IGG019WE
  S M=IGG019WD
/*
