//SMP001R0 JOB 527TSO000S0008,TEC,CLASS=D,MSGCLASS=1,NOTIFY=TS15500
//*
//*  CAUSE CONSOLE TO IPL IN CBT DEFAULT MODE
//*
//PROC#1   EXEC SMP8106
//SMPPTFIN DD   *
++USERMOD (CB00024)  /* CAUSE CONSOLE TO IPL IN CBT DEFAULT MODE */.
++VER (Z038) FMID (JBB1126) PRE(UZ35149).
++ZAP (IEECVETC) .
 EXPAND IEECVETC(72)  X'3DA' TO X'421'
 NAME IEECVETC
*     IGC0007B IEECVETC     LEVEL = OS/VS2 RELEASE 2.0 FICHE.
 VER 01B0 96E09122         OI  DCMIOCM2,DCMBLENT+DCMBLWRL+DCMBLWRR
 VER 03DA 00000000 KSPATCH DC XL72'00'
 REP 01B0 47F0C3D8         B  KSPATCH
 REP 03DA 96E09122 KSPATCH OI DCMIOCM2,DCMBLENT+DCMBLWRL+DCMBLWRR
 REP 03DE 58F09040         L  R15,DCMAENTR
 REP 03E2 D227F000C3F8     MVC 0(L'KSCMD,R15),KSCMD
 REP 03E8 41F0F002         LA  R15,2(,R15)
 REP 03EC 50F09054         ST  R15,DCMADOPN
 REP 03F0 58F09160         L   XFBRANCH,DCMNOPT1
 REP 03F4 58109050         L   X1PARM,DCMCXSVE
 REP 03F8 07FF             BR  XFBRANCH
 REP 03FA D240E2        K S
 REP 03FD 6BC3D6D57E    ,CON=
 REP 0402 D5            N
 REP 0403 6BE2C5C77E    ,SEG=
 REP 0408 F1F9          19
 REP 040A 6BD9D5E4D47E  ,RNUM=
 REP 0410 F1F9          19
 REP 0412 6BD9E3D4C57E  ,RTME=
 REP 0418 F0F1          01
 REP 041A 6BC4C5D37E    DEL=
 REP 041F D940          R(BLANK)
 REP 0421 40            (BLANK)
 IDRDATA CB00024
//SMPCNTL  DD   *
 RECEIVE S (CB00024) .
 APPLY   S (CB00024) DIS(NO).
//
