//SMP001R0 JOB 527TSO000S0008,TEC,CLASS=J,MSGCLASS=1,
//  REGION=2048K
//STEP01 EXEC SMP8106
//SMPPTFIN DD *
++ USERMOD (CB00028) /* CHANGE THE DEFAULT PAGE AND VIO SLOT
                    VALUES FROM 1/4 TO 1/24. */ .
++VER (Z038) FMID(EBB1102).
++ ZAP (ILRSLOTC) .
 NAME ILRSLOTC
 REP 0000 00000018
 NAME ILRSLOTV
 REP 0000 00000018
/*
//SMPCNTL DD *
 RECEIVE S (CB00028).
 APPLY   S (CB00028) .
//
