//SMP001R0 JOB 527TEC000S0008,TEC,CLASS=J,MSGCLASS=1
//*
//* THIS WILL PUT THE IEFACTRT EXIT INTO SP1
//*
//STEP01 EXEC PAN,SO=1
++WRITE WORK,CBT071
//STEP02 EXEC ASMBLR,SO=1,OBJ='RENT,NODECK'
//SYSLIN DD DCB=BLKSIZE=80
// EXEC SMP8106
//SMPPTFIN DD *
++USERMOD (CB10001).
++VER (Z038) FMID(JBB1126)   /*
*
* THIS WILL PUT THE IEFACTRT EXIT INTO SP1
*
*           */.
++MOD (IEFACTRT).
// DD DSN=&LOADSET,DISP=(OLD,DELETE)
//SMPCNTL DD *
   RECEIVE S (CB10001).
   APPLY   S (CB10001) DIS(WRITE) .
//
