//SMP001R0 JOB 527TEC000S0008,TEC,CLASS=J,MSGCLASS=1
//*
//* THIS WILL PUT THE IEFUJI   EXIT INTO SP1
//*
//STEP01 EXEC PAN,SO=1
++WRITE WORK,CBT230
//STEP02 EXEC ASMBLR,SO=1,OBJ='RENT,NODECK'
//SYSLIN DD DCB=BLKSIZE=80
//STEP03 EXEC SMP8106
//SMPPTFIN DD *
++USERMOD (CB10003).
++VER (Z038) FMID(JBB1126)   /*
*
* THIS WILL PUT THE IEFUJI   EXIT INTO SP1
*
*           */.
++MOD (IEFUJI)  .
// DD DSN=&LOADSET,DISP=(OLD,DELETE)
//SMPCNTL DD *
   RECEIVE S (CB10003).
   APPLY   S (CB10003) DIS(WRITE) .
//
