         TITLE 'IEDBSM, BRACKET MANAGER                                *
                        '
IEDBSM   CSECT ,                                                   0001
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @11,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@11                                         0001
IEDBSM   IEDHJN START,HJN
*/********************************************************************/
*/*                                                                  */
*/*     M A I N     R O U T I N E                                    */
*/*                                                                  */
*/********************************************************************/
*  RC=0;                           /* INIT RETURN CODE TO 0          */
         SLR   RC,RC                                               0197
*  RLCB=PLBMLCB;                   /* LCB ADDRESSABILITY             */
         L     RLCB,PLBMLCB(,PLBMPTR)                              0198
*  RSIB=PLBMSIB;                   /* SIB ADDRESSABILITY             */
         L     RSIB,PLBMSIB(,PLBMPTR)                              0199
*/*                                                                  */
*  CALL DOICOORD;                  /* CALCULATE INPUT COORDINATE     */
         BAL   @14,DOICOORD                                        0200
*/*                                                                  */
*  IF ICOORD^=0 THEN               /* VALID INPUT COORDINATE         */
         LTR   ICOORD,ICOORD                                       0201
         BZ    @RF00201                                            0201
*    DO;                           /* YES                            */
*      CALL DOSCOORD;              /* CALCULATE STATE COORDINATE     */
         BAL   @14,DOSCOORD                                        0203
*      CALL DOACTION;              /* PERFORM ACTION                 */
         BAL   @14,DOACTION                                        0204
*    END;                                                          0205
*/*                                                                  */
*  RETURN CODE(RC);                /* RETURN (PASS RETURN CODE IN R15*/
@RF00201 LR    @15,RC                                              0206
         L     @14,12(,@13)                                        0206
         LM    @00,@12,20(@13)                                     0206
         BR    @14                                                 0206
*/********************************************************************/
*/*  E N D   O F   M A I N   R O U T I N E                           */
*/********************************************************************/
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE USES THE INPUT AND STATE COORDINATES PREVIOUSLY     */
*/* CALCULATED TO OBTAIN THE ACTION CODE FROM THE BRACKET STATE      */
*/* ACTION TABLE.  IT USES THE ACTION CODE FROM THIS TABLE AS AN     */
*/* INDEX TO A CASE STATEMENT WHICH CAUSES CONTROL TO BE PASSED TO   */
*/* THE PROPER SUBCASE ROUTINE. THE SUBCASE ROUTINE THEN PERFORMS    */
*/* THE DESIRED ACTION.                                              */
*/*                                                                  */
*/********************************************************************/
*DOACTION: PROC OPTIONS(NOSAVE,NOSAVEAREA);                        0207
DOACTION DS    0H                                                  0208
*  ACTION=BSATBL(ICOORD,SCOORD);   /* GET ACTION CODE FROM BRACKET STAT
*                                     ACTION TABLE                   */
*                                                                  0208
         LR    @06,ICOORD                                          0208
         MH    @06,@CH00776                                        0208
         ALR   @06,SCOORD                                          0208
         SLR   ACTION,ACTION                                       0208
         IC    ACTION,BSATBL-10(@06)                               0208
*BSACASE:    DO; /*BSACASE:CASE(ACTION)NAMES(BSA1,BSA2,BSA3,BSA4,BSA5,B
*A6,BSA7,BSA8,BSA9,BSA10,BSA11,BSA12,BSA13,BSA14,BSA15,BSA16,BSA17,BSA1
*,BSA19,BSA20,BSA21,BSA22,BSA23,BSA24)*/                           0209
BSACASE  DS    0H                                                  0210
*              DCL CL0001@ LABEL BASED(CP0001@(ACTION))            0210
*                      VALUERANGE(BSA1,BSA2,BSA3,BSA4,BSA5,BSA6,BSA7,BS
*8,BSA9,BSA10,BSA11,BSA12,BSA13,BSA14,BSA15,BSA16,BSA17,BSA18,BSA19,BSA
*0,BSA21,BSA22,BSA23,BSA24); /*BRANCH TARGET */                    0210
*              DCL CP0001@(24) PTR(31)                             0211
*                      INIT(ADDR(BSA1),ADDR(BSA2),ADDR(BSA3),ADDR(BSA4)
*ADDR(BSA5),ADDR(BSA6),ADDR(BSA7),ADDR(BSA8),ADDR(BSA9),ADDR(BSA10),ADD
*(BSA11),ADDR(BSA12),ADDR(BSA13),ADDR(BSA14),ADDR(BSA15),ADDR(BSA16),AD
*R(BSA17),ADDR(BSA18),ADDR(BSA19),ADDR(BSA20),ADDR(BSA21),ADDR(BSA22),A
*DR(BSA23),ADDR(BSA24));                                           0211
*              GOTO CL0001@; /*BRANCH TO SELECTED CASE*/           0212
         LR    @06,ACTION                                          0212
         SLA   @06,2                                               0212
         L     @06,CP0001@-4(@06)                                  0212
         BR    @06                                                 0212
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0213
*BSA1:DO; /*SUBCASE*/                                              0213
BSA1     DS    0H                                                  0214
*  SIBBSTAT=SIBBETB;               /* GO TO 'BETWEEN BRACKET' STATE  */
         NI    SIBBSTAT(RSIB),B'11110000'                          0214
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0215
         B     CE0001@                                             0215
*     END BSA1; /*END OF SUBCASE*/                                 0216
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0217
*BSA2:DO; /*SUBCASE*/                                              0217
BSA2     DS    0H                                                  0218
*  SIBBSTAT=SIBPINB;               /* GO TO 'PENDING IN BRACKET' STATE
*                                                                    */
         NI    SIBBSTAT(RSIB),B'11110001'                          0218
         OI    SIBBSTAT(RSIB),B'00000001'                          0218
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0219
         B     CE0001@                                             0219
*     END BSA2; /*END OF SUBCASE*/                                 0220
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0221
*BSA3:DO; /*SUBCASE*/                                              0221
BSA3     DS    0H                                                  0222
*  SIBBSTAT=SIBINB;                /* GO TO 'IN BRACKET' STATE       */
         NI    SIBBSTAT(RSIB),B'11110010'                          0222
         OI    SIBBSTAT(RSIB),B'00000010'                          0222
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0223
         B     CE0001@                                             0223
*     END BSA3; /*END OF SUBCASE*/                                 0224
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0225
*BSA4:DO; /*SUBCASE*/                                              0225
BSA4     DS    0H                                                  0226
*  SIBBSTAT=SIBPBB;                /* GO TO 'PENDING BEGIN BRACKETS'
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110011'                          0226
         OI    SIBBSTAT(RSIB),B'00000011'                          0226
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0227
         B     CE0001@                                             0227
*     END BSA4; /*END OF SUBCASE*/                                 0228
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0229
*BSA5:DO; /*SUBCASE*/                                              0229
BSA5     DS    0H                                                  0230
*  SIBBSTAT=SIBRSPR;               /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING FOR RESPONSE TO BE SENT'
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110100'                          0230
         OI    SIBBSTAT(RSIB),B'00000100'                          0230
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0231
         B     CE0001@                                             0231
*     END BSA5; /*END OF SUBCASE*/                                 0232
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0233
*BSA6:DO; /*SUBCASE*/                                              0233
BSA6     DS    0H                                                  0234
*  SIBBSTAT=SIBECR;                /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING TO RECEIVE END CHAIN'
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110101'                          0234
         OI    SIBBSTAT(RSIB),B'00000101'                          0234
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0235
         B     CE0001@                                             0235
*     END BSA6; /*END OF SUBCASE*/                                 0236
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0237
*BSA7:DO; /*SUBCASE*/                                              0237
BSA7     DS    0H                                                  0238
*  SIBBSTAT=SIBPURGR;              /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING TO RECEIVE END CHAIN 0238
*                                     WHILE IN PURGING CHAIN STATE'
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110110'                          0238
         OI    SIBBSTAT(RSIB),B'00000110'                          0238
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0239
         B     CE0001@                                             0239
*     END BSA7; /*END OF SUBCASE*/                                 0240
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0241
*BSA8:DO; /*SUBCASE*/                                              0241
BSA8     DS    0H                                                  0242
*  SIBBSTAT=SIBRSPS;               /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING TO RECEIVE RESPONSE' 0242
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110111'                          0242
         OI    SIBBSTAT(RSIB),B'00000111'                          0242
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0243
         B     CE0001@                                             0243
*     END BSA8; /*END OF SUBCASE*/                                 0244
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0245
*BSA9:DO; /*SUBCASE*/                                              0245
BSA9     DS    0H                                                  0246
*  SIBBSTAT=SIBECS;                /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING FOR END CHAIN TO BE SENT'
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11111000'                          0246
         OI    SIBBSTAT(RSIB),B'00001000'                          0246
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0247
         B     CE0001@                                             0247
*     END BSA9; /*END OF SUBCASE*/                                 0248
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0249
*BSA10:                                                            0249
*     DO; /*SUBCASE*/                                              0249
BSA10    DS    0H                                                  0250
*                                  /* NO ACTION                      */
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0250
         B     CE0001@                                             0250
*     END BSA10; /*END OF SUBCASE*/                                0251
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0252
*BSA11:                                                            0252
*     DO; /*SUBCASE*/                                              0252
BSA11    DS    0H                                                  0253
*                                  /* 'SHOULD NOT OCCUR' CONDITION-
*                                     TAKE NO ACTION                 */
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0253
         B     CE0001@                                             0253
*     END BSA11; /*END OF SUBCASE*/                                0254
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0255
*BSA12:                                                            0255
*     DO; /*SUBCASE*/                                              0255
BSA12    DS    0H                                                  0256
*  IF SIBBTERM=OFF THEN            /* UNCONDITIONAL TERMINATION      */
         TM    SIBBTERM(RSIB),B'00000010'                          0256
         BNZ   @RF00256                                            0256
*    SIBBSTAT=SIBBETB;             /* YES-GO TO 'BETWEEN BRACKET'  0257
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110000'                          0257
*  ELSE                            /* CONDITIONAL TERMINATION        */
*    SIBBSTAT=SIBRSPR;             /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING FOR RESPONSE TO BE SENT'
*                                     STATE                          */
         B     @RC00256                                            0258
@RF00256 NI    SIBBSTAT(RSIB),B'11110100'                          0258
         OI    SIBBSTAT(RSIB),B'00000100'                          0258
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0259
         B     CE0001@                                             0259
*     END BSA12; /*END OF SUBCASE*/                                0260
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0261
*BSA13:                                                            0261
*     DO; /*SUBCASE*/                                              0261
BSA13    DS    0H                                                  0262
*  IF SIBBTERM=OFF THEN            /* UNCONDITIONAL TERMINATION      */
         TM    SIBBTERM(RSIB),B'00000010'                          0262
         BNZ   @RF00262                                            0262
*    SIBBSTAT=SIBBETB;             /* YES-GO TO 'BETWEEN BRACKET'  0263
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110000'                          0263
*  ELSE                            /* CONDITIONAL TERMINATION        */
*    SIBBSTAT=SIBECR;              /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING TO RECEIVE END CHAIN'
*                                     STATE                          */
         B     @RC00262                                            0264
@RF00262 NI    SIBBSTAT(RSIB),B'11110101'                          0264
         OI    SIBBSTAT(RSIB),B'00000101'                          0264
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0265
         B     CE0001@                                             0265
*     END BSA13; /*END OF SUBCASE*/                                0266
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0267
*BSA14:                                                            0267
*     DO; /*SUBCASE*/                                              0267
BSA14    DS    0H                                                  0268
*  IF SIBBTERM=OFF THEN            /* UNCONDITIONAL TERMINATION      */
         TM    SIBBTERM(RSIB),B'00000010'                          0268
         BNZ   @RF00268                                            0268
*    SIBBSTAT=SIBBETB;             /* YES-GO TO 'BETWEEN BRACKET'  0269
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110000'                          0269
*  ELSE                            /* CONDITIONAL TERMINATION        */
*    SIBBSTAT=SIBRSPS;             /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING TO RECEIVE RESPONSE' 0270
*                                     STATE                          */
         B     @RC00268                                            0270
@RF00268 NI    SIBBSTAT(RSIB),B'11110111'                          0270
         OI    SIBBSTAT(RSIB),B'00000111'                          0270
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0271
         B     CE0001@                                             0271
*     END BSA14; /*END OF SUBCASE*/                                0272
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0273
*BSA15:                                                            0273
*     DO; /*SUBCASE*/                                              0273
BSA15    DS    0H                                                  0274
*  IF SIBBTERM=OFF THEN            /* UNCONDITIONAL TERMINATION      */
         TM    SIBBTERM(RSIB),B'00000010'                          0274
         BNZ   @RF00274                                            0274
*    SIBBSTAT=SIBBETB;             /* YES-GO TO 'BETWEEN BRACKET'  0275
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110000'                          0275
*  ELSE                            /* CONDITIONAL TERMINATION        */
*    SIBBSTAT=SIBECS;              /* GO TO 'PENDING BETWEEN BRACKETS-
*                                     WAITING FOR END CHAIN TO BE SENT'
*                                     STATE                          */
         B     @RC00274                                            0276
@RF00274 NI    SIBBSTAT(RSIB),B'11111000'                          0276
         OI    SIBBSTAT(RSIB),B'00001000'                          0276
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0277
         B     CE0001@                                             0277
*     END BSA15; /*END OF SUBCASE*/                                0278
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0279
*BSA16:                                                            0279
*     DO; /*SUBCASE*/                                              0279
BSA16    DS    0H                                                  0280
*  IF SIBRTRP=ON THEN              /* 'RTR PENDING' STATE            */
         TM    SIBRTRP(RSIB),B'00010000'                           0280
         BNO   @RF00280                                            0280
*    DO;                           /* YES                            */
*      PLBMSNC=SNSSTATE;           /* BRACKET STATE ERROR            */
         MVC   PLBMSNC(2,PLBMPTR),@CB00742                         0282
*      RC=ERROR;                   /* SET ERROR RETURN CODE          */
         LA    RC,4                                                0283
*    END;                                                          0284
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0285
         B     CE0001@                                             0285
*     END BSA16; /*END OF SUBCASE*/                                0286
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0287
*BSA17:                                                            0287
*     DO; /*SUBCASE*/                                              0287
BSA17    DS    0H                                                  0288
*  IF SIBRTRP=ON THEN              /* 'RTR PENDING' STATE            */
         TM    SIBRTRP(RSIB),B'00010000'                           0288
         BNO   @RF00288                                            0288
*    DO;                           /* YES                            */
*      PLBMSNC=SNSSTATE;           /* BRACKET STATE ERROR            */
         MVC   PLBMSNC(2,PLBMPTR),@CB00742                         0290
*      RC=ERROR;                   /* SET ERROR RETURN CODE          */
         LA    RC,4                                                0291
*    END;                                                          0292
*  ELSE                            /* NOT 'RTR PENDING'              */
*    SIBBSTAT=SIBPINB;             /* GO TO 'PENDING IN BRACKET'   0293
*                                     STATE                          */
         B     @RC00288                                            0293
@RF00288 NI    SIBBSTAT(RSIB),B'11110001'                          0293
         OI    SIBBSTAT(RSIB),B'00000001'                          0293
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0294
         B     CE0001@                                             0294
*     END BSA17; /*END OF SUBCASE*/                                0295
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0296
*BSA18:                                                            0296
*     DO; /*SUBCASE*/                                              0296
BSA18    DS    0H                                                  0297
*  PLBMSNC=SNSSTATE;               /* BRACKET STATE ERROR SENSE      */
         MVC   PLBMSNC(2,PLBMPTR),@CB00742                         0297
*  RC=ERROR;                       /* SET ERROR RETURN CODE          */
         LA    RC,4                                                0298
*  LCBRTRRO=OFF;                   /* RESET RTR RESPONSE OWED        */
         NI    LCBRTRRO(IEDQLPTR),B'11111011'                      0299
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0300
         B     CE0001@                                             0300
*     END BSA18; /*END OF SUBCASE*/                                0301
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0302
*BSA19:                                                            0302
*     DO; /*SUBCASE*/                                              0302
BSA19    DS    0H                                                  0303
*  PLBMSNC=SNSRACE;                /* BRACKET RACE ERROR             */
         MVC   PLBMSNC(2,PLBMPTR),@CB00744                         0303
*  RC=ERROR;                       /* SET ERROR RETURN CODE          */
         LA    RC,4                                                0304
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0305
         B     CE0001@                                             0305
*     END BSA19; /*END OF SUBCASE*/                                0306
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0307
*BSA20:                                                            0307
*     DO; /*SUBCASE*/                                              0307
BSA20    DS    0H                                                  0308
*  PLBMSNC=SNSSTATE;               /* BRACKET STATE ERROR            */
         MVC   PLBMSNC(2,PLBMPTR),@CB00742                         0308
*  RC=ERROR;                       /* SET ERROR RETURN CODE          */
         LA    RC,4                                                0309
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0310
         B     CE0001@                                             0310
*     END BSA20; /*END OF SUBCASE*/                                0311
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0312
*BSA21:                                                            0312
*     DO; /*SUBCASE*/                                              0312
BSA21    DS    0H                                                  0313
*  SIBRTRP=OFF;                    /* RESET RTR PENDING STATE        */
         NI    SIBRTRP(RSIB),B'11101111'                           0313
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0314
         B     CE0001@                                             0314
*     END BSA21; /*END OF SUBCASE*/                                0315
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0316
*BSA22:                                                            0316
*     DO; /*SUBCASE*/                                              0316
BSA22    DS    0H                                                  0317
*  SIBBSTAT=SIBPBB;                /* GO TO 'PENDING BEGIN BRACKET'
*                                     STATE                          */
         NI    SIBBSTAT(RSIB),B'11110011'                          0317
         OI    SIBBSTAT(RSIB),B'00000011'                          0317
*  SIBRTRP=OFF;                    /* RESET RTR PENDING STATE        */
         NI    SIBRTRP(RSIB),B'11101111'                           0318
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0319
         B     CE0001@                                             0319
*     END BSA22; /*END OF SUBCASE*/                                0320
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0321
*BSA23:                                                            0321
*     DO; /*SUBCASE*/                                              0321
BSA23    DS    0H                                                  0322
*  SIBRTRP=ON;                     /* GO TO 'RTR PENDING' STATE      */
         OI    SIBRTRP(RSIB),B'00010000'                           0322
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0323
         B     CE0001@                                             0323
*     END BSA23; /*END OF SUBCASE*/                                0324
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*                                                                  0325
*BSA24:                                                            0325
*     DO; /*SUBCASE*/                                              0325
BSA24    DS    0H                                                  0326
*  SIBBSTAT=SIBBETB;               /* GO TO 'BETWEEN BRACKET' STATE  */
         NI    SIBBSTAT(RSIB),B'11110000'                          0326
*  SIBRTRP=ON;                     /* GO TO 'RTR PENDING' STATE      */
         OI    SIBRTRP(RSIB),B'00010000'                           0327
*       GOTO CE0001@; /*BRANCH TO END OF CASE*/                    0328
         B     CE0001@                                             0328
*     END BSA24; /*END OF SUBCASE*/                                0329
*                                                                  0329
*CE0001@:                                                          0330
*   END BSACASE; /*END OF CASE*/                                   0330
*  RETURN;                                                         0331
@EL00002 DS    0H                                                  0331
@EF00002 DS    0H                                                  0331
@ER00002 BR    @14                                                 0331
*END DOACTION;                                                     0332
         B     @EL00002                                            0332
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE CALCULATES THE INPUT COORDINATE. IT IS DONE IN      */
*/* TWO STEPS.                                                       */
*/*          1) COMPUTE THE MASK VALUE. THE MASK IS COMPOSED OF BITS */
*/*             WHICH ARE SET ACCORDING TO THE TYPE OF INPUT.        */
*/*          2) USE THE COMPUTED MASK VALUE AS AN INDEX INTO A TABLE */
*/*             (THE TABLE USED DEPENDS UPON THE TYPE OF INPUT). THE */
*/*             VALUE OBTAINED FROM THE TABLE IS THE INPUT           */
*/*             COORDINATE.                                          */
*/*                                                                  */
*/********************************************************************/
*DOICOORD:PROC OPTIONS(NOSAVE,NOSAVEAREA);                         0333
DOICOORD DS    0H                                                  0334
*  IF TRHTYPE=OFF THEN             /* REQUEST                        */
         LA    @10,4                                               0334
         ALR   @10,PLBMPTR                                         0334
         TM    TRHTYPE(@10),B'10000000'                            0334
         BNZ   @RF00334                                            0334
*    DO;                           /* YES                            */
*      IF PLBMSTAT=PLBMNORM THEN   /* 'NORMAL' STATUS REQUEST        */
         TM    PLBMSTAT(PLBMPTR),B'01100000'                       0336
         BNZ   @RF00336                                            0336
*        DO;                       /* YES                            */
*          NRQMASK=''B;            /* INIT MASK TO ZERO              */
         XC    NRQMASK(2),NRQMASK                                  0338
*          IF TRHRUCAT^=TRHFMD THEN /* NOT AN FM DATA REQUEST        */
         TM    TRHRUCAT(@10),B'01100000'                           0339
         BZ    @RF00339                                            0339
*            DO;                   /* YES                            */
*              IF PLBMCMD=CD1CANCL THEN /* CANCEL                    */
         CLI   PLBMCMD(PLBMPTR),X'83'                              0341
         BNE   @RF00341                                            0341
*                NRQTYPE='001'B;   /* YES-SET CANCEL TYPE BITS       */
         NC    NRQTYPE(2),@CB00910                                 0342
         OI    NRQTYPE+1,B'01000000'                               0342
*              ELSE                                                0343
*                IF PLBMCMD=CD1BID THEN /* BID                       */
         B     @RC00341                                            0343
@RF00341 CLI   PLBMCMD(PLBMPTR),X'C8'                              0343
         BNE   @RF00343                                            0343
*                  NRQTYPE='010'B; /* YES-SET BID TPYE BITS          */
         NC    NRQTYPE(2),@CB00913                                 0344
         OI    NRQTYPE+1,B'10000000'                               0344
*                ELSE                                              0345
*                  IF PLBMCMD=CD1RTR THEN /* RTR                     */
         B     @RC00343                                            0345
@RF00343 CLI   PLBMCMD(PLBMPTR),X'05'                              0345
         BNE   @RF00345                                            0345
*                    NRQTYPE='011'B; /* YES-SET RTR TYPE BITS        */
         NI    NRQTYPE,B'11111110'                                 0346
         OI    NRQTYPE+1,B'11000000'                               0346
*                  ELSE                                            0347
*                    NRQTYPE='100'B; /* 'OTHER' CATAGORY             */
         B     @RC00345                                            0347
@RF00345 NI    NRQTYPE+1,B'00111111'                               0347
         OI    NRQTYPE,B'00000001'                                 0347
*            END;                                                  0348
@RC00345 DS    0H                                                  0348
@RC00343 DS    0H                                                  0348
@RC00341 DS    0H                                                  0349
*          IF PLBMSNDI=ON THEN     /* THIS REQUEST GOING OUTBOUND    */
@RF00339 TM    PLBMSNDI(PLBMPTR),B'10000000'                       0349
         BNO   @RF00349                                            0349
*            NRQSNDI=ON;           /* YES-SET SEND INDICATOR         */
         OI    NRQSNDI,B'00100000'                                 0350
*          IF TRHBB=ON THEN        /* BEGIN BRACKET (BB)             */
@RF00349 TM    TRHBB+4(PLBMPTR),B'10000000'                        0351
         BNO   @RF00351                                            0351
*            NRQBB=ON;             /* YES-SET BB INDICATOR           */
         OI    NRQBB,B'00010000'                                   0352
*          IF TRHEB=ON THEN        /* END BRACKET (EB)               */
@RF00351 TM    TRHEB+4(PLBMPTR),B'01000000'                        0353
         BNO   @RF00353                                            0353
*            NRQEB=ON;             /* YES-SET EB INDICATOR           */
         OI    NRQEB,B'00001000'                                   0354
*          IF (TRHDR1=ON × TRHDR2=ON) &                            0355
*             TRHER=OFF THEN       /* RQ ASKING FOR DEFINITE RESPONSE*/
@RF00353 LA    @10,4                                               0355
         ALR   @10,PLBMPTR                                         0355
         TM    TRHDR1(@10),B'10100000'                             0355
         BZ    @RF00355                                            0355
         TM    TRHER(@10),B'00010000'                              0355
         BNZ   @RF00355                                            0355
*            NRQRQD=ON;            /* YES-SET DEFINITE RSP INDICATOR */
         OI    NRQRQD,B'00000100'                                  0356
*          IF TRHBC=ON THEN        /* BEGIN CHAIN (BC)               */
@RF00355 TM    TRHBC+4(PLBMPTR),B'00000010'                        0357
         BNO   @RF00357                                            0357
*            NRQBC=ON;             /* YES-SET BEGIN CHAIN INDICATOR  */
         OI    NRQBC,B'00000010'                                   0358
*          IF TRHEC=ON THEN        /* END CHAIN (EC)                 */
@RF00357 TM    TRHEC+4(PLBMPTR),B'00000001'                        0359
         BNO   @RF00359                                            0359
*            NRQEC=ON;             /* YES-SET EC INDICATOR           */
         OI    NRQEC,B'00000001'                                   0360
*/*                                                                  */
*          ICOORD=NRQTBL(NRQMASK+1); /* USE MASK VALUE PLUS ONE(CANNNOT
*                                     HAVE 0 INDEX) TO INDEX 'NORMAL'
*                                     REQUEST TABLE TO GET INPUT   0361
*                                     COORDINATE                     */
@RF00359 SLR   @10,@10                                             0361
         ICM   @10,3,NRQMASK                                       0361
         SLR   ICOORD,ICOORD                                       0361
         IC    ICOORD,NRQTBL(@10)                                  0361
*        END;                                                      0362
*      ELSE                        /* NOT 'NORMAL' STATUS REQUEST    */
*        DO;                                                       0363
         B     @RC00336                                            0363
@RF00336 DS    0H                                                  0364
*          EPRQMASK=''B;           /* INIT MASK TO 0                 */
         XC    EPRQMASK(2),EPRQMASK                                0364
*          IF PLBMCMD=CD1CANCL THEN /* CANCEL COMMAND                */
         CLI   PLBMCMD(PLBMPTR),X'83'                              0365
         BNE   @RF00365                                            0365
*            EPRQCAN=ON;           /* YES-SET CANCEL INDICATOR       */
         OI    EPRQCAN,B'00001000'                                 0366
*          IF TRHEB=ON THEN        /* END BRACKET (EB)               */
@RF00365 TM    TRHEB+4(PLBMPTR),B'01000000'                        0367
         BNO   @RF00367                                            0367
*            EPRQEB=ON;            /* YES-SET EB INDICATOR           */
         OI    EPRQEB,B'00000100'                                  0368
*          IF (TRHDR1=ON × TRHDR2=ON) &                            0369
*             TRHER=OFF THEN       /* RQ ASKING FOR DEFINITE RESPONSE*/
@RF00367 LA    @10,4                                               0369
         ALR   @10,PLBMPTR                                         0369
         TM    TRHDR1(@10),B'10100000'                             0369
         BZ    @RF00369                                            0369
         TM    TRHER(@10),B'00010000'                              0369
         BNZ   @RF00369                                            0369
*            EPRQRQD=ON;           /* YES-SET RQD INDICATOR          */
         OI    EPRQRQD,B'00000010'                                 0370
*          IF TRHEC=ON THEN        /* END CHAIN (EC)                 */
@RF00369 TM    TRHEC+4(PLBMPTR),B'00000001'                        0371
         BNO   @RF00371                                            0371
*            EPRQEC=ON;            /* YES-SET EC INDICATOR           */
         OI    EPRQEC,B'00000001'                                  0372
*/*                                                                  */
*          IF PLBMSTAT=PLBMERR THEN /* ERROR HAS PREVIOUSLY BEEN   0373
*                                     DETECTED ON THIS REQUEST       */
@RF00371 TM    PLBMSTAT(PLBMPTR),B'01100000'                       0373
         BNO   @RF00373                                            0373
*            ICOORD=ERQTBL(EPRQMASK+1); /* USE COMPUTED MASK TO INDEX
*                                     'ERROR' REQUEST TABLE TO GET 0374
*                                     INPUT COORDINATE               */
         SLR   @10,@10                                             0374
         ICM   @10,3,EPRQMASK                                      0374
         SLR   ICOORD,ICOORD                                       0374
         IC    ICOORD,ERQTBL(@10)                                  0374
*          ELSE                    /* REQUEST HAS BEEN RECEIVED WHILE
*                                     IN 'PURGING CHAIN' STATE       */
*            ICOORD=PRQTBL(EPRQMASK+1); /* USE COMPUTED MASK TO INDEX
*                                     'PURG'    REQUEST TABLE TO GET
*                                     INPUT COORDINATE               */
         B     @RC00373                                            0375
@RF00373 SLR   @10,@10                                             0375
         ICM   @10,3,EPRQMASK                                      0375
         SLR   ICOORD,ICOORD                                       0375
         IC    ICOORD,PRQTBL(@10)                                  0375
*        END;                                                      0376
*    END;                                                          0377
*  ELSE                            /* RESPONSE                       */
*    DO;                                                           0378
         B     @RC00334                                            0378
@RF00334 DS    0H                                                  0379
*      RSPMASK=''B;                /* INIT RESPONSE MASK TO 0        */
         XC    RSPMASK(2),RSPMASK                                  0379
*      IF TRHRUCAT^=TRHFMD THEN    /* NOT FM DATA RESPONSE           */
         TM    TRHRUCAT+4(PLBMPTR),B'01100000'                     0380
         BZ    @RF00380                                            0380
*        DO;                       /* YES                            */
*          IF PLBMCMD=CD1CANCL THEN /* CANCEL RESPONSE               */
         CLI   PLBMCMD(PLBMPTR),X'83'                              0382
         BNE   @RF00382                                            0382
*             RSPTYPE='001'B;      /* YES-SET CANCEL TYPE INDICATORS */
         NI    RSPTYPE,B'11001111'                                 0383
         OI    RSPTYPE,B'00001000'                                 0383
*          ELSE                                                    0384
*            IF PLBMCMD=CD1BID THEN /* BID RESPONSE                  */
         B     @RC00382                                            0384
@RF00382 CLI   PLBMCMD(PLBMPTR),X'C8'                              0384
         BNE   @RF00384                                            0384
*              RSPTYPE='010'B;     /* YES-SET BID TYPE INDICATORS    */
         NI    RSPTYPE,B'11010111'                                 0385
         OI    RSPTYPE,B'00010000'                                 0385
*            ELSE                                                  0386
*              IF PLBMCMD=CD1RTR THEN /* RTR RESPONSE                */
         B     @RC00384                                            0386
@RF00384 CLI   PLBMCMD(PLBMPTR),X'05'                              0386
         BNE   @RF00386                                            0386
*                RSPTYPE='011'B;   /* YES-SET RTR TYPE INDICATORS    */
         NI    RSPTYPE,B'11011111'                                 0387
         OI    RSPTYPE,B'00011000'                                 0387
*              ELSE                                                0388
*                RSPTYPE='100'B;   /* 'OTHER' TYPE INDICATORS        */
         B     @RC00386                                            0388
@RF00386 NI    RSPTYPE,B'11100111'                                 0388
         OI    RSPTYPE,B'00100000'                                 0388
*        END;                                                      0389
@RC00386 DS    0H                                                  0389
@RC00384 DS    0H                                                  0389
@RC00382 DS    0H                                                  0390
*/*                                                                  */
*      IF TRHSDI=ON THEN           /* EXCEPTION RESPONSE             */
@RF00380 TM    TRHSDI+4(PLBMPTR),B'00000100'                       0390
         BNO   @RF00390                                            0390
*        DO;                       /* YES                            */
*          IF PLBMSNC=SNSRTRWF THEN /* IS SENSE 'RTR WILL FLOW'      */
         CLC   PLBMSNC(2,PLBMPTR),@CB00740                         0392
         BNE   @RF00392                                            0392
*            RSPSNS='01'B;         /* YES-SET 'RTR WILL FLOW' BITS   */
         NI    RSPSNS,B'11111011'                                  0393
         OI    RSPSNS,B'00000010'                                  0393
*          ELSE                    /* NOT 'RTR WILL FLOW SENSE       */
*            RSPSNS='10'B;         /* SET NOT 'RTR WILL FLOW' BITS   */
         B     @RC00392                                            0394
@RF00392 NI    RSPSNS,B'11111101'                                  0394
         OI    RSPSNS,B'00000100'                                  0394
*        END;                                                      0395
@RC00392 DS    0H                                                  0396
*      IF PLBMSNDI=ON THEN         /* OUTBOUND RESPONSE              */
@RF00390 TM    PLBMSNDI(PLBMPTR),B'10000000'                       0396
         BNO   @RF00396                                            0396
*        RSPSNDI=ON;               /* YES-SET SEND INDICATOR         */
         OI    RSPSNDI,B'00000001'                                 0397
*/*                                                                  */
*      ICOORD=RSPTBL(RSPMASK+1);   /* USE COMPUTED MASK TO INDEX   0398
*                                     RESPONSE TABLE TO GET INPUT  0398
*                                     COORDINATE                     */
@RF00396 SLR   @10,@10                                             0398
         ICM   @10,3,RSPMASK                                       0398
         SLR   ICOORD,ICOORD                                       0398
         IC    ICOORD,RSPTBL(@10)                                  0398
*    END;                                                          0399
*  RETURN;                         /* RETURN TO CALLER               */
@EL00003 DS    0H                                                  0400
@EF00003 DS    0H                                                  0400
@ER00003 BR    @14                                                 0400
*END DOICOORD;                                                     0401
         B     @EL00003                                            0401
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE CALCULATES THE STATE COORDINATE.  IT SIMPLY USES    */
*/* THE VALUE IN THE SIBBSTAT (BRACKET STATE) FIELD.                 */
*/*                                                                  */
*/********************************************************************/
*DOSCOORD:PROC OPTIONS(NOSAVE,NOSAVEAREA);                         0402
DOSCOORD DS    0H                                                  0403
*  R2=SIBSTAT1;                    /* GET 1 BYTE FIELD CONTAINING  0403
*                                     SIBBSTAT                       */
         SLR   R2,R2                                               0403
         IC    R2,SIBSTAT1(,RSIB)                                  0403
*  R2=R2&ANDMASK;                  /* USE A MASK TO AND OFF ALL BUT
*                                     SIBBSTAT BITS                  */
         N     R2,@CF00746                                         0404
*  SCOORD=R2+1;                    /* SET STATE COORDINATE VALUE     */
         LA    SCOORD,1                                            0405
         ALR   SCOORD,R2                                           0405
*  RETURN;                         /* RETURN TO CALLER               */
@EL00004 DS    0H                                                  0406
@EF00004 DS    0H                                                  0406
@ER00004 BR    @14                                                 0406
*END DOSCOORD;                                                     0407
*END IEDBSM                                                        0408
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (TCD1D   )                                        *
*/*%INCLUDE SYSLIB  (TLCBD   )                                        *
*/*%INCLUDE SYSLIB  (TPLBMD  )                                        *
*/*%INCLUDE SYSLIB  (TRHD    )                                        *
*/*%INCLUDE SYSLIB  (TSIBD   )                                        *
*;                                                                 0408
@DATA    DS    0H
@CH00776 DC    H'9'
         DS    0F
         DS    0F
@CF00746 DC    XL4'0000000F'
         DS    0D
@CB00740 DC    X'0814'
@CB00742 DC    X'2003'
@CB00744 DC    X'080B'
@CB00910 DC    B'1111111001111111'
@CB00913 DC    B'1111111010111111'
NRQMASK  DS    BL2
         ORG   NRQMASK
@NM00054 DS    BL1
NRQTYPE  EQU   NRQMASK+0
NRQSNDI  EQU   NRQMASK+1
NRQBB    EQU   NRQMASK+1
NRQEB    EQU   NRQMASK+1
NRQRQD   EQU   NRQMASK+1
NRQBC    EQU   NRQMASK+1
NRQEC    EQU   NRQMASK+1
         ORG   NRQMASK+2
EPRQMASK DS    BL2
         ORG   EPRQMASK
@NM00055 DS    BL2
EPRQCAN  EQU   EPRQMASK+1
EPRQEB   EQU   EPRQMASK+1
EPRQRQD  EQU   EPRQMASK+1
EPRQEC   EQU   EPRQMASK+1
         ORG   EPRQMASK+2
RSPMASK  DS    BL2
         ORG   RSPMASK
@NM00056 DS    BL2
RSPTYPE  EQU   RSPMASK+1
RSPSNS   EQU   RSPMASK+1
RSPSNDI  EQU   RSPMASK+1
         ORG   RSPMASK+2
BSATBL   DC    AL1(10)
         DC    AL1(11)
         DC    AL1(19)
         DC    AL1(10)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(19)
         DC    AL1(10)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(19)
         DC    AL1(10)
         DC    5AL1(11)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(19)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(19)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(19)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(12)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(13)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(5)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(1)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(1)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(3)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(21)
         DC    AL1(11)
         DC    AL1(18)
         DC    AL1(18)
         DC    5AL1(11)
         DC    AL1(19)
         DC    AL1(11)
         DC    AL1(12)
         DC    AL1(19)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(3)
         DC    3AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    3AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    3AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    3AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(3)
         DC    3AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(1)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(11)
         DC    AL1(3)
         DC    AL1(11)
         DC    AL1(11)
         DC    45AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(1)
         DC    4AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(3)
         DC    AL1(7)
         DC    3AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    5AL1(11)
         DC    AL1(4)
         DC    8AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    5AL1(11)
         DC    27AL1(11)
         DC    AL1(16)
         DC    AL1(11)
         DC    AL1(20)
         DC    AL1(1)
         DC    5AL1(11)
         DC    AL1(16)
         DC    AL1(11)
         DC    AL1(20)
         DC    AL1(1)
         DC    5AL1(11)
         DC    AL1(17)
         DC    AL1(11)
         DC    AL1(20)
         DC    AL1(3)
         DC    5AL1(11)
         DC    AL1(17)
         DC    AL1(11)
         DC    AL1(20)
         DC    AL1(3)
         DC    5AL1(11)
         DC    AL1(20)
         DC    AL1(11)
         DC    AL1(14)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(20)
         DC    AL1(11)
         DC    AL1(15)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(20)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(20)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(20)
         DC    5AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(10)
         DC    4AL1(11)
         DC    AL1(8)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(10)
         DC    4AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    6AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(10)
         DC    5AL1(11)
         DC    27AL1(11)
         DC    AL1(10)
         DC    AL1(3)
         DC    AL1(10)
         DC    4AL1(11)
         DC    AL1(1)
         DC    AL1(11)
         DC    AL1(10)
         DC    AL1(24)
         DC    AL1(10)
         DC    4AL1(11)
         DC    AL1(3)
         DC    AL1(3)
         DC    AL1(10)
         DC    AL1(1)
         DC    AL1(10)
         DC    4AL1(11)
         DC    AL1(3)
         DC    AL1(3)
         DC    AL1(22)
         DC    AL1(11)
         DC    AL1(21)
         DC    AL1(21)
         DC    5AL1(11)
         DC    AL1(23)
         DC    AL1(11)
         DC    AL1(23)
         DC    6AL1(11)
         DC    AL1(21)
         DC    AL1(11)
         DC    AL1(21)
         DC    6AL1(11)
         DC    AL1(10)
         DC    AL1(11)
         DC    AL1(10)
         DC    6AL1(11)
NRQTBL   DC    AL1(15)
         DC    AL1(14)
         DC    AL1(12)
         DC    AL1(11)
         DC    AL1(0)
         DC    AL1(13)
         DC    AL1(0)
         DC    AL1(10)
         DC    2AL1(0)
         DC    AL1(9)
         DC    AL1(8)
         DC    3AL1(0)
         DC    AL1(7)
         DC    2AL1(0)
         DC    AL1(6)
         DC    AL1(5)
         DC    3AL1(0)
         DC    AL1(4)
         DC    2AL1(0)
         DC    AL1(3)
         DC    AL1(2)
         DC    3AL1(0)
         DC    AL1(1)
         DC    AL1(54)
         DC    AL1(0)
         DC    AL1(52)
         DC    2AL1(0)
         DC    AL1(53)
         DC    AL1(0)
         DC    AL1(51)
         DC    2AL1(0)
         DC    AL1(50)
         DC    4AL1(0)
         DC    AL1(49)
         DC    2AL1(0)
         DC    AL1(48)
         DC    4AL1(0)
         DC    AL1(47)
         DC    2AL1(0)
         DC    AL1(46)
         DC    4AL1(0)
         DC    AL1(45)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(17)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    AL1(16)
         DC    7AL1(0)
         DC    AL1(55)
         DC    63AL1(0)
         DC    AL1(56)
         DC    27AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    3AL1(0)
         DC    AL1(18)
         DC    35AL1(0)
         DC    AL1(20)
         DC    3AL1(0)
         DC    AL1(20)
         DC    3AL1(0)
         DC    AL1(19)
         DC    3AL1(0)
         DC    AL1(19)
         DC    3AL1(0)
         DC    AL1(20)
         DC    3AL1(0)
         DC    AL1(20)
         DC    3AL1(0)
         DC    AL1(19)
         DC    3AL1(0)
         DC    AL1(19)
         DC    32AL1(0)
ERQTBL   DC    AL1(23)
         DC    AL1(22)
         DC    AL1(23)
         DC    AL1(21)
         DC    AL1(23)
         DC    AL1(22)
         DC    AL1(23)
         DC    AL1(21)
         DC    AL1(25)
         DC    AL1(25)
         DC    AL1(25)
         DC    AL1(25)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
PRQTBL   DC    AL1(28)
         DC    AL1(27)
         DC    AL1(28)
         DC    AL1(26)
         DC    AL1(28)
         DC    AL1(27)
         DC    AL1(28)
         DC    AL1(26)
         DC    AL1(30)
         DC    AL1(30)
         DC    AL1(30)
         DC    AL1(30)
         DC    AL1(29)
         DC    AL1(29)
         DC    AL1(29)
         DC    AL1(29)
RSPTBL   DC    AL1(60)
         DC    AL1(36)
         DC    AL1(61)
         DC    AL1(37)
         DC    AL1(62)
         DC    AL1(37)
         DC    2AL1(0)
         DC    AL1(66)
         DC    AL1(38)
         DC    AL1(66)
         DC    AL1(0)
         DC    AL1(66)
         DC    3AL1(0)
         DC    AL1(63)
         DC    AL1(0)
         DC    AL1(64)
         DC    AL1(0)
         DC    AL1(65)
         DC    AL1(41)
         DC    3AL1(0)
         DC    AL1(39)
         DC    AL1(0)
         DC    AL1(40)
         DC    AL1(0)
         DC    AL1(40)
         DC    3AL1(0)
         DC    AL1(41)
         DC    AL1(0)
         DC    AL1(41)
         DC    AL1(0)
         DC    AL1(41)
         DC    2AL1(0)
         DS    CL2
CP0001@  DC    AL4(BSA1)
         DC    AL4(BSA2)
         DC    AL4(BSA3)
         DC    AL4(BSA4)
         DC    AL4(BSA5)
         DC    AL4(BSA6)
         DC    AL4(BSA7)
         DC    AL4(BSA8)
         DC    AL4(BSA9)
         DC    AL4(BSA10)
         DC    AL4(BSA11)
         DC    AL4(BSA12)
         DC    AL4(BSA13)
         DC    AL4(BSA14)
         DC    AL4(BSA15)
         DC    AL4(BSA16)
         DC    AL4(BSA17)
         DC    AL4(BSA18)
         DC    AL4(BSA19)
         DC    AL4(BSA20)
         DC    AL4(BSA21)
         DC    AL4(BSA22)
         DC    AL4(BSA23)
         DC    AL4(BSA24)
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RC       EQU   @07
ACTION   EQU   @10
SCOORD   EQU   @09
ICOORD   EQU   @08
IEDQLPTR EQU   @04
LCBXPTR  EQU   @05
PLBMPTR  EQU   @01
RSIB     EQU   @05
RPARM    EQU   @01
R2       EQU   @02
RLCB     EQU   @04
RBASE    EQU   @12
R14      EQU   @14
R15      EQU   @15
IEDQLCB  EQU   0
LCBRCB   EQU   IEDQLCB
LCBTSOB  EQU   IEDQLCB+19
LCBCHAIN EQU   IEDQLCB+20
LCBSCRNN EQU   LCBCHAIN
LCBTETEN EQU   LCBCHAIN
LCBINSRC EQU   IEDQLCB+21
LCBLKMDE EQU   LCBINSRC+2
LCBNTXT  EQU   IEDQLCB+24
LCBSTAT4 EQU   LCBNTXT
LCBPHASE EQU   LCBSTAT4
LCBSCBDA EQU   IEDQLCB+25
LCBMHA   EQU   IEDQLCB+29
LCBFLAG1 EQU   IEDQLCB+32
LCBIOBSN EQU   IEDQLCB+33
LCBSNS   EQU   LCBIOBSN+1
LCBSENS0 EQU   LCBSNS
LCBLOSDT EQU   LCBSENS0
LCBTMOUT EQU   LCBSENS0
LCBFLAG3 EQU   LCBIOBSN+7
LCBCSW   EQU   LCBIOBSN+8
LCBCSWST EQU   LCBCSW+3
LCBCSWUS EQU   LCBCSWST
LCBCSWCS EQU   LCBCSWST+1
LCBSIOCC EQU   LCBIOBSN+15
LCBDCBPT EQU   IEDQLCB+52
LCBRCQCB EQU   IEDQLCB+56
LCBTHSQ  EQU   IEDQLCB+60
LCBINCAM EQU   LCBTHSQ
LCBERRCT EQU   IEDQLCB+62
LCBLSPCI EQU   IEDQLCB+65
LCBRCBFR EQU   LCBLSPCI
LCBSTATE EQU   IEDQLCB+70
LCBSTAT1 EQU   LCBSTATE
LCBSTAT2 EQU   LCBSTATE+1
LCBBEOTN EQU   LCBSTAT2
LCBSYNC  EQU   LCBSTAT2
LCBDIAL  EQU   LCBSTAT2
LCBTSTSW EQU   IEDQLCB+72
LCBERB   EQU   IEDQLCB+76
LCBERBST EQU   IEDQLCB+84
LCBDLNKN EQU   LCBERBST
LCBERBCT EQU   IEDQLCB+88
LCBRBCT2 EQU   LCBERBCT+1
LCBMSGFM EQU   IEDQLCB+92
LCBOBRCH EQU   IEDQLCB+96
LCBINVPT EQU   LCBOBRCH+1
LCBBFRW  EQU   LCBINVPT
LCBTPCD  EQU   IEDQLCB+100
LCBSTAT5 EQU   LCBTPCD
LCBSTAT6 EQU   LCBTPCD+4
LCBRTRRO EQU   LCBSTAT6
LCBRSPSV EQU   LCBTPCD+8
LCBSAVSN EQU   IEDQLCB+112
LCBERCCW EQU   IEDQLCB+120
LCBCPA   EQU   IEDQLCB+144
LCBCCW5  EQU   LCBCPA+32
IEDQLCBX EQU   0
LCBXCON  EQU   IEDQLCBX
LCBXFLAG EQU   LCBXCON
LCBXDCT  EQU   LCBXCON+1
LCBXRADR EQU   LCBXCON+4
IEDPLBM  EQU   0
PLBMFLG1 EQU   IEDPLBM
PLBMSNDI EQU   PLBMFLG1
PLBMSTAT EQU   PLBMFLG1
PLBMSNC  EQU   IEDPLBM+2
PLBMRH   EQU   IEDPLBM+4
PLBMCMD  EQU   IEDPLBM+7
PLBMSIB  EQU   IEDPLBM+8
PLBMLCB  EQU   IEDPLBM+12
IEDRH    EQU   0
TRHBYTE0 EQU   IEDRH
TRHTYPE  EQU   TRHBYTE0
TRHRUCAT EQU   TRHBYTE0
TRHSDI   EQU   TRHBYTE0
TRHBC    EQU   TRHBYTE0
TRHEC    EQU   TRHBYTE0
TRHBYTE1 EQU   IEDRH+1
TRHDR1   EQU   TRHBYTE1
TRHDR2   EQU   TRHBYTE1
TRHER    EQU   TRHBYTE1
TRHBYTE2 EQU   IEDRH+2
TRHBB    EQU   TRHBYTE2
TRHEB    EQU   TRHBYTE2
IEDSIBD  EQU   0
SIBSESSN EQU   IEDSIBD+10
SIBPACIN EQU   IEDSIBD+11
SIBSEQN  EQU   IEDSIBD+12
SIBSTAT1 EQU   IEDSIBD+16
SIBRTRP  EQU   SIBSTAT1
SIBBSTAT EQU   SIBSTAT1
SIBSTAT2 EQU   IEDSIBD+17
SIBBIND  EQU   IEDSIBD+20
SIBBIND1 EQU   SIBBIND
SIBBIND2 EQU   SIBBIND+1
SIBBTERM EQU   SIBBIND2
SIBBIND3 EQU   SIBBIND+2
SIBSTAT0 EQU   IEDSIBD+23
CL0001@  EQU   0
LCBRSPIN EQU   LCBIOBSN
LCBLUSNS EQU   LCBRSPIN+5
LCBSCPRS EQU   LCBRSPIN+9
LCBCSWU1 EQU   LCBSCPRS+2
LCBRSPFG EQU   LCBRSPIN+15
LCBCOREQ EQU   LCBTPCD
@NM00028 EQU   LCBCPA+40
LCBQNX   EQU   LCBERCCW
LCBQNXMN EQU   LCBQNX
LCBQEBPL EQU   LCBQNX+4
LCBCANCL EQU   LCBSAVSN
LCBCANFG EQU   LCBCANCL
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00035 EQU   LCBCANCL+3
LCBCANTH EQU   LCBCANCL+1
@NM00034 EQU   LCBCANFG
LCBCANCD EQU   LCBCANFG
@NM00033 EQU   LCBCANFG
LCBCANEB EQU   LCBCANFG
LCBCANXT EQU   LCBCANFG
LCBUNADD EQU   LCBQNX+21
LCBUASZE EQU   LCBQNX+20
LCBDSTEA EQU   LCBQNX+16
@NM00032 EQU   LCBQNX+12
LCBCP    EQU   LCBQEBPL+4
LCBIOSB  EQU   LCBQEBPL+1
LCBSIO   EQU   LCBQEBPL
LCBSTSAV EQU   LCBQNX+1
@NM00031 EQU   LCBQNXMN
LCBNX509 EQU   LCBQNXMN
LCBNX162 EQU   LCBQNXMN
LCBNX142 EQU   LCBQNXMN
LCBNX064 EQU   LCBQNXMN
@NM00030 EQU   @NM00028+4
LCBNCPPT EQU   @NM00028+1
@NM00029 EQU   @NM00028
LCBWRSCH EQU   LCBCOREQ+8
LCBCQLNK EQU   LCBCOREQ+4
LCBCQELE EQU   LCBCOREQ
LCBPAKCH EQU   LCBRSPIN+16
@NM00027 EQU   LCBRSPFG
LCBRSRH  EQU   LCBRSPFG
LCBEXPI  EQU   LCBRSPFG
@NM00026 EQU   LCBRSPIN+12
LCBUSUE1 EQU   LCBCSWU1
@NM00025 EQU   LCBCSWU1
@NM00024 EQU   LCBSCPRS+1
LCBDFCMD EQU   LCBSCPRS
LCBUSER  EQU   LCBLUSNS+2
LCBSMIN  EQU   LCBLUSNS+1
LCBSMAJ  EQU   LCBLUSNS
LCBRHSV  EQU   LCBRSPIN+2
LCBSNS0  EQU   LCBRSPIN+1
@NM00023 EQU   LCBRSPIN
SIBLUTYP EQU   SIBSTAT0
SIBCD    EQU   SIBSTAT0
@NM00053 EQU   SIBBIND3
SIBCRES  EQU   SIBBIND3
SIBSPKR  EQU   SIBBIND3
SIBRECOV EQU   SIBBIND3
SIBFMODE EQU   SIBBIND3
SIBALT   EQU   SIBBIND2
SIBBRACK EQU   SIBBIND2
SIBFMUSE EQU   SIBBIND2
SIBSEBI  EQU   SIBBIND2
SIBSCMP  EQU   SIBBIND2
SIBSEXC  EQU   SIBBIND2
SIBSDEF  EQU   SIBBIND2
SIBSRQM  EQU   SIBBIND1
SIBSCHNG EQU   SIBBIND1
SIBPEBI  EQU   SIBBIND1
SIBPCMP  EQU   SIBBIND1
SIBPEXC  EQU   SIBBIND1
SIBPDEF  EQU   SIBBIND1
SIBPRQM  EQU   SIBBIND1
SIBPCHN  EQU   SIBBIND1
SIBFMPRO EQU   IEDSIBD+19
SIBTSPRO EQU   IEDSIBD+18
@NM00052 EQU   SIBSTAT2
SIBDACLU EQU   SIBSTAT2
SIBRDSCN EQU   SIBSTAT2
SIBTERM  EQU   SIBSTAT2
SIBUSS   EQU   SIBSTAT2
SIBFTERM EQU   SIBSTAT1
SIBRQEND EQU   SIBSTAT1
SIBRQSHT EQU   SIBSTAT1
SIBSEQO  EQU   SIBSEQN+2
SIBSEQI  EQU   SIBSEQN
SIBNCNT  EQU   SIBPACIN
SIBMCNT  EQU   SIBPACIN
SIBDSTAT EQU   SIBSESSN
SIBSSTAT EQU   SIBSESSN
SIBINBIU EQU   SIBSESSN
SIBSHUTC EQU   SIBSESSN
SIBLGOFF EQU   SIBSESSN
SIBINDEX EQU   IEDSIBD+8
SIBCHAIN EQU   IEDSIBD+4
SIBRUSEG EQU   IEDSIBD
@NM00051 EQU   TRHBYTE2
@NM00050 EQU   TRHBYTE2
@NM00049 EQU   TRHBYTE2
TRHCSI   EQU   TRHBYTE2
@NM00048 EQU   TRHBYTE2
TRHCDI   EQU   TRHBYTE2
TRHPI    EQU   TRHBYTE1
@NM00047 EQU   TRHBYTE1
@NM00046 EQU   TRHBYTE1
@NM00045 EQU   TRHBYTE1
@NM00044 EQU   TRHBYTE1
TRHFI    EQU   TRHBYTE0
@NM00043 EQU   TRHBYTE0
@NM00042 EQU   IEDPLBM+1
@NM00041 EQU   PLBMFLG1
LCBERADR EQU   LCBXRADR+1
LCBPCIRC EQU   LCBXRADR
LCBDCT3  EQU   LCBXDCT+2
LCBDCT2  EQU   LCBXDCT+1
LCBDCT1  EQU   LCBXDCT
@NM00040 EQU   LCBXFLAG
LCBERPND EQU   LCBXFLAG
LCBSRCPF EQU   LCBXFLAG
LCBGPCTV EQU   LCBXFLAG
@NM00039 EQU   LCBXFLAG
@NM00038 EQU   LCBXFLAG
@NM00037 EQU   LCBXFLAG
@NM00036 EQU   LCBXFLAG
LCBCCW10 EQU   LCBCPA+72
LCBCCW9  EQU   LCBCPA+64
LCBCCW8  EQU   LCBCPA+56
LCBCCW7  EQU   LCBCPA+48
LCBCCW6  EQU   LCBCPA+40
LCBATTEL EQU   LCBCCW5
LCBCCW4  EQU   LCBCPA+24
LCBCCW3  EQU   LCBCPA+16
LCBCCW2  EQU   LCBCPA+8
LCBCCW1  EQU   LCBCPA
@NM00022 EQU   LCBERCCW+16
LCBATL05 EQU   LCBERCCW+8
@NM00021 EQU   LCBERCCW
LCBCSWSV EQU   LCBSAVSN+1
LCBSNSV  EQU   LCBSAVSN
LCBBFSNS EQU   LCBRSPSV
LCBWAITC EQU   LCBTPCD+5
LCBINPAK EQU   LCBSTAT6
LCBMHBID EQU   LCBSTAT6
LCBHDRPD EQU   LCBSTAT6
LCBCHN   EQU   LCBSTAT6
LCBBFRSV EQU   LCBTPCD+1
@NM00020 EQU   LCBSTAT5
LCBLUS   EQU   LCBSTAT5
LCBLUNIT EQU   LCBSTAT5
LCBPERM  EQU   LCBSTAT5
LCBNXCMD EQU   LCBBFRW
LCBERMSK EQU   LCBOBRCH
LCBSCBA  EQU   IEDQLCB+93
LCBOLT   EQU   LCBMSGFM
LCBEOT   EQU   LCBMSGFM
LCBENQ   EQU   LCBMSGFM
LCBTTD   EQU   LCBMSGFM
LCBRSTRT EQU   LCBMSGFM
LCBVSTRT EQU   LCBMSGFM
LCBACKI  EQU   LCBMSGFM
LCBNAK   EQU   LCBMSGFM
LCBTTCIN EQU   IEDQLCB+90
@NM00019 EQU   LCBRBCT2
LCBDCNT  EQU   LCBRBCT2
LCBRBCT1 EQU   LCBERBCT
LCBERBCH EQU   IEDQLCB+85
LCBCOMPL EQU   LCBDLNKN
LCBPRCPG EQU   LCBERBST
LCBERROR EQU   LCBERBST
@NM00018 EQU   LCBERBST
LCBINQ   EQU   LCBERBST
LCBRDERR EQU   LCBERBST
LCBEOMSG EQU   LCBERBST
LCBMSG   EQU   LCBERBST
LCBERBLK EQU   IEDQLCB+81
LCBERBPY EQU   IEDQLCB+80
LCBERBQB EQU   LCBERB+1
LCBERBKY EQU   LCBERB
LCBRECAD EQU   IEDQLCB+73
@NM00017 EQU   LCBTSTSW
@NM00016 EQU   LCBTSTSW
@NM00015 EQU   LCBTSTSW
@NM00014 EQU   LCBTSTSW
@NM00013 EQU   LCBTSTSW
@NM00012 EQU   LCBTSTSW
@NM00011 EQU   LCBTSTSW
LCBCONCT EQU   LCBTSTSW
LCBRESP  EQU   LCBSTAT2
LCBBFRAV EQU   LCBDIAL
LCBATTN  EQU   LCBSYNC
LCBNEGRP EQU   LCBSTAT2
LCBSNDPR EQU   LCBSTAT2
LCBCONNN EQU   LCBBEOTN
LCBMSGNN EQU   LCBSTAT2
LCBTRACE EQU   LCBSTAT2
LCBSENDN EQU   LCBSTAT1
LCBRECVN EQU   LCBSTAT1
LCBFREEN EQU   LCBSTAT1
LCBCONT  EQU   LCBSTAT1
LCBINITN EQU   LCBSTAT1
LCBOCNI  EQU   LCBSTAT1
LCBOCWTN EQU   LCBSTAT1
LCBRCLLN EQU   LCBSTAT1
LCBRECOF EQU   IEDQLCB+68
LCBRDBFR EQU   LCBRCBFR
LCBUCBX  EQU   IEDQLCB+64
LCBTTBIN EQU   LCBERRCT
@NM00010 EQU   LCBINCAM
LCBGETMN EQU   LCBINCAM
LCBRESTR EQU   LCBRCQCB
LCBPCILK EQU   LCBDCBPT
LCBSTART EQU   LCBIOBSN+16
LCBAP4OL EQU   LCBSIOCC
LCBAP3OL EQU   LCBSIOCC
LCBAP2OL EQU   LCBSIOCC
LCBAP1OL EQU   LCBSIOCC
LCBSIOC2 EQU   LCBSIOCC
LCBSIOC1 EQU   LCBSIOCC
@NM00009 EQU   LCBSIOCC
LCBCSWRC EQU   LCBCSW+5
LCBCSCHC EQU   LCBCSWCS
LCBCSICC EQU   LCBCSWCS
LCBCSCCC EQU   LCBCSWCS
LCBCSCDC EQU   LCBCSWCS
LCBCSPTC EQU   LCBCSWCS
LCBCSPGC EQU   LCBCSWCS
LCBCSIL  EQU   LCBCSWCS
LCBCSPCI EQU   LCBCSWCS
LCBUSUE  EQU   LCBCSWUS
LCBUSUC  EQU   LCBCSWUS
LCBUSDE  EQU   LCBCSWUS
LCBUSCE  EQU   LCBCSWUS
LCBUSBSY EQU   LCBCSWUS
LCBUSCUE EQU   LCBCSWUS
LCBUSSM  EQU   LCBCSWUS
LCBUSAT  EQU   LCBCSWUS
LCBCSWCA EQU   LCBCSW
LCBOBR   EQU   LCBFLAG3
LCBOBRRD EQU   LCBFLAG3
LCBIOMSG EQU   LCBFLAG3
LCBSOHC  EQU   LCBFLAG3
LCBRLAD  EQU   LCBFLAG3
LCBSOHR  EQU   LCBFLAG3
@NM00008 EQU   LCBFLAG3
LCBECBPT EQU   LCBIOBSN+4
LCBECBCC EQU   LCBIOBSN+3
LCBSENS1 EQU   LCBSNS+1
LCBABORT EQU   LCBTMOUT
LCBNOTIN EQU   LCBLOSDT
LCBOVRUN EQU   LCBSENS0
LCBDATCK EQU   LCBSENS0
LCBEQUCK EQU   LCBSENS0
LCBBUSCK EQU   LCBSENS0
LCBINTRQ EQU   LCBSENS0
LCBCMDRJ EQU   LCBSENS0
LCBFLAG2 EQU   LCBIOBSN
@NM00007 EQU   LCBFLAG1
LCBUNREL EQU   LCBFLAG1
LCBEXCPN EQU   LCBFLAG1
@NM00006 EQU   LCBFLAG1
LCBERPIN EQU   LCBFLAG1
@NM00005 EQU   LCBFLAG1
LCBFSBFR EQU   LCBMHA
LCBISZE  EQU   IEDQLCB+28
LCBLNENT EQU   LCBSCBDA+1
@NM00004 EQU   LCBSCBDA
LCBCPGMH EQU   LCBSTAT4
LCBREAL  EQU   LCBPHASE
@NM00003 EQU   LCBSTAT4
LCBACTRQ EQU   LCBSTAT4
LCBIPLRQ EQU   LCBSTAT4
LCBDACRQ EQU   LCBSTAT4
LCBDMPRQ EQU   LCBSTAT4
@NM00002 EQU   LCBLKMDE
LCBLOCKI EQU   LCBLKMDE
LCBLOCKR EQU   LCBLKMDE
LCBHMFLG EQU   LCBLKMDE
LCBBDFLG EQU   LCBLKMDE
@NM00001 EQU   LCBINSRC
LCBABRTN EQU   LCBCHAIN
LCBCTLMD EQU   LCBTETEN
LCBBFRSZ EQU   LCBCHAIN
LCBUREQN EQU   LCBCHAIN
LCBNORTY EQU   LCBCHAIN
LCBERMSG EQU   LCBCHAIN
LCBEXCP  EQU   LCBCHAIN
LCBINVRQ EQU   LCBSCRNN
LCB2741N EQU   LCBTSOB
LCBINHBN EQU   LCBTSOB
LCBCIRCD EQU   LCBTSOB
LCBPREP  EQU   LCBTSOB
LCBSOPL  EQU   LCBTSOB
LCBSATRD EQU   LCBTSOB
LCBTSBUF EQU   LCBTSOB
LCBWRBRK EQU   LCBTSOB
LCBTDL   EQU   IEDQLCB+18
LCBEOLTD EQU   IEDQLCB+16
LCBRSLNK EQU   IEDQLCB+13
LCBRSPRI EQU   IEDQLCB+12
LCBSTCBA EQU   IEDQLCB+9
LCBRSKEY EQU   IEDQLCB+8
LCBLINK  EQU   LCBRCB+5
LCBPRI   EQU   LCBRCB+4
LCBQCBA  EQU   LCBRCB+1
LCBKEY   EQU   LCBRCB
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
CE0001@  EQU   @EL00002
@RC00334 EQU   @EL00003
@RC00256 EQU   CE0001@
@RC00262 EQU   CE0001@
@RC00268 EQU   CE0001@
@RC00274 EQU   CE0001@
@RF00280 EQU   CE0001@
@RC00288 EQU   CE0001@
@RC00336 EQU   @RC00334
@RC00373 EQU   @RC00334
@ENDDATA EQU   *
         END   IEDBSM,(C'PLS0103',0701,77144)
