         TITLE 'IEDDVAS, CONTROL BLOCK ASSIGNMENT SUBROUTINE           *
                        '
IEDDVAS  CSECT ,                                                   0001
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         ST    @13,@SA00001+4                                      0001
         LA    @14,@SA00001                                        0001
         ST    @14,8(,@13)                                         0001
         LR    @13,@14                                             0001
*                                   /*
IEDDVAS IEDHJN START,HJN                IDENTIFICATION MACRO
*                                                                  0258
*   /*****************************************************************/
*   /*                                                               */
*   /* CONTROL BLOCK POINTERS AT ENTRY ARE:                          */
*   /* LINETRM-->CTERMTRM-->CTERMQCB-->PLCB. CONTROL BLOCK POINTERS  */
*   /* AFTER DEVICE ASSOCIATION WILL BE:                             */
*   /* LINETRM-->LCITRM-->LCIQCB-->PLCB. BEFORE ANY POINTERS ARE     */
*   /* MOVED, ADDRESSABILITY WILL BE ESTABLISHED TO NEEDED CONTROL   */
*   /* BLOCKS.                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0258
*   IEDQAPTR=TCXAVT;                /* ADDRESSABILITY TO AVT         */
         L     @09,CVTPTR                                          0258
         L     @09,TCXPTR(,@09)                                    0258
         L     @09,TCXAVT(,@09)                                    0258
         ST    @09,IEDQAPTR                                        0258
*   RDISP=AVTEA;                    /* SET DISPATCHER BASE   @YM05686*/
         L     RDISP,AVTEA(,@09)                                   0259
*   CTERMCIN=RZERO;                 /* SAVE TTCIN OF CTERM           */
         STH   RZERO,CTERMCIN                                      0260
*   LCICIN=RPARM;                   /* SAVE TTCIN OF LCI TERMINAL    */
         STH   RPARM,LCICIN                                        0261
*   CALL IEDQTNT;                   /* CONVERT LCI TTCIN TO TRM ADDR */
         L     @15,AVTRNMPT(,@09)                                  0262
         BALR  @14,@15                                             0262
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* SET POINTER TO START OF     0263
*                                      CONTROL BLOCK PREFIX          */
         SL    RPARM,@CF01964                                      0263
*   RTRM=RPARM;                     /* ADDRESSABILITY TO LCI TRM     */
         LR    RTRM,RPARM                                          0264
*   RPARM=CTERMCIN;                 /* SET PARM FOR IEDQTNT          */
         LH    RPARM,CTERMCIN                                      0265
         N     RPARM,@CF02175                                      0265
*   CALL IEDQTNT;                   /* CONVERT CTERM TTCIN TO TRM ADR*/
         L     @09,IEDQAPTR                                        0266
         L     @15,AVTRNMPT(,@09)                                  0266
         BALR  @14,@15                                             0266
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* SET POINTER TO START OF CNTRL
*                                      BLOCK PREFIX                  */
         SL    RPARM,@CF01964                                      0267
*   CTRM=RPARM;                     /* ADDRESSABILITY TO CTERM TRM   */
         ST    RPARM,CTRM                                          0268
*   CQCB=CTRM->TRMDESTQ;            /* ADDRESSABILITY TO CTERM QCB   */
         L     @09,CTRM                                            0269
         SLR   CQCB,CQCB                                           0269
         ICM   CQCB,7,TRMDESTQ(@09)                                0269
*   CQCB=CQCB-LENGTH(IEDNQCB);      /* POINT TO NEG PREFIX   @XM05693*/
         SL    CQCB,@CF00046                                       0270
*   RQCB=TRMDESTQ;                  /* ADDRESSABILITY TO LCI QCB     */
         SLR   RQCB,RQCB                                           0271
         ICM   RQCB,7,TRMDESTQ(RTRM)                               0271
*   IF QCBSTPRI=QCBCNTVL&QCBDELAY=ON THEN/* IS TO QCB CINTVL         */
         CLI   QCBSTPRI(IEDQQPTR),X'70'                            0272
         BNE   @RF00272                                            0272
         TM    QCBDELAY(IEDQQPTR),B'00000010'                      0272
         BNO   @RF00272                                            0272
*     DO;                           /* AND ON TIME DELAY     @XM05693*/
*       RPARM=RQCB;                 /* YES SO TAKE OFF TIME DELAY  0274
*                                                            @XM05693*/
         LR    RPARM,RQCB                                          0274
*       CALL IEDQHG02;              /* INVOKE TIME DELAY DEQUEUE   0275
*                                                            @XM05693*/
         L     @09,IEDQAPTR                                        0275
         L     @15,AVTHG02(,@09)                                   0275
         BALR  @14,@15                                             0275
*     END;                          /*                       @XM05693*/
*   ELSE                                                           0277
*     ;                             /* NOT CINTVL AND ON TDQ @XM05693*/
@RF00272 DS    0H                                                  0278
*   LINECIN=CTRM->TRMCOHRT;         /* SAVE LINE TNT IND     @YM07428*/
         L     @09,CTRM                                            0278
         LH    @09,TRMCOHRT(,@09)                                  0278
         N     @09,@CF02175                                        0278
         STH   @09,LINECIN                                         0278
*   RPARM=CTRM->TRMCOHRT;           /* SET PARM FOR IEDQTNT          */
         LR    RPARM,@09                                           0279
*   CALL IEDQTNT;                   /* CONVERT LINE TTCIN TO TRM ADDR*/
         L     @09,IEDQAPTR                                        0280
         L     @15,AVTRNMPT(,@09)                                  0280
         BALR  @14,@15                                             0280
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* SET POINTER TO START OF CNTRL
*                                      BLK PREFIX                    */
         SL    RPARM,@CF01964                                      0281
*   LINETRM=RPARM;                  /* ADDRESSABILITY TO LINE TRM    */
         LR    LINETRM,RPARM                                       0282
*   RLCB=CQCB->QCBPLCBA;            /* PLCB ADDRESSABILITY   @YM05686*/
         L     @09,QCBPLCBA-1(,CQCB)                               0283
         LA    @09,0(,@09)                                         0283
         LR    RLCB,@09                                            0283
*                                                                  0284
*   /*****************************************************************/
*   /*                                                               */
*   /* IN THE HEIRARCHIAL CONTROL BLOCK STRUCTURE, REPLACE THE       */
*   /* CTERM'S TRM AND QCB WITH THE LCI'S TRM AND QCB. ASSIGN THE    */
*   /* CTERM'S PLCB TO THE LCI'S QCB.                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0284
*   LINETRM->TRMSUBST=LCICIN;       /* LINE TRM MUST POINT TO TRM OF
*                                      LCI                           */
         LH    @06,LCICIN                                          0284
         N     @06,@CF02175                                        0284
         STH   @06,TRMSUBST(,LINETRM)                              0284
*   TRMCOHRT=CTRM->TRMCOHRT;        /* LCI TRM MUST POINT TO TRM OF
*                                      LINE                          */
         L     @06,CTRM                                            0285
         LH    @05,TRMCOHRT(,@06)                                  0285
         N     @05,@CF02175                                        0285
         STH   @05,TRMCOHRT(,RTRM)                                 0285
*   QCBPLCBA=CQCB->QCBPLCBA;        /* MOVE PLCB FROM CTERM TO LCI   */
         LR    @05,IEDQQPTR                                        0286
         SL    @05,@CF00046                                        0286
         STCM  @09,7,QCBPLCBA(@05)                                 0286
*   CQCB->QCBPLCBN=OFF;             /* INDICATE CTERM HAS NO PLCB    */
         NI    QCBPLCBN(CQCB),B'01111111'                          0287
*   QCBPLCBN=ON;                    /* INDICATE LCI HAS A PLCB       */
         OI    QCBPLCBN(@05),B'10000000'                           0288
*   CQCB->QCBTTCIN=CTERMCIN;        /* ASSIGN CTERM'S TTCIN TO QCB   */
         LH    @09,CTERMCIN                                        0289
         N     @09,@CF02175                                        0289
         STH   @09,QCBTTCIN(,CQCB)                                 0289
*   LCBTTCIN=LCICIN;                /* ASSIGN LCI TTCIN TO PLCB    0290
*                                                            @YM04678*/
         LH    @09,LCICIN                                          0290
         N     @09,@CF02175                                        0290
         STH   @09,LCBTTCIN(,RLCB)                                 0290
*   IF CTRM->TRMCLOSN=ON THEN       /* COPY TRMCLOSN BIT IF ON     0291
*                                                            @YM09106*/
         TM    TRMCLOSN(@06),B'00100000'                           0291
         BNO   @RF00291                                            0291
*     TRMCLOSN=ON;                  /* TO LCI ENTRY          @YM09106*/
         LA    @05,TRMCLOSN(,RTRM)                                 0292
         LR    @15,@05                                             0292
         LA    @09,3                                               0292
         NR    @15,@09                                             0292
         LCR   @15,@15                                             0292
         ALR   @05,@15                                             0292
         L     @09,0(,@05)                                         0292
@GL00002 LR    @06,@09                                             0292
         O     @06,@CB02178+3(@15)                                 0292
         CS    @09,@06,0(@05)                                      0292
         BNE   @GL00002                                            0292
*   IF CTRM->TRMOCNI=ON THEN        /* COPY TRMOCNI BIT IF ON      0293
*                                                            @YM09106*/
@RF00291 L     @09,CTRM                                            0293
         TM    TRMOCNI(@09),B'00100000'                            0293
         BNO   @RF00293                                            0293
*     TRMOCNI=ON;                   /* TO LCI ENTRY          @YM09106*/
         OI    TRMOCNI(RTRM),B'00100000'                           0294
*   CTRM->TRMCLOSN=OFF;             /* RESET TRMCLOSN IN CTRM ENTRY
*                                                            @YM09106*/
@RF00293 L     @14,CTRM                                            0295
         LA    @05,TRMCLOSN(,@14)                                  0295
         LR    @15,@05                                             0295
         LA    @09,3                                               0295
         NR    @15,@09                                             0295
         LCR   @15,@15                                             0295
         ALR   @05,@15                                             0295
         L     @09,0(,@05)                                         0295
@GL00003 LR    @06,@09                                             0295
         N     @06,@CB02183+3(@15)                                 0295
         CS    @09,@06,0(@05)                                      0295
         BNE   @GL00003                                            0295
*   CTRM->TRMOCNI=OFF;              /* RESET TRMOCNI IN CTRM ENTRY 0296
*                                                            @YM09106*/
         L     @09,CTRM                                            0296
         NI    TRMOCNI(@09),B'11011111'                            0296
*   IF TRMOCNI=ON×TRMCLOSN=ON THEN                                 0297
         TM    TRMOCNI(RTRM),B'00100000'                           0297
         BO    @RT00297                                            0297
         TM    TRMCLOSN(RTRM),B'00100000'                          0297
         BNO   @RF00297                                            0297
@RT00297 DS    0H                                                  0298
*     LCBLNENT=LINECIN;             /* SET LCBLNENT FOR OPERATOR CNTL
*                                                            @YM07428*/
         LH    @09,LINECIN                                         0298
         N     @09,@CF02175                                        0298
         STH   @09,LCBLNENT(,RLCB)                                 0298
*   ELSE                            /* NOT STOPLINE OR CLOSEDOWN   0299
*                                                            @YM07428*/
*     LCBLNENT=LCBTTCIN;            /* SET LCBLNENT FOR OLD CODE   0299
*                                                            @YM07750*/
         B     @RC00297                                            0299
@RF00297 LH    @09,LCBTTCIN(,RLCB)                                 0299
         N     @09,@CF02175                                        0299
         STH   @09,LCBLNENT(,RLCB)                                 0299
*                                                                  0300
*   /*****************************************************************/
*   /*                                                               */
*   /* PRIME SENDING IF NECESSARY                            @YM05686*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0300
*   RFY                                                            0300
*     RRETCODE RSTD;                /* RESTRICT RRETCODE     @YM05686*/
@RC00297 DS    0H                                                  0301
*   IF LCBSTCBA->STCBVTO=DSPSEND THEN/* IF SS STILL IN PLCB  @YM05686*/
         L     @14,LCBSTCBA-1(,RLCB)                               0301
         CLI   STCBVTO(@14),X'22'                                  0301
         BNE   @RF00301                                            0301
*     DO;                           /*                       @YM05686*/
*       SAVEQCB=RQCB;               /* SAVE RQCB             @YM05686*/
         LR    SAVEQCB,RQCB                                        0303
*       RTOQCB=CTRM->TRMDESTQ;      /* SET TO QCB TO FROM-TRM'S QCB
*                                                            @YM05686*/
         L     @14,CTRM                                            0304
         SLR   RTOQCB,RTOQCB                                       0304
         ICM   RTOQCB,7,TRMDESTQ(@14)                              0304
*       RFROMQCB=RLCB;              /* SET FROM QCB TO PLCB  @YM05686*/
         LR    RFROMQCB,RLCB                                       0305
*       RZERO=RAVT;                 /* SAVE SAVEAREA PTR     @YM08132*/
         LR    RZERO,RAVT                                          0306
*       RAVT=ADDR(AVTSAVE2);        /* GET AVT ADDRESS       @YM08132*/
         L     RAVT,IEDQAPTR                                       0307
         LA    RAVT,AVTSAVE2(,RAVT)                                0307
*       CALL DSPUNAVR;              /* REMOVE FROM-TRM'S SS  @YM05686*/
         LA    @15,DSPUNAVR(,RDISP)                                0308
         BALR  @14,@15                                             0308
*       RAVT=RZERO;                 /* RESTORE SAVEAREA PTR  @YM08132*/
         LR    RAVT,RZERO                                          0309
*       RQCB=SAVEQCB;               /* RESTORE RQCB          @YM05686*/
         LR    RQCB,SAVEQCB                                        0310
*       IF CTRM->TRMOCNI=OFF&CTRM->TRMCLOSN=OFF THEN/* NOT STOPLINE
*                                      NOR CLOSEDOWN         @YM08570*/
         L     @14,CTRM                                            0311
         TM    TRMOCNI(@14),B'00100000'                            0311
         BNZ   @RF00311                                            0311
         TM    TRMCLOSN(@14),B'00100000'                           0311
         BNZ   @RF00311                                            0311
*         DO;                       /*                       @YM08570*/
*           CQCB->QCBSNDRQ=ON;      /* REQ. SS FOR FROM-TRM  @YM05686*/
         OI    QCBSNDRQ(CQCB),B'00100000'                          0313
*           IF CTRM->TRMTYPE^=TRMCTERM&/* IF FROM-TRM NOT CTERM AND
*                                      NOT CALL-IN ONLY THEN @YM05686*/
*               CTRM->TRMDESTQ->QCBSTPRI^=QCBCALLN THEN            0314
         CLI   TRMTYPE(@14),X'48'                                  0314
         BE    @RF00314                                            0314
         SLR   @09,@09                                             0314
         ICM   @09,7,TRMDESTQ(@14)                                 0314
         CLI   QCBSTPRI(@09),X'50'                                 0314
         BE    @RF00314                                            0314
*             DO;                   /*                       @YM05686*/
*               CQCB->QCBRCVRQ=ON;  /* SET PLCB REQUESTED    @YM05686*/
         OI    QCBRCVRQ(CQCB),B'00010000'                          0316
*               RPARM=CTRM->TRMDESTQ;/* PASS FROM-TRM'S QCB  @YM05686*/
         LR    RPARM,@09                                           0317
*               CALL IEDIAP01;      /* REQUEST A PLCB        @YM05686*/
         L     @10,IEDQAPTR                                        0318
         L     @10,AVTSAVTP(,@10)                                  0318
         L     @15,SAVTPREQ(,@10)                                  0318
         BALR  @14,@15                                             0318
*               IF RRETCODE^=0 THEN /* IF PLCB ASSIGNED THEN @YM05686*/
         LTR   RRETCODE,RRETCODE                                   0319
         BZ    @RF00319                                            0319
*                 DO;               /*                       @YM05686*/
*                   RPARM=RRETCODE; /* SET ELEMENT REG       @YM05686*/
         LR    RPARM,RRETCODE                                      0321
*                   RPARM->LCBQCBA=RPARM;/* TPOST TO ITSELF  @YM05686*/
         STCM  RPARM,7,LCBQCBA(RPARM)                              0322
*                   RPARM->LCBPRI=PRILNFRE;/* SET PRIORITY   @YM05686*/
         MVI   LCBPRI(RPARM),X'E0'                                 0323
*                   SAVEQCB=RQCB;   /* SAVE RQCB             @YM05686*/
         LR    SAVEQCB,RQCB                                        0324
*                   RZERO=RAVT;     /* SAVE SAVEAREA PTR     @YM08132*/
         LR    RZERO,RAVT                                          0325
*                   RAVT=ADDR(AVTSAVE2);/* GET AVT ADDRESS   @YM08132*/
         L     RAVT,IEDQAPTR                                       0326
         LA    RAVT,AVTSAVE2(,RAVT)                                0326
*                   CALL DSPPOSTR;  /* TPOST PLCB TO ITSELF  @YM05686*/
         LA    @15,DSPPOSTR(,RDISP)                                0327
         BALR  @14,@15                                             0327
*                   RAVT=RZERO;     /* RESTORE SAVEAREA PTR  @YM08132*/
         LR    RAVT,RZERO                                          0328
*                   RQCB=SAVEQCB;   /* RESTORE RQCB          @YM05686*/
         LR    RQCB,SAVEQCB                                        0329
*                 END;              /*                       @YM05686*/
*             END;                  /*                       @YM05686*/
*         END;                      /*                       @YM05686*/
*     END;                          /*                       @YM05686*/
*   ELSE                                                           0334
*     DO;                                                          0334
         B     @RC00301                                            0334
@RF00301 DS    0H                                                  0335
*       CQCB=CQCB+LENGTH(IEDNQCB);  /* POINT TO FROM QCB     @XM05693*/
         AL    CQCB,@CF00046                                       0335
*       IF CQCB->QCBSTPRI=QCBCNTVL&CQCB->QCBDELAY=OFF&/*     @XM05693*/
*           CQCB->QCBINTVL>0&CTRM->TRMOCNI=OFF&/*            @ZM47635*/
*           CTRM->TRMCLOSN=OFF THEN /* QCB=CINTVAL AND OFF TDQ     0336
*                                                            @ZM47635*/
         CLI   QCBSTPRI(CQCB),X'70'                                0336
         BNE   @RF00336                                            0336
         TM    QCBDELAY(CQCB),B'00000010'                          0336
         BNZ   @RF00336                                            0336
         LH    @14,QCBINTVL(,CQCB)                                 0336
         N     @14,@CF02175                                        0336
         LTR   @14,@14                                             0336
         BNP   @RF00336                                            0336
         L     @09,CTRM                                            0336
         TM    TRMOCNI(@09),B'00100000'                            0336
         BNZ   @RF00336                                            0336
         TM    TRMCLOSN(@09),B'00100000'                           0336
         BNZ   @RF00336                                            0336
*         DO;                       /* AND CINTVAL>0 AND NOT STOPLINE
*                                      OR CLOSEDOWN          @XM05693*/
*           RTIME=CQCB->QCBINTVL;   /* PICK UP CINTVL        @XM05693*/
         LR    RTIME,@14                                           0338
*           IF RTIME>SEC12HR THEN   /* IS IT GREATER THAN 12 HOURS 0339
*                                                            @XM05693*/
         L     @14,@CF02155                                        0339
         CR    RTIME,@14                                           0339
         BNH   @RF00339                                            0339
*             DO;                   /* YES                   @XM05693*/
*               RTIME=RTIME-SEC12HR;/* SUBTRACT 12 HOURS     @XM05693*/
         SLR   RTIME,@14                                           0341
*               CQCB->QCBTIME=ON;   /* INDICATE 12 HOURS     @XM05693*/
         OI    QCBTIME(CQCB),B'00000001'                           0342
*             END;                  /*                       @XM05693*/
*           ELSE                                                   0344
*             ;                     /* CINTVL LESS THAN 12 HOURS   0344
*                                                            @XM05693*/
@RF00339 DS    0H                                                  0345
*           CQCB->QCBEOLDT=RTIME;   /* SET DELAY INTERVAL    @XM05693*/
         STH   RTIME,QCBEOLDT(,CQCB)                               0345
*           CQCB->QCBLKRLN=0;       /* ZERO LOCK RELATED LINE NUM  0346
*                                                            @XM05693*/
         MVI   QCBLKRLN(CQCB),X'00'                                0346
*           CQCB->QCBELCHN=CQCB;    /* SET QCB ADDR IN ELEMENT     0347
*                                                            @XM05693*/
         STCM  CQCB,7,QCBELCHN(CQCB)                               0347
*           CQCB->QCBPRI=PRIMHUNT;  /* SET PRIORITY ON RETURN      0348
*                                                            @XM05693*/
         MVI   QCBPRI(CQCB),X'E8'                                  0348
*           CQCB->QCBSTCHN=CQCB->QCBSLINK;/* PUT DEST SCHED IN     0349
*                                                            @XM05693*/
         MVC   QCBSTCHN(3,CQCB),QCBSLINK(CQCB)                     0349
*           RPARM=CQCB;             /* POINT TO ELEMENT QCB  @XM05693*/
         LR    RPARM,CQCB                                          0350
*           CALL IEDQHG01;          /* PUT ON TIME DELAY     @XM05693*/
         L     @09,IEDQAPTR                                        0351
         L     @15,AVTHG01(,@09)                                   0351
         BALR  @14,@15                                             0351
*         END;                      /*                       @XM05693*/
*       CQCB=CQCB-LENGTH(IEDNQCB);  /* BACK UP TO PREF       @XM05693*/
@RF00336 SL    CQCB,@CF00046                                       0353
*     END;                          /*                       @XM05693*/
*   IF TRMTYPE^=TRMCTERM THEN       /* IF TO-TRM IS NOT THE CTERM    */
@RC00301 CLI   TRMTYPE(RTRM),X'48'                                 0355
         BE    @RF00355                                            0355
*     IF QCBSNDRQ=ON THEN           /* IF SS REQUESTED THEN  @YM05686*/
         LR    @14,IEDQQPTR                                        0356
         SL    @14,@CF00046                                        0356
         TM    QCBSNDRQ(@14),B'00100000'                           0356
         BNO   @RF00356                                            0356
*       DO;                         /*                       @YM05686*/
*         QCBSNDRQ=OFF;             /* RESET SS REQUESTED    @YM05686*/
         NI    QCBSNDRQ(@14),B'11011111'                           0358
*         SAVEQCB=RQCB;             /* SAVE RQCB             @YM05686*/
         LR    SAVEQCB,RQCB                                        0359
*         RTOQCB=RLCB;              /* SET TO QCB TO PLCB    @YM05686*/
         LR    RTOQCB,RLCB                                         0360
*         RFROMQCB=TRMDESTQ;        /* SET FROM QCB TO TO-TRM'S QCB
*                                                            @YM05686*/
         SLR   RFROMQCB,RFROMQCB                                   0361
         ICM   RFROMQCB,7,TRMDESTQ(RTRM)                           0361
*         RZERO=RAVT;               /* SAVE SAVEAREA PTR     @YM08132*/
         LR    RZERO,RAVT                                          0362
*         RAVT=ADDR(AVTSAVE2);      /* GET AVT ADDRESS       @YM08132*/
         L     RAVT,IEDQAPTR                                       0363
         LA    RAVT,AVTSAVE2(,RAVT)                                0363
*         CALL DSPUNAVR;            /* INSERT TO-TRM'S SS    @YM05686*/
         LA    @15,DSPUNAVR(,RDISP)                                0364
         BALR  @14,@15                                             0364
*         RAVT=RZERO;               /* RESTORE SAVEAREA PTR  @YM08132*/
         LR    RAVT,RZERO                                          0365
*         RQCB=SAVEQCB;             /* RESTORE RQCB          @YM05686*/
         LR    RQCB,SAVEQCB                                        0366
*       END;                        /*                       @YM05686*/
*   RFY                                                            0368
*     RRETCODE UNRSTD;              /* FREE REG              @YM05686*/
@RF00356 DS    0H                                                  0368
@RF00355 DS    0H                                                  0369
*                                                                  0369
*   /*****************************************************************/
*   /*                                                               */
*   /* WHEN SENDING AND RECEIVING, TCAM'S TTCIN'S ARE TRANSLATED TO  */
*   /* AND FROM NETWORK ADDRESSES VIA TWO TABLES: THE RESOURCE VECTOR*/
*   /* TABLE (RVT) ON RECEIVE AND THE NETWORK ADDRESS TABLE (NAT) ON */
*   /* SEND. SINCE THE NCP COMMUNICATES ONLY WITH THE CTERM, IF TCAM */
*   /* IS SENDING TO A LOGICAL CONNECTION INDEX, THE LCI'S TTCIN MUST*/
*   /* BE TRANSLATED TO THE CTERM'S NETWORK ADDRESS. ON RECEIVE THE  */
*   /* CTERM'S NETWORK ADDRESS MUST BE TRANSLATED TO THE LCI'S TTCIN.*/
*   /* THIS IS ACCOMPLISHED BY SWAPPING THE CTERM AND LCI ENTRIES IN */
*   /* THE RVT AND NAT TABLES. THE ELEMENT PORTION OF A NETWORK      */
*   /* ADDRESS IS AN INDEX INTO THE RVT. A TTCIN IS AN INDEX INTO THE*/
*   /* NAT. FOR EACH NCP IN THE SYSTEM, THERE IS A UNIQUE RVT. THE   */
*   /* SUBAREA TABLE (SAT) IS A TABLE OF POINTERS TO THESE RVT'S. THE*/
*   /* SUBAREA TABLE IS INDEXED BY THE SUBAREA PORTION OF THE NETWORK*/
*   /* ADDRESS.                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0369
*/*                                                                  */
*/*CALL IEDIAP04 TO CONVERT THE LCI'S TTCIN TO A NETWORK ADDRESS     */
*/*                                                                  */
*                                                                  0369
*   RPARM=LCICIN;                   /* PARM PASSED IS TTCIN OF LCI   */
         LH    RPARM,LCICIN                                        0369
         N     RPARM,@CF02175                                      0369
*   RFY                                                            0370
*     RLINK RSTD;                                                  0370
*   CALL IEDIAP04;                  /* ON RETURN, RLINK WILL CONTAIN
*                                      THE NETWORK ADDRESS           */
         L     @09,IEDQAPTR                                        0371
         L     @09,AVTSAVTP(,@09)                                  0371
         L     @15,SAVTTNTX(,@09)                                  0371
         BALR  @14,@15                                             0371
*   LCISUBA=RLINK;                  /* SAVE THE NETWORK ADDRESS IN 0372
*                                      TWO LOCATIONS                 */
         STCM  RLINK,3,LCISUBA                                     0372
*   LCIELEM=RLINK;                                                 0373
*                                                                  0373
         STCM  RLINK,3,LCIELEM                                     0373
*/*                                                                  */
*/*SEPARATE THE LCI'S NETWORK ADDRESS INTO SUBAREA AND ELEMENT       */
*/*                                                                  */
*                                                                  0374
*   SLL(LCIELEM,SAVTSUBL);          /* TO GET ELEMENT ADDRESS, SHIFT
*                                      SUBAREA'S ADDRESS OUT OF    0374
*                                      NETWORK ADDRESS               */
         SLR   @14,@14                                             0374
         ICM   @14,3,LCIELEM                                       0374
         L     @09,IEDQAPTR                                        0374
         L     @09,AVTSAVTP(,@09)                                  0374
         SLR   @06,@06                                             0374
         IC    @06,SAVTSUBL(,@09)                                  0374
         SLL   @14,0(@06)                                          0374
         STCM  @14,3,LCIELEM                                       0374
*   SRL(LCIELEM,SAVTSUBL);          /* RIGHT ADJUST ELEMENT ADDRESS  */
         SLR   @14,@14                                             0375
         ICM   @14,3,LCIELEM                                       0375
         SRL   @14,0(@06)                                          0375
         STCM  @14,3,LCIELEM                                       0375
*/*                                                                  */
*                                                                  0376
*   ELEMLEN=NABITLEN-SAVTSUBL;      /* CALC LENGTH OF ELEMENT'S    0376
*                                      ADDRESS                       */
         LCR   @06,@06                                             0376
         AL    @06,@CF00464                                        0376
         LR    ELEMLEN,@06                                         0376
*   SRL(LCISUBA,ELEMLEN);           /* TO GET SUBAREA ADDRESS, SHIFT
*                                      ELEMENT'S ADDRESS OUT OF    0377
*                                      NETWORK ADDRESS               */
         SLR   @14,@14                                             0377
         ICM   @14,3,LCISUBA                                       0377
         SRL   @14,0(ELEMLEN)                                      0377
         STCM  @14,3,LCISUBA                                       0377
*/*                                                                  */
*/*CALL IEDIAP04 TO CONVERT THE CTERM'S TTCIN TO A NETWORK ADDRESS   */
*/*                                                                  */
*                                                                  0378
*   RPARM=CTERMCIN;                 /* PARM PASSED IS THE CTERM TTCIN*/
         LH    RPARM,CTERMCIN                                      0378
         N     RPARM,@CF02175                                      0378
*   CALL IEDIAP04;                  /* ON RETURN RLINK CONTAINS THE
*                                      NETWORK ADDRESS               */
         L     @15,SAVTTNTX(,@09)                                  0379
         BALR  @14,@15                                             0379
*   CTRMELEM=RLINK;                 /* SAVE THE CTERM'S NETWORK    0380
*                                      ADDRESS....                   */
         STCM  RLINK,3,CTRMELEM                                    0380
*   CTRMSUBA=RLINK;                 /* ....IN TWO LOCATIONS          */
         STCM  RLINK,3,CTRMSUBA                                    0381
*   RFY                                                            0382
*     RLINK UNRSTD;                                                0382
*                                                                  0382
*/*                                                                  */
*/*SEPARATE THE CTERM'S NETWORK ADDRESS INTO SUBAREA AND ELEMENT     */
*/*                                                                  */
*                                                                  0383
*   SLL(CTRMELEM,SAVTSUBL);         /* SHIFT THE SUBAREA PORTION OUT
*                                      OF THE ....                   */
         SLR   @09,@09                                             0383
         ICM   @09,3,CTRMELEM                                      0383
         L     @06,IEDQAPTR                                        0383
         L     @06,AVTSAVTP(,@06)                                  0383
         SLR   @05,@05                                             0383
         IC    @05,SAVTSUBL(,@06)                                  0383
         SLL   @09,0(@05)                                          0383
         STCM  @09,3,CTRMELEM                                      0383
*   SRL(CTRMELEM,SAVTSUBL);         /* ...CTERM'S NETWORK ADDRESS    */
         SLR   @09,@09                                             0384
         ICM   @09,3,CTRMELEM                                      0384
         SRL   @09,0(@05)                                          0384
         STCM  @09,3,CTRMELEM                                      0384
*   SRL(CTRMSUBA,ELEMLEN);          /* SHIFT ELEMENTS ADDRESS OUT OF
*                                      NETWORK ADDR                  */
         SLR   @09,@09                                             0385
         ICM   @09,3,CTRMSUBA                                      0385
         SRL   @09,0(ELEMLEN)                                      0385
         STCM  @09,3,CTRMSUBA                                      0385
*/*                                                                  */
*/*SETUP ADDRESSABILITY TO LCI'S AND CTERM'S RESOURCE VECTOR TABLES  */
*/*                                                                  */
*                                                                  0386
*   IEDQSATP=SAVTSAT+(LENGTH(IEDSATD)*(LCISUBA-1));/* FIND LCI SAT 0386
*                                      ENTRY                         */
         L     @09,SAVTSAT(,@06)                                   0386
         SLR   IEDQSATP,IEDQSATP                                   0386
         ICM   IEDQSATP,3,LCISUBA                                  0386
         BCTR  IEDQSATP,0                                          0386
         SLA   IEDQSATP,3                                          0386
         ALR   IEDQSATP,@09                                        0386
*   LCIRVTP=SATRNRVT;               /* PTR TO LCI RVT                */
         L     @05,SATRNRVT(,IEDQSATP)                             0387
         ST    @05,LCIRVTP                                         0387
*   IEDQSATP=SAVTSAT+(LENGTH(IEDSATD)*(CTRMSUBA-1));/* FIND CTERM SAT
*                                      ENTRY                         */
         SLR   IEDQSATP,IEDQSATP                                   0388
         ICM   IEDQSATP,3,CTRMSUBA                                 0388
         BCTR  IEDQSATP,0                                          0388
         SLA   IEDQSATP,3                                          0388
         ALR   @09,IEDQSATP                                        0388
         LR    IEDQSATP,@09                                        0388
*   IEDQRVTP=SATRNRVT;              /* PTR TO CTERM RVT              */
         L     @09,SATRNRVT(,IEDQSATP)                             0389
         ST    @09,IEDQRVTP                                        0389
*/*                                                                  */
*/*SWAP THE LCI AND CTERM ENTRIES IN THE RVT                         */
*/*                                                                  */
*                                                                  0390
*   IEDQRVTP=IEDQRVTP+(CTRMELEM*LENGTH(RVTINDEX));/* CTERM ENTRY   0390
*                                                            @YM05649*/
         SLR   @15,@15                                             0390
         ICM   @15,3,CTRMELEM                                      0390
         ALR   @15,@15                                             0390
         ALR   @09,@15                                             0390
         ST    @09,IEDQRVTP                                        0390
*   SAVINDEX=RVTINDEX;              /* SAVE CTERM ENTRY              */
         LH    SAVINDEX,RVTINDEX(,@09)                             0391
*   LCIRVTP=LCIRVTP+(LCIELEM*LENGTH(RVTINDEX));/* LCI ENTRY  @YM05649*/
         SLR   @15,@15                                             0392
         ICM   @15,3,LCIELEM                                       0392
         ALR   @15,@15                                             0392
         ALR   @05,@15                                             0392
         ST    @05,LCIRVTP                                         0392
*   RVTINDEX=LCIRVTP->RVTINDEX;     /* REPLACE CTERM ENTRY WITH LCI
*                                      ENTRY                         */
         LH    @15,RVTINDEX(,@05)                                  0393
         STH   @15,RVTINDEX(,@09)                                  0393
*   LCIRVTP->RVTINDEX=SAVINDEX;     /* REPLACE LCI ENTRY WITH CTERM
*                                      ENTRY                         */
         STH   SAVINDEX,RVTINDEX(,@05)                             0394
*/*                                                                  */
*/*SWAP THE LCI AND CTERM ENTRIES IN THE NAT                         */
*/*                                                                  */
*                                                                  0395
*   IEDQNATP=SAVTNAT+((CTERMCIN-1)*(LENGTH(IEDNATD)));/* SET PTR TO
*                                      CTERM ENTRY                   */
         L     @09,SAVTNAT(,@06)                                   0395
         LH    @06,CTERMCIN                                        0395
         N     @06,@CF02175                                        0395
         BCTR  @06,0                                               0395
         ALR   @06,@06                                             0395
         ALR   @06,@09                                             0395
         ST    @06,IEDQNATP                                        0395
*   SAVNA=NATODAF;                  /* SAVE CTERM ENTRY              */
         LH    @05,NATODAF(,@06)                                   0396
         N     @05,@CF02175                                        0396
         STH   @05,SAVNA                                           0396
*   LCINATPT=SAVTNAT+((LCICIN-1)*(LENGTH(IEDNATD)));/* SET PTR TO LCI
*                                      ENTRY                         */
         LH    LCINATPT,LCICIN                                     0397
         N     LCINATPT,@CF02175                                   0397
         BCTR  LCINATPT,0                                          0397
         ALR   LCINATPT,LCINATPT                                   0397
         ALR   @09,LCINATPT                                        0397
         LR    LCINATPT,@09                                        0397
*   NATODAF=LCINATPT->NATODAF;      /* REPLACE CTERM ENTRY WIHT LCI
*                                      ENTRY                         */
         MVC   NATODAF(2,@06),NATODAF(LCINATPT)                    0398
*   LCINATPT->NATODAF=SAVNA;        /* REPALCE LCI ENTRY WITH CTERM
*                                      ENTRY                         */
         LH    @09,SAVNA                                           0399
         N     @09,@CF02175                                        0399
         STH   @09,NATODAF(,LCINATPT)                              0399
*                                                                  0400
*   /*****************************************************************/
*   /*                                                               */
*   /* STATE BITS MUST BE PROPOGATED BETWEEN THE TWO TRM CONTROL     */
*   /* BLOCKS.                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0400
*   IF CTRM->TRMSESSN=ON THEN       /*                       @YM04682*/
         L     @10,CTRM                                            0400
         TM    TRMSESSN(@10),B'01000000'                           0400
         BNO   @RF00400                                            0400
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMSESSN=OFF;         /*                       @YM04682*/
         NI    TRMSESSN(@10),B'10111111'                           0402
*       TRMSESSN=ON;                /*                       @YM04682*/
         OI    TRMSESSN(RTRM),B'01000000'                          0403
*     END;                          /*                       @YM04682*/
*   IF CTRM->TRMUDEF=ON THEN        /*                       @YM04682*/
@RF00400 L     @10,CTRM                                            0405
         TM    TRMUDEF(@10),B'10000000'                            0405
         BNO   @RF00405                                            0405
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMUDEF=OFF;          /*                       @YM04682*/
         NI    TRMUDEF(@10),B'01111111'                            0407
*       TRMUDEF=ON;                 /*                       @YM04682*/
         OI    TRMUDEF(RTRM),B'10000000'                           0408
*     END;                          /*                       @YM04682*/
*   IF CTRM->TRMOCNI=ON THEN        /*                       @YM04682*/
@RF00405 L     @10,CTRM                                            0410
         TM    TRMOCNI(@10),B'00100000'                            0410
         BNO   @RF00410                                            0410
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMOCNI=OFF;          /*                       @YM04682*/
         NI    TRMOCNI(@10),B'11011111'                            0412
*       TRMOCNI=ON;                 /*                       @YM04682*/
         OI    TRMOCNI(RTRM),B'00100000'                           0413
*     END;                          /*                       @YM04682*/
*   IF CTRM->TRMERLCK=ON THEN       /*                       @YM04682*/
@RF00410 L     @10,CTRM                                            0415
         TM    TRMERLCK(@10),B'00000100'                           0415
         BNO   @RF00415                                            0415
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMERLCK=OFF;         /*                       @YM04682*/
         NI    TRMERLCK(@10),B'11111011'                           0417
*       TRMERLCK=ON;                /*                       @YM04682*/
         OI    TRMERLCK(RTRM),B'00000100'                          0418
*     END;                          /*                       @YM04682*/
*   IF CTRM->TRMASNXI=ON THEN       /*                       @YM04682*/
@RF00415 L     @10,CTRM                                            0420
         TM    TRMASNXI(@10),B'00010000'                           0420
         BNO   @RF00420                                            0420
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMASNXI=OFF;         /*                       @YM04682*/
         NI    TRMASNXI(@10),B'11101111'                           0422
*       TRMASNXI=ON;                /*                       @YM04682*/
         OI    TRMASNXI(RTRM),B'00010000'                          0423
*     END;                          /*                       @YM04682*/
*   IF CTRM->TRMSTMM=ON THEN        /*                       @YM04682*/
@RF00420 L     @10,CTRM                                            0425
         TM    TRMSTMM(@10),B'00100000'                            0425
         BNO   @RF00425                                            0425
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMSTMM=OFF;          /*                       @YM04682*/
         NI    TRMSTMM(@10),B'11011111'                            0427
*       TRMSTMM=ON;                 /*                       @YM04682*/
         OI    TRMSTMM(RTRM),B'00100000'                           0428
*     END;                          /*                       @YM04682*/
*   IF CTRM->TRMTRACE=ON THEN       /*                       @YM04682*/
@RF00425 L     @10,CTRM                                            0430
         TM    TRMTRACE(@10),B'00001000'                           0430
         BNO   @RF00430                                            0430
*     DO;                           /*                       @YM04682*/
*       CTRM->TRMTRACE=OFF;         /*                       @YM04682*/
         NI    TRMTRACE(@10),B'11110111'                           0432
*       TRMTRACE=ON;                /*                       @YM04682*/
         OI    TRMTRACE(RTRM),B'00001000'                          0433
*     END;                          /*                       @YM04682*/
*   END IEDDVAS                                                    0435
*                                                                  0435
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */
*/*%INCLUDE SYSLIB  (TNATD   )                                       */
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */
*/*%INCLUDE SYSLIB  (TRVTD   )                                       */
*/*%INCLUDE SYSLIB  (TSATD   )                                       */
*/*%INCLUDE SYSLIB  (TSTCBD  )                                       */
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*                                                                  0435
*       ;                                                          0435
@EL00001 L     @13,4(,@13)                                         0435
@EF00001 DS    0H                                                  0435
@ER00001 LM    @14,@12,12(@13)                                     0435
         BR    @14                                                 0435
@DATA    DS    0H
         DS    0F
@SA00001 DS    18F
         DS    0F
@CF00046 DC    F'8'
@CF01964 DC    F'14'
@CF02155 DC    F'43200'
@CF02175 DC    XL4'0000FFFF'
@CF00464 DC    XL4'10'
         DS    0D
IEDQAPTR DS    A
IEDQNATP DS    A
IEDQRVTP DS    A
LCIRVTP  DS    A
CTRM     DS    A
SAVNA    DS    H
CTERMCIN DS    H
LCICIN   DS    H
LINECIN  DC    AL2(0)
@CB02178 DC    B'000000000000000000000000001000000000000000000000000000C
               00'
@CB02183 DC    B'111111111111111111111111110111111111111111111111111111C
               11'
CTRMSUBA DS    BL2
LCISUBA  DS    BL2
LCIELEM  DS    BL2
CTRMELEM DS    BL2
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SAVEQCB  EQU   @06
ELEMLEN  EQU   @10
LINETRM  EQU   @05
CQCB     EQU   @10
SAVINDEX EQU   @10
LCINATPT EQU   @10
IEDQSATP EQU   @10
RDISP    EQU   @11
IEDQLPTR EQU   @04
LCBXPTR  EQU   @05
IEDQQPTR EQU   @07
RTRM     EQU   @08
RLCB     EQU   @04
RPARM    EQU   @01
RZERO    EQU   @00
RLINK    EQU   @15
RTIME    EQU   @02
RTOQCB   EQU   @03
RFROMQCB EQU   @07
RQCB     EQU   @07
RBASE    EQU   @12
RAVT     EQU   @13
RRETCODE EQU   @15
RRETURN  EQU   @14
CVTPTR   EQU   16
IEDQAVTD EQU   0
AVTSAVE2 EQU   IEDQAVTD+72
AVTSAVEX EQU   IEDQAVTD+288
@NM00003 EQU   IEDQAVTD+388
AVTCKFLG EQU   @NM00003
AVTBASE  EQU   IEDQAVTD+412
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+424
AVTOSECB EQU   IEDQAVTD+492
AVTECB1  EQU   AVTOSECB
AVTHG02  EQU   IEDQAVTD+528
AVTEA    EQU   IEDQAVTD+548
AVTDISP  EQU   IEDQAVTD+552
AVTHD    EQU   IEDQAVTD+556
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+612
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+652
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+680
AVTCKBYT EQU   IEDQAVTD+691
AVTHG01  EQU   IEDQAVTD+692
AVTCKLNK EQU   IEDQAVTD+696
AVTCRELE EQU   IEDQAVTD+708
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+716
AVTADBUF EQU   IEDQAVTD+720
AVTSYSER EQU   IEDQAVTD+728
AVTCKPQB EQU   IEDQAVTD+804
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+816
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+828
AVTCWFL1 EQU   IEDQAVTD+924
AVTCWFL2 EQU   IEDQAVTD+925
AVTSUBT  EQU   IEDQAVTD+948
AVTIOTR  EQU   IEDQAVTD+949
AVTBIT1  EQU   IEDQAVTD+1050
AVTBIT2  EQU   IEDQAVTD+1051
AVTBIT3  EQU   IEDQAVTD+1052
AVTBIT4  EQU   IEDQAVTD+1136
@NM00085 EQU   IEDQAVTD+1232
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTPREQ EQU   IEDNSVTD+16
SAVTNAT  EQU   IEDNSVTD+76
SAVTSAT  EQU   IEDNSVTD+80
SAVTLUSQ EQU   IEDNSVTD+88
SAVTTCPU EQU   IEDNSVTD+238
SAVTTNTX EQU   IEDNSVTD+252
SAVTZELM EQU   IEDNSVTD+270
SAVTSUBL EQU   IEDNSVTD+272
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IEDQDISP EQU   0
DSPPOSTR EQU   28
DSPUNAVR EQU   44
IEDQLCB  EQU   0
LCBRCB   EQU   IEDQLCB
LCBQCBA  EQU   LCBRCB+1
LCBPRI   EQU   LCBRCB+4
LCBSTCBA EQU   IEDQLCB+9
LCBTSOB  EQU   IEDQLCB+19
LCBCHAIN EQU   IEDQLCB+20
LCBSCRNN EQU   LCBCHAIN
LCBTETEN EQU   LCBCHAIN
LCBINSRC EQU   IEDQLCB+21
LCBLKMDE EQU   LCBINSRC+2
LCBNTXT  EQU   IEDQLCB+24
LCBSTAT4 EQU   LCBNTXT
LCBPHASE EQU   LCBSTAT4
LCBSCBDA EQU   IEDQLCB+25
LCBLNENT EQU   LCBSCBDA+1
LCBMHA   EQU   IEDQLCB+29
LCBFLAG1 EQU   IEDQLCB+32
LCBIOBSN EQU   IEDQLCB+33
LCBSNS   EQU   LCBIOBSN+1
LCBSENS0 EQU   LCBSNS
LCBLOSDT EQU   LCBSENS0
LCBTMOUT EQU   LCBSENS0
LCBFLAG3 EQU   LCBIOBSN+7
LCBCSW   EQU   LCBIOBSN+8
LCBCSWST EQU   LCBCSW+3
LCBCSWUS EQU   LCBCSWST
LCBCSWCS EQU   LCBCSWST+1
LCBSIOCC EQU   LCBIOBSN+15
LCBDCBPT EQU   IEDQLCB+52
LCBRCQCB EQU   IEDQLCB+56
LCBTHSQ  EQU   IEDQLCB+60
LCBINCAM EQU   LCBTHSQ
LCBERRCT EQU   IEDQLCB+62
LCBLSPCI EQU   IEDQLCB+65
LCBRCBFR EQU   LCBLSPCI
LCBSTATE EQU   IEDQLCB+70
LCBSTAT1 EQU   LCBSTATE
LCBSTAT2 EQU   LCBSTATE+1
LCBBEOTN EQU   LCBSTAT2
LCBSYNC  EQU   LCBSTAT2
LCBDIAL  EQU   LCBSTAT2
LCBTSTSW EQU   IEDQLCB+72
LCBERB   EQU   IEDQLCB+76
LCBERBST EQU   IEDQLCB+84
LCBDLNKN EQU   LCBERBST
LCBERBCT EQU   IEDQLCB+88
LCBRBCT2 EQU   LCBERBCT+1
LCBTTCIN EQU   IEDQLCB+90
LCBMSGFM EQU   IEDQLCB+92
LCBOBRCH EQU   IEDQLCB+96
LCBINVPT EQU   LCBOBRCH+1
LCBBFRW  EQU   LCBINVPT
LCBTPCD  EQU   IEDQLCB+100
LCBSTAT5 EQU   LCBTPCD
LCBSTAT6 EQU   LCBTPCD+4
LCBRSPSV EQU   LCBTPCD+8
LCBSAVSN EQU   IEDQLCB+112
LCBERCCW EQU   IEDQLCB+120
LCBCPA   EQU   IEDQLCB+144
LCBCCW5  EQU   LCBCPA+32
LCBATTEL EQU   LCBCCW5
LCBQEBPL EQU   LCBATTEL
IEDQLCBX EQU   0
LCBXCON  EQU   IEDQLCBX
LCBXFLAG EQU   LCBXCON
LCBXDCT  EQU   LCBXCON+1
LCBXRADR EQU   LCBXCON+4
IEDNATD  EQU   0
NATODAF  EQU   IEDNATD
IEDQQCB  EQU   0
QCBDSFLG EQU   IEDQQCB
QCBDISK  EQU   QCBDSFLG
QCBELCHN EQU   IEDQQCB+1
QCBPRI   EQU   IEDQQCB+4
QCBSTCHN EQU   IEDQQCB+9
QCBSTPRI EQU   IEDQQCB+12
QCBSLINK EQU   IEDQQCB+13
QCBEOLDT EQU   IEDQQCB+16
QCBBYTE1 EQU   QCBEOLDT+1
QCBLKRLN EQU   IEDQQCB+18
QCBRETCT EQU   QCBLKRLN
QCBSTAT  EQU   IEDQQCB+19
QCBTIME  EQU   QCBSTAT
QCBINSRC EQU   IEDQQCB+21
@NM00150 EQU   QCBINSRC
QCBTSOF2 EQU   @NM00150+1
QCBTSOF1 EQU   @NM00150+2
QCBDELAY EQU   QCBTSOF1
QCBINTVL EQU   IEDQQCB+24
QCBPREN  EQU   IEDQQCB+28
QCBLKRRN EQU   QCBPREN+1
QCBDCBAD EQU   IEDQQCB+33
QCBFLAG  EQU   IEDQQCB+36
IEDQPQCB EQU   0
QCBFHDLZ EQU   IEDQPQCB+3
QCBPFEFO EQU   QCBFHDLZ+1
QCBFHDTZ EQU   IEDQPQCB+6
QCBINTLF EQU   IEDQPQCB+12
IEDNQCB  EQU   0
QCBSTAT1 EQU   IEDNQCB+4
QCBPLCBN EQU   QCBSTAT1
QCBSNDRQ EQU   QCBSTAT1
QCBRCVRQ EQU   QCBSTAT1
QCBPLCBA EQU   IEDNQCB+5
QCBTTCIN EQU   QCBPLCBA+1
IEDRVTD  EQU   0
RVTINDEX EQU   IEDRVTD+2
IEDSATD  EQU   0
SATRNRVT EQU   IEDSATD+4
IEDQSTCB EQU   0
STCBVTO  EQU   IEDQSTCB
IEDQTCXD EQU   0
TCXAVT   EQU   IEDQTCXD
TCXATTEN EQU   IEDQTCXD+4
TCXFLAG1 EQU   IEDQTCXD+34
TCXBUFA  EQU   IEDQTCXD+80
TCXDSAVE EQU   IEDQTCXD+104
TCXQE8   EQU   IEDQTCXD+216
IEDTRM   EQU   0
IEDNTRM  EQU   IEDTRM
TRMBYTE4 EQU   IEDNTRM
TRMBYTE3 EQU   IEDNTRM+1
TRMBYTE2 EQU   IEDNTRM+2
TRMINPG  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMBYTE1 EQU   IEDNTRM+3
TRMSCPRQ EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMCOHRT EQU   IEDNTRM+4
TRMBYTE0 EQU   IEDNTRM+6
TRMUDEF  EQU   TRMBYTE0
TRMSIBPT EQU   IEDNTRM+7
TRMTYPE  EQU   IEDNTRM+11
TRMSUBST EQU   IEDNTRM+12
IEDQTRM  EQU   IEDTRM+14
TRMSTATE EQU   IEDQTRM
TRMLOG   EQU   TRMSTATE
TRMDESTQ EQU   IEDQTRM+1
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMALTD  EQU   IEDQTRM+8
TRMDEVFL EQU   IEDQTRM+10
TRMSTAT  EQU   IEDQTRM+12
IEDQTNT  EQU   0
IEDQHG02 EQU   0
IEDQHG01 EQU   0
IEDIAP01 EQU   0
IEDIAP04 EQU   0
DSPBYPAS EQU   20
DSPCHAIN EQU   12
DSPDISP  EQU   4
DSPLIFO  EQU   56
DSPLIFOR EQU   60
DSPLIST  EQU   8
DSPPOST  EQU   24
DSPPRIO  EQU   48
DSPPRIOR EQU   52
DSPTRACE EQU   64
DSPTSTQ  EQU   32
DSPTSTQR EQU   36
DSPUNAV  EQU   40
DSPWAIT  EQU   16
QCBLDCB  EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LCBRSPIN EQU   LCBIOBSN
LCBLUSNS EQU   LCBRSPIN+5
LCBSCPRS EQU   LCBRSPIN+9
LCBCSWU1 EQU   LCBSCPRS+2
LCBRSPFG EQU   LCBRSPIN+15
LCBCOREQ EQU   LCBTPCD
@NM00134 EQU   LCBCPA+40
LCBQNX   EQU   LCBERCCW
LCBQNXMN EQU   LCBQNX
LCBCANCL EQU   LCBSAVSN
LCBCANFG EQU   LCBCANCL
TCXPTR   EQU   CVTAQAVT
TRMPRE1  EQU   TRMBYTE4
TRMSESSN EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMNCP1  EQU   TRMBYTE4
TRMPRE   EQU   TRMBYTE3
TRMSTMM  EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMNCP   EQU   TRMBYTE3
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00162 EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMLULOG EQU   TRMLU
TRMINERR EQU   TRMLU
TRMLUREQ EQU   TRMLU
TRMSESRQ EQU   TRMLU
TRMTDIFF EQU   TRMLU
TRMLUTM  EQU   TRMLU
TRMLUIT  EQU   TRMLU
TRMAUTO  EQU   TRMLU
TRMPCONT EQU   TRMPU
@NM00161 EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMNCPCL EQU   TRMNCP
TRMIPLDM EQU   TRMNCP
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
@NM00160 EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
@NM00142 EQU   LCBCANCL+3
LCBCANTH EQU   LCBCANCL+1
@NM00141 EQU   LCBCANFG
LCBCANCD EQU   LCBCANFG
@NM00140 EQU   LCBCANFG
LCBCANEB EQU   LCBCANFG
LCBCANXT EQU   LCBCANFG
LCBUNADD EQU   LCBQNX+21
LCBUASZE EQU   LCBQNX+20
LCBDSTEA EQU   LCBQNX+16
@NM00139 EQU   LCBQNX+8
LCBIOSBS EQU   LCBQNX+5
@NM00138 EQU   LCBQNX+4
LCBSTSAV EQU   LCBQNX+1
@NM00137 EQU   LCBQNXMN
LCBNX509 EQU   LCBQNXMN
LCBNX162 EQU   LCBQNXMN
LCBNX142 EQU   LCBQNXMN
LCBNX064 EQU   LCBQNXMN
@NM00136 EQU   @NM00134+4
LCBNCPPT EQU   @NM00134+1
@NM00135 EQU   @NM00134
LCBWRSCH EQU   LCBCOREQ+8
LCBCQLNK EQU   LCBCOREQ+4
LCBCQELE EQU   LCBCOREQ
LCBPAKCH EQU   LCBRSPIN+16
@NM00133 EQU   LCBRSPFG
LCBRSRH  EQU   LCBRSPFG
LCBEXPI  EQU   LCBRSPFG
@NM00132 EQU   LCBRSPIN+12
LCBUSUE1 EQU   LCBCSWU1
@NM00131 EQU   LCBCSWU1
@NM00130 EQU   LCBSCPRS+1
LCBDFCMD EQU   LCBSCPRS
LCBUSER  EQU   LCBLUSNS+2
LCBSMIN  EQU   LCBLUSNS+1
LCBSMAJ  EQU   LCBLUSNS
LCBRHSV  EQU   LCBRSPIN+2
LCBSNS0  EQU   LCBRSPIN+1
@NM00129 EQU   LCBRSPIN
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
TRMOPT   EQU   IEDTRM+34
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMSENSE EQU   TRMSTAT+3
TRMTEMPR EQU   TRMSTAT+2
TRMSIO   EQU   TRMSTAT
@NM00159 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
TRMNCPI  EQU   TRMDEVFL+1
TRMRNTRM EQU   TRMDEVFL+1
@NM00158 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMADDC  EQU   TRMDEVFL
TRMDDIG  EQU   TRMDEVFL
TRMBUFS  EQU   TRMDEVFL
TRMPRILK EQU   TRMALTD
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TLISTCNT
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMLINE  EQU   TRMSTATE
TRMRLMCT EQU   IEDNTRM+10
TRMCOHTG EQU   TRMSIBPT+1
TRMGPCNT EQU   TRMSIBPT
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
@NM00157 EQU   TRMBYTE0
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMSTOTE EQU   TRMBYTE1
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMREMB  EQU   TRMBYTE2
TRMRSACT EQU   TRMBYTE2
TCXEND   EQU   IEDQTCXD+224
TCXNCPIO EQU   IEDQTCXD+220
TCXACTE8 EQU   TCXQE8
TCXABEPL EQU   IEDQTCXD+212
TCXSRBS  EQU   IEDQTCXD+208
TCXSIOSB EQU   IEDQTCXD+204
TCXESAVE EQU   IEDQTCXD+132
TCXERPPM EQU   IEDQTCXD+128
TCXERPSV EQU   IEDQTCXD+116
TCXSATTN EQU   IEDQTCXD+112
@NM00156 EQU   TCXDSAVE+4
@NM00155 EQU   TCXDSAVE
TCXPLCB  EQU   IEDQTCXD+100
TCXBITS  EQU   IEDQTCXD+98
TCXSCBSZ EQU   IEDQTCXD+97
TCXBIT1  EQU   IEDQTCXD+96
TCXCOMPT EQU   IEDQTCXD+92
TCXAVAIL EQU   IEDQTCXD+88
TCXBUFL  EQU   IEDQTCXD+84
TCXTOTE  EQU   TCXBUFA
TCXCKPM  EQU   IEDQTCXD+79
TCXNCKPR EQU   IEDQTCXD+78
TCXSZAIB EQU   IEDQTCXD+76
TCXAIBC  EQU   IEDQTCXD+72
TCXPEBC  EQU   IEDQTCXD+68
TCXPEWAC EQU   IEDQTCXD+64
TCXQRQ   EQU   IEDQTCXD+60
TCXOCQ   EQU   IEDQTCXD+56
TCXPNTQ  EQU   IEDQTCXD+52
TCXPUTQ  EQU   IEDQTCXD+48
TCXGETQ  EQU   IEDQTCXD+44
TCXTSI   EQU   IEDQTCXD+40
TCXRPT   EQU   IEDQTCXD+36
TCXCC3TS EQU   IEDQTCXD+35
TCXAPDMP EQU   TCXFLAG1
TCXAPPL  EQU   TCXFLAG1
TCXRTM   EQU   TCXFLAG1
TCXMCPCD EQU   TCXFLAG1
TCXAUTH  EQU   TCXFLAG1
TCXASID  EQU   IEDQTCXD+32
TCXASCB  EQU   IEDQTCXD+28
TCXREADY EQU   IEDQTCXD+24
TCXPASWD EQU   IEDQTCXD+16
TCXDISP  EQU   IEDQTCXD+12
TCXTCB   EQU   IEDQTCXD+8
TCXATTLN EQU   TCXATTEN
STCBLINK EQU   IEDQSTCB+5
STCBPRI  EQU   IEDQSTCB+4
STCBTCIN EQU   IEDQSTCB+2
STCBINDX EQU   IEDQSTCB+1
SATRNLCB EQU   IEDSATD
RVTNUM   EQU   IEDRVTD
@NM00154 EQU   QCBPLCBA
@NM00153 EQU   QCBSTAT1
QCBFLUSH EQU   QCBSTAT1
QCBNDXRQ EQU   QCBSTAT1
QCBESIG  EQU   QCBSTAT1
QCBWAITC EQU   QCBSTAT1
QCBCHAIN EQU   IEDNQCB
QCBPQBCK EQU   IEDQPQCB+25
QCBPRIPQ EQU   IEDQPQCB+24
QCBCFHDR EQU   IEDQPQCB+21
QCBLFEFO EQU   IEDQPQCB+18
QCBFFEFO EQU   IEDQPQCB+15
QCBPREVF EQU   QCBINTLF
QCBINTFF EQU   IEDQPQCB+9
QCBDATSQ EQU   QCBFHDTZ+1
@NM00152 EQU   QCBFHDTZ
@NM00151 EQU   QCBPFEFO
QCBDATFL EQU   QCBFHDLZ
QCBDNHDR EQU   IEDQPQCB
QCBQBACK EQU   IEDQQCB+37
QCBCKPT  EQU   QCBFLAG
QCBPROC  EQU   QCBFLAG
QCBSDFFO EQU   QCBFLAG
QCBTERMQ EQU   QCBFLAG
QCBRSRV  EQU   QCBFLAG
QCBREAD  EQU   QCBFLAG
QCBNOBRK EQU   QCBFLAG
QCBTSSES EQU   QCBFLAG
QCBLGBAD EQU   QCBDCBAD
QCBRELLN EQU   IEDQQCB+32
QCBTJID  EQU   QCBLKRRN+1
QCBCARCT EQU   QCBLKRRN
QCBPRLVL EQU   QCBPREN
QCBMSGCT EQU   IEDQQCB+26
QCBEXTO  EQU   QCBINTVL
QCBDISC  EQU   QCBTSOF1
QCBPARTO EQU   QCBTSOF1
QCBSATRD EQU   QCBTSOF1
QCBNOBUF EQU   QCBTSOF1
QCBTPUT  EQU   QCBTSOF1
QCBTGET  EQU   QCBTSOF1
QCBWRBRK EQU   QCBTSOF1
QCBSATLC EQU   QCBTSOF2
QCBSATTI EQU   QCBTSOF2
QCBSATCH EQU   QCBTSOF2
QCBSIMRD EQU   QCBTSOF2
QCBDSSMI EQU   QCBTSOF2
QCBPOSTO EQU   QCBTSOF2
QCBBUFQ  EQU   QCBTSOF2
QCBINHBN EQU   QCBTSOF2
QCBSATCT EQU   @NM00150
QCBSCBOF EQU   IEDQQCB+20
QCBCLOCK EQU   QCBSTAT
QCBSCHDL EQU   QCBSTAT
QCBSMODE EQU   QCBSTAT
QCBSEND  EQU   QCBSTAT
QCBBUFRD EQU   QCBSTAT
QCBTRMHO EQU   QCBSTAT
QCBEOM   EQU   QCBSTAT
QCBHUCT  EQU   QCBRETCT
QCBIEND  EQU   QCBRETCT
QCBEND   EQU   QCBRETCT
QCBNL    EQU   QCBRETCT
QCBLOGCT EQU   QCBRETCT
@NM00149 EQU   QCBBYTE1
QCBRITRM EQU   QCBBYTE1
@NM00148 EQU   QCBEOLDT
QCBSTVTO EQU   IEDQQCB+8
QCBLINK  EQU   IEDQQCB+5
QCBHELD  EQU   QCBDSFLG
QCBFQCB  EQU   QCBDSFLG
QCBDRQQ  EQU   QCBDSFLG
QCBALTMH EQU   QCBDSFLG
QCBREUS  EQU   QCBDISK
QCBNREUS EQU   QCBDISK
QCBCORE  EQU   QCBDSFLG
QCBTSQ   EQU   QCBDSFLG
LCBERADR EQU   LCBXRADR+1
LCBPCIRC EQU   LCBXRADR
LCBDCT3  EQU   LCBXDCT+2
LCBDCT2  EQU   LCBXDCT+1
LCBDCT1  EQU   LCBXDCT
@NM00147 EQU   LCBXFLAG
LCBERPND EQU   LCBXFLAG
LCBSRCPF EQU   LCBXFLAG
LCBGPCTV EQU   LCBXFLAG
@NM00146 EQU   LCBXFLAG
@NM00145 EQU   LCBXFLAG
@NM00144 EQU   LCBXFLAG
@NM00143 EQU   LCBXFLAG
LCBCCW10 EQU   LCBCPA+72
LCBCCW9  EQU   LCBCPA+64
LCBCCW8  EQU   LCBCPA+56
LCBCCW7  EQU   LCBCPA+48
LCBCCW6  EQU   LCBCPA+40
LCBCP    EQU   LCBQEBPL+4
LCBIOSB  EQU   LCBQEBPL+1
LCBSIO   EQU   LCBQEBPL
LCBCCW4  EQU   LCBCPA+24
LCBCCW3  EQU   LCBCPA+16
LCBCCW2  EQU   LCBCPA+8
LCBCCW1  EQU   LCBCPA
@NM00128 EQU   LCBERCCW+16
LCBATL05 EQU   LCBERCCW+8
@NM00127 EQU   LCBERCCW
LCBCSWSV EQU   LCBSAVSN+1
LCBSNSV  EQU   LCBSAVSN
LCBBFSNS EQU   LCBRSPSV
LCBWAITC EQU   LCBTPCD+5
LCBINPAK EQU   LCBSTAT6
LCBMHBID EQU   LCBSTAT6
LCBRTRRO EQU   LCBSTAT6
LCBHDRPD EQU   LCBSTAT6
LCBCHN   EQU   LCBSTAT6
LCBBFRSV EQU   LCBTPCD+1
@NM00126 EQU   LCBSTAT5
LCBLUS   EQU   LCBSTAT5
LCBLUNIT EQU   LCBSTAT5
LCBPERM  EQU   LCBSTAT5
LCBNXCMD EQU   LCBBFRW
LCBERMSK EQU   LCBOBRCH
LCBSCBA  EQU   IEDQLCB+93
LCBOLT   EQU   LCBMSGFM
LCBEOT   EQU   LCBMSGFM
LCBENQ   EQU   LCBMSGFM
LCBTTD   EQU   LCBMSGFM
LCBRSTRT EQU   LCBMSGFM
LCBVSTRT EQU   LCBMSGFM
LCBACKI  EQU   LCBMSGFM
LCBNAK   EQU   LCBMSGFM
@NM00125 EQU   LCBRBCT2
LCBDCNT  EQU   LCBRBCT2
LCBRBCT1 EQU   LCBERBCT
LCBERBCH EQU   IEDQLCB+85
LCBCOMPL EQU   LCBDLNKN
LCBPRCPG EQU   LCBERBST
LCBERROR EQU   LCBERBST
@NM00124 EQU   LCBERBST
LCBINQ   EQU   LCBERBST
LCBRDERR EQU   LCBERBST
LCBEOMSG EQU   LCBERBST
LCBMSG   EQU   LCBERBST
LCBERBLK EQU   IEDQLCB+81
LCBERBPY EQU   IEDQLCB+80
LCBERBQB EQU   LCBERB+1
LCBERBKY EQU   LCBERB
LCBRECAD EQU   IEDQLCB+73
@NM00123 EQU   LCBTSTSW
@NM00122 EQU   LCBTSTSW
@NM00121 EQU   LCBTSTSW
@NM00120 EQU   LCBTSTSW
@NM00119 EQU   LCBTSTSW
@NM00118 EQU   LCBTSTSW
@NM00117 EQU   LCBTSTSW
LCBCONCT EQU   LCBTSTSW
LCBRESP  EQU   LCBSTAT2
LCBBFRAV EQU   LCBDIAL
LCBATTN  EQU   LCBSYNC
LCBNEGRP EQU   LCBSTAT2
LCBSNDPR EQU   LCBSTAT2
LCBCONNN EQU   LCBBEOTN
LCBMSGNN EQU   LCBSTAT2
LCBTRACE EQU   LCBSTAT2
LCBSENDN EQU   LCBSTAT1
LCBRECVN EQU   LCBSTAT1
LCBFREEN EQU   LCBSTAT1
LCBCONT  EQU   LCBSTAT1
LCBINITN EQU   LCBSTAT1
LCBOCNI  EQU   LCBSTAT1
LCBOCWTN EQU   LCBSTAT1
LCBRCLLN EQU   LCBSTAT1
LCBRECOF EQU   IEDQLCB+68
LCBRDBFR EQU   LCBRCBFR
LCBUCBX  EQU   IEDQLCB+64
LCBTTBIN EQU   LCBERRCT
@NM00116 EQU   LCBINCAM
LCBGETMN EQU   LCBINCAM
LCBRESTR EQU   LCBRCQCB
LCBPCILK EQU   LCBDCBPT
LCBSTART EQU   LCBIOBSN+16
LCBAP4OL EQU   LCBSIOCC
LCBAP3OL EQU   LCBSIOCC
LCBAP2OL EQU   LCBSIOCC
LCBAP1OL EQU   LCBSIOCC
LCBSIOC2 EQU   LCBSIOCC
LCBSIOC1 EQU   LCBSIOCC
@NM00115 EQU   LCBSIOCC
LCBCSWRC EQU   LCBCSW+5
LCBCSCHC EQU   LCBCSWCS
LCBCSICC EQU   LCBCSWCS
LCBCSCCC EQU   LCBCSWCS
LCBCSCDC EQU   LCBCSWCS
LCBCSPTC EQU   LCBCSWCS
LCBCSPGC EQU   LCBCSWCS
LCBCSIL  EQU   LCBCSWCS
LCBCSPCI EQU   LCBCSWCS
LCBUSUE  EQU   LCBCSWUS
LCBUSUC  EQU   LCBCSWUS
LCBUSDE  EQU   LCBCSWUS
LCBUSCE  EQU   LCBCSWUS
LCBUSBSY EQU   LCBCSWUS
LCBUSCUE EQU   LCBCSWUS
LCBUSSM  EQU   LCBCSWUS
LCBUSAT  EQU   LCBCSWUS
LCBCSWCA EQU   LCBCSW
LCBOBR   EQU   LCBFLAG3
LCBOBRRD EQU   LCBFLAG3
LCBIOMSG EQU   LCBFLAG3
LCBSOHC  EQU   LCBFLAG3
LCBRLAD  EQU   LCBFLAG3
LCBSOHR  EQU   LCBFLAG3
@NM00114 EQU   LCBFLAG3
LCBECBPT EQU   LCBIOBSN+4
LCBECBCC EQU   LCBIOBSN+3
LCBSENS1 EQU   LCBSNS+1
LCBABORT EQU   LCBTMOUT
LCBNOTIN EQU   LCBLOSDT
LCBOVRUN EQU   LCBSENS0
LCBDATCK EQU   LCBSENS0
LCBEQUCK EQU   LCBSENS0
LCBBUSCK EQU   LCBSENS0
LCBINTRQ EQU   LCBSENS0
LCBCMDRJ EQU   LCBSENS0
LCBFLAG2 EQU   LCBIOBSN
@NM00113 EQU   LCBFLAG1
LCBUNREL EQU   LCBFLAG1
LCBEXCPN EQU   LCBFLAG1
@NM00112 EQU   LCBFLAG1
LCBERPIN EQU   LCBFLAG1
@NM00111 EQU   LCBFLAG1
LCBFSBFR EQU   LCBMHA
LCBISZE  EQU   IEDQLCB+28
@NM00110 EQU   LCBSCBDA
LCBCPGMH EQU   LCBSTAT4
LCBREAL  EQU   LCBPHASE
@NM00109 EQU   LCBSTAT4
LCBACTRQ EQU   LCBSTAT4
LCBIPLRQ EQU   LCBSTAT4
LCBDACRQ EQU   LCBSTAT4
LCBDMPRQ EQU   LCBSTAT4
@NM00108 EQU   LCBLKMDE
LCBLOCKI EQU   LCBLKMDE
LCBLOCKR EQU   LCBLKMDE
LCBHMFLG EQU   LCBLKMDE
LCBBDFLG EQU   LCBLKMDE
@NM00107 EQU   LCBINSRC
LCBABRTN EQU   LCBCHAIN
LCBCTLMD EQU   LCBTETEN
LCBBFRSZ EQU   LCBCHAIN
LCBUREQN EQU   LCBCHAIN
LCBNORTY EQU   LCBCHAIN
LCBERMSG EQU   LCBCHAIN
LCBEXCP  EQU   LCBCHAIN
LCBINVRQ EQU   LCBSCRNN
LCB2741N EQU   LCBTSOB
LCBINHBN EQU   LCBTSOB
LCBCIRCD EQU   LCBTSOB
LCBPREP  EQU   LCBTSOB
LCBSOPL  EQU   LCBTSOB
LCBSATRD EQU   LCBTSOB
LCBTSBUF EQU   LCBTSOB
LCBWRBRK EQU   LCBTSOB
LCBTDL   EQU   IEDQLCB+18
LCBEOLTD EQU   IEDQLCB+16
LCBRSLNK EQU   IEDQLCB+13
LCBRSPRI EQU   IEDQLCB+12
LCBRSKEY EQU   IEDQLCB+8
LCBLINK  EQU   LCBRCB+5
LCBKEY   EQU   LCBRCB
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00106 EQU   CVTFIX+248
@NM00105 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
SAVTBITN EQU   IEDNSVTD+312
@NM00104 EQU   SAVTCKQB+8
@NM00103 EQU   SAVTCKEC+1
@NM00102 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00101 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00100 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00099 EQU   IEDNSVTD+273
@NM00098 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTNAX  EQU   IEDNSVTD+248
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTSCPT EQU   SAVTTCPU
SAVTRQTG EQU   IEDNSVTD+236
SAVTRQCH EQU   IEDNSVTD+232
SAVTMAND EQU   IEDNSVTD+228
SAVTSPLN EQU   IEDNSVTD+224
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTDFCO EQU   IEDNSVTD+200
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTSCLU EQU   IEDNSVTD+168
SAVTXTRQ EQU   IEDNSVTD+164
SAVTMVBF EQU   IEDNSVTD+160
@NM00097 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00096 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00095 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00094 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTSLCB EQU   IEDNSVTD+104
SAVTLUSR EQU   IEDNSVTD+100
@NM00093 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00092 EQU   IEDNSVTD+84
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00091 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTCPBNO EQU   IEDQAVTD+1244
AVTHRESS EQU   IEDQAVTD+1243
@NM00090 EQU   IEDQAVTD+1242
@NM00089 EQU   IEDQAVTD+1241
@NM00088 EQU   IEDQAVTD+1240
@NM00087 EQU   IEDQAVTD+1237
@NM00086 EQU   IEDQAVTD+1236
AVTHRESE EQU   @NM00085
AVTRADDR EQU   IEDQAVTD+1228
AVTNADDR EQU   IEDQAVTD+1224
AVTHRESN EQU   IEDQAVTD+1220
AVTVOLRN EQU   IEDQAVTD+1216
AVTTOTNN EQU   IEDQAVTD+1212
AVTTRCYN EQU   IEDQAVTD+1208
AVTRCTRN EQU   IEDQAVTD+1204
AVTNOVON EQU   IEDQAVTD+1200
AVTADEBN EQU   IEDQAVTD+1196
AVTVOLRR EQU   IEDQAVTD+1192
AVTTOTNR EQU   IEDQAVTD+1188
AVTTRCYR EQU   IEDQAVTD+1184
AVTRCTRR EQU   IEDQAVTD+1180
AVTNOVOR EQU   IEDQAVTD+1176
AVTADEBR EQU   IEDQAVTD+1172
AVTLODPT EQU   IEDQAVTD+1168
AVTIOBN  EQU   IEDQAVTD+1164
AVTIOBR  EQU   IEDQAVTD+1160
AVTCPBPT EQU   IEDQAVTD+1156
AVTFCPB  EQU   IEDQAVTD+1152
@NM00084 EQU   IEDQAVTD+1148
AVTINCPQ EQU   IEDQAVTD+1144
@NM00083 EQU   IEDQAVTD+1140
@NM00082 EQU   IEDQAVTD+1137
@NM00081 EQU   AVTBIT4
@NM00080 EQU   AVTBIT4
@NM00079 EQU   AVTBIT4
@NM00078 EQU   AVTBIT4
@NM00077 EQU   AVTBIT4
@NM00076 EQU   AVTBIT4
@NM00075 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00074 EQU   IEDQAVTD+1132
AVTNOBFQ EQU   IEDQAVTD+1128
@NM00073 EQU   IEDQAVTD+1124
AVTDKENQ EQU   IEDQAVTD+1120
@NM00072 EQU   IEDQAVTD+1116
AVTDKAPQ EQU   IEDQAVTD+1112
AVTCOPY  EQU   IEDQAVTD+1108
AVTIA    EQU   IEDQAVTD+1104
AVTFL    EQU   IEDQAVTD+1100
@NM00071 EQU   IEDQAVTD+1096
AVTNCPBQ EQU   IEDQAVTD+1092
AVTTOTNC EQU   IEDQAVTD+1088
AVTCMAX  EQU   IEDQAVTD+1084
AVTCMIN  EQU   IEDQAVTD+1080
AVTHM02  EQU   IEDQAVTD+1076
AVTOPCIN EQU   IEDQAVTD+1074
AVTDCTLN EQU   IEDQAVTD+1072
AVTOPMSK EQU   IEDQAVTD+1068
AVTDDFT  EQU   IEDQAVTD+1064
AVTSTEAL EQU   IEDQAVTD+1060
AVTOPTN  EQU   IEDQAVTD+1056
AVTDSKCT EQU   IEDQAVTD+1054
AVTCKRST EQU   IEDQAVTD+1053
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00070 EQU   AVTBIT2
@NM00069 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+1048
AVTDLQX  EQU   IEDQAVTD+1046
AVTINTLV EQU   IEDQAVTD+1044
AVTSMCNT EQU   IEDQAVTD+1042
AVTAVFCT EQU   IEDQAVTD+1040
AVTOPCON EQU   IEDQAVTD+1038
AVTOPCNT EQU   IEDQAVTD+1036
AVTLNCNT EQU   IEDQAVTD+1034
AVTKEYLE EQU   IEDQAVTD+1032
AVTHA16  EQU   IEDQAVTD+1030
AVTHA7   EQU   IEDQAVTD+1028
AVTHA4   EQU   IEDQAVTD+1026
AVTHA3   EQU   IEDQAVTD+1024
AVTHA2   EQU   IEDQAVTD+1022
AVTGETMS EQU   IEDQAVTD+1021
@NM00068 EQU   IEDQAVTD+1020
AVTGETMD EQU   IEDQAVTD+1016
AVTGETMN EQU   IEDQAVTD+1012
AVTCWTOT EQU   IEDQAVTD+1008
AVTCWINT EQU   IEDQAVTD+956
AVTDTRAP EQU   IEDQAVTD+952
@NM00067 EQU   IEDQAVTD+950
@NM00066 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00065 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+944
AVTAFE20 EQU   IEDQAVTD+940
AVTAFE10 EQU   IEDQAVTD+936
AVTCWEC2 EQU   IEDQAVTD+932
AVTCWPM2 EQU   IEDQAVTD+928
AVTCWTS2 EQU   IEDQAVTD+927
AVTCWTS1 EQU   IEDQAVTD+926
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00064 EQU   AVTCWFL2
@NM00063 EQU   AVTCWFL2
@NM00062 EQU   AVTCWFL2
@NM00061 EQU   AVTCWFL2
@NM00060 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00059 EQU   AVTCWFL1
@NM00058 EQU   AVTCWFL1
@NM00057 EQU   AVTCWFL1
@NM00056 EQU   AVTCWFL1
@NM00055 EQU   AVTCWFL1
@NM00054 EQU   AVTCWFL1
@NM00053 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+920
AVTCWPM1 EQU   IEDQAVTD+916
AVTCAREA EQU   IEDQAVTD+912
AVTFZERO EQU   IEDQAVTD+908
AVTCADDR EQU   IEDQAVTD+904
AVTCOREC EQU   IEDQAVTD+900
@NM00052 EQU   IEDQAVTD+892
AVTCPBCB EQU   IEDQAVTD+888
@NM00051 EQU   IEDQAVTD+880
AVTDSIOB EQU   IEDQAVTD+876
@NM00050 EQU   IEDQAVTD+868
AVTCPRMB EQU   IEDQAVTD+864
@NM00049 EQU   IEDQAVTD+856
AVTCLOSB EQU   IEDQAVTD+852
@NM00048 EQU   IEDQAVTD+844
AVTACTIB EQU   IEDQAVTD+840
@NM00047 EQU   IEDQAVTD+836
AVTOLTEB EQU   IEDQAVTD+832
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00046 EQU   AVTOPCQB+8
@NM00045 EQU   AVTOPCEC+1
@NM00044 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00043 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00042 EQU   AVTCKPEC+1
@NM00041 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00040 EQU   IEDQAVTD+796
AVTBFRTB EQU   IEDQAVTD+792
@NM00039 EQU   IEDQAVTD+784
AVTBFREB EQU   IEDQAVTD+780
AVTTIMQ  EQU   IEDQAVTD+776
@NM00038 EQU   IEDQAVTD+772
AVTIMQPS EQU   IEDQAVTD+768
AVTINOUT EQU   IEDQAVTD+766
AVTREFTM EQU   IEDQAVTD+764
@NM00037 EQU   IEDQAVTD+752
AVTDELYB EQU   IEDQAVTD+748
AVTOCQPT EQU   IEDQAVTD+744
AVTTSOPT EQU   IEDQAVTD+740
AVTSUPPT EQU   IEDQAVTD+736
AVTCBQCB EQU   IEDQAVTD+732
AVTMSGS  EQU   IEDQAVTD+729
@NM00036 EQU   AVTSYSER
@NM00035 EQU   AVTSYSER
@NM00034 EQU   AVTSYSER
@NM00033 EQU   AVTSYSER
@NM00032 EQU   AVTSYSER
@NM00031 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+724
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00030 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+704
AVTDELEM EQU   IEDQAVTD+700
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00029 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00028 EQU   AVTCKBYT
@NM00027 EQU   AVTCKBYT
@NM00026 EQU   AVTCKBYT
@NM00025 EQU   AVTCKBYT
@NM00024 EQU   AVTCKBYT
@NM00023 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+690
AVTOPXCL EQU   IEDQAVTD+688
AVTOPERL EQU   IEDQAVTD+687
@NM00022 EQU   IEDQAVTD+686
AVTCKTIM EQU   IEDQAVTD+684
AVTCKELV EQU   IEDQAVTD+682
AVTCPRCD EQU   IEDQAVTD+681
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00021 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+677
AVTSCBSZ EQU   IEDQAVTD+676
@NM00020 EQU   IEDQAVTD+672
AVTCKELE EQU   IEDQAVTD+668
@NM00019 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+648
AVTHI    EQU   IEDQAVTD+644
AVTIOT   EQU   IEDQAVTD+640
AVTNX    EQU   IEDQAVTD+636
AVTTONE  EQU   IEDQAVTD+632
AVTA3TL  EQU   IEDQAVTD+628
AVTDMECB EQU   IEDQAVTD+624
AVTABEND EQU   IEDQAVTD+618
AVTPLCBN EQU   IEDQAVTD+616
@NM00018 EQU   AVTSAVTP+1
@NM00017 EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
@NM00016 EQU   IEDQAVTD+608
AVTCMBSS EQU   IEDQAVTD+604
AVTRCV   EQU   IEDQAVTD+600
AVTSEND  EQU   IEDQAVTD+596
AVTCSCH  EQU   IEDQAVTD+592
AVTQ1    EQU   IEDQAVTD+588
AVTE7    EQU   IEDQAVTD+584
AVTHB    EQU   IEDQAVTD+580
AVTR1    EQU   IEDQAVTD+576
AVTBZ    EQU   IEDQAVTD+572
AVTEZ    EQU   IEDQAVTD+568
AVTEC    EQU   IEDQAVTD+564
AVTEW    EQU   IEDQAVTD+560
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00015 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTAX    EQU   IEDQAVTD+544
AVTA3    EQU   IEDQAVTD+540
AVTGD    EQU   IEDQAVTD+536
AVTAL    EQU   IEDQAVTD+532
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+524
AVTUI    EQU   IEDQAVTD+520
AVTCOMPT EQU   IEDQAVTD+516
AVTCRSRF EQU   IEDQAVTD+512
@NM00014 EQU   IEDQAVTD+508
AVTKA02  EQU   IEDQAVTD+504
AVTOPTPT EQU   IEDQAVTD+500
AVTPCBPT EQU   IEDQAVTD+496
@NM00013 EQU   AVTECB1
AVTCOMP  EQU   AVTECB1
@NM00012 EQU   AVTECB1
AVTOPECA EQU   IEDQAVTD+488
AVTOLECA EQU   IEDQAVTD+484
AVTCKECA EQU   IEDQAVTD+480
AVTCWECA EQU   IEDQAVTD+476
AVTCWTCB EQU   IEDQAVTD+472
AVTOLTCB EQU   IEDQAVTD+468
AVTOCTCB EQU   IEDQAVTD+464
AVTCKTCB EQU   IEDQAVTD+460
AVTAS    EQU   IEDQAVTD+456
AVTNOLBF EQU   IEDQAVTD+454
AVTNCKPR EQU   IEDQAVTD+453
AVTCIB   EQU   IEDQAVTD+452
AVTSPLPT EQU   IEDQAVTD+448
AVTMVBFR EQU   IEDQAVTD+444
AVTSBTA  EQU   IEDQAVTD+440
AVTRARTN EQU   IEDQAVTD+436
AVTBSCAN EQU   IEDQAVTD+432
AVTRDYA  EQU   IEDQAVTD+428
AVTDISTR EQU   IEDQAVTD+420
AVTPARM3 EQU   IEDQAVTD+416
@NM00011 EQU   AVTPKF
@NM00010 EQU   AVTPKF
@NM00009 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00008 EQU   AVTPKF
@NM00007 EQU   AVTPKF
@NM00006 EQU   AVTPKF
@NM00005 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+408
AVTEXS2A EQU   IEDQAVTD+402
AVTEXA2S EQU   IEDQAVTD+396
AVTOCGET EQU   IEDQAVTD+392
AVTCKAVT EQU   @NM00003+1
@NM00004 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
@NM00002 EQU   IEDQAVTD+384
AVTREADD EQU   IEDQAVTD+380
AVTREADY EQU   IEDQAVTD+376
AVTRACE  EQU   IEDQAVTD+372
AVTTCB   EQU   IEDQAVTD+368
AVTPASWD EQU   IEDQAVTD+360
AVTCTLCH EQU   IEDQAVTD+352
AVTDOUBL EQU   IEDQAVTD+344
AVTDOUBX EQU   IEDQAVTD+336
AVTDPARM EQU   IEDQAVTD+332
AVTCSTCS EQU   IEDQAVTD+328
AVTDLQ   EQU   AVTSAVEX+32
@NM00001 EQU   AVTSAVEX
AVTSAVE4 EQU   IEDQAVTD+216
AVTSAVE3 EQU   IEDQAVTD+144
AVTSAVE1 EQU   IEDQAVTD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RF00311 EQU   @RC00301
@RF00314 EQU   @RC00301
@RF00319 EQU   @RC00301
@RF00430 EQU   @EL00001
@ENDDATA EQU   *
         END   IEDDVAS,(C'PLS2028',0701,77187)
