         MACRO
         HELP  &UNIT=,&VOLNO=
         COPY  SGGBLPAK
         LCLB  &Q
         AIF   (NOT &SGMENTB(59)).H1    TEST FOR PREVIOUS ENTRY
    MNOTE 5,'* * * IEIHEL101 HELP MACRO PREVIOUSLY USED'
         AGO   .HQUIT
.H1      ANOP
&SGMENTB(59)   SETB 1                   SET HELP ENTRY SWITCH
         AIF   (N'&UNIT EQ N'&VOLNO).H2 IS JUST 1 PARAMETER MISSING?
    MNOTE 5,'* * * IEIHEL102 UNIT VALUE OR VOLNO VALUE MISSING'
         AGO   .HQUIT
.H2      AIF   ('&UNIT' EQ '').H5       BRANCH FOR SYSRES DEFAULT
         AIF   (K'&UNIT LE 8).H3        TEST FOR VALID UNIT SPECIFICATN
    MNOTE 5,'* * * IEIHEL103 UNIT VALUE &UNIT INVALID'
&Q       SETB  1
.H3      AIF   (K'&VOLNO LE 6).H4       TEST VALID VOLNO SPECIFICATION
    MNOTE 5,'* * * IEIHEL104 VOLNO VALUE &VOLNO INVALID'
         AGO   .HQUIT
.H4      AIF   (&Q).HQUIT               TEST IF PREVIOUS ERROR FOUND
    MNOTE *,'      HELP DATA SET WILL RESIDE ON -                      *
                             UNIT &UNIT  VOLUME &VOLNO'
&SGCTRLC(51) SETC '&UNIT'
&SGCTRLC(52) SETC '&VOLNO'
         MEXIT
.H5 MNOTE *,'      HELP DATA SET WILL RESIDE ON SYSRES'
         MEXIT
.HQUIT   ANOP                           SET QUIT BIT AND EXIT
&SGQUITB SETB  1
         MEND
