         MACRO
         IMAGELIB &UNIT=,&VOLNO=
         COPY SGGBLPAK
         AIF   (NOT &SGMENTB(66)).IMAG1
    MNOTE 5,'* * * IEIIMG101 IMAGELIB MACRO PREVIOUSLY USED'
         AGO   .IMGQUIT
.IMAG1   ANOP
&SGMENTB(66)   SETB 1
         AIF   (N'&UNIT EQ N'&VOLNO).IMAG2
    MNOTE 5,'* * * IEIIMG102 UNIT VALUE OR VOLNO VALUE MISSING'
         AGO   .IMGQUIT
.IMAG2   AIF   ('&UNIT' EQ '').M1
         AIF   (K'&UNIT LE 8).IMAG3
    MNOTE 5,'* * * IEIIMG103 UNIT VALUE &UNIT INVALID'
         AGO   .IMGQUIT
.IMAG3   AIF   (K'&VOLNO LE 6).IMAG4
    MNOTE 5,'* * * IEIIMG104 VOLNO VALUE &VOLNO INVALID'
         AGO   .IMGQUIT
.IMAG4   ANOP
&SGCTRLC(62)   SETC '&VOLNO'
&SGCTRLC(61)   SETC '&UNIT'
         MEXIT
.M1 MNOTE *,'     IMAGE LIBRARY WILL RESIDE ON SYSRES'
         MEXIT
.IMGQUIT ANOP
&SGQUITB SETB  1
         MEND
