         MACRO
         SGIEC2DT
         COPY  SGGBLPAK
         LCLC  &RESBLDL,&MVT
&SGCTRLC(6) SETC 'IGC018'
         AIF   (&SGSUPRB(20) NE 1).NORBLDL   TEST BLDL SWITCH
&RESBLDL SETC  'YES'              SET RESBLDL SWITCH TO YES
.TESTMVT AIF   (&SGCPRGB(8) NE 1).NOMVT   IF MVT OPTION SET SWITCH
&MVT     SETC  'YES'              TO SHOW OPTION
         AGO   .PUNCH          PUNCH MODULE OUT
.NORBLDL ANOP
&RESBLDL SETC  'NO'      SET NON RESIDENT BLDL SWITCH
         AGO   .TESTMVT            CHECK FOR MVT OPTION
.NOMVT ANOP
&MVT     SETC  'NO'   SET NO MVT SWITCH
.PUNCH   ANOP                    LAVEL USED FOR ENTRY POINT ONLY
         COPY  SGASMPAK         GET JCL FOR ASSEMBLY
 PUNCH ' SGIEC0DT &RESBLDL,&MVT,&SGSUPRB(32),TYPE=(&SGDCLSB(31),&SGDCLS*
               B(28),&SGDCLSB(42),&SGDCLSB(30),&SGDCLSB(32),&SGDCLSB(75*
               ),&SGDCLSB(76),&SGDCLSB(41),&SGDCLSB(69))'
         PUNCH '         END'
         PUNCH '/*'
         MEND
