         MACRO
         SGIEK502
*
* STATUS - CHANGE LEVEL 1, RELEASE 19, MARCH 19,1970
*
* 2420   000760                                                   II295
*        000800-001000,007800-008000,008600,038356                HSCPY
*
         COPY  SGGBLPAK            DEFINE SYSGEN GLOBALS
         PUNCH ' COPY OUTDD=FORTLIB,INDD=LM501'                   HSCPY
 PUNCH ' SELECT MEMBER=(IHCLLOG,DLOG,DLOG10,IHCSLOG,ALOG,ALOG10)      '
 PUNCH ' SELECT MEMBER=(IHCLEXP,DEXP,IHCSEXP,EXP,IHCLSQRT,DSQRT)      '
 PUNCH ' SELECT MEMBER=(IHCSSQRT,SQRT,IHCFMAXD,DMAX1,DMIN1)           '
 PUNCH ' SELECT MEMBER=(IHCFMAXI,AMAX0,AMIN0,MAX0,MIN0)               '
 PUNCH ' SELECT MEMBER=(IHCFMAXR,AMAX1,AMIN1,MAX1,MIN1)               '
 PUNCH ' SELECT MEMBER=(IHCLSCN,DSIN,DCOS,IHCSSCN,SIN,COS)            '
 PUNCH ' SELECT MEMBER=(IHCLTANH,DTANH,IHCSTANH,TANH)                 '
 PUNCH ' SELECT MEMBER=(IHCFSLIT,SLITE,SLITET,IHCFOVER,OVERFL)        '
 PUNCH ' SELECT MEMBER=(IHCFDVCH,DVCHK,IHCFEXIT,EXIT,IHCFDUMP,DUMP,PDUM*
               P)'
         AIF   (NOT &SGFORLB(3) AND NOT &SGFORLB(2)).EEEE TEST FOR G-H.
 PUNCH ' SELECT MEMBER=(IHCCLLOG,CDLOG,IHCCSLOG,CLOG,IHCCLEXP,CDEXP)  '
 PUNCH ' SELECT MEMBER=(IHCCSEXP,CEXP,IHCCLSQT,CDSQRT,IHCCSSQT,CSQRT) '
 PUNCH ' SELECT MEMBER=(IHCLASCN,DARSIN,DARCOS)                       '
 PUNCH ' SELECT MEMBER=(IHCSASCN,ARSIN,ARCOS)                         '
 PUNCH ' SELECT MEMBER=(IHCSGAMA,GAMMA,ALGAMA)                        '
 PUNCH ' SELECT MEMBER=(IHCCLSCN,CDSIN,CDCOS)'
 PUNCH ' SELECT MEMBER=(IHCCSSCN,CSIN,CCOS,IHCLTNCT,DTAN,DCOTAN)      '
 PUNCH ' SELECT MEMBER=(IHCSTNCT,TAN,COTAN,IHCLSCNH,DSINH,DCOSH)      '
 PUNCH ' SELECT MEMBER=(IHCSSCNH,SINH,COSH)                           '
 PUNCH ' SELECT MEMBER=(IHCCLABS,CDABS,IHCCSABS,CABS)                 '
 PUNCH ' SELECT MEMBER=(IHCLERF,DERF,DERFC,IHCSERF,ERF,ERFC)          '
 PUNCH ' SELECT MEMBER=(IHCLGAMA,DGAMMA,DLGAMA)                     '
         AIF   (NOT &SGFORLB(5)).EEEE
     PUNCH  '    SELECT MEMBER=(IHCERRM,ERRMON,IHCERRE)          '
     PUNCH  '    SELECT MEMBER=(IHCFOPT,ERRSET,ERRSAV,ERRSTR)    '
.EEEE    ANOP
 PUNCH ' SELECT MEMBER=(IHCFMODI,MOD,IHCFMODR,DMOD,AMOD)              '
 PUNCH ' SELECT MEMBER=(IHCFAINT,AINT,IHCFIFIX,IDINT,INT)   '
         PUNCH ' COPY OUTDD=LINKLIB,INDD=LM501'                   HSCPY
 PUNCH ' SELECT MEMBER=(IHCSTAE) '                                II295
         AIF   (NOT &SGFORLB(4)).OLDFORT                          II295
 PUNCH ' SELECT MEMBER=(IHCADJST) '                                BNDY
.OLDFORT ANOP                                                      BNDY
         PUNCH ' COPY OUTDD=FORTLIB,INDD=FORTLIBA'                HSCPY
   PUNCH  '  EXCLUDE  MEMBER=IHCUATBL'
 PUNCH ' EXCLUDE MEMBER=IHCFCOME       '
 PUNCH ' EXCLUDE MEMBER=IHCIBERR       '
 PUNCH ' EXCLUDE MEMBER=IHCCGOTO       '
 PUNCH ' EXCLUDE MEMBER=IHCLLOG        '
 PUNCH ' EXCLUDE MEMBER=DLOG           '
 PUNCH ' EXCLUDE MEMBER=DLOG10         '
 PUNCH ' EXCLUDE MEMBER=IHCSLOG        '
 PUNCH ' EXCLUDE MEMBER=ALOG           '
 PUNCH ' EXCLUDE MEMBER=ALOG10         '
 PUNCH ' EXCLUDE MEMBER=IHCLEXP        '
 PUNCH ' EXCLUDE MEMBER=DEXP           '
 PUNCH ' EXCLUDE MEMBER=IHCSEXP        '
 PUNCH ' EXCLUDE MEMBER=EXP            '
 PUNCH ' EXCLUDE MEMBER=IHCLSQRT       '
 PUNCH ' EXCLUDE MEMBER=DSQRT          '
 PUNCH ' EXCLUDE MEMBER=IHCSSQRT       '
 PUNCH ' EXCLUDE MEMBER=SQRT           '
 PUNCH ' EXCLUDE MEMBER=IHCLATAN       '
 PUNCH ' EXCLUDE MEMBER=DATAN          '
 PUNCH ' EXCLUDE MEMBER=IHCSATAN       '
 PUNCH ' EXCLUDE MEMBER=ATAN           '
 PUNCH ' EXCLUDE MEMBER=IHCFMAXD       '
 PUNCH ' EXCLUDE MEMBER=DMAX1          '
 PUNCH ' EXCLUDE MEMBER=DMIN1          '
 PUNCH ' EXCLUDE MEMBER=IHCFMAXI'
 PUNCH ' EXCLUDE MEMBER=AMAX0'
 PUNCH ' EXCLUDE MEMBER=AMIN0'
 PUNCH ' EXCLUDE MEMBER=MAX0'
 PUNCH ' EXCLUDE MEMBER=MIN0'
 PUNCH ' EXCLUDE MEMBER=IHCFMAXR'
 PUNCH ' EXCLUDE MEMBER=AMAX1'
 PUNCH ' EXCLUDE MEMBER=AMIN1'
 PUNCH ' EXCLUDE MEMBER=MAX1'
 PUNCH ' EXCLUDE MEMBER=MIN1'
 PUNCH ' EXCLUDE MEMBER=IHCFMODI       '
 PUNCH ' EXCLUDE MEMBER=MOD            '
 PUNCH ' EXCLUDE MEMBER=IHCFMODR       '
 PUNCH ' EXCLUDE MEMBER=DMOD           '
 PUNCH ' EXCLUDE MEMBER=AMOD           '
 PUNCH ' EXCLUDE MEMBER=IHCFAINT       '
 PUNCH ' EXCLUDE MEMBER=AINT           '
 PUNCH ' EXCLUDE MEMBER=IHCFIFIX       '
 PUNCH ' EXCLUDE MEMBER=IDINT          '
 PUNCH ' EXCLUDE MEMBER=INT            '
 PUNCH ' EXCLUDE MEMBER=IFIX           '
 PUNCH ' EXCLUDE MEMBER=IHCFIXPI       '
 PUNCH ' EXCLUDE MEMBER=IHCFRXPI       '
 PUNCH ' EXCLUDE MEMBER=IHCLSCN        '
 PUNCH ' EXCLUDE MEMBER=DSIN           '
 PUNCH ' EXCLUDE MEMBER=DCOS           '
 PUNCH ' EXCLUDE MEMBER=IHCSSCN        '
 PUNCH ' EXCLUDE MEMBER=SIN            '
 PUNCH ' EXCLUDE MEMBER=COS            '
 PUNCH ' EXCLUDE MEMBER=IHCLTANH       '
 PUNCH ' EXCLUDE MEMBER=DTANH          '
 PUNCH ' EXCLUDE MEMBER=IHCSTANH       '
 PUNCH ' EXCLUDE MEMBER=TANH           '
 PUNCH ' EXCLUDE MEMBER=IHCFDXPI       '
 PUNCH ' EXCLUDE MEMBER=IHCFRXPR       '
 PUNCH ' EXCLUDE MEMBER=IHCFDXPD       '
 PUNCH ' EXCLUDE MEMBER=IHCFSLIT       '
 PUNCH ' EXCLUDE MEMBER=SLITE          '
 PUNCH ' EXCLUDE MEMBER=SLITET         '
 PUNCH ' EXCLUDE MEMBER=IHCFOVER       '
 PUNCH ' EXCLUDE MEMBER=OVERFL         '
 PUNCH ' EXCLUDE MEMBER=IHCFDVCH       '
 PUNCH ' EXCLUDE MEMBER=DVCHK          '
 PUNCH ' EXCLUDE MEMBER=IHCFEXIT       '
 PUNCH ' EXCLUDE MEMBER=EXIT           '
 PUNCH ' EXCLUDE MEMBER=IHCFDUMP       '
 PUNCH ' EXCLUDE MEMBER=DUMP           '
 PUNCH ' EXCLUDE MEMBER=PDUMP          '
 PUNCH ' EXCLUDE MEMBER=IHCFLOAT       '
 PUNCH ' EXCLUDE MEMBER=DFLOAT         '
 PUNCH ' EXCLUDE MEMBER=FLOAT          '
         PUNCH ' EXCLUDE MEMBER=IHCIBERH'
 PUNCH ' EXCLUDE MEMBER=IHCCLLOG       '
 PUNCH ' EXCLUDE MEMBER=CDLOG          '
 PUNCH ' EXCLUDE MEMBER=IHCCSLOG       '
 PUNCH ' EXCLUDE MEMBER=CLOG           '
 PUNCH ' EXCLUDE MEMBER=IHCCLEXP       '
 PUNCH ' EXCLUDE MEMBER=CDEXP          '
 PUNCH ' EXCLUDE MEMBER=IHCCSEXP       '
 PUNCH ' EXCLUDE MEMBER=CEXP           '
 PUNCH ' EXCLUDE MEMBER=IHCCLSQT       '
 PUNCH ' EXCLUDE MEMBER=CDSQRT         '
 PUNCH ' EXCLUDE MEMBER=IHCCSSQT       '
 PUNCH ' EXCLUDE MEMBER=CSQRT          '
 PUNCH ' EXCLUDE MEMBER=IHCLASCN       '
 PUNCH ' EXCLUDE MEMBER=DARSIN         '
 PUNCH ' EXCLUDE MEMBER=DARCOS         '
 PUNCH ' EXCLUDE MEMBER=IHCSASCN       '
 PUNCH ' EXCLUDE MEMBER=ARSIN          '
 PUNCH ' EXCLUDE MEMBER=ARCOS          '
 PUNCH ' EXCLUDE MEMBER=IHCSGAMA       '
 PUNCH ' EXCLUDE MEMBER=GAMMA          '
 PUNCH ' EXCLUDE MEMBER=ALGAMA         '
 PUNCH ' EXCLUDE MEMBER=IHCCLAS        '
 PUNCH ' EXCLUDE MEMBER=IHCCSAS        '
 PUNCH ' EXCLUDE MEMBER=IHCFCDXI       '
 PUNCH ' EXCLUDE MEMBER=IHCFCXPI       '
 PUNCH ' EXCLUDE MEMBER=IHCCLSCN       '
 PUNCH ' EXCLUDE MEMBER=CDSIN          '
 PUNCH ' EXCLUDE MEMBER=CDCOS          '
 PUNCH ' EXCLUDE MEMBER=IHCCSSCN       '
 PUNCH ' EXCLUDE MEMBER=CSIN           '
 PUNCH ' EXCLUDE MEMBER=CCOS           '
 PUNCH ' EXCLUDE MEMBER=IHCLTNCT       '
 PUNCH ' EXCLUDE MEMBER=DTAN           '
 PUNCH ' EXCLUDE MEMBER=DCOTAN         '
 PUNCH ' EXCLUDE MEMBER=IHCSTNCT       '
 PUNCH ' EXCLUDE MEMBER=TAN            '
 PUNCH ' EXCLUDE MEMBER=COTAN          '
 PUNCH ' EXCLUDE MEMBER=IHCLSCNH       '
 PUNCH ' EXCLUDE MEMBER=DSINH          '
 PUNCH ' EXCLUDE MEMBER=DCOSH          '
 PUNCH ' EXCLUDE MEMBER=IHCSSCNH       '
 PUNCH ' EXCLUDE MEMBER=SINH           '
 PUNCH ' EXCLUDE MEMBER=COSH           '
 PUNCH ' EXCLUDE MEMBER=IHCCLABS       '
 PUNCH ' EXCLUDE MEMBER=CDABS          '
 PUNCH ' EXCLUDE MEMBER=IHCCSABS       '
 PUNCH ' EXCLUDE MEMBER=CABS           '
 PUNCH ' EXCLUDE MEMBER=IHCLERF        '
 PUNCH ' EXCLUDE MEMBER=DERF           '
 PUNCH ' EXCLUDE MEMBER=DERFC          '
 PUNCH ' EXCLUDE MEMBER=IHCSERF        '
 PUNCH ' EXCLUDE MEMBER=ERF            '
 PUNCH ' EXCLUDE MEMBER=ERFC           '
 PUNCH ' EXCLUDE MEMBER=IHCLGAMA       '
 PUNCH ' EXCLUDE MEMBER=DGAMMA         '
 PUNCH ' EXCLUDE MEMBER=DLGAMA         '
 PUNCH ' EXCLUDE MEMBER=IHCFCOMH       '
         PUNCH  ' EXCLUDE MEMBER=IHCFCVTH'
 PUNCH ' EXCLUDE MEMBER=IHCDBUG        '
 PUNCH ' EXCLUDE MEMBER=IHCFIOSH       '
 PUNCH ' EXCLUDE MEMBER=IHCLATN2       '
 PUNCH ' EXCLUDE MEMBER=DATN2          '
 PUNCH ' EXCLUDE MEMBER=IHCSATN2       '
 PUNCH ' EXCLUDE MEMBER=ATAN2          '
 PUNCH ' EXCLUDE MEMBER=IHCNAMEL       '
         PUNCH ' EXCLUDE MEMBER=IHCDIOSE         '
 PUNCH ' EXCLUDE MEMBER=IHCTRCH '                                  4594
 PUNCH ' EXCLUDE MEMBER=IHCUOPT '                                  BNDY
         PUNCH ' EXCLUDE MEMBER=IHCFINTH              '
         PUNCH ' EXCLUDE MEMBER=IHCEFNTH              '
         PUNCH ' EXCLUDE MEMBER=IHCETRCH              '
         PUNCH ' EXCLUDE MEMBER=IHCERRM               '
         PUNCH ' EXCLUDE MEMBER=ERRMON                '
         PUNCH ' EXCLUDE MEMBER=ERRTRA                '
         PUNCH ' EXCLUDE MEMBER=IHCEDIOS              '
         PUNCH ' EXCLUDE MEMBER=IHCEFIOS              '
         PUNCH ' EXCLUDE MEMBER=FIOCSB                '
         PUNCH ' EXCLUDE MEMBER=IHCECOMH              '
         PUNCH ' EXCLUDE MEMBER=IHCERRE               '
         PUNCH ' EXCLUDE MEMBER=IHCFOPT                         '
         PUNCH ' EXCLUDE MEMBER=ERRSET                        '
         PUNCH ' EXCLUDE MEMBER=ERRSAV                        '
         PUNCH ' EXCLUDE MEMBER=ERRSTR                        '
         MEND
