)ATTR
 ^ TYPE(INPUT) INTENS(LOW)
)BODY
%------------------------^C2                           %----------------
%COMMAND ===>_ZCMD
%
%
%  The assembly process has now started: You will shortly receive a new
%  screen to enable you to perform concurrent processing.
)INIT
 .CURSOR = ZCMD
  &C1='------------------------'
  &C2='INTERACTIVE ASSEMBLY AND LINK'
  &C3='---------------------------------'
)END
