)BODY
%------------------SYSTEM USERS (TSO OR BATCH + STC) DISPLAY------------
%
%
%      This facility gives you a very quick display of whats going
%      on in the system.
%
%      It saves you having to incur all the overhead of initialising
%      SDSF when you just want to see whats happening.
%
%      Enter TSO if you want to display all TSO users logged on
%      or enter STC (or anything other than TSO).
%
%
%      To end press PF3  or enter END
%
%
+      SELECT OPTION:%====> _OPT1              +
)INIT
 &OPT1=&Z
)END
