)ATTR
   @ TYPE(OUTPUT) INTENS(LOW)
   % TYPE(TEXT) INTENS(HIGH)
   + TYPE(TEXT) INTENS(LOW)
   _ TYPE(INPUT) INTENS(HIGH) JUST(LEFT)
   ^ TYPE(&YIDSCR1) INTENS(LOW)
   \ TYPE(INPUT) INTENS(LOW)  JUST(LEFT)
   × TYPE(INPUT) INTENS(LOW) JUST(LEFT)
)BODY
%Time-&ZTIME ------------- PIE/File Access -----------------------------
%C ==>_OPT
%T 0@YITSO0    %1@YITSO1    %2@YITSO2    %3@YITSO3    %4@YITSO4    %5@YI
%T 6@YITSO6    %7@YITSO7    %8@YITSO8    %9@YITSO9    %A@YITSOA    %B@YI
%P%?+LCat/LCV LVtoc ESCape/X Del CANcel/SAVE STore/Reshow/T ON REPlace S
%L%?+Edit Browse DErase Print DInf DCopy Util Vol Del/Yank Ins/Rep/A Tso
%C............. &SYSTAB  Directory .............%Member ..Volume.F..Last
)MODEL
×Z ^Z                                           \Z       ^Z     _Z@Z
)INIT
  &VARS = '(ACTION DSNAME MBR VOL FSTR LASTACT)'
  .HELP = T#DTABLE
  IF (&YAMT = ' ')
     &YAMT = 'HALF'
  IF (&YIDSCR1 = ' ')
     &YIDSCR1 = 'INPUT'
)END
