)BODY
%--------------------------SWITCH TO ANOTHER TSO SESSION ---------------
%
%
%      This facility allows you to switch between multi TSO sessions.
%
%      Note : in order to switch between sessions you must have previous
%             started them up.
%
%      You can access several sessions simultaneously.  .
%      For example if you use ISPF and SDSF a lot start up 1 session
%      for each and just switch back and forth when you need to.
%
%      To return to the menu screen hit / followed by PF24 if you origin
%      logged on to TSO on CPUB or < followed by PF24 if you were on CPU
%
%      Enter the session  you wish to enter. Enter GO if you have lost t
%      your sessions. A menu screen will show you what you were doing.
%
%      To end press PF3.
%
%      Note to end a session enter LOGOFF in the session.
%
+   ENTER REQUIRED SESSION OR GO  =====> _OPT
)INIT
 &OPT=&Z
)END
