         MACRO
&LABEL   ALHSIK &R1,&R3,&I16
.*
.*       Generate Opcode in IFOX00
.*
&LABEL   DC    0XL6'00',X'EC',AL.4(&R1.,&R3.),AL2(&I16),X'00DA'
         MEND
