         MACRO
&LABEL   MYLR  &R1,&R3,&R2
.*
.*       Generate Opcode in IFOX00
.*
         DS    0H
&LABEL   DC    0XL4'00',X'B339',AL.4(&R1.,0),AL.4(&R3.,&R2.)
         MEND
