//COBULG PROC SOUT='*'
//LKED  EXEC  PGM=IEWL,PARM='LIST,XREF,LET'
//SYSLIN DD DDNAME=SYSIN
//SYSLMOD DD DSNAME=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,
//             SPACE=(1024,(50,20,1))
//SYSLIB DD DSNAME=SYS1.COBLIB,DISP=SHR
//SYSUT1 DD UNIT=(SYSDA,SEP=(SYSLIN,SYSLMOD)),SPACE=(1024,(50,20))
//SYSPRINT  DD SYSOUT=&SOUT
//GO  EXEC PGM=*.LKED.SYSLMOD,COND=(5,LT,LKED)
