//FORTGLG)  PROC SOUT='*'
//LKED EXEC PGM=IEWL,PARM=(XREF,LET,LIST)
//SYSLIB   DD  DSNAME=SYS1.FORTLIB,DISP=SHR
//SYSLMOD  DD  DSNAME=&GOSET(MAIN),DISP=(NEW,PASS),UNIT=SYSDA,         X
//             SPACE=(1024,(20,10,1),RLSE),DCB=BLKSIZE=1024
//SYSPRINT DD  SYSOUT=&SOUT
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(100,10),RLSE),DCB=BLKSIZE=1024, X
//             DSNAME=&SYSUT1
//SYSLIN   DD  DDNAME=SYSIN
//GO  EXEC  PGM=*.LKED.SYSLMOD,COND=(4,LT,LKED)
//FT05F001 DD  DDNAME=SYSIN
//FT06F001 DD  SYSOUT=&SOUT
//FT07F001 DD  SYSOUT=B
