//GTFPRINT PROC SOUT='*'
//GTFPRINT EXEC PGM=AMDPRDMP
//SYSPRINT DD  SYSOUT=&SOUT
//PRINTER  DD  SYSOUT=&SOUT
//TRACE    DD  DISP=OLD,DSN=GTF.TRACE(-0)
//SYSIN    DD  DISP=SHR,DSN=SYS2.SYSINLIB(GTFPRINT)
