X31      TITLE 'IEX31 - ERROR MESSAGE EDITING, ALGOL F'
*
*        COMPONENT ID - 360S-AL-531 ALGOL F COMPILER
*
*        FUNCTION/OPERATION -
*        THE ERROR PATTERNS GENERATED DURING SCANIII ARE HANDLED
*        AND THE CORRESPONDING DIAGNOSTIC MESSAGES ARE
*        GENERATED
*
*        ENTRY POINT - IEX31000 - ERROR MESSAGE EDITING
*                      XCTL EP=IEX31
*                      THE MODULE IS ENTERED FROM IEX30
*
*        INPUT - N/A
*
*        OUTPUT -
*        THE DIAGNOSTIC MESSAGES ARE PUT OUT ON SYSPRINT. IF
*        SYSPRINT IS DOWN, THIS IS REPORTED WITH A WTO
*
*        EXTERNAL ROUTINE - THE PRINT ROUTINE IN IEX00 IS USED
*
*        EXIT - NORMAL -
*        IF NO TERMINATING ERROR HAS OCCURRED CONTROL IS GIVEN
*        TO THE NEXT PHASE BY MEANS OF XCTL EP=IEX40.
*
*        EXIT - ERROR -
*        IF A TERMINATING ERROR HAS OCCURRED (IN THIS MODULE OR
*        THE PRECEDING) CONTROL IS GIVEN TO THE TERMINATING
*        MODULE BY MEANS OF XCTL EP=51002.
*
*        TABLES/WORKAREAS -
*        THE MESSAGE TEXTS WITH CORRESPONDING ADDRESS TABLE ARE
*        IN THE LOAD MODULE IEX31M
*        THE ERROR MESSAGE EDITING ROUTINE, CSECT IEX60000, ALSO
*        USES THE FOLLOWING TABLES -
*        WINTEBC  - TRANSLATION OF INTERNAL CHARACTERS TO EBCDIC
*        WSYMBSRC - TRANSLATION OF INTERNAL SYMBOLS TO EBCDIC
*        WSYMBSTK - TRANSLATION OF INTERNAL SYMBOLS TO EBCDIC
*        WORDSEBC - TRANSLATION OF COMPOUND SYMBOLS IF SOURCE
*                   IN EBCDIC
*        WORDSISO - TRANSLATION OF COMPOUND SYMBOLS IF SOURCE
*                   IN ISOCODE
*        WEBCDIC  - TRANSLATION EBCDIC - EBCDIC
*        A WORKAREA OF 270 BYTES, WAREA, IS USED FOR BUILDING
*        THE MESSAGES
*
*        ATTRIBUTES - NONE
*
*        NOTES -
*        CHARACTER CODE DEPENDENCE. FOR THE BUILDING OF A
*        MESSAGE (CODE PART BETWEEN COT03 AND COT12) THE
*        FOLLOWING APPLIES. IN CASE NO SOURCE INFORMATION IS TO
*        BE INSERTED (COT31), OR IF THE INFORMATION IS EBCDIC-
*        CHARACTERS (COT07), THE OPERATION OF CSECT IEX60000
*        DEPENDS UPON AN INTERNAL REPRESENTATION OF THE EXTERNAL
*        CHARACTER SET WHICH IS EQUIVALENT TO THE ONE USED AT
*        ASSEMBLY TIME.
*
*        IF THE SOURCE INFORMATION TO BE INSERTED IS INTERNAL
*        CHARACTERS (COT33) THE OPERATION OF CSECT IEX60000
*        DEPENDS UPON A TRANSLATION FROM THE INTERNAL
*        REPRESENTATION TO THE EBCDIC CHARACTER SET BY MEANS OF
*        THE TABLE 'WINTEBC'.
*
*        IF THE SOURCE INFORMATION TO BE INSERTED IS INTERNAL
*        ALGOL SYMBOLS (COT10) THE OPERATION OF CSECT IEX60000
*        DEPENDS UPON A TRANSLATION FROM THE INTERNAL
*        REPRESENTATION TO THE EBCDIC CHARACTER SET BY MEANS OF
*        THE TABLES 'WSYMBSTK'/'WSYMBSRC' AND 'WORDSISO'/'WORDSEBC'.
*
*        FOR THE OUTPUT OF A MESSAGE (CODE PART BETWEEN COT12
*        AND COT21) THE FOLLOWING APPLIES.
*        WHEN A MESSAGE HAS BEEN BUILT IN EBCDIC, AN EBCDIC -
*        EBCDIC TRANSLATION IS PERFORMED BEFORE OUTPUT BY MEANS
*        OF THE TABLE 'WEBCDIC'. THUS THE OUTPUT MAY BE MODIFIED
*        BY MAKING CHANGES IN THIS TABLE.
*
*        THE OPERATION OF CSECT IEX31000 DOES NOT DEPEND UPON A
*        PARTICULAR INTERNAL REPRESENTATION OF THE EXTERNAL
*        CHARACTER SET.
*
*        AT SYSTEM GENERATION THIS MODULE WILL BE LINKED
*        TOGETHER WITH THE MODULE IEX31M TO FORM THE MODULE
*        IEX31.
*
*        THIS MODULE IS ONLY INTENDED TO BE EXECUTED IN
*        CONNECTION WITH THE OTHER MODULES OF THE ALGOL COMPILER,
*        IN PARTICULAR IT REQUIRES THE COMMON WORKAREA
*
IEX31000 CSECT
*
         IEXENTRY 'IEX31000 LEVEL 2.1 &SYSDATE &SYSTIME'
*
         USING IEX31000,R15
*
         L     R2,=A(IEX60000)         ADDRESS ERROR MSG EDIT ROUTINE
         LA    R14,SUSCR               LOAD RETURN ADDRESS
         LA    R1,ERRINFO              ADDRESS INFO FOR ERROR ED ROUT
         BR    R2                      GOTO ERROR MESSAGE EDITING
*
         DC    0F'0'
*
*        INITIALIZATION OF SUBSCR HANDLING
*
SUSCR    XCTL  EP=IEX40000
*
ERRINFO  DC    V(IEX31M00)             ADDR OF MESSAGE TEXTS
         DC    V(IEX31M01)             ADDR OF ADDR TABLE
         DC    H'119'                  MODIFICATION NUMBER
*
         LTORG
*
         COPY  IEX60000
*
WORKAREA DSECT
*
         COPY  WORKAREA
*
*
*        CHARACTER EQUATES
*
         IEXCHAR
*
*        REGISTER EQUATES
*
         IEZREGS
*
         END
