*          DATA SET P50229     AT LEVEL 002 AS OF 09/03/80
P50229   CSECT
**********************************************************************
*                                                                    *
*  THIS IS A NON EXECUTABLE CSECT WHICH CONTAINS A SERIES OF 44 BYTE *
*  ENTRIES. THIS TABLE IS A LIST OF LIBRARIES FROM WHICH USER        *
*  SUBMITTED PRODUCTION JOBS WILL BE ALLOWED. THE LAST ENTRY IN THE  *
*  THE TABLE MUST BE HEX ZEROS                                       *
*                                                                    *
**********************************************************************
         DC    CL44'SYSL.F01640'
         DC    CL44'MB98.F01640'
         DC    CL44'MB97.F01640'
         DC    CL44'TS00.F01640'
         DC    CL44'DS98.F01640'
         DC    CL44'MB01.F01640'
         DC    CL44'MB02.F01640'
         DC    CL44'MB03.F01640'
         DC    CL44'MB04.F01640'
         DC    CL44'MB05.F01640'
         DC    CL44'MB06.F01640'
         DC    CL44'MB07.F01640'
         DC    CL44'MB08.F01640'
         DC    CL44'MB09.F01640'
         DC    CL44'SP98.F01640'
         DC    CL44'DUM1.F01640'
         DC    CL44'DUM2.F01640'
         DC    CL44'DUM3.F01640'
         DC    CL44'DUM4.F01640'
         DC    CL44'DUM5.F01640'
         DC    CL44'DUM6.F01640'
         DC    CL44'DUM7.F01640'
         DC    CL44'DUM8.F01640'
         DC    CL44'DUM9.F01640'
         DC    CL44'DUMA.F01640'
         DC    CL44'DUMB.F01640'
         DC    44X'00'
         END
