//JOBNAME JOB ACCOUNT,'NAME'
//*------------------------------------------------------------------*/
//*                                                                  */
//* Copyright (c) The Charles Stark Draper Laboratory, Inc., 1997    */
//*                                                                  */
//* This software is provided on an "AS IS" basis. All warranties,   */
//* including the implied warranties of merchantability and fitness, */
//* are expressly denied.                                            */
//*                                                                  */
//* Provided this copyright notice is included, this software may    */
//* be freely distributed and not offered for sale.                  */
//*                                                                  */
//* Changes or modifications may be made and used only by the maker  */
//* of same, and not further distributed. Such modifications should  */
//* be mailed to the author for consideration for addition to the    */
//* software and incorporation in subsequent releases.               */
//*                                                                  */
//*------------------------------------------------------------------*/
//*
//*    TSO/ISPF square brackets support for ISPF V4R2
//*
//*  Version: 1
//*
//* Author: Steve Bacher <seb@draper.com>
//*
//* Date: 17 Nov 1997
//*
//*-------------------------------------------------------------------
//*
//* This job creates the distribution libraries (PDS's).
//*
//* Run this JCL to create the PDS's, after customizing to suit.
//* (Obviously, put in a good JOB statement first.)
//* To customize the JCL, change the defaults on the //MDLOAD PROC
//* statement to your liking, particularly the PREFIX default.
//* You might also want to change the final qualifiers of the PDS's
//* created - to do this, find the // EXEC MDLOAD statements and
//* change the value of the TO parameter.
//*
//* See the $$README file (of the CNTL PDS, first in this stream)
//* for the rest of the installation instructions.
//*
//MDLOAD PROC CLS='*',BS='6160',U='SYSDA',V='',
//      TRK1='30',TRK2='10',DIR='35',RLSE='RLSE',
//      PREFIX='SYS8.BRACKETS.'
//*
//IEBUPDTE EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=&CLS
//SYSUT2 DD DISP=(NEW,CATLG,DELETE),DSN=&PREFIX.&TO,
//  DCB=(RECFM=FB,LRECL=80,BLKSIZE=&BS),
//  SPACE=(TRK,(&TRK1,&TRK2,&DIR),&RLSE),UNIT=&U,VOL=SER=&V
//*
//  PEND
//*
//CNTL     EXEC MDLOAD,BS='6160',TRK1='5',TRK2='1',TO='CNTL'
//SYSIN    DD   DATA,DLM='?!'
./ ADD NAME=$$README

TSO/ISPF Square Brackets Support

This support consists of 3 SMP/E usermods to ISPF (currently written
for ISPF V4R2), plus a REXX exec called "BRACKETS".

To install these utilities:

(1) Receive and apply the usermods in the CNTL dataset.  Change the
    SYSMOD ID's to whatever you want, but be sure to modify the
    references across all three.  Change the FMIDs of the ISPF
    products to match your site.  Note that the distribution
    library for the new terminal translate tables is ADLOAD; either
    create an SMP/E DDDEF for this distlib or change the JCLIN to
    reflect a different distlib of your choice.

(2) Install the BRACKETS exec in the CLIST or EXEC library of your
    choice.  Install the BRACKETS help similarly.

(3) Send all gripes, compliments and suggestions to seb@draper.com.

./ ADD NAME=BRACKET1
++USERMOD(BRACKET1) /* ISPF 4.2 ISPF ASCII TERMINAL TYPE USERMOD
**********************************************************************
***                                                                ***
***  This usermod creates an ISPF terminal translate table         ***
***  (called ISPX7171) associated with a terminal type we call     ***
***  "ASCII" on the ISPF settings panels.  This terminal type      ***
***  supports square brackets.                                     ***
***                                                                ***
***  Also required is BRACKET2, which creates the corresponding    ***
***  ISPF/PDF terminal translate table ISRX7171; and BRACKET3,     ***
***  which modifies the ISPF settings panels to support this.      ***
***                                                                ***
********************************************************************/.
++VER(Z038) FMID(HIF4202).
++IF FMID(JIF4203) THEN REQ(BRACKET2) /* ISRX7171 module      */ .
++IF FMID(JIF4210) THEN REQ(BRACKET3) /* ISPF settings panels */ .
++JCLIN.
//LKED EXEC PGM=IEWL,PARM='LIST,LET,RENT,REUS'
//SYSPRINT DD SYSOUT=A
//SYSLMOD DD DISP=SHR,DSN=ISP.V4R2M0.SISPLPA
//ADLOAD  DD DISP=SHR,DSN=DST2.ADLOAD
//SYSLIN DD *
   ENTRY ISPX7171
   INCLUDE ADLOAD(ISPX7171)
   MODE AMODE(31),RMODE(ANY)
 NAME ISPX7171(R)
/*
++SRC(ISPX7171) DISTLIB(ADSOURCE) DISTMOD(ADLOAD).
         SPACE 1
***********************************************************************
*                                                                     *
* ISPF 4.2.0 "ASCII" ISPF terminal translate table.                   *
* Also see ISRX7171 for ISPF/PDF terminal translation.                *
* Reference: ISPF Planning and Customizing (SC34-4443-01)             *
*                                                                     *
* Copied from ISPOWNTT (in SAMPLIB) and modified.  Actually, since    *
* the table did not change from the V3R5 version, I just copied it    *
* from the V3R5 usermod.                                              *
*                                                                     *
***********************************************************************
*
ISPX7171 CSECT
TTID     DC    CL8'ISPX7171'
UPPP     DC    AL4(TTUPP)
LOWP     DC    AL4(TTLOW)
VALP     DC    AL4(TTVAL)
ALBP     DC    AL4(TTALB)
ETOP     DC    A(0)
GSCP     DC    A(0)
GSMP     DC    AL4(TTGSM)
GSSP     DC    A(0)
EDIP     DC    A(0)
EDOP     DC    A(0)
DPRP     DC    A(0)
TBIP     DC    A(0)
TBOP     DC    A(0)
ESCV     DC    X'00000000'
ALPP     DC    AL4(TTALP)
COLP     DC    AL4(0)              No non-EBCDIC collating - SEB
*
*
TTUPP    DC    X'0001020304050607'     (X'00' TO X'07')
         DC    X'40090A0B0C0D0E0F'     (X'08' TO X'0F')
         DC    X'1011121314151617'     (X'10' TO X'17')
         DC    X'18191A1B4040401F'     (X'18' TO X'1F')
         DC    X'2021222324252627'     (X'20' TO X'27')
         DC    X'28292A2B2C2D2E2F'     (X'28' TO X'2F')
         DC    X'3031323334353637'     (X'30' TO X'37')
         DC    X'38393A3B3C3D3E3F'     (X'38' TO X'3F')
         DC    X'4041424344454647'     (X'40' TO X'47')
         DC    X'48494A4B4C4D4E4F'     (X'48' TO X'4F')
         DC    X'5051525354555657'     (X'50' TO X'57')
         DC    X'58595A5B5C5D5E5F'     (X'58' TO X'5F')
         DC    X'6061626364656667'     (X'60' TO X'67')
         DC    X'68696A6B6C6D6E6F'     (X'68' TO X'6F')
         DC    X'7071727374757677'     (X'70' TO X'77')
         DC    X'78797A7B7C7D7E7F'     (X'78' TO X'7F')
         DC    X'80C1C2C3C4C5C6C7'     (X'80' TO X'87')
         DC    X'C8C98A8B8C8D8E8F'     (X'88' TO X'8F')
         DC    X'90D1D2D3D4D5D6D7'     (X'90' TO X'97')
         DC    X'D8D99A9B9C9D9E9F'     (X'98' TO X'9F')
         DC    X'A0A1E2E3E4E5E6E7'     (X'A0' TO X'A7')
         DC    X'E8E9AAABACADAEAF'     (X'A8' TO X'AF')
         DC    X'B0B1B2B3B4B5B6B7'     (X'B0' TO X'B7')
         DC    X'B8B9BABBBCBDBEBF'     (X'B8' TO X'BF')
         DC    X'C0C1C2C3C4C5C6C7'     (X'C0' TO X'C7')
         DC    X'C8C9CACBCCCDCECF'     (X'C8' TO X'CF')
         DC    X'D0D1D2D3D4D5D6D7'     (X'D0' TO X'D7')
         DC    X'D8D9DADBDCDDDEDF'     (X'D8' TO X'DF')
         DC    X'E0E1E2E3E4E5E6E7'     (X'E0' TO X'E7')
         DC    X'E8E9EAEBECEDEEEF'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9FAFBFCFDFEFF'     (X'F8' TO X'FF')
*
*
TTLOW    DC    X'0001020304050607'     (X'00' TO X'07')
         DC    X'40090A0B0C0D0E0F'     (X'08' TO X'0F')
         DC    X'1011121314151617'     (X'10' TO X'17')
         DC    X'18191A1B4040401F'     (X'18' TO X'1F')
         DC    X'2021222324252627'     (X'20' TO X'27')
         DC    X'28292A2B2C2D2E2F'     (X'28' TO X'2F')
         DC    X'3031323334353637'     (X'30' TO X'37')
         DC    X'38393A3B3C3D3E3F'     (X'38' TO X'3F')
         DC    X'4041424344454647'     (X'40' TO X'47')
         DC    X'48494A4B4C4D4E4F'     (X'48' TO X'4F')
         DC    X'5051525354555657'     (X'50' TO X'57')
         DC    X'58595A5B5C5D5E5F'     (X'58' TO X'5F')
         DC    X'6061626364656667'     (X'60' TO X'67')
         DC    X'68696A6B6C6D6E6F'     (X'68' TO X'6F')
         DC    X'7071727374757677'     (X'70' TO X'77')
         DC    X'78797A7B7C7D7E7F'     (X'78' TO X'7F')
         DC    X'8081828384858687'     (X'80' TO X'87')
         DC    X'88898A8B8C8D8E8F'     (X'88' TO X'8F')
         DC    X'9091929394959697'     (X'90' TO X'97')
         DC    X'98999A9B9C9D9E9F'     (X'98' TO X'9F')
         DC    X'A0A1A2A3A4A5A6A7'     (X'A0' TO X'A7')
         DC    X'A8A9AAABACADAEAF'     (X'A8' TO X'AF')
         DC    X'B0B1B2B3B4B5B6B7'     (X'B0' TO X'B7')
         DC    X'B8B9BABBBCBDBEBF'     (X'B8' TO X'BF')
         DC    X'C0C1C2C3C4C5C6C7'     (X'C0' TO X'C7')
         DC    X'C8C9CACBCCCDCECF'     (X'C8' TO X'CF')
         DC    X'D0D1D2D3D4D5D6D7'     (X'D0' TO X'D7')
         DC    X'D8D9DADBDCDDDEDF'     (X'D8' TO X'DF')
         DC    X'E0E1E2E3E4E5E6E7'     (X'E0' TO X'E7')
         DC    X'E8E9EAEBECEDEEEF'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9FAFBFCFDFEFF'     (X'F8' TO X'FF')
*
*
TTVAL    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'07')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'00FFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFF0000000000'     (X'48' TO X'4F') X'4A' cent sign
         DC    X'00FFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFF000000000000'     (X'58' TO X'5F')
         DC    X'0000FFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFF0000000000'     (X'68' TO X'6F') X'6A' dbl v bar
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FF00000000000000'     (X'78' TO X'7F')
         DC    X'FF00000000000000'     (X'80' TO X'87')
         DC    X'0000FFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FF00000000000000'     (X'90' TO X'97')
         DC    X'0000FFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FF00000000000000'     (X'A0' TO X'A7')
         DC    X'0000FFFFFF00FFFF'     (X'A8' TO X'AF') X'AD' lbracket
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFF00FFFF'     (X'B8' TO X'BF') X'BD' rbracket
         DC    X'0000000000000000'     (X'C0' TO X'C7')
         DC    X'0000FFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'0000000000000000'     (X'D0' TO X'D7')
         DC    X'0000FFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'00FF000000000000'     (X'E0' TO X'E7')
         DC    X'0000FFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'0000000000000000'     (X'F0' TO X'F7')
         DC    X'0000FFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
TTGSM    DC    X'0101010101010101'     (X'00' TO X'07')
         DC    X'0101010101010101'     (X'08' TO X'0F')
         DC    X'0101010101010101'     (X'10' TO X'17')
         DC    X'0101010101010101'     (X'18' TO X'1F')
         DC    X'0101010101010101'     (X'20' TO X'27')
         DC    X'0101010101010101'     (X'28' TO X'2F')
         DC    X'0101010101010101'     (X'30' TO X'37')
         DC    X'0101010101010101'     (X'38' TO X'3F')
         DC    X'0001010101010101'     (X'40' TO X'47')
         DC    X'0101010202020202'     (X'48' TO X'4F') X'4A' is P'.'
         DC    X'0201010101010101'     (X'50' TO X'57')
         DC    X'0101020202020202'     (X'58' TO X'5F')
         DC    X'0202010101010101'     (X'60' TO X'67')
         DC    X'0101010202020202'     (X'68' TO X'6F') X'6A' is P'.'
         DC    X'0101010101010101'     (X'70' TO X'77')
         DC    X'0102020202020202'     (X'78' TO X'7F')
         DC    X'0110101010101010'     (X'80' TO X'87')
         DC    X'1010010101010101'     (X'88' TO X'8F')
         DC    X'0110101010101010'     (X'90' TO X'97')
         DC    X'1010010101010101'     (X'98' TO X'9F')
         DC    X'0102101010101010'     (X'A0' TO X'A7')
         DC    X'1010010101020101'     (X'A8' TO X'AF') X'AD' is P'$'
         DC    X'0101010101010101'     (X'B0' TO X'B7')
         DC    X'0101010101020101'     (X'B8' TO X'BF') X'BD' is P'$'
         DC    X'0220202020202020'     (X'C0' TO X'C7')
         DC    X'2020010101010101'     (X'C8' TO X'CF')
         DC    X'0220202020202020'     (X'D0' TO X'D7')
         DC    X'2020010101010101'     (X'D8' TO X'DF')
         DC    X'0201202020202020'     (X'E0' TO X'E7')
         DC    X'2020010101010101'     (X'E8' TO X'EF')
         DC    X'4040404040404040'     (X'F0' TO X'F7')
         DC    X'4040010101010101'     (X'F8' TO X'FF')
*
*
TTALP    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'07')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFFFFFFFFFFFF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFF00FFFFFFFF'     (X'58' TO X'5F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFFFFFFFF'     (X'68' TO X'6F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFFFF0000FFFFFF'     (X'78' TO X'7F')
         DC    X'FF00000000000000'     (X'80' TO X'87')
         DC    X'0000FFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FF00000000000000'     (X'90' TO X'97')
         DC    X'0000FFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFF000000000000'     (X'A0' TO X'A7')
         DC    X'0000FFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FF00000000000000'     (X'C0' TO X'C7')
         DC    X'0000FFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FF00000000000000'     (X'D0' TO X'D7')
         DC    X'0000FFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFF000000000000'     (X'E0' TO X'E7')
         DC    X'0000FFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'F0' TO X'F7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
TTALB    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'07')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFFFFFFFFFFFF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFFFFFFFFFFFF'     (X'58' TO X'5F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFFFFFFFF'     (X'68' TO X'6F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFFFFFFFFFFFFFF'     (X'78' TO X'7F')
         DC    X'FF00000000000000'     (X'80' TO X'87')
         DC    X'0000FFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FF00000000000000'     (X'90' TO X'97')
         DC    X'0000FFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFF000000000000'     (X'A0' TO X'A7')
         DC    X'0000FFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FF00000000000000'     (X'C0' TO X'C7')
         DC    X'0000FFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FF00000000000000'     (X'D0' TO X'D7')
         DC    X'0000FFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFF000000000000'     (X'E0' TO X'E7')
         DC    X'0000FFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'F0' TO X'F7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
         AGO   .NOTTCOL                Skip it - SEB
TTCOL    DC    X'0001020304050607'     (X'00' TO X'07')
         DC    X'08090A0B0C0D0E0F'     (X'08' TO X'0F')
         DC    X'1011121314151617'     (X'10' TO X'17')
         DC    X'18191A1B1C1D1E1F'     (X'18' TO X'1F')
         DC    X'2021222324252627'     (X'20' TO X'27')
         DC    X'28292A2B2C2D2E2F'     (X'28' TO X'2F')
         DC    X'3031323334353637'     (X'30' TO X'37')
         DC    X'38393A3B3C3D3E3F'     (X'38' TO X'3F')
         DC    X'4041424344454647'     (X'40' TO X'47')
         DC    X'48494A4B4C4D4E4F'     (X'48' TO X'4F')
         DC    X'5051525354555657'     (X'50' TO X'57')
         DC    X'58595A5B5C5D5E5F'     (X'58' TO X'5F')
         DC    X'6061626364656667'     (X'60' TO X'67')
         DC    X'68696A6B6C6D6E6F'     (X'68' TO X'6F')
         DC    X'7071727374757677'     (X'70' TO X'77')
         DC    X'78797A7B7C7D7E7F'     (X'78' TO X'7F')
         DC    X'8081828384858687'     (X'80' TO X'87')
         DC    X'88898A8B8C8D8E8F'     (X'88' TO X'8F')
         DC    X'9091929394959697'     (X'90' TO X'97')
         DC    X'98999A9B9C9D9E9F'     (X'98' TO X'9F')
         DC    X'A0A1A2A3A4A5A6A7'     (X'A0' TO X'A7')
         DC    X'A8A9AAABACADAEAF'     (X'A8' TO X'AF')
         DC    X'B0B1B2B3B4B5B6B7'     (X'B0' TO X'B7')
         DC    X'B8B9BABBBCBDBEBF'     (X'B8' TO X'BF')
         DC    X'C0C1C2C3C4C5C6C7'     (X'C0' TO X'C7')
         DC    X'C8C9CACBCCCDCECF'     (X'C8' TO X'CF')
         DC    X'D0D1D2D3D4D5D6D7'     (X'D0' TO X'D7')
         DC    X'D8D9DADBDCDDDEDF'     (X'D8' TO X'DF')
         DC    X'E0E1E2E3E4E5E6E7'     (X'E0' TO X'E7')
         DC    X'E8E9EAEBECEDEEEF'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9FAFBFCFDFEFF'     (X'F8' TO X'FF')
.NOTTCOL ANOP  ,                       Skip it - SEB
         END
./ ADD NAME=BRACKET2
++USERMOD(BRACKET2) /* ISPF 4.2 PDF ASCII TERMINAL TYPE USERMOD
**********************************************************************
***                                                                ***
***  This usermod creates an ISPF/PDF terminal translate table     ***
***  (called ISRX7171) associated with a terminal type we call     ***
***  "ASCII" on the ISPF settings panels.  This terminal type      ***
***  supports square brackets.                                     ***
***                                                                ***
***  Also required is BRACKET1, which creates the corresponding    ***
***  ISPF terminal translate table ISPX7171; and BRACKET3,         ***
***  which modifies the ISPF settings panels to support this.      ***
***                                                                ***
********************************************************************/.
++VER(Z038) FMID(JIF4203).
++IF FMID(HIF4202) THEN REQ(BRACKET1) /* ISPX7171 module      */ .
++IF FMID(JIF4210) THEN REQ(BRACKET3) /* ISPF settings panels */ .
++JCLIN.
//LKED EXEC PGM=IEWL,PARM='LIST,LET,RENT,REUS'
//SYSPRINT DD SYSOUT=A
//SYSLMOD DD DISP=SHR,DSN=ISP.V4R2M0.SISPLPA
//ADLOAD  DD DISP=SHR,DSN=DST2.ADLOAD
//SYSLIN DD *
   ENTRY ISRX7171
   INCLUDE ADLOAD(ISRX7171)
   MODE AMODE(31),RMODE(ANY)
 NAME ISRX7171(R)
/*
++SRC(ISRX7171) DISTLIB(ADSOURCE) DISTMOD(ADLOAD).
         SPACE 1
***********************************************************************
*                                                                     *
* ISPF 4.2.0 "ASCII" ISPF/PDF terminal translate table.               *
* Also see ISPX7171 for ISPF terminal translation.                    *
* Reference: ISPF Planning and Customizing (SC34-4443-01)             *
*                                                                     *
* Copied from ISROWNTT (in SAMPLIB) and modified.  Actually, since    *
* the table did not change from the V3R5 version, I just copied it    *
* from the V3R5 usermod.                                              *
*                                                                     *
***********************************************************************
         SPACE 1
ISRX7171 CSECT
TTID     DC    CL8'ISRX7171'
VDSN     DC    AL4(TTVDSN)
IDSN     DC    AL4(TTIDSN)
HEXP     DC    AL4(TTHEX)
NUMP     DC    AL4(TTNUM)
ALNP     DC    AL4(TTALN)
DUMMY1   DC    A(0)
ETOP     DC    AL4(TTETO)
GSCP     DC    AL4(TTGSC)
DUMMY2   DC    A(0)
GSSP     DC    AL4(TTGSS)
EDIP     DC    A(0)
EDOP     DC    A(0)
UPPP     DC    AL4(TTUPP)
LOWP     DC    AL4(TTLOW)
DUMMY3   DC    A(0)
DUMMY4   DC    A(0)
DUMMY5   DC    A(0)
DUMMY6   DC    A(0)
*
*
TTVDSN   DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'07')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'00FFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFFFFFFFF00FF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFF0000FFFFFF'     (X'58' TO X'5F')
         DC    X'00FFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFF00FFFF'     (X'68' TO X'6F')  OY08618
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFF000000FFFFFF'     (X'78' TO X'7F')
         DC    X'FF00000000000000'     (X'80' TO X'87')
         DC    X'0000FFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FF00000000000000'     (X'90' TO X'97')
         DC    X'0000FFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFF000000000000'     (X'A0' TO X'A7')
         DC    X'0000FFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FF00000000000000'     (X'C0' TO X'C7')
         DC    X'0000FFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FF00000000000000'     (X'D0' TO X'D7')
         DC    X'0000FFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFF000000000000'     (X'E0' TO X'E7')
         DC    X'0000FFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'0000000000000000'     (X'F0' TO X'F7')
         DC    X'0000FFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
TTIDSN   DC    X'0000000000000000'     (X'00' TO X'07')
         DC    X'0000000000000000'     (X'08' TO X'0F')
         DC    X'0000000000000000'     (X'10' TO X'17')
         DC    X'0000000000000000'     (X'18' TO X'1F')
         DC    X'0000000000000000'     (X'20' TO X'27')
         DC    X'0000000000000000'     (X'28' TO X'2F')
         DC    X'0000000000000000'     (X'30' TO X'37')
         DC    X'0000000000000000'     (X'38' TO X'3F')
         DC    X'0000000000000000'     (X'40' TO X'47')
         DC    X'0000000000004E00'     (X'48' TO X'4F')
         DC    X'0000000000000000'     (X'50' TO X'57')
         DC    X'0000005B5C000000'     (X'58' TO X'5F')
         DC    X'6000000000000000'     (X'60' TO X'67')
         DC    X'00000000006D0000'     (X'68' TO X'6F')
         DC    X'0000000000000000'     (X'70' TO X'77')
         DC    X'00007A7B7C000000'     (X'78' TO X'7F')
         DC    X'0081828384858687'     (X'80' TO X'87')
         DC    X'8889000000000000'     (X'88' TO X'8F')
         DC    X'0091929394959697'     (X'90' TO X'97')
         DC    X'9899000000000000'     (X'98' TO X'9F')
         DC    X'0000A2A3A4A5A6A7'     (X'A0' TO X'A7')
         DC    X'A8A9000000000000'     (X'A8' TO X'AF')
         DC    X'0000000000000000'     (X'B0' TO X'B7')
         DC    X'0000000000000000'     (X'B8' TO X'BF')
         DC    X'00C1C2C3C4C5C6C7'     (X'C0' TO X'C7')
         DC    X'C8C9000000000000'     (X'C8' TO X'CF')
         DC    X'00D1D2D3D4D5D6D7'     (X'D0' TO X'D7')
         DC    X'D8D9000000000000'     (X'D8' TO X'DF')
         DC    X'0000E2E3E4E5E6E7'     (X'E0' TO X'E7')
         DC    X'E8E9000000000000'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9000000000000'     (X'F8' TO X'FF')
*
*
TTHEX    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'07')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFFFFFFFFFFFF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFFFFFFFFFFFF'     (X'58' TO X'5F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFFFFFFFF'     (X'68' TO X'6F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFFFFFFFFFFFFFF'     (X'78' TO X'7F')
         DC    X'FF000000000000FF'     (X'80' TO X'87')
         DC    X'FFFFFFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'90' TO X'97')
         DC    X'FFFFFFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'A0' TO X'A7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FF000000000000FF'     (X'C0' TO X'C7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'D0' TO X'D7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'E0' TO X'E7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'0000000000000000'     (X'F0' TO X'F7')
         DC    X'0000FFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
TTNUM    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFFFFFFFFFFFF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFFFFFFFFFFFF'     (X'58' TO X'5F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFFFFFFFF'     (X'68' TO X'6F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFFFFFFFFFFFFFF'     (X'78' TO X'7F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'80' TO X'87')
         DC    X'FFFFFFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'90' TO X'97')
         DC    X'FFFFFFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'A0' TO X'A7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'C0' TO X'C7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'D0' TO X'D7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'E0' TO X'E7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'0000000000000000'     (X'F0' TO X'F7')
         DC    X'0000FFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
TTALN    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFFFFFFFFFFFF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFF00FFFFFFFF'     (X'58' TO X'5F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFFFFFFFF'     (X'68' TO X'6F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFFFF0000FFFFFF'     (X'78' TO X'7F')
         DC    X'FF00000000000000'     (X'80' TO X'87')
         DC    X'0000FFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FF00000000000000'     (X'90' TO X'97')
         DC    X'0000FFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFF000000000000'     (X'A0' TO X'A7')
         DC    X'0000FFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FF00000000000000'     (X'C0' TO X'C7')
         DC    X'0000FFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FF00000000000000'     (X'D0' TO X'D7')
         DC    X'0000FFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFF000000000000'     (X'E0' TO X'E7')
         DC    X'0000FFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'0000000000000000'     (X'F0' TO X'F7')
         DC    X'0000FFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
TTETO    DC    X'1515151515151515'     (X'00' TO X'0F')
         DC    X'1515151515151515'     (X'08' TO X'0F')
         DC    X'1515151515151515'     (X'10' TO X'17')
         DC    X'1515151515151515'     (X'18' TO X'1F')
         DC    X'1515151515151515'     (X'20' TO X'27')
         DC    X'1515151515151515'     (X'28' TO X'2F')
         DC    X'1515151515151515'     (X'30' TO X'37')
         DC    X'1515151515151515'     (X'38' TO X'3F')
         DC    X'4015151515151515'     (X'40' TO X'47')
         DC    X'1515154B4C4D4E4F'     (X'48' TO X'4F') 4A cent sign
         DC    X'5015151515151515'     (X'50' TO X'57')
         DC    X'15155A5B5C5D5E5F'     (X'58' TO X'5F')
         DC    X'6061151515151515'     (X'60' TO X'67')
         DC    X'1515156B6C6D6E6F'     (X'68' TO X'6F') 6A broken v bar
         DC    X'1515151515151515'     (X'70' TO X'77')
         DC    X'15797A7B7C7D7E7F'     (X'78' TO X'7F')
         DC    X'1581828384858687'     (X'80' TO X'87')
         DC    X'8889151515151515'     (X'88' TO X'8F')
         DC    X'1591929394959697'     (X'90' TO X'97')
         DC    X'9899151515151515'     (X'98' TO X'9F')
         DC    X'15A1A2A3A4A5A6A7'     (X'A0' TO X'A7')
         DC    X'A8A9151515AD1515'     (X'A8' TO X'AF') AD left bracket
         DC    X'1515151515151515'     (X'B0' TO X'B7')
         DC    X'1515151515BD1515'     (X'B8' TO X'BF') BD rightbracket
         DC    X'C0C1C2C3C4C5C6C7'     (X'C0' TO X'C7')
         DC    X'C8C9151515151515'     (X'C8' TO X'CF')
         DC    X'D0D1D2D3D4D5D6D7'     (X'D0' TO X'D7')
         DC    X'D8D9151515151515'     (X'D8' TO X'DF')
         DC    X'E015E2E3E4E5E6E7'     (X'E0' TO X'E7')  OY08618
         DC    X'E8E9151515151515'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9151515151515'     (X'F8' TO X'FF')
*
*
TTGSC    DC    X'00'                   (X'00')
         DC    X'01'                   (X'01')
         DC    X'02'                   (X'02')
         DC    X'04'                   (X'03')
         DC    X'08'                   (X'04')
         DC    X'10'                   (X'05')
         DC    X'20'                   (X'06')
         DC    X'40'                   (X'07')
         DC    X'80'                   (X'08')
         DC    X'FF'                   (X'09')
         DC    X'30'                   (X'0A')
         DC    X'7F'                   (X'0B')
         DC    X'FF'                   (X'0C')
         DC    X'FF'                   (X'0D')
         DC    X'FF'                   (X'0E')
         DC    X'FF'                   (X'0F')
         DC    X'40'                   (X'10')
         DC    X'20'                   (X'11')
         DC    X'10'                   (X'12')
         DC    X'30'                   (X'13')
         DC    X'FF'                   (X'14')
         DC    X'FF'                   (X'15')
         DC    X'FF'                   (X'16')
*
*
TTGSS    DC    X'FFFFFFFFFFFFFFFF'     (X'00' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'08' TO X'0F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'10' TO X'17')
         DC    X'FFFFFFFFFFFFFFFF'     (X'18' TO X'1F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'20' TO X'27')
         DC    X'FFFFFFFFFFFFFFFF'     (X'28' TO X'2F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'30' TO X'37')
         DC    X'FFFFFFFFFFFFFFFF'     (X'38' TO X'3F')
         DC    X'40FFFFFFFFFFFFFF'     (X'40' TO X'47')
         DC    X'FFFFFF0105FFFFFF'     (X'48' TO X'4F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'50' TO X'57')
         DC    X'FFFFFF02FFFFFF0B'     (X'58' TO X'5F')
         DC    X'10FFFFFFFFFFFFFF'     (X'60' TO X'67')
         DC    X'FFFFFFFFFFFF06FF'     (X'68' TO X'6F')
         DC    X'FFFFFFFFFFFFFFFF'     (X'70' TO X'77')
         DC    X'FFFFFF070AFF00FF'     (X'78' TO X'7F')
         DC    X'FF81828384858687'     (X'80' TO X'87')
         DC    X'8889FFFFFFFFFFFF'     (X'88' TO X'8F')
         DC    X'FF91929394959697'     (X'90' TO X'97')
         DC    X'9899FFFFFFFFFFFF'     (X'98' TO X'9F')
         DC    X'FFFFA2A3A4A5A6A7'     (X'A0' TO X'A7')
         DC    X'A8A9FFFFFFFFFFFF'     (X'A8' TO X'AF')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B0' TO X'B7')
         DC    X'FFFFFFFFFFFFFFFF'     (X'B8' TO X'BF')
         DC    X'FFC1C2C3C4C5C6C7'     (X'C0' TO X'C7')
         DC    X'C8C9FFFFFFFFFFFF'     (X'C8' TO X'CF')
         DC    X'FFD1D2D3D4D5D6D7'     (X'D0' TO X'D7')
         DC    X'D8D9FFFFFFFFFFFF'     (X'D8' TO X'DF')
         DC    X'FFFFE2E3E4E5E6E7'     (X'E0' TO X'E7')
         DC    X'E8E9FFFFFFFFFFFF'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9FFFFFFFFFFFF'     (X'F8' TO X'FF')
*
*
* THE FOLLOWING LABEL CHANGED FROM 'TTLOW' TO 'TTUPP' FOR OY08282
* ALSO, ENTRIES WERE CHANGED FROM X'C1' TO X'E9'.  THEY WOULD HAVE
* CHANGED UPPERCASE A-Z TO LOWERCASE.
*
TTUPP    DC    X'0001020304050607'     (X'00' TO X'07')  OY08282
         DC    X'08090A0B0C0D0E0F'     (X'08' TO X'0F')
         DC    X'1011121314151617'     (X'10' TO X'17')
         DC    X'18191A1B1C1D1E1F'     (X'18' TO X'1F')
         DC    X'2021222324252627'     (X'20' TO X'27')
         DC    X'28292A2B2C2D2E2F'     (X'28' TO X'2F')
         DC    X'3031323334353637'     (X'30' TO X'37')
         DC    X'38393A3B3C3D3E3F'     (X'38' TO X'3F')
         DC    X'4041424344454647'     (X'40' TO X'47')
         DC    X'48494A4B4C4D4E4F'     (X'48' TO X'4F')
         DC    X'5051525354555657'     (X'50' TO X'57')
         DC    X'58595A5B5C5D5E5F'     (X'58' TO X'5F')
         DC    X'6061626364656667'     (X'60' TO X'67')
         DC    X'68696A6B6C6D6E6F'     (X'68' TO X'6F')
         DC    X'7071727374757677'     (X'70' TO X'77')
         DC    X'78797A7B7C7D7E7F'     (X'78' TO X'7F')
         DC    X'80C1C2C3C4C5C6C7'     (X'80' TO X'87')
         DC    X'C8C98A8B8C8D8E8F'     (X'88' TO X'8F')
         DC    X'90D1D2D3D4D5D6D7'     (X'90' TO X'97')
         DC    X'D8D99A9B9C9D9E9F'     (X'98' TO X'9F')
         DC    X'A0A1E2E3E4E5E6E7'     (X'A0' TO X'A7')
         DC    X'E8E9AAABACADAEAF'     (X'A8' TO X'AF')
         DC    X'B0B1B2B3B4B5B6B7'     (X'B0' TO X'B7')
         DC    X'B8B9BABBBCBDBEBF'     (X'B8' TO X'BF')
         DC    X'C0C1C2C3C4C5C6C7'     (X'C0' TO X'C7')  OY08282
         DC    X'C8C9CACBCCCDCECF'     (X'C8' TO X'CF')  OY08282
         DC    X'D0D1D2D3D4D5D6D7'     (X'D0' TO X'D7')  OY08282
         DC    X'D8D9DADBDCDDDEDF'     (X'D8' TO X'DF')  OY08282
         DC    X'E0E1E2E3E4E5E6E7'     (X'E0' TO X'E7')  OY08282
         DC    X'E8E9EAEBECEDEEEF'     (X'E8' TO X'EF')  OY08282
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9FAFBFCFDFEFF'     (X'F8' TO X'FF')
*
*
TTLOW    DC    X'0001020304050607'     (X'00' TO X'07')
         DC    X'08090A0B0C0D0E0F'     (X'08' TO X'0F')
         DC    X'1011121314151617'     (X'10' TO X'17')
         DC    X'18191A1B1C1D1E1F'     (X'18' TO X'1F')
         DC    X'2021222324252627'     (X'20' TO X'27')
         DC    X'28292A2B2C2D2E2F'     (X'28' TO X'2F')
         DC    X'3031323334353637'     (X'30' TO X'37')
         DC    X'38393A3B3C3D3E3F'     (X'38' TO X'3F')
         DC    X'4041424344454647'     (X'40' TO X'47')
         DC    X'48494A4B4C4D4E4F'     (X'48' TO X'4F')
         DC    X'5051525354555657'     (X'50' TO X'57')
         DC    X'58595A5B5C5D5E5F'     (X'58' TO X'5F')
         DC    X'6061626364656667'     (X'60' TO X'67')
         DC    X'68696A6B6C6D6E6F'     (X'68' TO X'6F')
         DC    X'7071727374757677'     (X'70' TO X'77')
         DC    X'78797A7B7C7D7E7F'     (X'78' TO X'7F')
         DC    X'8081828384858687'     (X'80' TO X'87')
         DC    X'88898A8B8C8D8E8F'     (X'88' TO X'8F')
         DC    X'9091929394959697'     (X'90' TO X'97')
         DC    X'98999A9B9C9D9E9F'     (X'98' TO X'9F')
         DC    X'A0A1A2A3A4A5A6A7'     (X'A0' TO X'A7')
         DC    X'A8A9AAABACADAEAF'     (X'A8' TO X'AF')
         DC    X'B0B1B2B3B4B5B6B7'     (X'B0' TO X'B7')
         DC    X'B8B9BABBBCBDBEBF'     (X'B8' TO X'BF')
         DC    X'C081828384858687'     (X'C0' TO X'C7')
         DC    X'8889CACBCCCDCECF'     (X'C8' TO X'CF')
         DC    X'D091929394959697'     (X'D0' TO X'D7')
         DC    X'9899DADBDCDDDEDF'     (X'D8' TO X'DF')
         DC    X'E0E1A2A3A4A5A6A7'     (X'E0' TO X'E7')
         DC    X'A8A9EAEBECEDEEEF'     (X'E8' TO X'EF')
         DC    X'F0F1F2F3F4F5F6F7'     (X'F0' TO X'F7')
         DC    X'F8F9FAFBFCFDFEFF'     (X'F8' TO X'FF')
         END
*  CHANGE ACTIVITY
*
*  OY08282 - 870909 - COMPILER ERROR RESULT BECAUSE THERE ARE TWO
*            'TTLOW' LABELS AND NO 'TTUPP' LABEL.  ALSO, TTUPP ENTRIES
*            IN THE RANGE X'C1' TO X'E9' CHANGED TO ASSURE UPPERCASE
*            CHARACTERS REMAIN IN UPPERCASE.  GT4045-SFG
*
*  OY08618 - 879010 - IN TRANSLATE TABLE TTVDSN, FIELDS X'6D' AND X'6E'
*            ARE REVERSED.  IN TTETO, ENTRY FOR X'E1' SHOULD BE X'15'
*            INSTEAD OF X'E1'.  GT4045-SFG
*
./ ADD NAME=BRACKET3
++USERMOD(BRACKET3) /* ISPF 4.2 SETTINGS TERMINAL TYPE USERMOD
**********************************************************************
***                                                                ***
***  This usermod updates the ISPF settings panels to allow        ***
***  entry of a terminal type called "ASCII" that supports         ***
***  square brackets.                                              ***
***                                                                ***
***  Also required is BRACKET1, which creates the required ISPF    ***
***  terminal translate table ISPX7171; and BRACKET2, which creates***
***  the required ISPF/PDF terminal translate table ISRX7171.      ***
***                                                                ***
***  The following panels need to be updated:                      ***
***                                                                ***
*** ISPISMMN                                                       ***
*** ISPOPT1                                                        ***
*** ISPOPT1A                                                       ***
*** ISPOPT3A                                                       ***
*** ISPOPT3B                                                       ***
*** ISPOPT3D                                                       ***
*** ISPOPT3E                                                       ***
*** ISPO901H                                                       ***
*** ISP05110                                                       ***
*** ISP05300                                                       ***
***                                                                ***
***  The following msgs need to be updated:                        ***
***                                                                ***
*** ISPO00                                                         ***
***                                                                ***
********************************************************************/.
++VER(Z038) FMID(JIF4210) PRE(UW23186).
++IF FMID(HIF4202) THEN REQ(BRACKET1) /* ISPX7171 module     */ .
++IF FMID(JIF4203) THEN REQ(BRACKET2) /* ISRX7171 module     */ .
++PNLENU(ISPISMMN).
)PANEL KEYLIST(ISRSAB,ISR)
)ATTR DEFAULT() FORMAT(MIX)
 0B TYPE(AB)
 04 TYPE(ABSL)
 05 TYPE(PT)
 09 TYPE(FP)
 0A TYPE(NT)
 0C TYPE(NT) SKIP(ON)
 11 TYPE(SAC)
 12 TYPE(CEF) PADC(USER)
 13 TYPE(NEF) PADC(USER)
 22 TYPE(WASL) SKIP(ON)
 26 TYPE(NEF) CAPS(ON) PADC(USER)
 27 AREA(SCRL) EXTEND(ON)
 28 TYPE(GRPBOX)
 2A TYPE(SC)
 29 TYPE(CEF) PADC(USER) CKBOX(ON)
 2B TYPE(VOI) CAPS(ON) PADC(USER)
 2C TYPE(SAC) CSRGRP(99) RADIO(ON)
 2E TYPE(SAC) CSRGRP(98) DDLIST(ON)
 2D TYPE(CEF) PADC(USER) CSRGRP(98) DDLIST(ZTM) WIDTH(7)
)ABC DESC('Log/List') MNEM(1)
PDC DESC('Log Data set defaults') MNEM(1) ACTION RUN(>LOGDSD)
PDC DESC('List Data set defaults') MNEM(6) ACTION RUN(>LISTDSD)
PDC DESC('List Data set characteristics') MNEM(15) ACTION RUN(>LISTDSC)
PDC DESC('JCL...') MNEM(1) PDSEP(ON) ACTION RUN(>LLJCL)
)ABCINIT
.ZVARS=ZPDC
&ZPDC=' '
IF (&MNLOO='1') &ZPDC=1
IF (&MNLOO='2') &ZPDC=2
IF (&MNLOO='3') &ZPDC=3
IF (&MNLOO='4') &ZPDC=4
)ABCPROC
IF (&ZPDC=1) &MNLOO='1'
IF (&ZPDC=2) &MNLOO='2'
IF (&ZPDC=3) &MNLOO='3'
IF (&ZPDC=4) &MNLOO='4'
)ABC DESC('Function keys') MNEM(1)
PDC DESC('Non-Keylist PF Key settings') MNEM(1) ACTION RUN(ZKEYS)
PDC DESC('Keylist settings...') MNEM(1) ACTION RUN(KEYLIST)
PDC DESC('Tailor function key display') UNAVAIL(ZFK0) MNEM(1) ACTION RUN
PDC DESC('Show all function keys') UNAVAIL(ZFK1) MNEM(6) PDSEP(ON)
 ACTION RUN(FKA) PARM('ON')
PDC DESC('Show partial function keys') UNAVAIL(ZFK2) MNEM(6)
 ACTION RUN(FKA) PARM('SHORT')
PDC DESC('Remove function key display') UNAVAIL(ZFK3) MNEM(1)
 ACTION RUN(FKA) PARM('OFF')
PDC DESC('Use private and shared') UNAVAIL(ZFK6) MNEM(8) PDSEP(ON)
 ACTION RUN(KEYLIST) PARM('private')
PDC DESC('Use only shared') UNAVAIL(ZFK7) MNEM(10)
 ACTION RUN(KEYLIST) PARM('shared')
PDC DESC('Disable keylists') UNAVAIL(ZFK4) MNEM(1) PDSEP(ON) ACTION RUN(
PDC DESC('Enable keylists') UNAVAIL(ZFK5) MNEM(1) ACTION RUN(>KLON)
)ABCINIT
.ZVARS=ZPDC
&ZPDC=' '
IF (&MNFK='1') &ZPDC=1
IF (&MNFK='2') &ZPDC=2
IF (&MNFK='3') &ZPDC=3
IF (&MNFK='4') &ZPDC=4
IF (&MNFK='5') &ZPDC=5
IF (&MNFK='6') &ZPDC=6
IF (&MNFK='9') &ZPDC=7
IF (&MNFK='10') &ZPDC=8
IF (&MNFK='7') &ZPDC=9
&ZFK0 = 0
IF (&ZPFCTL = 'OFF')
  &ZFK0 = 1
IF (&ZFKA = LONG)
  &zfk1 = 1
  &zfk2 = 0
  &zfk3 = 0
ELSE
  IF (&ZFKA = SHORT)
    &zfk1 = 0
    &zfk2 = 1
    &zfk3 = 0
  ELSE
    IF (&ZFKA = OFF)
      &zfk1 = 0
      &zfk2 = 0
      &zfk3 = 1
IF (&ZKLPRIV = 'N')
  &zfk6 = 0
  &zfk7 = 1
ELSE
  &zfk6 = 1
  &zfk7 = 0
VGET (ZKLUSE) PROFILE
IF (&ZKLUSE = 'N')
  &zfk4 = 1
  &zfk5 = 0
ELSE
  &zfk4 = 0
  &zfk5 = 1
IF (&MNFK='8') &ZPDC=10
)ABCPROC
IF (&ZPDC=1) &MNFK='1'
IF (&ZPDC=2) &MNFK='2'
IF (&ZPDC=3) &MNFK='3'
IF (&ZPDC=4) &MNFK='4'
IF (&ZPDC=5) &MNFK='5'
IF (&ZPDC=6) &MNFK='6'
IF (&ZPDC=7) &MNT='9'
IF (&ZPDC=8) &MNT='10'
IF (&ZPDC=9) &MNFK='7'
IF (&ZPDC=10) &MNFK='8'
)ABC DESC('Colors') MNEM(1)
PDC DESC('Global colors...') MNEM(1) ACTION RUN(COLOR)
PDC DESC('CUA attributes...') UNAVAIL(ZCUAA1) MNEM(1) ACTION RUN(CUAATTR
PDC DESC('Point-and-Shoot...') UNAVAIL(ZCUAA1) MNEM(1) ACTION RUN(PSCOLO
)ABCINIT
.ZVARS=ZPDC
&ZPDC=' '
IF (&MNC='1') &ZPDC=1
VGET (ZGTYPE)
IF (&ZGTYPE = ' ')
  &ZCUAA1 = &ZCUAA
ELSE
  IF (&ZGTYPE = 1)
    &ZCUAA1 = 0
  ELSE
    &ZCUAA1 = 1
IF (&MNC='2') &ZPDC=2
VGET (ZGTYPE)
IF (&ZGTYPE = ' ')
  &ZCUAA1 = &ZCUAA
ELSE
  IF (&ZGTYPE = 1)
    &ZCUAA1 = 0
  ELSE
    &ZCUAA1 = 1
IF (&MNC='3') &ZPDC=3
)ABCPROC
IF (&ZPDC=1) &MNC='1'
IF (&ZPDC=2) &MNC='2'
IF (&ZPDC=3) &MNC='3'
)ABC DESC('Environ') MNEM(1)
PDC DESC('Environ settings...') MNEM(1) ACTION RUN(ENVIRON)
)ABCINIT
.ZVARS=ZPDC
&ZPDC=' '
IF (&MNE='1') &ZPDC=1
)ABCPROC
IF (&ZPDC=1) &MNE='1'
)ABC DESC('Workstation') MNEM(1)
PDC DESC('Workstation connection...') UNAVAIL(GUI1) MNEM(1) ACTION RUN(>
PDC DESC('GUI panel settings...') UNAVAIL(GUI2) MNEM(1) ACTION RUN(>GUIS
PDC DESC('Workstation Tool Integration...') UNAVAIL(GUI3) MNEM(18)
 ACTION RUN(INT)
)ABCINIT
.ZVARS=ZPDC
&ZPDC=' '
       &gui1=0
       &gui2=0
       &gui3=0
       VGET(ZGUI)
       if (&ZGUI ^= ' ')
        &gui1=1
       VGET(ZWSCON)
       if (&ZWSCON = ' ')
        &gui3=1
IF (&MNG='1') &ZPDC=1
IF (&MNG='2') &ZPDC=2
IF (&MNG='3') &ZPDC=3
)ABCPROC
       &gui3=0
       VGET(ZWSCON)
       if (&ZWSCON = ' ')
        &gui3=1
IF (&ZPDC=1) &MNG='1'
IF (&ZPDC=2) &MNG='2'
IF (&ZPDC=3) &MNG='3'
)ABC DESC('Identifier') MNEM(1)
PDC DESC('Message identifier...') MNEM(1) ACTION RUN(>MSGSET)
PDC DESC('Panel identifier...') MNEM(1) ACTION RUN(>PANSET)
PDC DESC('Screen name...') MNEM(1) ACTION RUN(>SCRSET)
)ABCINIT
.ZVARS=ZPDC
&ZPDC=' '
IF (&MNT='1') &ZPDC=1
IF (&MNT='2') &ZPDC=2
IF (&MNT='3') &ZPDC=3
)ABCPROC
IF (&ZPDC=1) &MNT='1'
IF (&ZPDC=2) &MNT='2'
IF (&ZPDC=3) &MNT='3'
)ABC DESC('Help') MNEM(1)
PDC DESC('Settings') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM000')
PDC DESC('Options') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM200')
PDC DESC('Terminal characteristics') MNEM(1) ACTION RUN(TUTOR) PARM('ISP
PDC DESC('Print Graphics parameters') MNEM(1) ACTION RUN(TUTOR) PARM('IS
PDC DESC('General') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSMB00')
PDC DESC('Log/List action bar') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM500
PDC DESC('Function keys action bar') MNEM(1) ACTION RUN(TUTOR) PARM('ISP
PDC DESC('Color action bar') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM700')
PDC DESC('Environ action bar') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM800'
PDC DESC('Workstation action bar') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM
PDC DESC('Identifier action bar') MNEM(1) ACTION RUN(TUTOR) PARM('ISPSM9
)ABCINIT
.ZVARS=ISMHELP
)BODY  CMD(ZCMD)
 Log/List Function keys Colors Environ Workstation Identifier He
-----------------------------------------------------------------------
                               	ISPF Settings
Command ===>Z
SAREA39



















)AREA SAREA39
GRPBOX1                                GRPBOX2
&multipmt.                            Family printer typeZ
ZCommand line at bottom            Device name . . . .Z
ZZ                                  Aspect ratio  . . .Z
ZLong message in pop-up            
ZTab to action bar choices         
ZTab to point-and-shoot fields     GRPBOX3
ZRestore TEST/TRACE options        Input field pad . .Z
ZSession Manager mode              Command delimiter .Z
ZJump from leader dots             
ZEdit PRINTDS Command         
ZZ                             

GRPBOX4
Screen format  ZZ Z     Z Z     Z Z     Z Z     

Terminal Type  Z1.3277  3.3278  5.3290A 7.3278CF9.327
                   2.3277A 4.3278A 6.3278T 8.3277KNA.ASC

)INIT
.ZVARS = '(ZCMD ZFAMPRT ZPL ZDEV ZC1 ZS000201 ZASP ZC2 ZC5 ZC6 ZTP ZPADC
           ZC3 ZDELP ZC4 ZPEDT ZC7 ZS001001 ZSF ZS1NO001 ZS100101 ZS1NO0
           ZS100201 ZS1NO003 ZS100301 ZS1NO004 ZS100401 ZTM)'
&ZWINTTL = 'ISPF Settings'
.HELP = ISPSM000
&ZCMD = ' '
&ZPL = ' '
&ZC1 = ' '
&ZC2 = ' '
&ZC5 = ' '
&ZC6 = ' '
&ZTP = ' '
&ZC3 = ' '
&ZC4 = ' '
&ZPEDT = ' '
&ZC7 = ' '
&ZSF = ' '
&ZTM = ' '
.ATTR(ZSF)='CSRGRP(99) RADIO(ON)'
&ZTERMP = &ZTERM
&ZDELP = &ZDEL
&ZPADCP = &ZPADC
&ZASP = &ZASPECT
&ZDEV = &ZDEVNAM
VGET(ZGUI)
IF (&ZGUI ^= ' ')
  &ZNOGUI='OFF'
ELSE
  &ZNOGUI='ON'
IF (&ZKLPRIV = ' ')
  &ZKLPRIV = 'Y'
IF (&ZPLACE = ' ')
  &ZPLACE = BOTTOM
&ZLPLACE = &ZPLACE
IF (&ZPLACE = BOTTOM)
  &ZPL = '/'
IF (&ZCM    = ' ')
  &ZCM    = YES
&ZLCM = &ZCM
&ZFAMPRT = '2'
IF (&ZISPOPT = ' ')
  &ZTOP = 'NO'
&ZTERMST = 'NO '
IF (&ZTERMTR = '')
    &ZTERMTR = OFF
ELSE
IF (&ZISPTOPT='N')
  &ZTOP = 'NO'
ELSE
  &ZTOP = 'YES'
&ZASSLS = &ZASSL
&ZFMTS = &ZFMT
IF (&ZEACT = 'Y')
  &ZEACT1 = 'Y'
  &ZEACT2 = 'Y'
  &ZEACT3 = 'Y'
  &ZEACT4 = 'Y'
  IF (&ZFMT = 'D')
    &ZEACT1 = 'N'
  IF (&ZFMT = 'S')
    &ZEACT2 = 'N'
  IF (&ZFMT = 'M')
    &ZEACT3 = 'N'
  IF (&ZFMT = 'P')
    &ZEACT4 = 'N'
&ZS000201='Panel display CUA mode'
IF (&ZNOGUI='OFF')
  .ATTR(ZC1)='TYPE(SC) UNAVAIL(ON) CKBOX(ON)'
  .ATTR(ZS000201)='UNAVAIL(ON)'
IF (&ZCM = 'YES') &ZC1 = '/'
&ZWCM = ' '
IF (&ZGUI ^= ' ')
  IF (&ZC1 = ' ')
    &ZC1 = '/'
    &ZWCM = &ZCM
IF (&ZLMP = 'YES') &ZC2 = '/'
IF (&ZTA = 'YES') &ZC5 = '/'
IF (&ZTPS = 'YES') &ZC6 = '/'
IF (&ZTOP = 'YES') &ZTP = '/'
IF (&ZSM = 'YES') &ZC3 = '/'
IF (&ZJUMP = 'Y') &ZC4 = '/'
IF (&ZPCMDEDT = 'Y') &ZPEDT = '/'
&ZS001001='Always show split line'
IF (&ZNOGUI='OFF')
  .ATTR(ZC7)='TYPE(SC) UNAVAIL(ON) CKBOX(ON)'
  .ATTR(ZS001001)='UNAVAIL(ON)'
IF (&ZASSL = 'Y') &ZC7 = '/'
&GRPBOX1 = 'Options'
.ATTR(GRPBOX1) = 'WIDTH(36) DEPTH(12)'
&GRPBOX2 = 'Print Graphics'
.ATTR(GRPBOX2) = 'WIDTH(31) DEPTH(4)'
.ATTR(ZPADCP)='PADC('' '')'
&GRPBOX3 = 'General'
.ATTR(GRPBOX3) = 'WIDTH(31) DEPTH(4)'
&ZS1NO001='1.'
&ZS100101='Data'
&ZS1NO002='2.'
&ZS100201='Std'
&ZS1NO003='3.'
&ZS100301='Max'
&ZS1NO004='4.'
&ZS100401='Part'
IF (&ZEACT1='Y')
  .ATTR(ZS1NO001)='UNAVAIL(ON) RADIO(ON) CSRGRP(99)'
  .ATTR(ZS100101)='UNAVAIL(ON)'
ELSE
  .ATTR(ZS1NO001)='RADIO(ON) CSRGRP(99)'
  IF (&ZFMT='D') &ZSF = 1
IF (&ZEACT2='Y')
  .ATTR(ZS1NO002)='UNAVAIL(ON) RADIO(ON) CSRGRP(99)'
  .ATTR(ZS100201)='UNAVAIL(ON)'
ELSE
  .ATTR(ZS1NO002)='RADIO(ON) CSRGRP(99)'
  IF (&ZFMT='S') &ZSF = 2
IF (&ZEACT3='Y')
  .ATTR(ZS1NO003)='UNAVAIL(ON) RADIO(ON) CSRGRP(99)'
  .ATTR(ZS100301)='UNAVAIL(ON)'
ELSE
  .ATTR(ZS1NO003)='RADIO(ON) CSRGRP(99)'
  IF (&ZFMT='M') &ZSF = 3
IF (&ZEACT4='Y')
  .ATTR(ZS1NO004)='UNAVAIL(ON) RADIO(ON) CSRGRP(99)'
  .ATTR(ZS100401)='UNAVAIL(ON)'
ELSE
  .ATTR(ZS1NO004)='RADIO(ON) CSRGRP(99)'
  IF (&ZFMT='P') &ZSF = 4
IF (&ZTERMP='3277') &ZTM = 1
IF (&ZTERMP='3277A') &ZTM = 2
IF (&ZTERMP='3278') &ZTM = 3
IF (&ZTERMP='3278A') &ZTM = 4
IF (&ZTERMP='3290A') &ZTM = 5
IF (&ZTERMP='3278T') &ZTM = 6
IF (&ZTERMP='3278CF') &ZTM = 7
IF (&ZTERMP='3277KN') &ZTM = 8
IF (&ZTERMP='3278KN') &ZTM = 9
IF (&ZTERMP='ASCII') &ZTM = A                              /* #SPF418 */
&GRPBOX4 = 'Terminal Characteristics'
.ATTR(GRPBOX4) = 'WIDTH(77) DEPTH(6)'
VGET (ZGUI)
IF (&ZGUI = ' ')
  &MULTIPMT='Enter "/" to select option    '
ELSE
  &MULTIPMT='Check box to select option    '
.CURSOR = 'ZCMD'
)REINIT
REFRESH(ZPL ZC1 ZC2 ZC5 ZC6 ZTP ZC3 ZC4 ZPEDT ZC7)
&ZASSLS = &ZASSL
&ZFMTS = &ZFMT
REFRESH (ZSF)
)PROC
VGET (ZVERB)
If (&ZVERB = CANCEL) goto ENDD
IF (&ZPL = ' ')
  &ZPLACE = ASIS
ELSE
  &ZPL = '/'
  &ZPLACE = BOTTOM
IF (&ZC1 ^= ' ')
  &ZC1 = '/'
  &ZCM = 'YES'
ELSE &ZCM = 'NO'
IF (&ZWCM ^= ' ')
  &ZCM = &ZWCM
IF (&ZGUI ^= ' ')
  VER(&ZC1,NONBLANK,MSG=ISPO904)
IF (&ZLCM = NO)
  IF (&ZCM = YES)
    IF (&ZLPLACE = &ZPLACE)
      &ZPLACE = BOTTOM
IF (&ZC2 ^= ' ')
  &ZC2 = '/'
  &ZLMP = 'YES'
ELSE &ZLMP = 'NO'
IF (&ZC5 ^= ' ')
  &ZC5 = '/'
  &ZTA = 'YES'
ELSE &ZTA = 'NO'
IF (&ZC6 ^= ' ')
  &ZC6 = '/'
  &ZTPS = 'YES'
ELSE &ZTPS = 'NO'
IF (&ZTP ^= ' ')
  &ZTP = '/'
  &ZTOP = 'YES'
ELSE &ZTOP = 'NO'
IF (&ZC3 ^= ' ')
  &ZC3 = '/'
  &ZSM = 'YES'
ELSE &ZSM = 'NO'
IF (&ZC4 ^= ' ')
  &ZC4 = '/'
  &ZJUMP = 'Y'
ELSE &ZJUMP = 'N'
IF (&ZPEDT ^= ' ')
  &ZPEDT = '/'
  &ZPCMDEDT = 'Y'
ELSE &ZPCMDEDT = 'N'
if (&ZTOP = 'YES')
  &ZISPTOPT = 'Y'
if (&ZTOP = 'NO')
  &ZISPTOPT = 'N'
IF (&ZC7 ^= ' ')
  &ZC7 = '/'
  &ZASSL = 'Y'
ELSE &ZASSL = 'N'
VER(&ZPADCP,NONBLANK,MSG=ISPP190)
VER(&ZDELP,NONBLANK)
IF (&ZPADCP = LIST /,A,C,D,E,F,G,H,I,J,K,L,M,O,P,Q,R,S,T,U,V,W,X,Y,Z,
                 0,1,2,3,4,5,6,7,8,9)
  .MSG = ISPO902
IF (.RESP = ENTER × .RESP = END)
  IF (.MSG ^= ISPP190 AND .MSG ^= ISPO902)
    &ZPADC = &ZPADCP
IF (&ZDELP = &ZPADC) .MSG = ISPO003
IF (&ZDELP  = LIST A,B,C,D,E,F,G,H,I,J,K,L,M,N,O,P,Q,R,S,T,U,V,W,X,Y,Z,
                 0,1,2,3,4,5,6,7,8,9,'.','=')
  .MSG = ISPO903
VER (&ZASP,LIST,0,1,MSG=ISPG213)
IF (.MSG ^= ISPG213)
  &ZASPECT = &ZASP
&ZDEVNAM = &ZDEV
IF (&ZCMD NE 'LOGDSD  ','LISTDSD ','LISTDSC ','LLJCL   ','KLON    ', +
             'KLOFF   ','MSGSET  ','PANSET  ','NKEYS   ', +
             'GUISET  ','GUIINIT ','SCRSET')
  VGET(ZVERB)
  IF (.RESP = ENTER)
    IF (&ZVERB ^= ' ')                  /* Invalid command  */
      .MSG = ISPZ002
    ELSE
      IF (&ZCMD ^= ' ')                 /* Invalid command  */
        .MSG = ISPZ001
      ELSE
  ELSE
ELSE
IF (.MSG = ' ')
  &ZDEL = &ZDELP
  VPUT ZPLACE PROFILE
ENDD:
VER(&ZSF,NONBLANK)
IF  (&ZTERM = 3278T)
  VER (&ZFMT LIST S,D,M MSG=ISPO005)
if (&ZASSL NE &ZASSLS)
  if (&ZSF = '4')
    .MSG = 'ISPO916'
VER(&ZSF RANGE,1,4)
IF (&ZEACT1='Y') VER(&ZSF,LISTX, 1)
IF (&ZEACT2='Y') VER(&ZSF,LISTX, 2)
IF (&ZEACT3='Y') VER(&ZSF,LISTX, 3)
IF (&ZEACT4='Y') VER(&ZSF,LISTX, 4)
IF (&ZSF = 1) &ZFMT = 'D'
IF (&ZSF = 2) &ZFMT = 'S'
IF (&ZSF = 3) &ZFMT = 'M'
IF (&ZSF = 4) &ZFMT = 'P'
VER(&ZTM,NONBLANK,MSG=ISPO901)
/* VER(&ZTM RANGE,1,9) */                                  /* #SPF418 */
VER(&ZTM LIST,1,2,3,4,5,6,7,8,9,a,A)                       /* #SPF418 */
IF (&ZTM = 1) &ZTERMP = '3277'
IF (&ZTM = 2) &ZTERMP = '3277A'
IF (&ZTM = 3) &ZTERMP = '3278'
IF (&ZTM = 4) &ZTERMP = '3278A'
IF (&ZTM = 5) &ZTERMP = '3290A'
IF (&ZTM = 6) &ZTERMP = '3278T'
IF (&ZTM = 7) &ZTERMP = '3278CF'
IF (&ZTM = 8) &ZTERMP = '3277KN'
IF (&ZTM = 9) &ZTERMP = '3278KN'
IF (&ZTM = a) &ZTERMP = 'ASCII'                            /* #SPF418 */
IF (&ZTM = A) &ZTERMP = 'ASCII'                            /* #SPF418 */
IF (.MSG ^= ISPO901)
  &ZTERM = &ZTERMP
/* set translate load module name based on terminal type */
&ZCHARLM = TRANS(&ZTERM
                 3277  ,  ISP3277
                 3277A ,  ISP3277A
                 3278  ,  ISP3278
                 3278A ,  ISP3278A
                 ASCII ,  ISPX7171                         /* #SPF418 */
                 3290A ,  ISP3278A
                 3278T ,  ISP3278T
                 3278CF,  ISP3278C
                 3277KN,  ISP3277K
                 3278KN,  ISP3278K)
IF (&ZVERB = 'EXIT'  OR .RESP = END)
  IF (.MSG ^= ' ')
    &ZVERB = ' '
    .RESP = ENTER
)HELP
FIELD(ZPL) PANEL(ISPOP41)
FIELD(ZC1) PANEL(ISPOP44)
FIELD(ZC2) PANEL(ISPO909H)
FIELD(ZC5) PANEL(ISPO923H)
FIELD(ZC6) PANEL(ISPO924H)
FIELD(ZTP) PANEL(ISPO912H)
FIELD(ZC3) PANEL(ISPO905H)
FIELD(ZC4) PANEL(ISPO906H)
FIELD(ZPEDT) PANEL(ISPO907H)
FIELD(ZC7) PANEL(ISPO925H)
FIELD(ZFAMPRT) PANEL(ISPSM001)
FIELD(ZDEV) PANEL(ISPSM002)
FIELD(ZASP) PANEL(ISPSM003)
FIELD(ZPADCP) PANEL(ISPO902H)
FIELD(ZDELP) PANEL(ISPO903H)
FIELD(ZSF) PANEL(ISPO904H)
FIELD(ZTM) PANEL(ISPO901H)
)LIST ZTM
VAL(1) CHOICE('3277')
VAL(2) CHOICE('3277A')
VAL(3) CHOICE('3278')
VAL(4) CHOICE('3278A')
VAL(5) CHOICE('3290A')
VAL(6) CHOICE('3278T')
VAL(7) CHOICE('3278CF')
VAL(8) CHOICE('3277KN')
VAL(9) CHOICE('3278KN')
VAL(a) CHOICE('ASCII')                                     /* #SPF418 */
VAL(A) CHOICE('ASCII')                                     /* #SPF418 */
)END
/* 5655-042 (C) COPYRIGHT IBM CORP 1994, 1995 */
/* ISPDTLC Release: 4.2.  Maintenance level: OW16102                  */
/* Panel created - Date: 2 Nov 1995, Time: 12:05:25                   */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISPOPT1).
)ATTR
   TYPE(INPUT) INTENS(HIGH) PAD(NULLS)
   TYPE(FP)
)BODY
%------------------------  TERMINAL CHARACTERISTICS  -------------------
COMMAND ===>_ZCMD
+
TERMINAL TYPE  . . . ._ZTERM   +(3277   - 3275/3277 terminal)
+                                (3277A  - 3275/3277 with APL keyboard)
+                                (3278   - 3276/3278/3279/3290 terminal)
+                                (3278A  - 3276/3278/3279 APL keyboard)
+                                (3278T  - 3276/3278/3279 TEXT keyboard)
+                                (3290A  - 3290 with APL keyboard)
+                                (ASCII  - VT100, PC, or other ASCII key
+
NUMBER OF PF KEYS  . ._ZKEYS+   (12 or 24)
+
INPUT FIELD PAD  . . .Z+       (N - Nulls)  (B - Blanks)  (Special Cha
+                                    must not be the same as COMMAND DEL
+
COMMAND DELIMITER  . ._Z+       (Special character for command stacking
+
SCREEN FORMAT  . . . ._ZSF +    (Select one of the following:)
+ (3278 Model 5 only)            (DATA - Format based on data width)
+                                (STD  - Always format 24 lines by 80 ch
+                                (MAX  - Always format 27 lines by 132 c
+
)INIT
  .HELP = ISP05100
  .ZVARS = '(ZPADC ZDEL)'
  &ZSF  = TRANS (&ZFMT D,DATA S,STD M,MAX P,PART *,' ')
)PROC
 IF (.RESP = ENTER)
   IF (&ZVERB ^= ' ')
     .MSG = ISPZ002                      /* INVALID COMMAND            *
   ELSE
     IF (&ZCMD ^= ' ')
       .MSG = ISPZ001                    /* INVALID COMMAND            *
 VER (&ZTERM NB LIST 3277,3277A,3278,3278A,3278T,          /* #SPF418 */
                     3278CF,3277KN,3278KN,3290A,ASCII)     /* #SPF418 */
 &ZCHARLM = TRANS(&ZTERM
                  3277  ,  ISP3277
                  3277A ,  ISP3277A
                  3278  ,  ISP3278
                  3278A ,  ISP3278A
                  ASCII ,  ISPX7171                        /* #SPF418 */
                  3290A ,  ISP3278A
                  3278T ,  ISP3278T
                  3278CF,  ISP3278C
                  3277KN,  ISP3277K
                  3278KN,  ISP3278K)

 VER (&ZKEYS NB LIST 12,24)


 VER (&ZPADC NB,MSG=ISPP190)
 IF (&ZDEL = &ZPADC) .MSG = ISPO003
 IF (&ZPADC = LIST A,C,D,E,F,G,H,I,J,K,L,M,O,P,Q,R,S,T,U,V,W,X,Y,Z,
                  0,1,2,3,4,5,6,7,8,9)
   .MSG = ISPP195
 IF (&ZDEL  = LIST A,B,C,D,E,F,G,H,I,J,K,L,M,N,O,P,Q,R,S,T,U,V,W,X,Y,Z,
                  0,1,2,3,4,5,6,7,8,9,'.','=')
   .MSG = ISPP195

 VER (&ZSF,NONBLANK)
 &ZFMT = TRUNC (&ZSF,1)
 VER (&ZFMT,LIST  D,S,M,P)

 VER (&ZDEL NB PICT C)

 IF  (&ZTERM = 3278T)
   VER (&ZFMT LIST S,D,M MSG=ISPO005)
 IF (.MSG ^= ' ')
   .RESP = ENTER
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1995 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
  The following 2 lines were removed from the body to make room for our
  enhancements (we don't have 3290's, so we can do this):
------------------------------------------------------------------------
+ (3290 Only)                    (PART - Format using hardware partition
+                                        Effective the next ISPF invocat
------------------------------------------------------------------------
++PNLENU(ISPOPT1A).
)ATTR
   TYPE(INPUT) INTENS(HIGH) PAD(NULLS)
   TYPE(FP)
)BODY
%------------------------  TERMINAL CHARACTERISTICS  -------------------
COMMAND ===>_ZCMD
+
TERMINAL TYPE  . . . ._ZTERM   +(3277   - 3275/3277 terminal)
+                                (3277A  - 3275/3277 with APL keyboard)
+                                (3278   - 3276/3278/3279/3290 terminal)
+                                (3278A  - 3276/3278/3279 APL keyboard)
+                                (3278T  - 3276/3278/3279 TEXT keyboard)
+                                (3290A  - 3290 with APL keyboard)
+                                (3278CF - 3276/3278 CANADIAN FRENCH ter
+                                (3277KN - 3275/3277 KATAKANA terminal)
+                                (3278KN - 3276/3278 KATAKANA terminal)
+                                (ASCII  - VT100, PC, or other ASCII key
+
NUMBER OF PF KEYS  . ._ZKEYS+   (12 or 24)
+
INPUT FIELD PAD  . . .Z+       (N - Nulls)  B - Blanks)  (Special Char
+                                   must not be the same as COMMAND DELI
COMMAND DELIMITER  . ._Z+       (Special character for command stacking
SCREEN FORMAT  . . . ._ZSF +    (Select one of the following:)
+ (3278 Model 5 only)            (DATA - Format based on data width)
+                                (STD  - Always format 24 lines by 80 ch
+                                (MAX  - Always format 27 lines by 132 c
)INIT
  .HELP = ISP05100
  .ZVARS = '(ZPADC ZDEL)'
  &ZSF  = TRANS (&ZFMT D,DATA S,STD M,MAX P,PART *,' ')
)PROC
 IF (.RESP = ENTER)
   IF (&ZVERB ^= ' ')
     .MSG = ISPZ002                      /* INVALID COMMAND            *
   ELSE
     IF (&ZCMD ^= ' ')
       .MSG = ISPZ001                    /* INVALID COMMAND            *
 VER (&ZTERM NB LIST 3277,3277A,3278,3278A,3278T,          /* #SPF418 */
                     3278CF,3277KN,3278KN,3290A,ASCII)     /* #SPF418 */
 &ZCHARLM = TRANS(&ZTERM
                  3277  ,  ISP3277
                  3277A ,  ISP3277A
                  3278  ,  ISP3278
                  3278A ,  ISP3278A
                  ASCII ,  ISPX7171                        /* #SPF418 */
                  3290A ,  ISP3278A
                  3278T ,  ISP3278T
                  3278CF,  ISP3278C
                  3277KN,  ISP3277K
                  3278KN,  ISP3278K)

 VER (&ZKEYS NB LIST 12,24)

 IF  (&ZTERM = 3278T)
   VER (&ZSF LIST STD,DATA,MAX MSG=ISPO005)

 VER (&ZPADC NB,MSG=ISPP190)
 IF (&ZDEL = &ZPADC) .MSG = ISPO003
 IF (&ZPADC = LIST A,C,D,E,F,G,H,I,J,K,L,M,O,P,Q,R,S,T,U,V,W,X,Y,Z,
                  0,1,2,3,4,5,6,7,8,9)
   .MSG = ISPP195
 IF (&ZDEL  = LIST A,B,C,D,E,F,G,H,I,J,K,L,M,N,O,P,Q,R,S,T,U,V,W,X,Y,Z,
                  0,1,2,3,4,5,6,7,8,9,'.','=')
   .MSG = ISPP195

 VER (&ZSF,NONBLANK)
 &ZFMT = TRUNC (&ZSF,1)
 VER (&ZFMT,LIST  D,S,M,P)

 VER (&ZDEL NB PICT C)

 IF (.MSG ^= ' ')
   .RESP = ENTER
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1995 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
  The following 2 lines were removed from the body to make room for our
  enhancements (we don't have 3290's, so we can do this):
------------------------------------------------------------------------
+ (3290 Only)                    (PART - Format using hardware partition
+                                        Effective the next ISPF invocat
------------------------------------------------------------------------
++PNLENU(ISPOPT3A).
)ATTR

 TYPE(ET)
  ' TYPE(CH)
  ^ TYPE(PIN)
   TYPE(FP)
   TYPE(PT)
   TYPE(NT)
  < TYPE(NEF) PAD(USER) CAPS(ON)
  @ TYPE(NEF) PAD(USER) CAPS(OFF)
   AREA(SCRL) EXTEND(ON)
)BODY
%                        PF Key Definitions and Labels%
Command ===><ZCMD
S1
)AREA S1
Number of PF Keys  . .<Z +                         Terminal type  . .<

PF1 . . .@ZPF13
PF2 . . .@ZPF14
PF3 . . .@ZPF15
PF4 . . .@ZPF16
PF5 . . .@ZPF17
PF6 . . .@ZPF18
PF7 . . .@ZPF19
PF8 . . .@ZPF20
PF9 . . .@ZPF21
PF10  . .@ZPF22
PF11  . .@ZPF23
PF12  . .@ZPF24

PF1  Label  . .@ZPFL13  + PF2  Label  . .@ZPFL14  + PF3  Label  . .@Z
PF4  Label  . .@ZPFL16  + PF5  Label  . .@ZPFL17  + PF6  Label  . .@Z
PF7  Label  . .@ZPFL19  + PF8  Label  . .@ZPFL20  + PF9  Label  . .@Z
PF10 Label  . .@ZPFL22  + PF11 Label  . .@ZPFL23  + PF12 Label  . .@Z

^Press
ENTER^key to save changes.  Enter
END^command to save changes and exit.
)INIT
  .ZVARS = '(ZKEYS)'
  .HELP = ISP05300
  .CURSOR = ZCMD
)PROC
 IF (.RESP = ENTER)
   IF (&ZVERB ^= ' ')
     .MSG = ISPZ002
   ELSE
     IF (&ZCMD ^= ' ')
       .MSG = ISPZ001
 VER (&ZKEYS NB LIST 12,24 MSG=ISPO004)

 VER (&ZTERM NB LIST 3277,3277A,3278,3278A,3278T,3278CF,3277KN,3278KN,32
                     ASCII                                 /* #SPF418 */
         MSG=ISPO004)

 &ZCHARLM = TRANS(&ZTERM
                  3277  ,  ISP3277
                  3277A ,  ISP3277A
                  3278  ,  ISP3278
                  3278A ,  ISP3278A
                  ASCII ,  ISPX7171                        /* #SPF418 */
                  3290A ,  ISP3278A
                  3278T ,  ISP3278T
                  3278CF,  ISP3278C
                  3277KN,  ISP3277K
                  3278KN,  ISP3278K)

 IF (&ZPF13 = ' ')
   &ZPF13 = HELP
 IF (&ZPF14 = ' ')
   &ZPF14 = SPLIT
 IF (&ZPF15 = ' ')
   &ZPF15 = END
 IF (&ZPF16 = ' ')
   &ZPF16 = RETURN
 IF (&ZPF17 = ' ')
   &ZPF17 = RFIND
 IF (&ZPF18 = ' ')
   &ZPF18 = RCHANGE
 IF (&ZPF19 = ' ')
   &ZPF19 = UP
 IF (&ZPF20 = ' ')
   &ZPF20 = DOWN
 IF (&ZPF21 = ' ')
   &ZPF21 = SWAP
 IF (&ZPF22 = ' ')
   &ZPF22 = LEFT
 IF (&ZPF23 = ' ')
   &ZPF23 = RIGHT
 IF (&ZPF24 = ' ')
   &ZPF24 = RETRIEVE
 VPUT ( ZPF13 ZPF14 ZPF15 ZPF16 ZPF17 ZPF18 ) PROFILE
 VPUT ( ZPF19 ZPF20 ZPF21 ZPF22 ZPF23 ZPF24 ) PROFILE
 VPUT ( ZPFL13 ZPFL14 ZPFL15 ZPFL16 ZPFL17 ZPFL18 ) PROFILE
 VPUT ( ZPFL19 ZPFL20 ZPFL21 ZPFL22 ZPFL23 ZPFL24 ZKEYS) PROFILE
 IF (.MSG ^= ' ')
   .RESP = ENTER
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1995 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISPOPT3B).
)ATTR

 TYPE(ET)
  ^ TYPE(PIN)
  ' TYPE(CH)
   TYPE(FP)
   TYPE(PT)
   TYPE(NT)
  < TYPE(NEF) PAD(USER) CAPS(ON)
  @ TYPE(NEF) PAD(USER) CAPS(OFF)
   AREA(SCRL) EXTEND(ON)
)BODY
%                PF Key Definitions and Labels - Primary Keys%
Command ===><ZCMD
S1
)AREA S1
Number of PF Keys  . .<Z +                         Terminal type  . .<

PF13  . .@ZPF13
PF14  . .@ZPF14
PF15  . .@ZPF15
PF16  . .@ZPF16
PF17  . .@ZPF17
PF18  . .@ZPF18
PF19  . .@ZPF19
PF20  . .@ZPF20
PF21  . .@ZPF21
PF22  . .@ZPF22
PF23  . .@ZPF23
PF24  . .@ZPF24

PF13 Label  . .@ZPFL13  + PF14 Label  . .@ZPFL14  + PF15 Label  . .@Z
PF16 Label  . .@ZPFL16  + PF17 Label  . .@ZPFL17  + PF18 Label  . .@Z
PF19 Label  . .@ZPFL19  + PF20 Label  . .@ZPFL20  + PF21 Label  . .@Z
PF22 Label  . .@ZPFL22  + PF23 Label  . .@ZPFL23  + PF24 Label  . .@Z

^Press
ENTER^key to display alternate keys.  Enter
END^command to exit.
)INIT
  .ZVARS = '(ZKEYS)'
  .HELP = ISP05300
  .CURSOR = ZCMD
)PROC
 IF (.RESP = ENTER)
   IF (&ZVERB ^= ' ')
     .MSG = ISPZ002
   ELSE
     IF (&ZCMD ^= ' ')
       .MSG = ISPZ001
 VER (&ZKEYS NB LIST 12,24 MSG=ISPO004)

 VER (&ZTERM NB LIST 3277,3277A,3278,3278A,3278T,3278CF,3277KN,3278KN,32
                     ASCII                                 /* #SPF418 */
         MSG=ISPO004)

 &ZCHARLM = TRANS(&ZTERM
                  3277  ,  ISP3277
                  3277A ,  ISP3277A
                  3278  ,  ISP3278
                  3278A ,  ISP3278A
                  ASCII ,  ISPX7171                        /* #SPF418 */
                  3290A ,  ISP3278A
                  3278T ,  ISP3278T
                  3278CF,  ISP3278C
                  3277KN,  ISP3277K
                  3278KN,  ISP3278K)

 IF (&ZPF13 = ' ')
   &ZPF13 = HELP
 IF (&ZPF14 = ' ')
   &ZPF14 = SPLIT
 IF (&ZPF15 = ' ')
   &ZPF15 = END
 IF (&ZPF16 = ' ')
   &ZPF16 = RETURN
 IF (&ZPF17 = ' ')
   &ZPF17 = RFIND
 IF (&ZPF18 = ' ')
   &ZPF18 = RCHANGE
 IF (&ZPF19 = ' ')
   &ZPF19 = UP
 IF (&ZPF20 = ' ')
   &ZPF20 = DOWN
 IF (&ZPF21 = ' ')
   &ZPF21 = SWAP
 IF (&ZPF22 = ' ')
   &ZPF22 = LEFT
 IF (&ZPF23 = ' ')
   &ZPF23 = RIGHT
 IF (&ZPF24 = ' ')
   &ZPF24 = RETRIEVE
 VPUT ( ZPF13 ZPF14 ZPF15 ZPF16 ZPF17 ZPF18 ) PROFILE
 VPUT ( ZPF19 ZPF20 ZPF21 ZPF22 ZPF23 ZPF24 ) PROFILE
 VPUT ( ZPFL13 ZPFL14 ZPFL15 ZPFL16 ZPFL17 ZPFL18 ) PROFILE
 VPUT ( ZPFL19 ZPFL20 ZPFL21 ZPFL22 ZPFL23 ZPFL24 ZKEYS) PROFILE
 IF (.MSG ^= ' ')
   .RESP = ENTER
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1995 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISPOPT3D).
)ATTR

 TYPE(ET)
  ^ TYPE(PIN)
  ' TYPE(CH)
   TYPE(FP)
   TYPE(PT)
   TYPE(NT)
  < TYPE(NEF) PAD(USER) CAPS(ON)
  @ TYPE(NEF) PAD(USER) CAPS(OFF)
   AREA(SCRL) EXTEND(ON)
)BODY
%                        PF Key Definitions and Labels%
Command ===><ZCMD
S1
)AREA S1
Number of PF Keys  . .<Z +                         Terminal type  . .<

PF1 . . .@ZPF01
PF2 . . .@ZPF02
PF3 . . .@ZPF03
PF4 . . .@ZPF04
PF5 . . .@ZPF05
PF6 . . .@ZPF06
PF7 . . .@ZPF07
PF8 . . .@ZPF08
PF9 . . .@ZPF09
PF10  . .@ZPF10
PF11  . .@ZPF11
PF12  . .@ZPF12

PF1  Label  . .@ZPFL01  + PF2  Label  . .@ZPFL02  + PF3  Label  . .@Z
PF4  Label  . .@ZPFL04  + PF5  Label  . .@ZPFL05  + PF6  Label  . .@Z
PF7  Label  . .@ZPFL07  + PF8  Label  . .@ZPFL08  + PF9  Label  . .@Z
PF10 Label  . .@ZPFL10  + PF11 Label  . .@ZPFL11  + PF12 Label  . .@Z

^Press
ENTER^key to save changes.  Enter
END^command to save changes and exit.
)INIT
  .ZVARS = '(ZKEYS)'
  .HELP = ISP05300
  .CURSOR = ZCMD
)PROC
 IF (.RESP = ENTER)
   IF (&ZVERB ^= ' ')
     .MSG = ISPZ002
   ELSE
     IF (&ZCMD ^= ' ')
       .MSG = ISPZ001
 VER (&ZKEYS NB LIST 12,24 MSG=ISPO004)

 VER (&ZTERM NB LIST 3277,3277A,3278,3278A,3278T,3278CF,3277KN,3278KN,32
                     ASCII                                 /* #SPF418 */
         MSG=ISPO004)

 &ZCHARLM = TRANS(&ZTERM
                  3277  ,  ISP3277
                  3277A ,  ISP3277A
                  3278  ,  ISP3278
                  3278A ,  ISP3278A
                  ASCII ,  ISPX7171                        /* #SPF418 */
                  3290A ,  ISP3278A
                  3278T ,  ISP3278T
                  3278CF,  ISP3278C
                  3277KN,  ISP3277K
                  3278KN,  ISP3278K)

 IF (&ZPF01 = ' ')
   &ZPF01 = HELP
 IF (&ZPF02 = ' ')
   &ZPF02 = SPLIT
 IF (&ZPF03 = ' ')
   &ZPF03 = END
 IF (&ZPF04 = ' ')
   &ZPF04 = RETURN
 IF (&ZPF05 = ' ')
   &ZPF05 = RFIND
 IF (&ZPF06 = ' ')
   &ZPF06 = RCHANGE
 IF (&ZPF07 = ' ')
   &ZPF07 = UP
 IF (&ZPF08 = ' ')
   &ZPF08 = DOWN
 IF (&ZPF09 = ' ')
   &ZPF09 = SWAP
 IF (&ZPF10 = ' ')
   &ZPF10 = LEFT
 IF (&ZPF11 = ' ')
   &ZPF11 = RIGHT
 IF (&ZPF12 = ' ')
   &ZPF12 = RETRIEVE
 VPUT ( ZPF01 ZPF02 ZPF03 ZPF04 ZPF05 ZPF06 ) PROFILE
 VPUT ( ZPF07 ZPF08 ZPF09 ZPF10 ZPF11 ZPF12 ) PROFILE
 VPUT ( ZPFL01 ZPFL02 ZPFL03 ZPFL04 ZPFL05 ZPFL06 ) PROFILE
 VPUT ( ZPFL07 ZPFL08 ZPFL09 ZPFL10 ZPFL11 ZPFL12 ZKEYS) PROFILE
 IF (.MSG ^= ' ')
   .RESP = ENTER
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1995 */
                     ASCII                                 /* #SPF418 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISPOPT3E).
)ATTR

 TYPE(ET)
  ^ TYPE(PIN)
  ' TYPE(CH)
   TYPE(FP)
   TYPE(PT)
   TYPE(NT)
  < TYPE(NEF) PAD(USER) CAPS(ON)
  @ TYPE(NEF) PAD(USER) CAPS(OFF)
   AREA(SCRL) EXTEND(ON)
)BODY
%                PF Key Definitions and Labels - Primary Keys%
Command ===><ZCMD
S1
)AREA S1
Number of PF Keys  . .<Z +                         Terminal type  . .<

PF1 . . .@ZPF01
PF2 . . .@ZPF02
PF3 . . .@ZPF03
PF4 . . .@ZPF04
PF5 . . .@ZPF05
PF6 . . .@ZPF06
PF7 . . .@ZPF07
PF8 . . .@ZPF08
PF9 . . .@ZPF09
PF10  . .@ZPF10
PF11  . .@ZPF11
PF12  . .@ZPF12

PF1  Label  . .@ZPFL01  + PF2  Label  . .@ZPFL02  + PF3  Label  . .@Z
PF4  Label  . .@ZPFL04  + PF5  Label  . .@ZPFL05  + PF6  Label  . .@Z
PF7  Label  . .@ZPFL07  + PF8  Label  . .@ZPFL08  + PF9  Label  . .@Z
PF10 Label  . .@ZPFL10  + PF11 Label  . .@ZPFL11  + PF12 Label  . .@Z

^Press
ENTER^key to display alternate keys.  Enter
END^command to exit.
)INIT
  .ZVARS = '(ZKEYS)'
  .HELP = ISP05300
  .CURSOR = ZCMD
)PROC
 IF (.RESP = ENTER)
   IF (&ZVERB ^= ' ')
     .MSG = ISPZ002
   ELSE
     IF (&ZCMD ^= ' ')
       .MSG = ISPZ001
 VER (&ZKEYS NB LIST 12,24 MSG=ISPO004)

 VER (&ZTERM NB LIST 3277,3277A,3278,3278A,3278T,3278CF,3277KN,3278KN,32
                     ASCII                                 /* #SPF418 */
         MSG=ISPO004)

 &ZCHARLM = TRANS(&ZTERM
                  3277  ,  ISP3277
                  3277A ,  ISP3277A
                  3278  ,  ISP3278
                  3278A ,  ISP3278A
                  ASCII ,  ISPX7171                        /* #SPF418 */
                  3290A ,  ISP3278A
                  3278T ,  ISP3278T
                  3278CF,  ISP3278C
                  3277KN,  ISP3277K
                  3278KN,  ISP3278K)

 IF (&ZPF01 = ' ')
   &ZPF01 = HELP
 IF (&ZPF02 = ' ')
   &ZPF02 = SPLIT
 IF (&ZPF03 = ' ')
   &ZPF03 = END
 IF (&ZPF04 = ' ')
   &ZPF04 = RETURN
 IF (&ZPF05 = ' ')
   &ZPF05 = RFIND
 IF (&ZPF06 = ' ')
   &ZPF06 = RCHANGE
 IF (&ZPF07 = ' ')
   &ZPF07 = UP
 IF (&ZPF08 = ' ')
   &ZPF08 = DOWN
 IF (&ZPF09 = ' ')
   &ZPF09 = SWAP
 IF (&ZPF10 = ' ')
   &ZPF10 = LEFT
 IF (&ZPF11 = ' ')
   &ZPF11 = RIGHT
 IF (&ZPF12 = ' ')
   &ZPF12 = RETRIEVE
 VPUT ( ZPF01 ZPF02 ZPF03 ZPF04 ZPF05 ZPF06 ) PROFILE
 VPUT ( ZPF07 ZPF08 ZPF09 ZPF10 ZPF11 ZPF12 ) PROFILE
 VPUT ( ZPFL01 ZPFL02 ZPFL03 ZPFL04 ZPFL05 ZPFL06 ) PROFILE
 VPUT ( ZPFL07 ZPFL08 ZPFL09 ZPFL10 ZPFL11 ZPFL12 ZKEYS) PROFILE
 IF (.MSG ^= ' ')
   .RESP = ENTER
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1995 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISPO901H).
)PANEL KEYLIST(ISRHLP2,ISR)
)ATTR DEFAULT() FORMAT(MIX)
 05 TYPE(PT)
 0A TYPE(NT)
 21 TYPE(SI)
 26 AREA(SCRL)
)BODY WINDOW(60,16) CMD()
                 	Help for Terminal Type                 
SAREA38                                                   
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
                                                          
)AREA SAREA38
Enter one of the following values depending on the type of
terminal you are using or the type of terminal your      
emulator is emulating:                                   

Type      Description                                    
1. 3277   (for a 3275 or 3277 terminal)                  
2. 3277A  (for a 3275 or 3277 terminal with an APL       
         keyboard)                                      
3. 3278   (for a 3276, 3278, 3279, or 3290 terminal)     
4. 3278A  (for a 3276, 3278, or 3279 terminal with APL   
         keyboard)                                      
5. 3290A  (for a 3290 with APL keyboard)                 
6. 3278T  (for a 3276, 3278, or 3279 terminal with TEXT  
         keyboard)                                      
7. 3278CF (for a 3276, 3278, or 3279 terminal with       
         Canadian French keyboard)                      
8. 3277KN (for a 3275 or 3277 terminal with Katakana     
         keyboard)                                      
9. 3278KN (for a 3276, 3278, or 3279 terminal with       
         Katakana keyboard)                             
A. ASCII  (for a VT100, PC, or other ASCII keyboard)     
)INIT
.HHELP = ISP00006
)PROC
)END
/* 5655-042 (C) COPYRIGHT IBM CORP 1994, 1995 */
/* ISPDTLC Release: 4.2.  Maintenance level: PID                      */
/* Panel created - Date: 10 May 1995, Time: 11:37:17                  */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISP05110).
)PANEL KEYLIST (ISRHELP ISR)
)ATTR
   % TYPE(ET)
   _ TYPE(NEF) PAD(USER) CAPS(ON)
   + TYPE(NT)
)BODY
%TUTORIAL ---------------------- TERMINAL TYPE ------------------------
%Command ===>_ZCMD
+
+  Specify:           For these terminals:
%   3277+              3275/3277
%   3277A+             3275/3277 with APL keyboard
%   3278+              3178/3179/3180/3191/3192/3193/3276/3278/3279/3290
%   3278A+             3276/3278/3279 APL keyboard
%   3278T+             3276/3278/3279 TEXT keyboard
%   3290A+             3290 with APL keyboard
%   3278CF+            3276/3278 CANADIAN FRENCH
%   3277KN+            3275/3277 KATAKANA
%   3278KN+            3276/3278 KATAKANA
%   ASCII+             VT100, PC or other ASCII keyboard
+  The valid terminal types that you can enter are listed above.  Some o
+  these terminal types might not apply to your installation.

+  To assure correct operation of ISPF, the terminal type must be correc
+  The terminal type determines the character set for your terminal.  IS
+  automatically determines the terminal type during ISPF initialization
+  sets it to the appropriate value.  The terminal type appears on the p
+  option panel and the ISPF parameter options panel for reference.  It
+  appears (and can be modified) on the F key definition panel.
)END
 /* 5655-042 (C) COPYRIGHT IBM CORP 1980, 1994 */
Usermods:
#SPF418 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++PNLENU(ISP05300).
)PANEL KEYLIST(ISRHLP2,ISR)
)ATTR DEFAULT() FORMAT(MIX)
 05 TYPE(PT)
 0A TYPE(NT)
 10 TYPE(ET)
 21 TYPE(SI)
 26 AREA(SCRL) EXTEND(ON)
)BODY WINDOW(74,18) CMD()
                    	PF Key Definitions and Labels
SAREA38















)AREA SAREA38
Use thePF Key Definitions and Labelspanel to assign PF keys to ISPF
commands.  The user can assign PF keys to system commands (such as HELP
or END), function commands (such as edit FIND and CHANGE), and line
commands (such as edit "I" and "D").

In support of the PFSHOW system command, the PF Key Definitions and
Labels panel also allows the user to optionally assign labels to the
function key definitions.  A label is used for display in place of its
corresponding PF key definition when the user issues the PFSHOW command

The PF Key Definitions and Labels panel displays when you select the
"Global PF keys settings" pulldown from Settings or when you enter the
KEYS command.

Prior to changing the function key definitions or labels, verify the
terminal type and its number of F keys (12 or 24).  The terminal type
must be set to either 3277, 3278, 3277A, 3278A, 3290A, 3278T, 3278CF,
 3277KN, 3278KN, or ASCII.  For a 3275 terminal, select 3277.  For 3279
 and 3290 terminals, select 3278.

For terminals with12 function keys,ISPF displays one PF Key
Definitions and Labels panel.  When you press the ENTER key, ISPF
processes any changes made to the display, causing the panel to display
again.  When you enter the END command, ISPF processes any changes and
ends the function.

For terminals with24 function keys,ISPF displays two PF Key
Definitions and Labels panels.  The first panel allows the user to
specify theprimarykeys (based on primary key setting).  When you pres
ENTER, ISPF processes any specified changes and displays the second
panel.  The user can specifyalternatekeys on the second panel.  By
continually pressing the ENTER key, the user can alternate between the
two panels.  From either panel, the END command process the changes and
then end the function.

You can define theprimaryandalternatekeys to be theupper(F13-24)
orlower(F1-12) keys.  This setting controls which keys will display i
the function key area when either primary or alternate is selected as
the display set.  On terminals with 12 keys, the primary keys will
always display and the numbers 1-12 will appear in the function key
area.  The keys assigned to them are determined by the definition of
primary keys.  When the definition of primary keys is set to upper (the
default), the values assigned to F13-24 display.  When the definition o
primary keys is set to lower, the values assigned to F1-12 display.  On
terminals with 24 keys, the numbers displayed will always match the
values assigned to the keys.  (For example, F1 will always have the
values assigned to F1 in the key definition.)

If the primary keys are defined with the default (upper) and a user
changes from a terminal with 12 F keys to a terminal with 24 keys, or
vice-versa, the primary F key definitions remain intact.  In other
words, the keypad keys on a 24-key terminal (F13 to F24) equate to F1 t
F12 on a 12-key terminal.  Again, the user should verify (or change) th
number of F keys and primary key definitions before changing the F key
definitions and labels .

When defining the function keys, a user can prefix a command with a
colon (:) .  The colon indicates a line command.  Line commands are
entered in the first input field on the line where the cursor is
positioned when the function key is pressed.  (The colon is stripped of
before processing.)

The absence of a colon causes the command to be entered in the
command/option field, regardless of where the cursor is positioned when
the key is pressed.  For compatibility with previous releases of ISPF,
greater-than sign (>) can precede a command, regardless of whether that
command appears in the command tables.  This causes the command to pass
to the dialog, unaltered, in the command/option field, so that the
dialog can take appropriate action.  For a command that is not an ISPF
system command, the greater-than sign is not required.  ISPF returns th
command to the dialog automatically.

From a PF Key Definitions and Labels panel a user can restore the
default definition for any F key simply by blanking out the field.  ISP
refills the field with the default.  To disable an F key, the user can
simply assign the value NOP to it.

Below are some examples of valid F key assignments:

       PF1 . . . HELP
       PF2 . . . TSO listcat;tso st
       PF3 . . . :ts
       PF4 . . . :tf 60
       PF5 . . . CHG ALL ABC XYZ;chg all aaa zzz

       PF1 is set to the ISPF HELP command.
       PF2 is set to two TSO commands, LISTCAT followed by STATUS.
       PF3 is set to the ISPF edit TS line command.
       PF4 is set to the ISPF edit TF line command.
       PF5 is set to two ISPF edit CHANGE commands.

The following example illustrates the association that exists between
function key definitions and their labels on a PF Key Definitions and
Labels panel:

  PF1 . . . HELP
        .
        .
        .
  PF10  . . LEFT
  PF11  . . change all city town
  PF12  . . RETRIEVE

  PF1  LABEL  . .         PF2  LABEL  . .         PF3  LABEL  . .
  PF4  LABEL  . . finish  PF5  LABEL  . .         PF6  LABEL  . .
  PF7  LABEL  . .         PF8  LABEL  . .         PF9  LABEL  . . begin
  PF10 LABEL  . .         PF11 LABEL  . . chgall  PF12 LABEL  . .

If the user issues the PFSHOW command, the label values of"finish",
"begin",and"chgall"will display for F4, F9, and F11 respectively.
Because the function key definitions for F1, F10, and F12 are not
assigned labels, definitions of"HELP", "LEFT",and"RETRIEVE"will be
used instead.
)INIT
.HHELP = ISP00006
&ZWINTTL = 'ISPF Settings'
)PROC
)END
/* 5655-042 (C) COPYRIGHT IBM CORP 1995 */
/* ISPDTLC Release: 4.2.  Maintenance level: PID                      */
/* Panel created - Date: 10 May 1995, Time: 11:48:03                  */
Usermods:
BRACKET3 - SEB1525 - Support for ASCII terminal type (ISPX7171) added.
++MSGENU(ISPO00).
ISPO001  'Selection panel error   '  .TYPE=WARNING
'"&P5." is invalid parameter for program ISPOPT on panel "&P6".'
ISPO002  'Inconsistent parameters '  .TYPE=WARNING
'24 function keys are valid only for 3278, 3278CF, 3278KN, 3290 and ASCI
'terminal types.'
ISPO003  'Invalid pad character   '  .TYPE=WARNING
'Input field pad character and command delimiter may not be the same.'
ISPO004  'Invalid value           '  .TYPE=WARNING
'Press Help for tutorial page giving valid options.'
ISPO005  'Inconsistent parameters '  .TYPE=WARNING
'Part may not be specified with 3278T.'
ISPO006  'Display format invalid  '                 .TYPE=WARNING
'Display format must be NO, SHORT, or LONG.'
ISPO007  'F key value required    '                 .TYPE=WARNING
'A function key must be assigned a value in order to have a display ' +
'format.'
ISPO008  'F key value required    '                 .TYPE=WARNING
'A function key must be assigned a value in order to have a label.'
ISPO009  'Invalid selection       '                 .TYPE=WARNING
'Enter a keylist name or select an existing keylist.'
/* 5655-042 (C) Copyright International Business Machines Corp., 1994 */
./ ENDUP
?!
//EXEC     EXEC MDLOAD,BS='6160',TRK1='5',TRK2='1',TO='EXEC'
//SYSIN    DD   DATA,DLM='?!'
./ ADD NAME=BRACKETS
/* REXX.  Use this in conjunction with ISPF "ASCII" terminal table on
          a non-extended-attributes terminal. */
trace off
signal on failure
address TSO
arg junk
if junk = "OFF" then do
 address TSO "TERM NOCHAR"
end
else if junk = "3179" then do
 address TSO,
 "TERM CHAR((X'BA' X'AD') (X'BB' X'BD') (X'AD' X'BA') (X'BD' X'BB'))"
end
else if junk \= "" then do
 say "Invalid value" junk
end
else do
 address TSO,
 "TERM CHAR((X'41' X'AD') (X'42' X'BD') (X'AD' X'41') (X'BD' X'42'))"
end
exit
./ ENDUP
?!
//HELP     EXEC MDLOAD,BS='6160',TRK1='5',TRK2='1',TO='HELP'
//SYSIN    DD   DATA,DLM='?!'
./ ADD NAME=BRACKETS
)F Function -

   The BRACKETS exec changes the terminal character translation of your
   TSO session to display square brackets properly on a 3278 terminal.
   Note that this works properly ONLY on such a terminal.  Do not use
   this on any other type of terminal.

   Use this exec under ISPF when you are on a 3278 terminal and you
   have set your terminal type (option 0.1) to ASCII in order to edit
   and browse square brackets.  If you set your terminal type to ASCII
   without using this exec, you will see odd-looking characters in
   bracket positions.  The character translation effected by the
   BRACKETS exec allows you to see actual brackets.

   From any ISPF command line, type:  TSO %BRACKETS

   Note:  If you execute BRACKETS from READY mode and then enter ISPF,
   ISPF will turn off character translation, and you will have to
   re-execute BRACKETS.

)X Syntax -

   %BRACKETS  {OFF}

    Required: none

    Defaults: no operand

)O Operands -

)P          - BRACKETS with no operand turns translation on.
              BRACKETS OFF turns translation off.
              BRACKETS 3179 turns translation on for a 3179 terminal,
                but this does not have the desired effect under ISPF.

./ ENDUP
?!
