         TITLE 'HMASMLC1 **PROCESS NOAPPLY/NOACCEPT REQUESTS**'
HMASMLC1 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'HMASMLC1  78.334'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         ST    @13,@SA00001+4                                      0001
         LA    @14,@SA00001                                        0001
         ST    @14,8(,@13)                                         0001
         LR    @13,@14                                             0001
         MVC   @PC00001(8),0(@01)                                  0001
         EJECT
*                                                                  0132
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE CORRECT DATASET TO CHECK BASED ON NOAPPLY OR        */
*   /* NOACCEPT AND THEN CALL CORRECT PROCEDURE BASED ON MASS OR     */
*   /* SELECT MODE. SAVE RETURN CODE.                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0132
*   LC1RTNCD=ZERO;                  /*                               */
         SLR   LC1RTNCD,LC1RTNCD                                   0132
*   IOPPTR=ADDR(LC1IOP);            /*                               */
         L     IOPPTR,@PC00001+4                                   0133
*   RFY                                                            0134
*     HMASMIOP BASED(IOPPTR);       /*                               */
*   IF IOPRETRN^=IOPEOF             /* IF NOT CALL AT END OF FILE    */
*     THEN                          /*                               */
         CLI   IOPRETRN(IOPPTR),4                                  0135
         BE    @RF00135                                            0135
*     DO;                           /*                               */
*       IF LISTNOAP=ON              /* IF NOAPPLY CHECK              */
*         THEN                      /*                               */
         L     @10,@PC00001                                        0137
         TM    LISTNOAP(@10),B'01000000'                           0137
         BNO   @RF00137                                            0137
*         DO;                       /*                               */
*           RFY                                                    0139
*             RTNCODE RSTD;         /*                               */
*           IF LISTSEL=OFF          /* IF SELECT CALL SELECT RTN     */
*             THEN                  /*                               */
         TM    LISTSEL(@10),B'10000000'                            0140
         BNZ   @RF00140                                            0140
*             CALL LC1MASS(NOAPIOP,IOPCDS);/*                        */
         LA    @01,@AL00141                                        0141
         BAL   @14,LC1MASS                                         0141
*           ELSE                    /*                               */
*             CALL LC1SEL(NOAPIOP,IOPCDS);/* ELSE MUST BE MASS       */
         B     @RC00140                                            0142
@RF00140 LA    @01,@AL00142                                        0142
         BAL   @14,LC1SEL                                          0142
*           LC1RTNCD=MAX(LC1RTNCD,RTNCODE);/* SAVE RETURN CODE       */
@RC00140 CR    LC1RTNCD,RTNCODE                                    0143
         BNL   *+6
         LR    LC1RTNCD,RTNCODE                                    0143
*           RFY                                                    0144
*             RTNCODE UNRSTD;       /*                               */
*         END;                      /* CORRECT IOP AND DATASET       */
*       IF LISTNOAC=ON              /* IF NOACCEPT REQUEST           */
*         THEN                      /*                               */
@RF00137 L     @10,@PC00001                                        0146
         TM    LISTNOAC(@10),B'00100000'                           0146
         BNO   @RF00146                                            0146
*         DO;                       /*                               */
*           RFY                                                    0148
*             RTNCODE RSTD;         /*                               */
*           IF LISTSEL=OFF          /* IF SELECT CALL SELECT RTN     */
*             THEN                  /*                               */
         TM    LISTSEL(@10),B'10000000'                            0149
         BNZ   @RF00149                                            0149
*             CALL LC1MASS(NOACIOP,IOPACDS);/*                       */
         LA    @01,@AL00150                                        0150
         BAL   @14,LC1MASS                                         0150
*           ELSE                    /*                               */
*             CALL LC1SEL(NOACIOP,IOPACDS);/* ELSE MUST BE MASS      */
         B     @RC00149                                            0151
@RF00149 LA    @01,@AL00151                                        0151
         BAL   @14,LC1SEL                                          0151
*           LC1RTNCD=MAX(LC1RTNCD,RTNCODE);/* SAVE RETURN CODE       */
@RC00149 CR    LC1RTNCD,RTNCODE                                    0152
         BNL   *+6
         LR    LC1RTNCD,RTNCODE                                    0152
*           RFY                                                    0153
*             RTNCODE UNRSTD;       /*                               */
*         END;                      /* CORRECT IOP AND DATASET       */
*     END;                          /* END NOT EOF CALL              */
*   ELSE                            /* IF CALL AT EOF                */
*     DO;                           /* THEN REINIT BUFFER AREAS      */
         B     @RC00135                                            0156
@RF00135 DS    0H                                                  0157
*       NOAPIOP=''B;                /*                               */
         XC    NOAPIOP(80),NOAPIOP                                 0157
*       NOACIOP=''B;                /*                               */
         XC    NOACIOP(80),NOACIOP                                 0158
*     END;                          /*                               */
*   RETURN CODE(LC1RTNCD);          /*                               */
@RC00135 LR    @15,LC1RTNCD                                        0160
         L     @13,4(,@13)                                         0160
         L     @14,12(,@13)                                        0160
         LM    @00,@12,20(@13)                                     0160
         BR    @14                                                 0160
         EJECT
*                                                                  0161
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE WILL PROCESS SELECT MODE REQUESTS                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0161
*LC1SEL:                                                           0161
*   PROCEDURE(SELIOP,SELID);        /*                               */
LC1SEL   STM   @14,@12,@SA00002                                    0161
         MVC   @PC00002(8),0(@01)                                  0161
*   DECLARE                                                        0162
*     SELIOP CHAR(*),               /* IOP TO USE                    */
*     SELID FIXED(8);               /* IOPDSID TO USE                */
*   DECLARE                                                        0163
*     LC1SELRC FIXED(8);            /*                               */
*   DECLARE                                                        0164
*     IOPPTR1 PTR(31);              /* SELECT MODE IOP               */
*   RFY                                                            0165
*     HMASMIOP BASED(IOPPTR1);      /*                               */
*   LC1SELRC=ZERO;                  /* PASSED IOP                    */
         SLR   LC1SELRC,LC1SELRC                                   0166
*   IOPPTR1=ADDR(SELIOP);           /* SETUP THE POINTER FOR THE     */
         L     IOPPTR1,@PC00002                                    0167
*   IOPNAME=IOPPTR->IOPNAME;        /* SETUP THE IOP WITH THE        */
         MVC   IOPNAME(8,IOPPTR1),IOPNAME(IOPPTR)                  0168
*   IOPTYPE=IOPPTR->IOPTYPE;        /* NAME AND TYPE TO BE           */
         MVC   IOPTYPE(1,IOPPTR1),IOPTYPE(IOPPTR)                  0169
*   IOPDSID=SELID;                  /* PROCESSED                     */
         L     @10,@PC00002+4                                      0170
         MVC   IOPDSID(1,IOPPTR1),SELID(@10)                       0170
*   IOPFUNCT=IOPBLDL;               /*                               */
         MVI   IOPFUNCT(IOPPTR1),X'04'                             0171
*   CALL HMASMIO(HMASMIOP);         /*                               */
         ST    IOPPTR1,@AL00001                                    0172
         L     @15,@CV01270                                        0172
         LA    @01,@AL00001                                        0172
         BALR  @14,@15                                             0172
*   IF IOPRETRN=IOPGOOD             /* IF FOUND                      */
*     THEN                          /*                               */
         CLI   IOPRETRN(IOPPTR1),0                                 0173
         BNE   @RF00173                                            0173
*     DO;                           /*                               */
*       IF IOPERROR=OFF             /* AND NOT IN ERROR              */
*         THEN                      /*                               */
         TM    IOPERROR(IOPPTR1),B'00010000'                       0175
         BNZ   @RF00175                                            0175
*         LC1SELRC=FOUR;            /* THEN SYSMOD NOT ELIGIBLE      */
         LA    LC1SELRC,4                                          0176
*     END;                          /*                               */
*   ELSE                            /*                               */
*     IF IOPRETRN>IOPNTFND          /* IF ERROR IN LOCATE            */
*       THEN                        /*                               */
         B     @RC00173                                            0178
@RF00173 CLI   IOPRETRN(IOPPTR1),4                                 0178
         BNH   @RF00178                                            0178
*       LC1SELRC=IOPRETRN;          /* PASS ALONG BAD RC             */
         SLR   LC1SELRC,LC1SELRC                                   0179
         IC    LC1SELRC,IOPRETRN(,IOPPTR1)                         0179
*   RETURN CODE(LC1SELRC);          /*                               */
@RF00178 DS    0H                                                  0180
@RC00173 LR    @15,LC1SELRC                                        0180
         L     @14,@SA00002                                        0180
         LM    @00,@12,@SA00002+8                                  0180
         BR    @14                                                 0180
*   END LC1SEL;                     /*                               */
         EJECT
*                                                                  0182
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE WILL PROCESS MASS MODE REQUESTS                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0182
*LC1MASS:                                                          0182
*   PROCEDURE(MASIOP,MASID);        /*                               */
LC1MASS  STM   @14,@12,@SA00003                                    0182
         MVC   @PC00003(8),0(@01)                                  0182
*   DECLARE                                                        0183
*     MASIOP CHAR(*),               /* IOP TO USE                    */
*     MASID FIXED(8);               /* IOPDSID TO USE                */
*   DECLARE                                                        0184
*     LC1MASRC FIXED(8);            /*                               */
*   DECLARE                                                        0185
*     IOPPTR2 PTR(31);              /* MASS MODE IOP                 */
*   RFY                                                            0186
*     HMASMIOP BASED(IOPPTR2);      /*                               */
*   LC1MASRC=ZERO;                  /* PASSED IOP                    */
         SLR   LC1MASRC,LC1MASRC                                   0187
*   IOPPTR2=ADDR(MASIOP);           /* SETUP THE POINTER FOR THE     */
         L     IOPPTR2,@PC00003                                    0188
*   IOPDSID=MASID;                  /* SETUP THE DATASET ID IN       */
         L     @10,@PC00003+4                                      0189
         MVC   IOPDSID(1,IOPPTR2),MASID(@10)                       0189
*   IOPFUNCT=IOPGETN;               /* THE IOP FOR GETNEXT           */
*                                                                  0190
         MVI   IOPFUNCT(IOPPTR2),X'0A'                             0190
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP READING THRU DATASET UNTIL MATCH FOUND FOR PASSED NAME OR*/
*   /* READ PAST SYSMOD                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0191
*   DO WHILE IOPRETRN=IOPGOOD       /* READ TILL ERR OR EOF          */
*         &IOPINAME<IOPPTR->IOPINAME;/* OR SYSMOD FOUND OR PASSED    */
         B     @DE00191                                            0191
@DL00191 DS    0H                                                  0192
*     CALL HMASMIO(HMASMIOP);       /* GET NEXT DATASET ENTRY        */
         ST    IOPPTR2,@AL00001                                    0192
         L     @15,@CV01270                                        0192
         LA    @01,@AL00001                                        0192
         BALR  @14,@15                                             0192
*   END;                            /*                               */
*                                                                  0193
@DE00191 CLI   IOPRETRN(IOPPTR2),0                                 0193
         BNE   @DC00191                                            0193
         CLC   IOPINAME(8,IOPPTR2),IOPINAME(IOPPTR)                0193
         BL    @DL00191                                            0193
@DC00191 DS    0H                                                  0194
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK TO SEE IF SYSMOD FOUND OR IF ANY ERRORS IN PROCESS      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0194
*   IF IOPRETRN=IOPGOOD             /* IF NOT STAOP AT EOF           */
*     THEN                          /*                               */
         CLI   IOPRETRN(IOPPTR2),0                                 0194
         BNE   @RF00194                                            0194
*     DO;                           /*                               */
*       IF IOPINAME=IOPPTR->IOPINAME/* AND MATCH FOUND               */
*           &IOPERROR=OFF           /* AND SYSMOD NOT IN ERROR       */
*         THEN                      /*                               */
         CLC   IOPINAME(8,IOPPTR2),IOPINAME(IOPPTR)                0196
         BNE   @RF00196                                            0196
         TM    IOPERROR(IOPPTR2),B'00010000'                       0196
         BNZ   @RF00196                                            0196
*         LC1MASRC=FOUR;            /* SYSMOD NOT ELIGIBLE           */
         LA    LC1MASRC,4                                          0197
*     END;                          /*                               */
*   ELSE                            /*                               */
*     IF IOPRETRN>IOPEOF            /* IF ERROR STOPPED LOOP         */
*       THEN                        /*                               */
         B     @RC00194                                            0199
@RF00194 CLI   IOPRETRN(IOPPTR2),4                                 0199
         BNH   @RF00199                                            0199
*       LC1MASRC=IOPRETRN;          /* PASS ALONG RC                 */
         SLR   LC1MASRC,LC1MASRC                                   0200
         IC    LC1MASRC,IOPRETRN(,IOPPTR2)                         0200
*   RETURN CODE(LC1MASRC);          /*                               */
@RF00199 DS    0H                                                  0201
@RC00194 LR    @15,LC1MASRC                                        0201
         L     @14,@SA00003                                        0201
         LM    @00,@12,@SA00003+8                                  0201
         BR    @14                                                 0201
*   END LC1MASS;                    /*                               */
*   END HMASMLC1                    /*                               */
*                                                                  0203
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */
*                                                                  0203
*       ;                                                          0203
@DATA    DS    0H
@CH00047 DC    H'2'
@CH00233 DC    H'12'
         DS    0F
@AL00141 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00142 DC    A(NOAPIOP)              LIST WITH   2 ARGUMENT(S)
         DC    A(@CH00047+1)
@AL00150 EQU   *                       LIST WITH   2 ARGUMENT(S)
@AL00151 DC    A(NOACIOP)              LIST WITH   2 ARGUMENT(S)
         DC    A(@CH00233+1)
         DS    0F
@SA00001 DS    18F
@PC00001 DS    2F
@SA00002 DS    0F
@PC00002 EQU   @SA00002+60
@SA00003 DS    0F
@PC00003 EQU   @SA00003+60
         DS    17F
@AL00001 DS    1A
         DS    0F
@CV01270 DC    V(HMASMIO)
         DS    0D
NOAPIOP  DC    XL80'0'
NOACIOP  DC    XL80'0'
PATCHLC1 DS    CL80
         ORG   PATCHLC1
@NM00176 DC    80X'FF'
         ORG   PATCHLC1+80
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IOPPTR2  EQU   @02
LC1MASRC EQU   @03
IOPPTR1  EQU   @02
LC1SELRC EQU   @03
LC1RTNCD EQU   @02
IOPPTR   EQU   @04
CCAPTR   EQU   @11
RTNCODE  EQU   @15
RTNREG   EQU   @14
HMASMCCA EQU   0
CCAFBUFR EQU   HMASMCCA+4
CCADSAD  EQU   CCAFBUFR+124
CCATPAD  EQU   CCAFBUFR+128
CCAFLAG7 EQU   CCAFBUFR+132
CCAFIOP  EQU   HMASMCCA+140
CCAFSYS  EQU   HMASMCCA+148
CCASREL  EQU   CCAFSYS+12
CCAFLAGA EQU   CCAFSYS+21
CCAFSTA  EQU   HMASMCCA+188
CCAFICT  EQU   HMASMCCA+192
CCAFPGM  EQU   HMASMCCA+208
CCABLDLP EQU   CCAFPGM
CCADBLDL EQU   CCAFPGM+4
CCAFGTP  EQU   HMASMCCA+224
CCASEGTP EQU   CCAFGTP
@NM00014 EQU   HMASMCCA+244
CCAFFUNC EQU   HMASMCCA+264
CCAFLAG1 EQU   CCAFFUNC+8
CCAFLAG2 EQU   CCAFFUNC+11
CCAFPROC EQU   HMASMCCA+276
CCAFLAG3 EQU   CCAFPROC
CCAFDIS  EQU   HMASMCCA+278
CCAFLAG4 EQU   CCAFDIS
CCAFLAG5 EQU   CCAFDIS+1
CCAFLAG6 EQU   CCAFDIS+2
CCAFCNV  EQU   HMASMCCA+281
CCAFLAG8 EQU   CCAFCNV
CCAFCTL  EQU   HMASMCCA+282
CCAFLAG9 EQU   CCAFCTL
CCAFDSNG EQU   HMASMCCA+298
CCAFLAGB EQU   CCAFDSNG
CCABLDLA EQU   0
@NM00030 EQU   CCABLDLA
CCABLDLL EQU   0
@NM00032 EQU   CCABLDLL
CCALKDRC EQU   @NM00032+20
@NM00034 EQU   CCABLDLL+124
CCAASMRC EQU   @NM00034+20
@NM00036 EQU   CCABLDLL+248
CCACPYRC EQU   @NM00036+20
@NM00038 EQU   CCABLDLL+372
CCACOMRC EQU   @NM00038+20
@NM00040 EQU   CCABLDLL+496
CCAZAPRC EQU   @NM00040+20
@NM00042 EQU   CCABLDLL+620
CCASUPRC EQU   @NM00042+20
@NM00044 EQU   CCABLDLL+744
CCAUPDRC EQU   @NM00044+20
CCABLDLM EQU   0
CCABELMT EQU   CCABLDLM+4
CCABMPOS EQU   CCABELMT
HMASMIOP EQU   0
IOPDSID  EQU   HMASMIOP
IOPFUNCT EQU   HMASMIOP+1
IOPRETRN EQU   HMASMIOP+2
IOPTYPE  EQU   HMASMIOP+3
IOPNAME  EQU   HMASMIOP+4
@NM00048 EQU   HMASMIOP+12
@NM00049 EQU   @NM00048
IOPDDNAM EQU   HMASMIOP+24
IOPBUFAD EQU   HMASMIOP+52
IOPDRMAP EQU   HMASMIOP+56
IOPINAME EQU   IOPDRMAP
IOPINAM  EQU   IOPINAME
IOPITYP  EQU   IOPINAM
IOPUSERL EQU   IOPDRMAP+11
IOPEND   EQU   IOPDRMAP+12
IOPLMCTL EQU   0
IOPQSMIF EQU   0
@NM00159 EQU   IOPQSMIF
IOPQSMLS EQU   IOPQSMIF+8
IOPQSMNM EQU   IOPQSMLS
IOPBS02  EQU   0
IOPBS04  EQU   0
IOPBAPF  EQU   IOPBS04
CCADSIDA EQU   0
CCATYPEA EQU   0
IOPBS01  EQU   0
IOPBS03  EQU   0
LISTPARM EQU   0
LISTPRM1 EQU   LISTPARM
LISTPRM2 EQU   LISTPARM+2
LISTPRM3 EQU   LISTPARM+4
LISTNOAP EQU   LISTPRM3
LISTNOAC EQU   LISTPRM3
LISTPRM4 EQU   LISTPARM+6
LISTSEL  EQU   LISTPRM4
LISTDATE EQU   LISTPARM+7
LISTBDAT EQU   LISTDATE
LISTEDAT EQU   LISTDATE+6
LC1IOP   EQU   0
SELIOP   EQU   0
SELID    EQU   0
MASIOP   EQU   0
MASID    EQU   0
IOPUDATA EQU   IOPEND
IOPINAM3 EQU   IOPINAME
@NM00055 EQU   IOPINAM3
IOPSTCMP EQU   IOPUDATA
IOPDYNDT EQU   IOPUDATA
IOPSPACE EQU   IOPDYNDT+44
IOPDTYPE EQU   IOPDYNDT+50
IOPNTMAX EQU   IOPDRMAP
IOPNTMAP EQU   IOPDRMAP
IOPCDMAP EQU   IOPNTMAP
IOPPTMAP EQU   IOPCDMAP
IOPSCMAP EQU   IOPPTMAP
IOPDIRCT EQU   IOPSCMAP+12
IOPCDMAX EQU   IOPDIRCT
IOPCQMAP EQU   IOPDRMAP
@NM00066 EQU   IOPUDATA
@NM00067 EQU   IOPUDATA
IOPASMNT EQU   IOPUDATA
IOPASMDR EQU   IOPASMNT
IOPABUNT EQU   IOPASMDR+1
IOPLMDNT EQU   IOPUDATA
IOPLMDDR EQU   IOPLMDNT
IOPLMLEP EQU   IOPLMDDR+1
IOPLMDF1 EQU   IOPLMLEP
IOPFLGS2 EQU   IOPLMDF1
IOPLMDF2 EQU   IOPLMLEP+1
IOPLMDF3 EQU   IOPLMLEP+2
IOPLMDF4 EQU   IOPLMLEP+3
IOPLMDF5 EQU   IOPLMDDR+5
IOPFLGS3 EQU   IOPLMDF5
IOPLMDFX EQU   IOPLMDNT+24
@NM00076 EQU   IOPLMDFX
IOPLNTRY EQU   IOPLMDFX+8
IOPLSYS  EQU   IOPLNTRY
IOPSYSLB EQU   IOPLSYS
IOPMACNT EQU   IOPUDATA
IOPMACDR EQU   IOPMACNT
IOPRMIDE EQU   IOPMACDR+1
IOPRMST  EQU   IOPRMIDE+7
IOPFMIDE EQU   IOPMACDR+9
IOPMACFX EQU   IOPMACNT+24
IOPBUNT  EQU   IOPMACFX
IOPMCEND EQU   IOPMACNT+104
IOPMACVR EQU   IOPMCEND
IOPMCENT EQU   IOPMACVR
IOPMCDTA EQU   IOPMCENT
IOPMCASM EQU   IOPMCDTA
IOPMACID EQU   IOPMCASM
IOPMACST EQU   IOPMCASM+7
IOPMCIND EQU   IOPMCENT+8
IOPEOFNT EQU   IOPUDATA
IOPSRCNT EQU   IOPUDATA
IOPSRCDR EQU   IOPSRCNT
@NM00087 EQU   IOPSRCDR+1
@NM00089 EQU   @NM00087+7
@NM00093 EQU   IOPSRCDR+9
IOPSRCFX EQU   IOPSRCNT+24
@NM00097 EQU   IOPSRCFX
IOPSREND EQU   IOPSRCNT+104
IOPSRCVR EQU   IOPSREND
IOPSNTRY EQU   IOPSRCVR
IOPSRDTA EQU   IOPSNTRY
IOPSRCID EQU   IOPSRDTA
IOPSRCST EQU   IOPSRDTA+7
IOPMODNT EQU   IOPUDATA
IOPMODDR EQU   IOPMODNT
@NM00103 EQU   IOPMODDR+1
@NM00105 EQU   @NM00103+7
@NM00109 EQU   IOPMODDR+9
IOPMODFX EQU   IOPMODNT+24
@NM00113 EQU   IOPMODFX
IOPMDLEP EQU   IOPMODFX+8
IOPMODF1 EQU   IOPMDLEP
IOPMODF2 EQU   IOPMDLEP+1
IOPMODF3 EQU   IOPMDLEP+2
IOPMODF4 EQU   IOPMDLEP+3
IOPMDEND EQU   IOPMODNT+104
IOPMODVR EQU   IOPMDEND
IOPMNTRY EQU   IOPMODVR
IOPMDDTA EQU   IOPMNTRY
IOPLMODS EQU   IOPMDDTA
IOPMODID EQU   IOPLMODS
IOPMODST EQU   IOPLMODS+7
IOPDLBNT EQU   IOPUDATA
IOPDLBDR EQU   IOPDLBNT
IOPDLBFX EQU   IOPDLBNT+24
@NM00124 EQU   IOPDLBFX
IOPDLEND EQU   IOPDLBNT+104
IOPDLBVR EQU   IOPDLEND
IOPDNTRY EQU   IOPDLBVR
IOPDSYS  EQU   IOPDNTRY
IOPSYSNT EQU   IOPUDATA
IOPSYSDR EQU   IOPSYSNT
IOPSYSF1 EQU   IOPSYSDR+4
IOPFLGS7 EQU   IOPSYSF1
IOPSYSFX EQU   IOPSYSNT+24
@NM00131 EQU   IOPSYSFX
IOPSYEND EQU   IOPSYSNT+184
IOPSYSVR EQU   IOPSYEND
IOPSYSTR EQU   IOPSYSVR
IOPSYNTR EQU   IOPSYSTR
IOPPTFNT EQU   IOPUDATA
IOPPTFDR EQU   IOPPTFNT
IOPPSTAT EQU   IOPPTFDR+2
IOPPTFF1 EQU   IOPPSTAT
IOPFLGS5 EQU   IOPPTFF1
IOPERROR EQU   IOPFLGS5
IOPPTFF2 EQU   IOPPSTAT+1
IOPPTFF3 EQU   IOPPSTAT+3
IOPPTFFX EQU   IOPPTFNT+24
@NM00140 EQU   IOPPTFFX
@NM00141 EQU   @NM00140
IOPPDTES EQU   IOPPTFFX+41
@NM00144 EQU   IOPPDTES
IOPPTPFX EQU   IOPPDTES+6
IOPDATES EQU   IOPPTPFX
IOPPTEND EQU   IOPPTFNT+104
IOPPTFVR EQU   IOPPTEND
IOPPNTRY EQU   IOPPTFVR
IOPPMODS EQU   IOPPNTRY
IOPENTNT EQU   IOPUDATA+104
IOPSRLNT EQU   IOPUDATA+104
IOPPRENT EQU   IOPUDATA+104
IOPNPRNT EQU   IOPUDATA+104
IOPSUPNT EQU   IOPUDATA+104
IOPREQNT EQU   IOPUDATA+104
IOPIRQNT EQU   IOPUDATA+104
IOPFIDNT EQU   IOPUDATA+104
IOPDELNT EQU   IOPUDATA+104
IOPVERNT EQU   IOPUDATA+104
IOPSBYNT EQU   IOPUDATA+104
IOPQSMNT EQU   IOPUDATA
IOPQSMDR EQU   IOPQSMNT
IOPQFMNT EQU   IOPUDATA
IOPQFMDR EQU   IOPQFMNT
IOPQFEND EQU   IOPQFMNT+2
IOPQFMVR EQU   IOPQFEND
IOPQFMLS EQU   IOPQFMVR
IOPQFMNM EQU   IOPQFMLS
IOPPTSYS EQU   IOPUDATA
IOPPTSDR EQU   IOPPTSYS
IOPPTSFX EQU   IOPPTSYS+24
IOPDSSPC EQU   IOPPTSFX
IOPPTFG1 EQU   IOPPTSFX+34
IOPPSEND EQU   IOPPTSYS+1064
IOPPTSVR EQU   IOPPSEND
IOPPTNTR EQU   IOPPTSVR
@NM00169 EQU   IOPPTNTR
IOPPTFMD EQU   @NM00169
IOPPTREL EQU   IOPPTFMD
IOPBPDS  EQU   IOPUDATA
IOPBLEP1 EQU   IOPBPDS+8
IOPBLEP2 EQU   IOPBPDS+9
@NM00173 EQU   IOPBPDS+18
IOPBFTB0 EQU   @NM00173
IOPBFTB1 EQU   IOPBFTB0
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
IOPBCEND EQU   IOPBPDS+21
IOPBFTB3 EQU   IOPBFTB0+2
IOPBFTB2 EQU   IOPBFTB0+1
@NM00175 EQU   IOPBFTB1
IOPBAPFP EQU   IOPBFTB1
IOPBSSI  EQU   IOPBFTB1
IOPBPAGA EQU   IOPBFTB1
@NM00174 EQU   IOPBFTB1
IOPBAOSL EQU   IOPBFTB1
IOPBSEPA EQU   IOPBPDS+15
IOPBFTBL EQU   IOPBPDS+13
IOPBSTOR EQU   IOPBPDS+10
IOPBREFR EQU   IOPBLEP2
IOPBLEF  EQU   IOPBLEP2
IOPBTEST EQU   IOPBLEP2
IOPBNE   EQU   IOPBLEP2
@NM00172 EQU   IOPBLEP2
IOPBDC   EQU   IOPBLEP2
@NM00171 EQU   IOPBLEP1
IOPBSCTR EQU   IOPBLEP1
IOPBOL   EQU   IOPBLEP1
@NM00170 EQU   IOPBLEP1
IOPBOVLY EQU   IOPBLEP1
IOPBREUS EQU   IOPBLEP1
IOPBRENT EQU   IOPBLEP1
IOPBNL   EQU   IOPBPDS+7
IOPBTTRN EQU   IOPBPDS+4
IOPBZERO EQU   IOPBPDS+3
IOPBTTRT EQU   IOPBPDS
IOPPTIND EQU   IOPPTNTR+8
IOPPTSND EQU   IOPPTREL
@NM00168 EQU   IOPPTSFX+872
IOPSYZPP EQU   IOPPTSFX+772
IOPSYZPR EQU   IOPPTSFX+771
IOPSYZPS EQU   IOPPTSFX+763
IOPSYZAP EQU   IOPPTSFX+755
IOPSYUPP EQU   IOPPTSFX+655
IOPSYUPR EQU   IOPPTSFX+654
IOPSYUPS EQU   IOPPTSFX+646
IOPSYUPD EQU   IOPPTSFX+638
IOPSYSPP EQU   IOPPTSFX+538
IOPSYSPR EQU   IOPPTSFX+537
IOPSYSPS EQU   IOPPTSFX+529
IOPSYSUP EQU   IOPPTSFX+521
IOPSYLKP EQU   IOPPTSFX+421
IOPSYLKR EQU   IOPPTSFX+420
IOPSYLKS EQU   IOPPTSFX+412
IOPSYLKD EQU   IOPPTSFX+404
IOPSYCPP EQU   IOPPTSFX+304
IOPSYCPR EQU   IOPPTSFX+303
IOPSYCPS EQU   IOPPTSFX+295
IOPSYCPY EQU   IOPPTSFX+287
IOPSYCOP EQU   IOPPTSFX+187
IOPSYCOR EQU   IOPPTSFX+186
IOPSYCOS EQU   IOPPTSFX+178
IOPSYCOM EQU   IOPPTSFX+170
IOPSYASP EQU   IOPPTSFX+70
IOPSYASR EQU   IOPPTSFX+69
IOPSYASS EQU   IOPPTSFX+61
IOPSYASM EQU   IOPPTSFX+53
@NM00167 EQU   IOPPTSFX+35
@NM00166 EQU   IOPPTFG1
IOPPTSNJ EQU   IOPPTFG1
IOPPTSNP EQU   IOPPTFG1
IOPSYPLN EQU   IOPPTSFX+32
IOPDSPFX EQU   IOPPTSFX+6
IOPDSDIR EQU   IOPDSSPC+4
IOPDSSEC EQU   IOPDSSPC+2
IOPDSPRM EQU   IOPDSSPC
@NM00165 EQU   IOPPTSDR+4
IOPPTPEM EQU   IOPPTSDR+2
IOPPCNVL EQU   IOPPTSDR+1
@NM00164 EQU   IOPPTSDR
IOPQFMTP EQU   IOPQFMLS+8
@NM00163 EQU   IOPQFMLS+7
IOPQFMND EQU   IOPQFMNM
@NM00162 EQU   IOPQFMDR
@NM00158 EQU   IOPQSMDR
@NM00157 EQU   IOPSBYNT+8
IOPSBYST EQU   IOPSBYNT+7
IOPSBYNM EQU   IOPSBYNT
@NM00156 EQU   IOPVERNT+8
IOPVERST EQU   IOPVERNT+7
IOPVERNM EQU   IOPVERNT
@NM00155 EQU   IOPDELNT+8
IOPDELST EQU   IOPDELNT+7
IOPDELNM EQU   IOPDELNT
@NM00154 EQU   IOPFIDNT+8
IOPFIDST EQU   IOPFIDNT+7
IOPFIDNM EQU   IOPFIDNT
@NM00153 EQU   IOPIRQNT+8
IOPIRQST EQU   IOPIRQNT+7
IOPIRQNM EQU   IOPIRQNT
@NM00152 EQU   IOPREQNT+8
IOPREQST EQU   IOPREQNT+7
IOPREQNM EQU   IOPREQNT
@NM00151 EQU   IOPSUPNT+8
IOPSUPST EQU   IOPSUPNT+7
IOPSUPNM EQU   IOPSUPNT
@NM00150 EQU   IOPNPRNT+8
IOPNPRST EQU   IOPNPRNT+7
IOPNPRNM EQU   IOPNPRNT
@NM00149 EQU   IOPPRENT+8
IOPPREST EQU   IOPPRENT+7
IOPPRENM EQU   IOPPRENT
@NM00148 EQU   IOPSRLNT+8
IOPSRLST EQU   IOPSRLNT+7
@NM00147 EQU   IOPSRLNT+4
IOPSRLNM EQU   IOPSRLNT
@NM00146 EQU   IOPENTNT+8
IOPENTST EQU   IOPENTNT+7
IOPENTNM EQU   IOPENTNT
IOPPIND  EQU   IOPPNTRY+8
IOPPTFND EQU   IOPPMODS
IOPPFMID EQU   IOPPTFFX+73
@NM00145 EQU   IOPPTPFX+24
IOPUCLT  EQU   IOPDATES+21
IOPUCLD  EQU   IOPDATES+18
IOPACCT  EQU   IOPDATES+15
IOPACCD  EQU   IOPDATES+12
IOPRSTT  EQU   IOPDATES+9
IOPRSTD  EQU   IOPDATES+6
IOPAPPT  EQU   IOPDATES+3
IOPAPPD  EQU   IOPDATES
IOPRECT  EQU   @NM00144+3
IOPRECD  EQU   @NM00144
@NM00143 EQU   IOPPTFFX+8
@NM00142 EQU   @NM00140+7
IOPPRELN EQU   @NM00141
@NM00139 EQU   IOPPTFDR+20
IOPSBYNO EQU   IOPPTFDR+13
IOPDBYNO EQU   IOPPTFDR+6
@NM00138 EQU   IOPPTFF3
IOPFLF   EQU   IOPPTFF3
IOPDBYP  EQU   IOPPTFF3
IOPSBYP  EQU   IOPPTFF3
IOPPMDLP EQU   IOPPTFF2+1
IOPPADDP EQU   IOPPTFF2+1
@NM00137 EQU   IOPPTFF2+1
IOPLRFP  EQU   IOPPTFF2
IOPJCLP  EQU   IOPPTFF2
IOPSUPP  EQU   IOPPTFF2
IOPREQP  EQU   IOPPTFF2
IOPPREP  EQU   IOPPTFF2
IOPNPRP  EQU   IOPPTFF2
IOPIRQP  EQU   IOPPTFF2
IOPDELP  EQU   IOPPTFF2
IOPREGEN EQU   IOPFLGS5
IOPBYP   EQU   IOPFLGS5
IOPDUMMP EQU   IOPFLGS5
@NM00136 EQU   IOPFLGS5
IOPACC   EQU   IOPFLGS5
IOPRES   EQU   IOPFLGS5
IOPAPP   EQU   IOPFLGS5
IOPPTYPE EQU   IOPPTFDR+1
@NM00135 EQU   IOPPTFDR
IOPSYSTP EQU   IOPSYSTR+8
IOPSYSND EQU   IOPSYNTR
@NM00134 EQU   IOPSYSFX+21
IOPSYSID EQU   IOPSYSFX+13
IOPNUCID EQU   IOPSYSFX+12
IOPSREL  EQU   IOPSYSFX+8
@NM00133 EQU   @NM00131+7
@NM00132 EQU   @NM00131
@NM00130 EQU   IOPSYSDR+5
@NM00129 EQU   IOPFLGS7
IOPSYNG  EQU   IOPFLGS7
IOPSYDL  EQU   IOPFLGS7
IOPSTSNP EQU   IOPFLGS7
IOPMTSNP EQU   IOPFLGS7
IOPPEMAX EQU   IOPSYSDR+2
IOPSCNVL EQU   IOPSYSDR+1
@NM00128 EQU   IOPSYSDR
IOPDLIND EQU   IOPDNTRY+8
IOPDLBND EQU   IOPDSYS
@NM00127 EQU   IOPDLBFX+8
@NM00126 EQU   @NM00124+7
@NM00125 EQU   @NM00124
@NM00123 EQU   IOPDLBDR+1
@NM00122 EQU   IOPDLBDR
IOPMDIND EQU   IOPMNTRY+8
@NM00121 EQU   IOPMODST
IOPMODND EQU   IOPMODID
IOPDLIB  EQU   IOPMODFX+72
@NM00120 EQU   IOPMODFX+12
@NM00119 EQU   IOPMODF4
@NM00118 EQU   IOPMODF3
@NM00117 EQU   IOPMODF2
IOPMPAGA EQU   IOPMODF2
IOPMNE   EQU   IOPMODF2
@NM00116 EQU   IOPMODF1
IOPMDC   EQU   IOPMODF1
IOPMREFR EQU   IOPMODF1
IOPMOVLY EQU   IOPMODF1
IOPMSCTR EQU   IOPMODF1
IOPMREUS EQU   IOPMODF1
IOPMRENT EQU   IOPMODF1
IOPMAPF  EQU   IOPMODF1
@NM00115 EQU   @NM00113+7
@NM00114 EQU   @NM00113
@NM00112 EQU   IOPMODDR+17
@NM00111 EQU   @NM00109+7
@NM00110 EQU   @NM00109
@NM00108 EQU   @NM00105
@NM00107 EQU   @NM00105
@NM00106 EQU   @NM00105
@NM00104 EQU   @NM00103
@NM00102 EQU   IOPMODDR
IOPSRIND EQU   IOPSNTRY+8
@NM00101 EQU   IOPSRCST
IOPSRCND EQU   IOPSRCID
IOPSRDLB EQU   IOPSRCFX+72
IOPSRSYS EQU   IOPSRCFX+64
@NM00100 EQU   IOPSRCFX+8
@NM00099 EQU   @NM00097+7
@NM00098 EQU   @NM00097
@NM00096 EQU   IOPSRCDR+18
IOPSRLNG EQU   IOPSRCDR+17
@NM00095 EQU   @NM00093+7
@NM00094 EQU   @NM00093
@NM00092 EQU   @NM00089
@NM00091 EQU   @NM00089
@NM00090 EQU   @NM00089
@NM00088 EQU   @NM00087
@NM00086 EQU   IOPSRCDR
IOPEOFND EQU   IOPEOFNT
IOPMCTYP EQU   IOPMCIND
@NM00085 EQU   IOPMACST
IOPMACND EQU   IOPMACID
IOPMCDLB EQU   IOPMACFX+72
IOPMCSYS EQU   IOPMACFX+64
@NM00084 EQU   IOPMACFX+8
IOPBUTYP EQU   IOPBUNT+7
IOPBUSMD EQU   IOPBUNT
@NM00083 EQU   IOPMACDR+18
IOPMCLNG EQU   IOPMACDR+17
IOPFMST  EQU   IOPFMIDE+7
IOPFMID  EQU   IOPFMIDE
@NM00082 EQU   IOPRMST
IOPRMASM EQU   IOPRMST
@NM00081 EQU   IOPRMST
IOPRMID  EQU   IOPRMIDE
@NM00080 EQU   IOPMACDR
IOPLMIND EQU   IOPLNTRY+8
IOPLMDND EQU   IOPSYSLB
@NM00078 EQU   @NM00076+7
@NM00077 EQU   @NM00076
@NM00075 EQU   IOPLMDDR+6
@NM00074 EQU   IOPFLGS3
IOPCHREP EQU   IOPFLGS3
IOPLINK  EQU   IOPFLGS3
IOPCOPY  EQU   IOPFLGS3
@NM00073 EQU   IOPLMDF4
@NM00072 EQU   IOPLMDF3
@NM00071 EQU   IOPLMDF2
IOPPAGA  EQU   IOPLMDF2
IOPNE    EQU   IOPLMDF2
@NM00070 EQU   IOPFLGS2
IOPDC    EQU   IOPFLGS2
IOPREFR  EQU   IOPFLGS2
IOPOVLY  EQU   IOPFLGS2
IOPSCTR  EQU   IOPFLGS2
IOPREUS  EQU   IOPFLGS2
IOPRENT  EQU   IOPFLGS2
IOPAPF   EQU   IOPFLGS2
@NM00069 EQU   IOPLMDDR
@NM00068 EQU   IOPASMDR+9
IOPABUTP EQU   IOPABUNT+7
IOPABUPT EQU   IOPABUNT
IOPNTLVL EQU   IOPASMDR
IOPALLOC EQU   @NM00067+4
IOPUSED  EQU   @NM00067
IOPTPSEQ EQU   @NM00066+8
IOPVLSER EQU   @NM00066+2
IOPBLKSI EQU   @NM00066
IOPCQMAX EQU   IOPCQMAP+12
@NM00065 EQU   IOPCQMAP+11
@NM00064 EQU   IOPCQMAP+8
@NM00063 EQU   IOPCQMAP
IOPPTMAX EQU   IOPCDMAX
@NM00062 EQU   IOPSCMAP+11
@NM00061 EQU   IOPSCMAP+8
@NM00060 EQU   IOPSCMAP
IOPDIRMX EQU   IOPNTMAX+12
@NM00059 EQU   IOPNTMAX+11
@NM00058 EQU   IOPNTMAX+8
@NM00057 EQU   IOPNTMAX
@NM00056 EQU   IOPDTYPE
IOPDMOD  EQU   IOPDTYPE
IOPDJCL  EQU   IOPDTYPE
IOPDSRC  EQU   IOPDTYPE
IOPDMAC  EQU   IOPDTYPE
IOPSDIR  EQU   IOPSPACE+4
IOPSSCND EQU   IOPSPACE+2
IOPSPRIM EQU   IOPSPACE
IOPDSN   EQU   IOPDYNDT
IOPNTYPE EQU   IOPSTCMP+17
IOPNNAME EQU   IOPSTCMP+9
IOPOTYPE EQU   IOPSTCMP+8
IOPONAME EQU   IOPSTCMP
IOPISEQ3 EQU   IOPINAM3+6
IOPITYP3 EQU   @NM00055+5
IOPIPTF3 EQU   @NM00055
LISTEYY  EQU   LISTEDAT+4
LISTEDD  EQU   LISTEDAT+2
LISTEMM  EQU   LISTEDAT
LISTBYY  EQU   LISTBDAT+4
LISTBDD  EQU   LISTBDAT+2
LISTBMM  EQU   LISTBDAT
@NM00005 EQU   LISTPRM4
LISTXREF EQU   LISTPRM4
@NM00004 EQU   LISTPRM3+1
LISTERR  EQU   LISTPRM3+1
LISTBYP  EQU   LISTPRM3+1
LISTDEL  EQU   LISTPRM3+1
LISTNSUP EQU   LISTPRM3+1
LISTSUP  EQU   LISTPRM3+1
LISTUSER EQU   LISTPRM3
LISTAPAR EQU   LISTPRM3
LISTPTF  EQU   LISTPRM3
LISTFUNC EQU   LISTPRM3
LISTRES  EQU   LISTPRM3
LISTALL3 EQU   LISTPRM3
@NM00003 EQU   LISTPRM2+1
LISTMCS  EQU   LISTPRM2+1
LISTFMD  EQU   LISTPRM2+1
LISTSMD  EQU   LISTPRM2+1
LISTSYS  EQU   LISTPRM2
LISTDLB  EQU   LISTPRM2
LISTSRC  EQU   LISTPRM2
LISTMOD  EQU   LISTPRM2
LISTMAC  EQU   LISTPRM2
LISTLMD  EQU   LISTPRM2
LISTASM  EQU   LISTPRM2
LISTALL2 EQU   LISTPRM2
@NM00002 EQU   LISTPRM1+1
LISTLOG  EQU   LISTPRM1+1
@NM00001 EQU   LISTPRM1
LISTPTS  EQU   LISTPRM1
LISTACRQ EQU   LISTPRM1
LISTCRQ  EQU   LISTPRM1
LISTSCDS EQU   LISTPRM1
LISTACDS EQU   LISTPRM1
LISTCDS  EQU   LISTPRM1
LISTALL1 EQU   LISTPRM1
IOPBS04E EQU   IOPBS04+2
IOPBAPFC EQU   IOPBAPF+1
IOPBAPFL EQU   IOPBAPF
IOPBS2NM EQU   IOPBS02+3
IOPBS2EP EQU   IOPBS02
IOPQSMTP EQU   IOPQSMLS+8
@NM00161 EQU   IOPQSMLS+7
IOPQSMND EQU   IOPQSMNM
@NM00160 EQU   @NM00159+7
IOPQSMFM EQU   @NM00159
@NM00079 EQU   IOPLMCTL+17
IOPLMCRD EQU   IOPLMCTL+9
IOPLMCRN EQU   IOPLMCTL+1
IOPLMCC  EQU   IOPLMCTL
@NM00054 EQU   IOPUSERL
@NM00053 EQU   IOPUSERL
IOPALIS  EQU   IOPUSERL
IOPTTR   EQU   IOPDRMAP+8
IOPINAM2 EQU   IOPINAM+1
IOPITYP2 EQU   IOPITYP
@NM00052 EQU   HMASMIOP+32
IOPDELDD EQU   IOPDDNAM
@NM00051 EQU   @NM00048+10
IOPSEQNO EQU   @NM00048+8
@NM00050 EQU   @NM00049+7
IOPPTFNM EQU   @NM00049
IOPNAM17 EQU   IOPNAME
CCABMREC EQU   CCABELMT+10
CCABPOS  EQU   CCABMPOS+8
CCABNAME EQU   CCABMPOS
@NM00047 EQU   CCABLDLM+2
@NM00046 EQU   CCABLDLM
CCAUPDPM EQU   @NM00044+24
@NM00045 EQU   @NM00044+21
CCARUPDT EQU   CCAUPDRC
CCAUPDSP EQU   @NM00044+12
CCAUPDTE EQU   @NM00044+8
CCAUPDNM EQU   @NM00044
CCASUPPM EQU   @NM00042+24
@NM00043 EQU   @NM00042+21
CCARSUP  EQU   CCASUPRC
CCASUPSP EQU   @NM00042+12
CCAIOSUP EQU   @NM00042+8
CCASUPNM EQU   @NM00042
CCAZAPPM EQU   @NM00040+24
@NM00041 EQU   @NM00040+21
CCARZAP  EQU   CCAZAPRC
CCAZAPSP EQU   @NM00040+12
CCASPZAP EQU   @NM00040+8
CCAZAPNM EQU   @NM00040
CCACOMPM EQU   @NM00038+24
@NM00039 EQU   @NM00038+21
CCARCOMP EQU   CCACOMRC
CCACOMSP EQU   @NM00038+12
CCACOMRS EQU   @NM00038+8
CCACOMNM EQU   @NM00038
CCACPYPM EQU   @NM00036+24
@NM00037 EQU   @NM00036+21
CCARCOPY EQU   CCACPYRC
CCACPYSP EQU   @NM00036+12
CCACOPY  EQU   @NM00036+8
CCACPYNM EQU   @NM00036
CCAASMPM EQU   @NM00034+24
@NM00035 EQU   @NM00034+21
CCARASM  EQU   CCAASMRC
CCAASMSP EQU   @NM00034+12
CCAASM   EQU   @NM00034+8
CCAASMNM EQU   @NM00034
CCALKDPM EQU   @NM00032+24
@NM00033 EQU   @NM00032+21
CCARLINK EQU   CCALKDRC
CCALKDSP EQU   @NM00032+12
CCALKED  EQU   @NM00032+8
CCALKDNM EQU   @NM00032
CCAPGMPM EQU   @NM00030+24
@NM00031 EQU   @NM00030+21
CCABPGRC EQU   @NM00030+20
CCABPGSP EQU   @NM00030+12
CCABPGAD EQU   @NM00030+8
CCABPGNM EQU   @NM00030
CCAEND   EQU   HMASMCCA+371
@NM00029 EQU   HMASMCCA+309
CCACURDD EQU   CCAFDSNG+3
CCACURDS EQU   CCAFDSNG+2
@NM00028 EQU   CCAFLAGB
CCAOUTNG EQU   CCAFLAGB
CCALOGNG EQU   CCAFLAGB
CCAFMID  EQU   HMASMCCA+291
CCALSTDS EQU   CCAFCTL+8
CCARPTDS EQU   CCAFCTL+7
CCATIME  EQU   CCAFCTL+4
CCADATE  EQU   CCAFCTL+1
@NM00027 EQU   CCAFLAG9
CCARVCAN EQU   CCAFLAG9
CCARVEST EQU   CCAFLAG9
CCAPTSNJ EQU   CCAFLAG9
CCASTSNP EQU   CCAFLAG9
CCAMTSNP EQU   CCAFLAG9
CCAPTSNP EQU   CCAFLAG9
@NM00026 EQU   CCAFLAG8
CCAACDSC EQU   CCAFLAG8
CCACDSC  EQU   CCAFLAG8
@NM00025 EQU   CCAFLAG6
CCAACRUP EQU   CCAFLAG6
CCACRQUP EQU   CCAFLAG6
CCAACDUP EQU   CCAFLAG6
CCACDSUP EQU   CCAFLAG6
@NM00024 EQU   CCAFLAG5
CCAACROS EQU   CCAFLAG5
CCACRQOS EQU   CCAFLAG5
CCAACDOS EQU   CCAFLAG5
CCACDSOS EQU   CCAFLAG5
@NM00023 EQU   CCAFLAG4
CCAACRIS EQU   CCAFLAG4
CCACRQIS EQU   CCAFLAG4
CCAACDIS EQU   CCAFLAG4
CCACDSIS EQU   CCAFLAG4
@NM00022 EQU   CCAFLAG3+1
CCARGNP  EQU   CCAFLAG3+1
CCADISRQ EQU   CCAFLAG3+1
CCAICTOK EQU   CCAFLAG3
CCADELP  EQU   CCAFLAG3
CCACMPRS EQU   CCAFLAG3
CCAZAPP  EQU   CCAFLAG3
CCALINKP EQU   CCAFLAG3
CCACOPYP EQU   CCAFLAG3
CCAASIP  EQU   CCAFLAG3
CCAUPDP  EQU   CCAFLAG3
CCAEOSMP EQU   CCAFLAG2
CCAEOFNC EQU   CCAFLAG2
@NM00021 EQU   CCAFLAG2
CCACHECK EQU   CCAFLAG2
CCATERM  EQU   CCAFLAG2
CCASVCLB EQU   CCAFLAG2
CCANCPTF EQU   CCAFLAG2
@NM00020 EQU   CCAFLAG1+1
CCAUNL   EQU   CCAFLAG1+1
CCARESET EQU   CCAFLAG1+1
CCALOG   EQU   CCAFLAG1+1
CCACNV   EQU   CCAFLAG1+1
CCALIST  EQU   CCAFLAG1
CCAUPDU  EQU   CCAFLAG1
CCAUPDJ  EQU   CCAFLAG1
CCARES   EQU   CCAFLAG1
CCAREJ   EQU   CCAFLAG1
CCAACCPT EQU   CCAFLAG1
CCAAPPLY EQU   CCAFLAG1
CCAREC   EQU   CCAFLAG1
CCAFUNCT EQU   CCAFFUNC
@NM00019 EQU   @NM00014+18
@NM00018 EQU   @NM00014+16
CCATBLPA EQU   @NM00014+12
@NM00017 EQU   @NM00014+8
@NM00016 EQU   @NM00014+4
@NM00015 EQU   @NM00014
CCAIFGTP EQU   CCAFGTP+16
CCAGTP3  EQU   CCAFGTP+12
CCAGTP2  EQU   CCAFGTP+8
CCAGTP1  EQU   CCAFGTP+4
CCASETAD EQU   CCASEGTP
CCACLST  EQU   CCAFPGM+12
CCASPDCB EQU   CCAFPGM+8
CCAICLMD EQU   CCAFICT+12
CCAICMOD EQU   CCAFICT+8
CCAICPTF EQU   CCAFICT+4
CCAICT   EQU   CCAFICT
CCARVAD  EQU   CCAFSTA
CCAACDID EQU   CCAFSYS+32
CCACDSID EQU   CCAFSYS+24
CCALNLEN EQU   CCAFSYS+22
@NM00013 EQU   CCAFLAGA
CCAPSYSF EQU   CCAFLAGA
CCAASYSF EQU   CCAFLAGA
CCACSYSF EQU   CCAFLAGA
CCANUCID EQU   CCAFSYS+20
CCAASREL EQU   CCAFSYS+16
CCACSREL EQU   CCASREL
CCAPEMAX EQU   CCAFSYS+10
CCAPGLEN EQU   CCAFSYS+8
CCAIOPAS EQU   CCAFSYS+4
CCAIOPCS EQU   CCAFSYS
CCAPESIZ EQU   CCAFIOP+4
CCAIOPTR EQU   CCAFIOP
@NM00012 EQU   CCAFLAG7+3
CCALOGP  EQU   CCAFLAG7+2
CCAOUTP  EQU   CCAFLAG7+2
CCASLBP  EQU   CCAFLAG7+2
CCARPTP  EQU   CCAFLAG7+2
CCALISTP EQU   CCAFLAG7+2
CCAJCLP  EQU   CCAFLAG7+2
CCAPTFP  EQU   CCAFLAG7+2
CCATLBP  EQU   CCAFLAG7+2
CCAUT3P  EQU   CCAFLAG7+1
CCAUT2P  EQU   CCAFLAG7+1
CCAUT1P  EQU   CCAFLAG7+1
CCAWK5P  EQU   CCAFLAG7+1
CCAWK4P  EQU   CCAFLAG7+1
CCAWK3P  EQU   CCAFLAG7+1
CCAWK2P  EQU   CCAFLAG7+1
CCAWK1P  EQU   CCAFLAG7+1
CCAACRQP EQU   CCAFLAG7
CCACRQP  EQU   CCAFLAG7
CCASTSP  EQU   CCAFLAG7
CCAMTSP  EQU   CCAFLAG7
CCAPTSP  EQU   CCAFLAG7
CCASCDSP EQU   CCAFLAG7
CCAACDSP EQU   CCAFLAG7
CCACDSP  EQU   CCAFLAG7
@NM00011 EQU   CCAFBUFR+122
@NM00010 EQU   CCAFBUFR+120
@NM00009 EQU   CCAFBUFR+118
CCATBFMX EQU   CCAFBUFR+116
CCA4BFMX EQU   CCAFBUFR+114
CCA3BFMX EQU   CCAFBUFR+112
CCA2BFMX EQU   CCAFBUFR+110
CCA1BFMX EQU   CCAFBUFR+108
CCAXBFMX EQU   CCAFBUFR+106
CCAQBFMX EQU   CCAFBUFR+104
CCASBFMX EQU   CCAFBUFR+102
CCAMBFMX EQU   CCAFBUFR+100
CCAPBFMX EQU   CCAFBUFR+98
CCAVBFMX EQU   CCAFBUFR+96
CCAABFMX EQU   CCAFBUFR+94
CCACBFMX EQU   CCAFBUFR+92
@NM00008 EQU   CCAFBUFR+88
@NM00007 EQU   CCAFBUFR+84
CCA4BFSZ EQU   CCAFBUFR+80
CCATBFSZ EQU   CCAFBUFR+76
CCAWBFSZ EQU   CCAFBUFR+72
CCAQBFSZ EQU   CCAFBUFR+68
CCAPBFSZ EQU   CCAFBUFR+64
CCAVBFSZ EQU   CCAFBUFR+60
CCACBFSZ EQU   CCAFBUFR+56
@NM00006 EQU   CCAFBUFR+52
CCA4BFOA EQU   CCAFBUFR+48
CCA4BFIA EQU   CCAFBUFR+44
CCATBFIA EQU   CCAFBUFR+40
CCAWBFOA EQU   CCAFBUFR+36
CCAWBFIA EQU   CCAFBUFR+32
CCAQBFOA EQU   CCAFBUFR+28
CCAQBFIA EQU   CCAFBUFR+24
CCAPBFOA EQU   CCAFBUFR+20
CCAPBFIA EQU   CCAFBUFR+16
CCAVBFOA EQU   CCAFBUFR+12
CCAVBFIA EQU   CCAFBUFR+8
CCACBFOA EQU   CCAFBUFR+4
CCACBFIA EQU   CCAFBUFR
CCAID    EQU   HMASMCCA
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RF00146 EQU   @RC00135
@RF00175 EQU   @RC00173
@RF00196 EQU   @RC00194
@ENDDATA EQU   *
         END   HMASMLC1,(C'PLS2041',0802,78334)
