//SALBERTQ JOB (U32048,17F),GUY,CLASS=A,MSGCLASS=N,NOTIFY=SALBERT
//QASM   PROC  M=
//ASM    EXEC  PGM=IEUASM,REGION=2048K,COND=(13,LT),
// PARM='LOAD,NODECK,LINECNT=54,BUFSIZE(MAX),SYSPARM((BFG))'
//SYSLIB   DD  DSN=SFTB.SP215.QUEUE,DISP=SHR  QUEUE MACRO LIBRARY
//         DD  DSN=SYS1.JES2SRC,DISP=SHR
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//         DD  DSN=SYS2.MACLIB,DISP=SHR           NEEDED ONLY IF BFG
//*                                                 IS IN SYSPARM
//SYSUT1   DD  SPACE=(CYL,(5,5)),UNIT=VIO
//SYSUT2   DD  SPACE=(CYL,(5,5)),UNIT=VIO
//SYSUT3   DD  SPACE=(CYL,(5,5)),UNIT=VIO
//SYSPRINT DD  SYSOUT=N
//SYSIN    DD  DISP=SHR,DSN=SFTB.SP215.QUEUE(&M)
//SYSGO    DD  DSN=SFTB.SP215.QOBJ(&M),DISP=OLD
//*
//PEND   PEND
//*
//QCOMMON  EXEC QASM,M=Q0
//ACTIVE   EXEC QASM,M=ACTIVE
//ALLOCATE EXEC QASM,M=ALLOCATE
//AUTH     EXEC QASM,M=AUTH
//CDIE     EXEC QASM,M=CDIE
//CHCT     EXEC QASM,M=CHCT
//CIOT     EXEC QASM,M=CIOT
//CJCT     EXEC QASM,M=CJCT
//CJHIST   EXEC QASM,M=CJHIST
//CJOE     EXEC QASM,M=CJOE
//CJQE     EXEC QASM,M=CJQE
//CKPT     EXEC QASM,M=CKPT
//CONSOLE  EXEC QASM,M=CONSOLE
//CPDDB    EXEC QASM,M=CPDDB
//CPFK     EXEC QASM,M=CPFK
//CSPIN    EXEC QASM,M=CSPIN
//CTGPS    EXEC QASM,M=CTGPS
//CTSO     EXEC QASM,M=CTSO
//DISPLAY  EXEC QASM,M=DISPLAY
//DDNAME   EXEC QASM,M=DDNAME
//FINDJOB  EXEC QASM,M=FINDJOB
//FINDPDDB EXEC QASM,M=FINDPDDB
//FORMAT   EXEC QASM,M=FORMAT
//HELP     EXEC QASM,M=HELP
//HEXBLK   EXEC QASM,M=HEXBLK
//HEXDUMP  EXEC QASM,M=HEXDUMP
//INIT     EXEC QASM,M=INIT
//INITS    EXEC QASM,M=INITS
//JCL      EXEC QASM,M=JCL
//JLOG     EXEC QASM,M=JLOG
//JMSG     EXEC QASM,M=JMSG
//LIST     EXEC QASM,M=LIST
//LISTDS   EXEC QASM,M=LISTDS
//PARSE    EXEC QASM,M=PARSE
//PRINT    EXEC QASM,M=PRINT
//QUEUE    EXEC QASM,M=QUEUE
//READSPC  EXEC QASM,M=READSPC
//REPOS    EXEC QASM,M=REPOS
//SAVE     EXEC QASM,M=SAVE
//SEARCH   EXEC QASM,M=SEARCH
//SUBSYS   EXEC QASM,M=SUBSYS
//SYSLOG   EXEC QASM,M=SYSLOG
//SYSOUT   EXEC QASM,M=SYSOUT
//XDS      EXEC QASM,M=XDS
//*
//LKED   EXEC  PGM=IEWL,PARM='XREF,LIST,LET,RENT,REUS,REFR',
//             COND=(4,LT)
//SYSLMOD  DD  DSN=SALBERT.LOAD,DISP=SHR
//SYSUT1   DD  UNIT=TEMP,SPACE=(CYL,(2,1))
//SYSPRINT DD  SYSOUT=N
//SYSLIB   DD  DSN=SFTB.SP215.QOBJ,DISP=OLD
//SYSLIN   DD  *
 INCLUDE SYSLIB(QUEUE)
 ENTRY QUEUE
 NAME Q7(R)
/*
//LKEDQ0 EXEC  PGM=IEWL,PARM='XREF,LIST,LET',
//             COND=(4,LT)
//SYSLMOD  DD  DSN=SALBERT.LOAD,DISP=SHR
//SYSUT1   DD  UNIT=TEMP,SPACE=(CYL,(2,1))
//SYSPRINT DD  SYSOUT=N
//SYSLIB   DD  DSN=SFTB.SP215.QOBJ,DISP=OLD
//SYSLIN   DD  *
 INCLUDE SYSLIB(Q0)
 NAME QUEUECMN(R)
/*
