./ CHANGE      SEQFLD=736,NAME=DSSSIM
    /*FIX030: ADD 3380 SUPPORT                                /*FIX030*/
              2  HB13_CYLM(0:886) FIXED BIN(31);/*CYL/ARM MAP /*FIX030*/
        DCL 1  DEVCHRS,                                       /*FIX030*/
               /* DEVICE DATA (FOR SEVEN SUPPORT DEVICES) */  /*FIX030*/
             2  DEVC_DTYP(07) CHAR(6)       /*DEVICE NAME*/   /*FIX030*/
                              INIT('2314  ',                  /*FIX030*/
                                   '3330  ',                  /*FIX030*/
                                   '3330-1',                  /*FIX030*/
                                   '3340  ',                  /*FIX030*/
                                   '3350  ',                  /*FIX030*/
                                   '2305-2',                  /*FIX030*/
                                   '3380  '),                 /*FIX030*/
             2  DEVC_NCPV(07) FIXED BIN(15) /*DATA CYLS  */   /*FIX030*/
                              INIT(200,                       /*FIX030*/
                                   404,                       /*FIX030*/
                                   808,                       /*FIX030*/
                                   696,                       /*FIX030*/
                                   555,                       /*FIX030*/
                                    96,                       /*FIX030*/
                                   885),                      /*FIX030*/
             2  DEVC_NTPC(07) FIXED BIN(15) /*TRKS/CYL   */   /*FIX030*/
                              INIT(20,                        /*FIX030*/
                                   19,                        /*FIX030*/
                                   19,                        /*FIX030*/
                                   12,                        /*FIX030*/
                                   30,                        /*FIX030*/
                                    8,                        /*FIX030*/
                                   15),                       /*FIX030*/
             2  DEVC_DSIC(07) FIXED BIN(15) /*TOTAL CYLS */   /*FIX030*/
                              INIT(203,                       /*FIX030*/
                                   411,                       /*FIX030*/
                                   815,                       /*FIX030*/
                                   698,                       /*FIX030*/
                                   560,                       /*FIX030*/
                                    96,                       /*FIX030*/
                                   886),                      /*FIX030*/
             2  DEVC_NTRK(07) FIXED BIN(15) /*TRKS/VOLUME*/   /*FIX030*/
                              INIT(4000,                      /*FIX030*/
                                   7676,                      /*FIX030*/
                                  15352,                      /*FIX030*/
                                   8352,                      /*FIX030*/
                                  16650,                      /*FIX030*/
                                    768,                      /*FIX030*/
                                  13275),                     /*FIX030*/
             2  DEVC_TCAP(07) FIXED BIN(31) /*BYTES/TRK  */   /*FIX030*/
                              INIT(7294,                      /*FIX030*/
                                  13030,                      /*FIX030*/
                                  13030,                      /*FIX030*/
                                   8368,                      /*FIX030*/
                                  19069,                      /*FIX030*/
                                  14660,                      /*FIX030*/
                                  47467),                     /*FIX030*/
             2  DEVC_UTYP(07) BIT(8)      /*DVC TYPE CODE*/   /*FIX030*/
                              INIT('00001000'B,               /*FIX030*/
                                   '00001001'B,               /*FIX030*/
                                   '00001101'B,               /*FIX030*/
                                   '00001010'B,               /*FIX030*/
                                   '00001011'B,               /*FIX030*/
                                   '00000111'B,               /*FIX030*/
                                   '00001110'B);              /*FIX030*/
           CYLMAP(0:886)     FIXED BIN(31) INIT((887) 0),     /*FIX030*/
           ARMMAP(0:886)     FIXED BIN(31) INIT((887) 0),     /*FIX030*/
           SIMCYL(0:886)     FIXED BIN(31) INIT((887) 0),     /*FIX030*/
           SIMARM(0:886)     FIXED BIN(31) INIT((887) 0);     /*FIX030*/
       DO I = 01 TO 07; /* SCAN DEVICE CHARS */               /*FIX030*/
       DO I = 0 TO 886; /* ADD UP CYL REFERENCES */           /*FIX030*/
       DO I = 0 TO 886; /* ADD UP CYL REFERENCES */           /*FIX030*/
         DO I = 01 TO 07;                                     /*FIX030*/
            2  DEVC_DTYP(07) CHAR(6),  /* DEVICE TYPES */     /*FIX030*/
            2  DEVC_NCPV(07) FIXED BIN(15), /* CYL(S)/VOLUME*//*FIX030*/
            2  DEVC_NTPC(07) FIXED BIN(15), /* TRKS / CYL   *//*FIX030*/
            2  DEVC_DSIC(07) FIXED BIN(15), /* TOTL CYLS/VOL*//*FIX030*/
            2  DEVC_NTRK(07) FIXED BIN(15), /* TOTL TRKS/VOL*//*FIX030*/
            2  DEVC_TCAP(07) FIXED BIN(31), /* TRK CAPACITY *//*FIX030*/
            2  DEVC_UTYP(07) BIT(8);        /* UCB DEVTYP   *//*FIX030*/
         DO I = 01 TO 07; /* SCAN FOR DEVICE MATCH × */       /*FIX030*/
       DO I = 01 TO 07; /* DEVICE CHAR SEARCH - CYLS/VOL × */ /*FIX030*/
         DO I = 01 TO 07; /* SEARCH ON TRKS/CYL × */          /*FIX030*/
