         TITLE '''IEDQ10'' - 1030 TRANSLATE TABLE'
IEDQ10   CSECT
* SEPTEMBER 19, 1969
         DS    0F
         DC    A(OUT)
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F40F13FF23F3FF3F43F3FF53FF6F73F'  0
         DC    X'F83F3FF93F3F7B3F3F3F3F3F3F3F3F37'  1
         DC    X'F03F3F613FE2E33F3FE4E53FE63F3FE7'  2
         DC    X'3FE8E93F3F3F3F6B3F3F3F3F3F263F3F'  3
         DC    X'603F3FD13FD2D33F3FD4D53FD63F3FD7'  4
         DC    X'3FD8D93F3F3F3F5B3F3F3F3F3F3F3F3F'  5
         DC    X'3F50C13FC23F3FC3C43F3FC53FC6C73F'  6
         DC    X'C83F3FC93F3F4B3F3F3F3F3F3F3F3F07'  7
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  8
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  9
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  A
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  B
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  C
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  D
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  E
         DC    X'3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F3F'  F
OUT      EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'DF37163D237ADF7F23232323235B2323' 0
         DC    X'23232323235B23DF2323232323232323' 1
         DC    X'23232323233B3D232323232323232323' 2
         DC    X'2323DF232323231F2323232323232323' 3
         DC    X'01232323232323232323237623232323' 4
         DC    X'61232323232323232323235723232323' 5
         DC    X'40232323232323232323233723232323' 6
         DC    X'23232323232323232323231620232323' 7
         DC    X'23626467686B6D6E7073232323232323' 8
         DC    X'23434546494A4C4F5152232323232323' 9
         DC    X'23232526292A2C2F3132232323232323' A
         DC    X'23232323232323232323232323232323' B
         DC    X'23626467686B6D6E7073232323232323' C
         DC    X'23434546494A4C4F5152232323232323' D
         DC    X'23232526292A2C2F3132232323232323' E
         DC    X'15020407080B0D0E1013232323232323' F
         END
