)ATTR
 @ TYPE(OUTPUT) INTENS(LOW)
 # TYPE(OUTPUT) INTENS(HIGH)
)BODY
%------------------------------  FILE LIST -----------------------------
%Command ===>_ZCMD                                          %Scroll ====
%SEL     Data Set Name                                 Volser  Last Acti
)MODEL
_Z      @Z                                            @Z     +#Z
)INIT
 .HELP=TDSINDX1
 .CURSOR=ZCMD
 &AMT='Half'
 &ZCMD=' '
 &TSEL=' '
 &LASTACT=' '
 .ZVARS='(TSEL DSNAME VOLSER LASTA TYPE)'
)PROC
)END
