         TITLE 'IGG0CLAP - VSAM CMS DEFINE: 3RD MODULE                 *
                        '
IGG0CLAP CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLAP  75.269'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPDCDA'
         EJECT
         B     @PB00002                                            0131
IGGPDCDA DS    0H                                                  0132
         ENTRY IGGPDCDA
         DROP @15
Z003     DS    0H                                                  0134
Z003DCDA DS    0H                                                  0135
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
*   AMDSBBAS=CTGFVDCH->CTGFVAMD->CTGFLPT(1);/* SET POINTER TO AMDSB  */
         L     @10,CCACPL(,R11)                                    0142
         L     @10,CTGFVT(,@10)                                    0142
         L     @15,CTGFVDCH(,@10)                                  0142
         L     @01,CTGFVAMD(,@15)                                  0142
         L     AMDSBBAS,CTGFLPT(,@01)                              0142
*   AMDDST=ON;                      /* KEYED ORGANIZATION            */
*   AMDSDT=ON;                      /* SEQUENCE SET WITH DATA        */
*   AMDRANGE=ON;                    /* KEY RANGE TYPE                */
         OI    AMDDST(AMDSBBAS),B'10100100'                        0145
*   AMDRKP=CATRKP;                  /* RELATIVE KEY POSITION         */
         SLR   @05,@05                                             0146
         STH   @05,AMDRKP(,AMDSBBAS)                               0146
*   AMDKEYLN=CATKLN;                /* KEY LENGTH                    */
         LA    @14,44                                              0147
         STH   @14,AMDKEYLN(,AMDSBBAS)                             0147
*   AMDPCTCA=N;                     /* % FREE CI IN CA               */
         MVI   AMDPCTCA(AMDSBBAS),X'00'                            0148
*   AMDPCTCI=N;                     /* % FREE BYTES IN CI            */
         MVI   AMDPCTCI(AMDSBBAS),X'00'                            0149
*   AMDFSCA=N;                      /* NO. OF FREE CI'S PER CA       */
         STH   @05,AMDFSCA(,AMDSBBAS)                              0150
*   AMDFSCI=N;                      /* NO. OF FREE BYTES PER CI      */
         ST    @05,AMDFSCI(,AMDSBBAS)                              0151
*   AMDCINV=CATCI;                  /* CI SIZE                       */
         LA    @09,512                                             0152
         ST    @09,AMDCINV(,AMDSBBAS)                              0152
*   AMDLRECL=CATLRECL;              /* MAXIMUM RECORD SIZE           */
         LA    @08,505                                             0153
         ST    @08,AMDLRECL(,AMDSBBAS)                             0153
*/********************************************************************/
*/*             SET FIXED VALUES IN CATALOG INDEX AMDSB              */
*/********************************************************************/
*                                                                  0154
*   AMDSBBAS=CTGFVICH->CTGFVAMD->CTGFLPT(1);/* ADDR OF INDEX AMDSB   */
         L     @10,CTGFVICH(,@10)                                  0154
         L     @01,CTGFVAMD(,@10)                                  0154
         L     AMDSBBAS,CTGFLPT(,@01)                              0154
*   AMDDST=OFF;                     /* ESDS ORGANIZATION             */
*   AMDSDT=ON;                      /* SEQUENCE SET WITH DATA        */
*   AMDRANGE=ON;                    /* KEY RANGE TYPE                */
         OI    AMDSDT(AMDSBBAS),B'00100100'                        0157
         NI    AMDDST(AMDSBBAS),B'01111111'                        0157
*   AMDNEST=CATNEIX;                /* NO. ENTRIES IN INDEX SECTION  */
         MVC   AMDNEST(2,AMDSBBAS),@CH00544                        0158
*   AMDRKP=CATRKP;                  /* RELATIVE KEY POSITION         */
         STH   @05,AMDRKP(,AMDSBBAS)                               0159
*   AMDKEYLN=CATKLN;                /* KEY LENGTH                    */
         STH   @14,AMDKEYLN(,AMDSBBAS)                             0160
*   AMDCINV=CATCI;                  /* CI SIZE                       */
         ST    @09,AMDCINV(,AMDSBBAS)                              0161
*   AMDLRECL=CATLRECL;              /* MAXIMUM RECORD SIZE           */
         ST    @08,AMDLRECL(,AMDSBBAS)                             0162
*/********************************************************************/
*/*     SET FIXED CATALOG DATA SET ATTRIBUTES - SET DATA VALUES      */
*/********************************************************************/
*                                                                  0163
*   CTGFVDCH->CTGFVATR->CTGFLPT(1)->CTGDSREU=OFF;/* NOT REUSABLE     */
         L     @05,CTGFVATR(,@15)                                  0163
         L     @05,CTGFLPT(,@05)                                   0163
         NI    CTGDSREU(@05),B'11011111'                           0163
*   CTGFVDCH->CTGFVATR->CTGFLPT(1)->CTGDSISH=CRRGOPT3;/* SHARE       */
         NI    CTGDSISH(@05),B'10111111'                           0164
         OI    CTGDSISH(@05),B'10000000'                           0164
*   CTGFVDCH->CTGFVATR->CTGFLPT(1)->CTGDSSSH=CRSYOPT3;/* SHARE       */
         NI    CTGDSSSH(@05),B'11101111'                           0165
         OI    CTGDSSSH(@05),B'00100000'                           0165
*   CTGFVDCH->CTGFVATR->CTGFLPT(1)->CTGDSSPD=OFF;/* RECOVERY         */
         NI    CTGDSSPD(@05),B'01111111'                           0166
*/********************************************************************/
*/*     SET FIXED CATALOG DATA SET ATTRIBUTES - SET INDEX VALUES     */
*/********************************************************************/
*                                                                  0167
*   CTGFVICH->CTGFVATR->CTGFLPT(1)->CTGDSREU=OFF;/* NOT REUSABLE     */
         L     @10,CTGFVATR(,@10)                                  0167
         L     @10,CTGFLPT(,@10)                                   0167
         NI    CTGDSREU(@10),B'11011111'                           0167
*   CTGFVICH->CTGFVATR->CTGFLPT(1)->CTGDSISH=CRRGOPT3;/* SHARE       */
         NI    CTGDSISH(@10),B'10111111'                           0168
         OI    CTGDSISH(@10),B'10000000'                           0168
*   CTGFVICH->CTGFVATR->CTGFLPT(1)->CTGDSSSH=CRSYOPT3;/* SHARE       */
         NI    CTGDSSSH(@10),B'11101111'                           0169
         OI    CTGDSSSH(@10),B'00100000'                           0169
*   CTGFVICH->CTGFVATR->CTGFLPT(1)->CTGDSSPD=OFF;/* RECOVERY         */
         NI    CTGDSSPD(@10),B'01111111'                           0170
*   IF CCACD1=RCS THEN              /* NO ERRORS SO FAR              */
         CLI   CCACD1(R11),0                                       0171
         BNE   @RF00171                                            0171
*Z004DCVS:                                                         0172
*     CALL IGGPDCVS;                /* DEFINE CATALOG VOL SER LISTS  */
Z004DCVS BAL   @14,IGGPDCVS                                        0172
*   ELSE                                                           0173
*     ;                             /* ERROR OCCURRED - DO NOTHING   */
@RF00171 DS    0H                                                  0174
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0174
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDCVS');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDCVS'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0177
@EF00002 DS    0H                                                  0177
@ER00002 BR    @14                                                 0177
@PB00002 DS    0H                                                  0178
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0179
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDCVS  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0179
*IGGPDCVS:                                                         0179
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00003                                            0179
IGGPDCVS DS    0H                                                  0180
*Z005:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z005DCVS:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0180
*    (R5,                                                          0180
*     R6,                                                          0180
*     R7,                                                          0180
*     R8,                                                          0180
*     R9,                                                          0180
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z005     DS    0H                                                  0180
Z005DCVS DS    0H                                                  0181
*   RFY                                                            0181
*    (R2,                                                          0181
*     R3,                                                          0181
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   DCL                                                            0182
*     MINCASZ FIXED(31) CONSTANT(3);/* MIN CA SIZE (TRK/CA) FOR    0182
*                                      CATALOG               @ZA05929*/
*/********************************************************************/
*/*     DEFINE CATALOG VOLUME SERIAL LISTS.  ALL ARE PRESENT AT      */
*/*     THIS POINT.  ALL LISTS ARE LIMITED TO ONE ENTRY WHICH IS     */
*/*     THE SAME.                                                    */
*/********************************************************************/
*                                                                  0183
*   IF CTGFVDCH->CTGFVVLT->LTLENGTH=CATVSLLN/* CHECK DATA VOLUME   0183
*                                      VOLSER LENGTH                 */
*       &CTGFVICH->CTGFVVLT->LTLENGTH=CATVSLLN/* CHECK INDEX VOLUME
*                                      VOLSER LENGTH                 */
*       &CTGFVVCH->CTGFVVLT->LTLENGTH=CATVSLLN/* CHECK SPACE VOLUME
*                                      VOLSER LENGTH                 */
*       &CTGFVVCH->CTGFVVLT->LTVOLSER(1)=/* COMPARE VOLSER OF SPACE
*                                      VOLUME WITH DATA VOLUME       */
*       CTGFVDCH->CTGFVVLT->LTVOLSER(1)&CTGFVVCH->CTGFVVLT->LTVOLSER(1)
*       =                           /* COMPARE VOLSER OF SPACE VOLUME
*                                      WITH INDEX VOLUME             */
*       CTGFVICH->CTGFVVLT->LTVOLSER(1) THEN/* COMPARE VOLSER'S      */
         LA    @10,8                                               0183
         L     @05,CCACPL(,R11)                                    0183
         L     @05,CTGFVT(,@05)                                    0183
         L     @01,CTGFVDCH(,@05)                                  0183
         L     @15,CTGFVVLT(,@01)                                  0183
         CH    @10,LTLENGTH(,@15)                                  0183
         BNE   @RF00183                                            0183
         L     @01,CTGFVICH(,@05)                                  0183
         L     @14,CTGFVVLT(,@01)                                  0183
         CH    @10,LTLENGTH(,@14)                                  0183
         BNE   @RF00183                                            0183
         L     @05,CTGFVVCH(,@05)                                  0183
         L     @09,CTGFVVLT(,@05)                                  0183
         CH    @10,LTLENGTH(,@09)                                  0183
         BNE   @RF00183                                            0183
         CLC   LTVOLSER(6,@09),LTVOLSER(@15)                       0183
         BNE   @RF00183                                            0183
         CLC   LTVOLSER(6,@09),LTVOLSER(@14)                       0183
         BNE   @RF00183                                            0183
*     DO;                           /* VOLSER'S MATCH, SO GET DEVICE
*                                      CHARACTERISTICS               */
*       RFY                                                        0185
*         DEVCHARS BASED(ADDR(CMWASTOR));/* ESTABLISH ADDRESSABLITY
*                                      OF WORKAREA                   */
*       DDNAMELC=CTGFVVCH->CTGFVIND;/* GET ADDRESS OF DDNAME FROM  0186
*                                      SPACE FVT                     */
         L     DDNAMELC,CTGFVIND(,@05)                             0186
*       DEVTYPEA=ADDR(DEVCHARS);    /* SET ADDRESS OF RETURN AREA FOR
*                                      DEVICE CHARACTERISTICS        */
         LA    DEVTYPEA,132                                        0187
         AL    DEVTYPEA,CCACMSWA(,R11)                             0187
*       RFY                                                        0188
*         R15 RSTD;                                                0188
*       GEN REFS(DDNAMELC,DEVTYPEA)                                0189
*           (DEVTYPE (DDNAMELC),(DEVTYPEA),DEVTAB);                0189
         DEVTYPE (DDNAMELC),(DEVTYPEA),DEVTAB
*       IF R15^=N THEN              /* DEVTYPE ERROR ENCOUNTERED     */
*                                                                  0190
         LTR   R15,R15                                             0190
         BZ    @RF00190                                            0190
*         /***********************************************************/
*         /*                                                         */
*         /* SET CCAMODID='AP', CCAREASN=RSN8, CCARETRN=RCINDER      */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0191
*         CCAPROB=IGGSEGID+(RSN8*K256)+RCINDER;/* ECD:             0191
*                                      MISSING/INVALID DD STMT. RCD:
*                                      INVALID DEVICE TYPE.  @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF03501                             0191
*       ELSE                        /* NO DEVTYPE ERROR OCCURRED     */
*         DO;                       /* PROCESS DEVICE CHARACTERISTICS*/
         B     @RC00190                                            0192
@RF00190 DS    0H                                                  0193
*           RFY                                                    0193
*             R15 UNRSTD;                                          0193
*                                                                  0193
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK VALIDITY OF DEVICE CLASS                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0194
*           IF RTCLSTYP(1:1)^=DADEVCLS THEN/* NOT DA DEVICE   @XM4334*/
*                                                                  0194
         L     @10,CCACMSWA(,R11)                                  0194
         CLI   RTCLSTYP+132(@10),32                                0194
         BE    @RF00194                                            0194
*             /*******************************************************/
*             /*                                                     */
*             /* SET CCAMODID='AP', CCAREASN=RSN2, CCARETRN=RCINVDTY */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0195
*             CCAPROB=IGGSEGID+(RSN2*K256)+RCINVDTY;/* ECD: INVALID
*                                      DEVICE TYPE. RCD: UNSUPPORTED
*                                      DEVICE TYPE.          @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF03503                             0195
*           ELSE                                                   0196
*             ;                     /* DEVICE IS DIR ACC      @XM4334*/
@RF00194 DS    0H                                                  0197
*           IF CCACD1=RCS THEN      /* NO ERROR SO FAR        @XM4334*/
         CLI   CCACD1(R11),0                                       0197
         BNE   @RF00197                                            0197
*             DO;                   /* CONTINUE PROCESSING    @XM4334*/
*               RTDEVUCB(2)=RTDEVUCB(2)&SYSMASK1;/* TURN OFF SYSTEM
*                                      BITS                  @Y30SSDW*/
         LA    @10,132                                             0199
         AL    @10,CCACMSWA(,R11)                                  0199
         NI    RTDEVUCB+1(@10),X'DC'                               0199
*               IF RTCLSTYP=D3340 THEN/* CHECK FOR 3340 DEV  @YM07013*/
         CLC   RTCLSTYP(2,@10),@CB03391                            0200
         BNE   @RF00200                                            0200
*                 RTDEVUCB(2)=RTDEVUCB(2)&SYSMASK2;/* TURN OFF RPS 0201
*                                      BIT                   @Y30SSDW*/
         NI    RTDEVUCB+1(@10),X'EF'                               0201
*               ELSE                                               0202
*                 ;                 /* NOT 3340 DEVICE       @YM07013*/
*                                                                  0202
@RF00200 DS    0H                                                  0203
*               /*****************************************************/
*               /*                                                   */
*               /* SET UP SPACE ATTRIBUTES IN WORKAREA       @XM01568*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0203
*               CMPHYBLK(1)=CATCI;  /* PHYSICAL BLK = DATA CI SIZE 0203
*                                                              Y02020*/
         LA    @10,512                                             0203
         L     @05,CCACMSWA(,R11)                                  0203
         ST    @10,CMPHYBLK(,@05)                                  0203
*               CMSWADTY(1)=RTDEVUCB;/* DEVICE TYPE - DATA     Y02020*/
         LA    @15,132                                             0204
         ALR   @15,@05                                             0204
         L     @14,RTDEVUCB(,@15)                                  0204
         ST    @14,CMSWADTY(,@05)                                  0204
*               CMTRKCYL(1)=RTNOTRKS;/* TRACKS PER CYLINDER - DATA 0205
*                                                              Y02020*/
         LH    @09,RTNOTRKS(,@15)                                  0205
         STH   @09,CMTRKCYL(,@05)                                  0205
*               CMPHYBLK(2)=CATCI;  /* PHYSICAL BLK = INDEX CI SIZE
*                                                              Y02020*/
         ST    @10,CMPHYBLK+16(,@05)                               0206
*               CMSWADTY(2)=RTDEVUCB;/* DEVICE TYPE - INDEX    Y02020*/
         ST    @14,CMSWADTY+16(,@05)                               0207
*               CMTRKCYL(2)=RTNOTRKS;/* TRACKS PER CYLINDER - INDEX
*                                                              Y02020*/
*                                                                  0208
         STH   @09,CMTRKCYL+16(,@05)                               0208
*               /*****************************************************/
*               /*                                                   */
*               /* SET DEVICE DEPENDENT VALUES                       */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0209
*               IF RTKABFLG=ON THEN /* USE BLOCK OVERHEAD      Y02020*/
         TM    RTKABFLG(@15),B'00001000'                           0209
         BNO   @RF00209                                            0209
*                 CMBLKTRK(1)=RTTRKSIZ/(((CMPHYBLK(1)*RTTOLFCT)/CATCI)+
*                     RTBOKAB-RTBONK);/* COMPUTE BLOCKS/TRACK  Y02020*/
         LH    @01,RTTOLFCT(,@15)                                  0210
         M     @00,CMPHYBLK(,@05)                                  0210
         SRL   @01,9                                               0210
         SLR   @10,@10                                             0210
         ICM   @10,3,RTBOKAB(@15)                                  0210
         ALR   @01,@10                                             0210
         SLR   @10,@10                                             0210
         IC    @10,RTBONK(,@15)                                    0210
         SLR   @01,@10                                             0210
         LH    @06,RTTRKSIZ(,@15)                                  0210
         SRDA  @06,32                                              0210
         DR    @06,@01                                             0210
         STH   @07,CMBLKTRK(,@05)                                  0210
*               ELSE                /* DO NOT USE BLOCK OVERHEAD     */
*                 CMBLKTRK(1)=((RTTRKSIZ-(CMPHYBLK(1)+RTBOKLB-RTBONK))/
*                     (((CMPHYBLK(1)*RTTOLFCT)/CATCI)+RTBOKNLB-RTBONK))
*                     +INCR1;       /* COMPUTE BLOCKS PER TRACK      */
         B     @RC00209                                            0211
@RF00209 L     @10,CCACMSWA(,R11)                                  0211
         LA    @05,132                                             0211
         ALR   @05,@10                                             0211
         L     @15,CMPHYBLK(,@10)                                  0211
         SLR   @14,@14                                             0211
         IC    @14,RTBOKLB(,@05)                                   0211
         ALR   @14,@15                                             0211
         SLR   @09,@09                                             0211
         IC    @09,RTBONK(,@05)                                    0211
         SLR   @14,@09                                             0211
         LCR   @14,@14                                             0211
         LH    @08,RTTRKSIZ(,@05)                                  0211
         ALR   @14,@08                                             0211
         ST    @14,@TF00001                                        0211
         LH    @08,RTTOLFCT(,@05)                                  0211
         MR    @14,@08                                             0211
         SRL   @15,9                                               0211
         SLR   @14,@14                                             0211
         IC    @14,RTBOKNLB(,@05)                                  0211
         ALR   @15,@14                                             0211
         SLR   @15,@09                                             0211
         L     @01,@TF00001                                        0211
         SLR   @00,@00                                             0211
         DR    @00,@15                                             0211
         AL    @01,@CF00037                                        0211
         STH   @01,CMBLKTRK(,@10)                                  0211
*               CMBLKTRK(2)=CMBLKTRK(1);/* SET INDEX BLOCKS/TRACK    */
*                                                                  0212
@RC00209 L     @10,CCACMSWA(,R11)                                  0212
         MVC   CMBLKTRK+16(2,@10),CMBLKTRK(@10)                    0212
*               /*****************************************************/
*               /*                                                   */
*               /* CALCULATE TRACKS PER CA (BLK/TRK = CI/TRK CATALOG)*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0213
*               CMTRKPCA(1)=(CATMCICA/CMBLKTRK(1))+INCR1;/* ONE ADDED
*                                      FOR SEQUENCE SET WITH DATA    */
         LA    @00,49                                              0213
         SRDA  @00,32                                              0213
         LH    @05,CMBLKTRK(,@10)                                  0213
         DR    @00,@05                                             0213
         AH    @01,@CH00037                                        0213
         STH   @01,CMTRKPCA(,@10)                                  0213
*               IF CMTRKPCA(1)<MINCASZ THEN/* IF BELOW       @ZA05929
*                                      MIN CA SIZE           @ZA05929*/
         LA    @05,3                                               0214
         CR    @01,@05                                             0214
         BNL   @RF00214                                            0214
*                 CMTRKPCA(1)=MINCASZ;/* UP TO MINIMUM       @ZA05929*/
         STH   @05,CMTRKPCA(,@10)                                  0215
*               ELSE                                               0216
*                 ;                 /* NOT BELOW MIN         @ZA05929*/
@RF00214 DS    0H                                                  0217
*               CMTRKPCA(2)=INCR1;  /* FOR SEQUENCE SET              */
*                                                                  0217
         L     @10,CCACMSWA(,R11)                                  0217
         MVC   CMTRKPCA+16(2,@10),@CH00037                         0217
*               /*****************************************************/
*               /*                                                   */
*               /* SET VALUES IN AMDSB'S                             */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0218
*               CTGFVDCH->CTGFVAMD->CTGFLPT(1)->AMDCIPCA=CMBLKTRK(1)*(
*                   CMTRKPCA(1)-INCR1);/* (BLK/TRK * TRK/CA) -1    0218
*                                      EQUALS CI/CA FOR CATALOG DATA
*                                      AMDSB. -1 REDUCES FOR SEQUENCE
*                                      SET WITH DATA                 */
         L     @05,CCACPL(,R11)                                    0218
         L     @05,CTGFVT(,@05)                                    0218
         L     @01,CTGFVDCH(,@05)                                  0218
         L     @01,CTGFVAMD(,@01)                                  0218
         L     @01,CTGFLPT(,@01)                                   0218
         LH    @00,CMTRKPCA(,@10)                                  0218
         BCTR  @00,0                                               0218
         MH    @00,CMBLKTRK(,@10)                                  0218
         STH   @00,AMDCIPCA(,@01)                                  0218
*               CTGFVICH->CTGFVAMD->CTGFLPT(1)->AMDCIPCA=CMBLKTRK(2);
         L     @05,CTGFVICH(,@05)                                  0219
         L     @05,CTGFVAMD(,@05)                                  0219
         L     @05,CTGFLPT(,@05)                                   0219
         MVC   AMDCIPCA(2,@05),CMBLKTRK+16(@10)                    0219
*                                   /* SET BLOCKS/TRACK FOR INDEX  0220
*                                      INSTEAD OF CI/CA              */
*             END;                  /* END 'DO' FOR NO ERRORS        */
*           ELSE                                                   0221
*             ;                     /* ERROR ENCOUNTERED             */
@RF00197 DS    0H                                                  0222
*         END;                      /* END PROCESSING FOR NO DEVTYPE
*                                      ERROR                         */
*     END;                          /* END 'DO' FOR MATCHED VOLSERS  */
*   ELSE                            /* VOLSER'S DO NOT MATCH         */
*                                                                  0224
*     /***************************************************************/
*     /*                                                             */
*     /* SET CCAMODID='AP', CCAREASN=RSN22, CCARETRN=RCINCNPM        */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0224
*     CCAPROB=IGGSEGID+(RSN22*K256)+RCINCNPM;/* ECD: INCONSISTENT  0224
*                                      PARM LIST. RCD: INCONSISTENT
*                                      VOLUME SERIAL LISTS.  @Y30SSDW*/
         B     @RC00183                                            0224
@RF00183 MVC   CCAPROB(4,R11),@CF03506                             0224
*   IF CCACD1=RCS THEN              /* NO ERRORS SO FAR              */
@RC00183 CLI   CCACD1(R11),0                                       0225
         BNE   @RF00225                                            0225
*Z009DCSP:                                                         0226
*     CALL IGGPDCSP;                /* DEFINE CATLG SPACE PARMAMETERS*/
Z009DCSP BAL   @14,IGGPDCSP                                        0226
*   ELSE                                                           0227
*     ;                             /* ERROR OCCURRED                */
@RF00225 DS    0H                                                  0228
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0228
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDCSP');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDCSP'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00003 DS    0H                                                  0231
@EF00003 DS    0H                                                  0231
@ER00003 BR    @14                                                 0231
@PB00003 DS    0H                                                  0232
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0233
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDCSP  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0233
*IGGPDCSP:                                                         0233
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00004                                            0233
IGGPDCSP DS    0H                                                  0234
*Z010:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z010DCSP:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0234
*    (R5,                                                          0234
*     R6,                                                          0234
*     R7,                                                          0234
*     R8,                                                          0234
*     R9,                                                          0234
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z010     DS    0H                                                  0234
Z010DCSP DS    0H                                                  0235
*   RFY                                                            0235
*    (R2,                                                          0235
*     R3,                                                          0235
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*/********************************************************************/
*/*    DEFINE CATALOG SPACE PARAMETERS PROCESSING:  FOR CATALOG      */
*/*    DEFINE, ONE SET OF PARAMETERS IS TO BE ATTACHED TO THE        */
*/*    CLUSTER FOR THE ENTIRE CATALOG AND IS TO BE IN NUMBER OF      */
*/*    TRACKS.                                                       */
*/********************************************************************/
*                                                                  0236
*   IF CCACD1=RCS THEN              /* NO ERRORS SO FAR              */
         CLI   CCACD1(R11),0                                       0236
         BNE   @RF00236                                            0236
*     DO;                           /* PROCESS SPACE PARAMETERS      */
*       IF CTGFVSPC^=N THEN         /* SPACE PARMS ADDRESS EXISTS    */
         L     @10,CCACPL(,R11)                                    0238
         L     @10,CTGFVT(,@10)                                    0238
         L     @10,CTGFVSPC(,@10)                                  0238
         LTR   @10,@10                                             0238
         BZ    @RF00238                                            0238
*         DO;                       /* CONVERT VALUES TO TRACKS      */
*           SPCPMBAS=CTGFVSPC->CTGFLPT(1);/* ADDR OF SPACE PARM      */
         L     SPCPMBAS,CTGFLPT(,@10)                              0240
*Z011DCON:                                                         0241
*           CALL IGGPDCON;          /* CONVERT SPACE PARMS TO TRACKS */
Z011DCON BAL   @14,IGGPDCON                                        0241
*         END;                      /* END 'DO' FOR TRACKS CONVERSION*/
*       ELSE                        /* SPACE PARMS ARE NOT GIVEN     */
*         DO;                       /* SET DEFAULT ALLOCATION VALUES */
         B     @RC00238                                            0243
@RF00238 DS    0H                                                  0244
*           SPCPMBAS=CTGFVDCH->CTGFVSPC->CTGFLPT(1);/* SET ADDRESS OF
*                                      SPACE PARAMETERS              */
         L     @10,CCACPL(,R11)                                    0244
         L     @10,CTGFVT(,@10)                                    0244
         L     @10,CTGFVDCH(,@10)                                  0244
         L     @10,CTGFVSPC(,@10)                                  0244
         L     SPCPMBAS,CTGFLPT(,@10)                              0244
*Z012DCON:                                                         0245
*           CALL IGGPDCON;          /* CONVERT SPACE PARMS TO TRACKS */
Z012DCON BAL   @14,IGGPDCON                                        0245
*           IF CCACD1=RCS THEN      /* NO ERRORS SO FAR              */
         CLI   CCACD1(R11),0                                       0246
         BNE   @RF00246                                            0246
*             DO;                   /* PROCESS INDEX SPACE PARM      */
*               CTGFVSPC=CTGFVDCH->CTGFVSPC;/* ATTACH DATA FPL TO  0248
*                                      CLUSTER FVT                   */
         L     @10,CCACPL(,R11)                                    0248
         L     @10,CTGFVT(,@10)                                    0248
         L     @05,CTGFVDCH(,@10)                                  0248
         MVC   CTGFVSPC(4,@10),CTGFVSPC(@05)                       0248
*               IF CTGFVICH->CTGFVSPC^=N THEN/* SPACE PARMS GIVEN    */
         L     @10,CTGFVICH(,@10)                                  0249
         L     @10,CTGFVSPC(,@10)                                  0249
         LTR   @10,@10                                             0249
         BZ    @RF00249                                            0249
*                 DO;               /* PROCESS GIVEN SPACE PARMS     */
*                   SPCPMBAS=CTGFVICH->CTGFVSPC->CTGFLPT(1);/* SET 0251
*                                      ADDRESS OF SPACE PARAMETERS   */
         L     SPCPMBAS,CTGFLPT(,@10)                              0251
*Z013DCON:                                                         0252
*                   CALL IGGPDCON;  /* CONVERT SPACE PARMS TO TRACKS */
Z013DCON BAL   @14,IGGPDCON                                        0252
*                   IF CCACD1=RCS THEN/* NO ERRORS SO FAR            */
         CLI   CCACD1(R11),0                                       0253
         BNE   @RF00253                                            0253
*                     CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=/* INCREMENT  0254
*                                      PRIMARY DATA SPACE QUANTITY BY
*                                      PRIMARY INDEX SPACE QUANTITY  */
*                         CTGFVSPC->CTGFLPT(1)->SPCPRIMQ+CTGFVICH->
*                         CTGFVSPC->CTGFLPT(1)->SPCPRIMQ;          0254
         L     @10,CCACPL(,R11)                                    0254
         L     @10,CTGFVT(,@10)                                    0254
         L     @05,CTGFVSPC(,@10)                                  0254
         L     @05,CTGFLPT(,@05)                                   0254
         L     @10,CTGFVICH(,@10)                                  0254
         L     @10,CTGFVSPC(,@10)                                  0254
         L     @10,CTGFLPT(,@10)                                   0254
         SLR   @15,@15                                             0254
         ICM   @15,7,SPCPRIMQ(@05)                                 0254
         SLR   @14,@14                                             0254
         ICM   @14,7,SPCPRIMQ(@10)                                 0254
         ALR   @15,@14                                             0254
         STCM  @15,7,SPCPRIMQ(@05)                                 0254
*                   ELSE                                           0255
*                     ;             /* ERROR OCCURRED IN IGGPDCON    */
@RF00253 DS    0H                                                  0256
*                 END;              /* END 'DO' FOR GIVEN SPACE PARMS*/
*               ELSE                /* SPACE PARMS NOT PROVIDED      */
*                 DO;                                              0257
*                                                                  0257
         B     @RC00249                                            0257
@RF00249 DS    0H                                                  0258
*                   /*************************************************/
*                   /*                                               */
*                   /* INCREASE SPACE REQUEST BY AN AMOUNT FOR INDEX.*/
*                   /* HIGH KEYRANGE AND HIGH INDEX LEVELS ADD       */
*                   /* SEQUENCE SET REQUIREMENT.                     */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0258
*                   CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=CTGFVSPC->CTGFLPT(1)
*                       ->SPCPRIMQ+(CTGFVSPC->CTGFLPT(1)->SPCPRIMQ/(
*                       CMTRKPCA(1)-INCR1));/*               @YM07313*/
*                                                                  0258
         L     @10,CCACPL(,R11)                                    0258
         L     @10,CTGFVT(,@10)                                    0258
         L     @10,CTGFVSPC(,@10)                                  0258
         L     @10,CTGFLPT(,@10)                                   0258
         SLR   @05,@05                                             0258
         ICM   @05,7,SPCPRIMQ(@10)                                 0258
         L     @15,CCACMSWA(,R11)                                  0258
         LH    @14,CMTRKPCA(,@15)                                  0258
         LR    @09,@14                                             0258
         BCTR  @09,0                                               0258
         LR    @01,@05                                             0258
         SLR   @00,@00                                             0258
         DR    @00,@09                                             0258
         ALR   @05,@01                                             0258
         STCM  @05,7,SPCPRIMQ(@10)                                 0258
*                   /*************************************************/
*                   /*                                               */
*                   /* ADD HIGH KEY RANGE REQUIREMENT                */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0259
*                   CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=CTGFVSPC->CTGFLPT(1)
*                       ->SPCPRIMQ+CTGFVSPC->CTGFLPT(1)->SPCPRIMQ/NINE;
*                                                                  0259
         LR    @01,@05                                             0259
         SLR   @00,@00                                             0259
         D     @00,@CF02727                                        0259
         ALR   @05,@01                                             0259
         STCM  @05,7,SPCPRIMQ(@10)                                 0259
*                   /*************************************************/
*                   /*                                               */
*                   /* ADD HIGH INDEX LEVEL REQUIREMENT              */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0260
*                   CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=CTGFVSPC->CTGFLPT(1)
*                       ->SPCPRIMQ+((CTGFVSPC->CTGFLPT(1)->SPCPRIMQ/
*                       CMTRKPCA(1))/(CMBLKTRK(1)*(CMTRKPCA(1)-INCR1)))
*                       /CMBLKTRK(1);                              0260
         LR    @01,@05                                             0260
         SLR   @00,@00                                             0260
         DR    @00,@14                                             0260
         LH    @08,CMBLKTRK(,@15)                                  0260
         LR    @07,@09                                             0260
         MR    @06,@08                                             0260
         LR    @14,@01                                             0260
         SRDA  @14,32                                              0260
         DR    @14,@07                                             0260
         LR    @00,@15                                             0260
         SRDA  @00,32                                              0260
         DR    @00,@08                                             0260
         ALR   @05,@01                                             0260
         STCM  @05,7,SPCPRIMQ(@10)                                 0260
*                 END;              /* END PROCESSING FOR GIVEN SPACE
*                                      PARAMETERS                    */
*             END;                  /* END 'DO' FOR NO ERRORS        */
*           ELSE                                                   0263
*             ;                     /* ERROR ENCOUNTERED IN IGGPDCON */
@RF00246 DS    0H                                                  0264
*         END;                      /* END 'DO' FOR NO SPACE PARMS   */
*                                                                  0264
@RC00246 DS    0H                                                  0265
*       /*************************************************************/
*       /*                                                           */
*       /* ROUND SPACE PARAMETERS DOWN TO THE NEXT MULTIPLE OF THE CA*/
*       /* SIZE, INCLUDING ONE TRACK FOR THE SEQUENCE SET.           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0265
*       IF CCACD1=RCS THEN          /* SUCCESSFUL SO FAR             */
@RC00238 CLI   CCACD1(R11),0                                       0265
         BNE   @RF00265                                            0265
*         DO;                                                      0266
*           CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=CTGFVSPC->CTGFLPT(1)->  0267
*               SPCPRIMQ-(CTGFVSPC->CTGFLPT(1)->SPCPRIMQ//CMTRKPCA(1));
         L     @10,CCACPL(,R11)                                    0267
         L     @10,CTGFVT(,@10)                                    0267
         L     @10,CTGFVSPC(,@10)                                  0267
         L     @10,CTGFLPT(,@10)                                   0267
         SLR   @05,@05                                             0267
         ICM   @05,7,SPCPRIMQ(@10)                                 0267
         L     @01,CCACMSWA(,R11)                                  0267
         LH    @15,CMTRKPCA(,@01)                                  0267
         LR    @00,@05                                             0267
         SRDA  @00,32                                              0267
         DR    @00,@15                                             0267
         SLR   @05,@00                                             0267
         STCM  @05,7,SPCPRIMQ(@10)                                 0267
*           IF CTGFVSPC->CTGFLPT(1)->SPCPRIMQ/* CHECK PRIMARY      0268
*                                      QUANTITY                      */
*               <CMTRKPCA(1)*THREE THEN/* PRIMARY SPACE QUANTITY LESS
*                                      THAN MINIMUM VALUE OF THREE 0268
*                                      CA'S                          */
         MH    @15,@CH00414                                        0268
         CR    @05,@15                                             0268
         BNL   @RF00268                                            0268
*             CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=CMTRKPCA(1)*THREE;    0269
         STCM  @15,7,SPCPRIMQ(@10)                                 0269
*           ELSE                                                   0270
*             ;                     /* PRIMARY QUANTITY >= 3 CA'S    */
@RF00268 DS    0H                                                  0271
*           IF CTGFVSPC->CTGFLPT(1)->SPCSECDQ^=N THEN/* SECONDARY  0271
*                                      ALLOCATION QUANTITY NOT     0271
*                                      OMITTED                       */
         L     @10,CCACPL(,R11)                                    0271
         L     @10,CTGFVT(,@10)                                    0271
         L     @10,CTGFVSPC(,@10)                                  0271
         L     @10,CTGFLPT(,@10)                                   0271
         SLR   @05,@05                                             0271
         ICM   @05,7,SPCSECDQ(@10)                                 0271
         LTR   @05,@05                                             0271
         BZ    @RF00271                                            0271
*             DO;                                                  0272
*               IF CTGFVSPC->CTGFLPT(1)->SPCSECDQ<CMTRKPCA(1) THEN/*
*                                      SECONDARY SPACE QUANTITY LESS
*                                      THAN MINIMUM VALUE OF ONE CA  */
         L     @01,CCACMSWA(,R11)                                  0273
         LH    @15,CMTRKPCA(,@01)                                  0273
         CR    @05,@15                                             0273
         BNL   @RF00273                                            0273
*                 CTGFVSPC->CTGFLPT(1)->SPCSECDQ=CMTRKPCA(1);      0274
         STCM  @15,7,SPCSECDQ(@10)                                 0274
*               ELSE                                               0275
*                 ;                 /* PRIMARY QUANTITY >= ONE CA    */
@RF00273 DS    0H                                                  0276
*               CTGFVSPC->CTGFLPT(1)->SPCSECDQ=/* SET SECONDARY    0276
*                                      QUANTITY REQUIRED             */
*                   CTGFVSPC->CTGFLPT(1)->SPCSECDQ-(CTGFVSPC->CTGFLPT(1
*                   )->SPCSECDQ//CMTRKPCA(1));                     0276
         L     @10,CCACPL(,R11)                                    0276
         L     @10,CTGFVT(,@10)                                    0276
         L     @10,CTGFVSPC(,@10)                                  0276
         L     @10,CTGFLPT(,@10)                                   0276
         SLR   @05,@05                                             0276
         ICM   @05,7,SPCSECDQ(@10)                                 0276
         L     @01,CCACMSWA(,R11)                                  0276
         LR    @06,@05                                             0276
         SRDA  @06,32                                              0276
         LH    @15,CMTRKPCA(,@01)                                  0276
         DR    @06,@15                                             0276
         SLR   @05,@06                                             0276
         STCM  @05,7,SPCSECDQ(@10)                                 0276
*             END;                  /* END 'DO' FOR GIVEN SEC QUANT  */
*         END;                      /* END 'DO' FOR NO ERRORS        */
*       ELSE                                                       0279
*         ;                         /* ERROR ENCOUNTERED             */
@RF00265 DS    0H                                                  0280
*     END;                          /* END 'DO' FOR NO ERRORS        */
*   ELSE                                                           0281
*     ;                             /* ERROR ENCOUNTERED             */
*                                                                  0281
@RF00236 DS    0H                                                  0282
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK THESE DATA SPACE PARAMETERS AGAINST CATALOG SPACE NEEDS.*/
*   /* CHECK PRIMARY ALLOCATION SIZE ONLY.                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0282
*   IF CCACD1=RCS THEN              /* SUCCESSFUL SO FAR             */
@RC00236 CLI   CCACD1(R11),0                                       0282
         BNE   @RF00282                                            0282
*     IF CTGFVVCH->CTGFVSPC->CTGFLPT(1)->SPCRQTYP=CMSALTRK THEN/*  0283
*                                      REQUEST IS FOR TRACKS         */
         L     @10,CCACPL(,R11)                                    0283
         L     @10,CTGFVT(,@10)                                    0283
         L     @05,CTGFVVCH(,@10)                                  0283
         L     @05,CTGFVSPC(,@05)                                  0283
         L     @05,CTGFLPT(,@05)                                   0283
         TM    SPCRQTYP(@05),B'10000000'                           0283
         BNO   @RF00283                                            0283
         TM    SPCRQTYP(@05),B'01000000'                           0283
         BNZ   @RF00283                                            0283
*       IF CTGFVSPC->CTGFLPT(1)->SPCPRIMQ>CTGFVVCH->CTGFVSPC->CTGFLPT(1
*           )->SPCPRIMQ THEN        /* INSUFFICIENT ALLOCATION       */
*                                                                  0284
         L     @10,CTGFVSPC(,@10)                                  0284
         L     @10,CTGFLPT(,@10)                                   0284
         CLC   SPCPRIMQ(3,@10),SPCPRIMQ(@05)                       0284
         BNH   @RF00284                                            0284
*         /***********************************************************/
*         /*                                                         */
*         /* SET CCAMODID='AP', CCAREASN=RSN24, CCARETRN=RCINCNPM    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0285
*         CCAPROB=IGGSEGID+(RSN24*K256)+RCINCNPM;/* ECD: INCONSISTENT
*                                      PARM LIST. RCD: PRIMARY     0285
*                                      ALLOCATION SIZE LESS THAN   0285
*                                      REQUIRED FOR CATALOG. @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF03509                             0285
*       ELSE                                                       0286
*         ;                         /* ALLOCATION QUANTITY SUFFICIENT*/
@RF00284 DS    0H                                                  0287
*     ELSE                          /* NOT TRACK REQUEST             */
*       IF CTGFVVCH->CTGFVSPC->CTGFLPT(1)->SPCRQTYP=CMSALCYL THEN/*
*                                      REQUEST IS FOR CYLINDERS      */
         B     @RC00283                                            0287
@RF00283 L     @10,CCACPL(,R11)                                    0287
         L     @10,CTGFVT(,@10)                                    0287
         L     @05,CTGFVVCH(,@10)                                  0287
         L     @05,CTGFVSPC(,@05)                                  0287
         L     @05,CTGFLPT(,@05)                                   0287
         TM    SPCRQTYP(@05),B'11000000'                           0287
         BNO   @RF00287                                            0287
*         IF CTGFVSPC->CTGFLPT(1)->SPCPRIMQ>CTGFVVCH->CTGFVSPC->CTGFLPT
*             (1)->SPCPRIMQ*CMTRKCYL(1) THEN/* INSUFFICIENT        0288
*                                      ALLOCATION                    */
*                                                                  0288
         L     @10,CTGFVSPC(,@10)                                  0288
         L     @10,CTGFLPT(,@10)                                   0288
         L     @01,CCACMSWA(,R11)                                  0288
         SLR   @00,@00                                             0288
         ICM   @00,7,SPCPRIMQ(@05)                                 0288
         MH    @00,CMTRKCYL(,@01)                                  0288
         SLR   @05,@05                                             0288
         ICM   @05,7,SPCPRIMQ(@10)                                 0288
         CR    @00,@05                                             0288
         BNL   @RF00288                                            0288
*           /*********************************************************/
*           /*                                                       */
*           /* SET CCAMODID='AP', CCAREASN=RSN24, CCARETRN=RCINCNPM  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0289
*           CCAPROB=IGGSEGID+(RSN24*K256)+RCINCNPM;/* ECD:         0289
*                                      INCONSISTENT PARM LIST. RCD:
*                                      PRIMARY ALLOCATION SIZE LESS
*                                      THAN REQUIRED FOR CATALOG.  0289
*                                                            @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF03509                             0289
*         ELSE                                                     0290
*           ;                       /* ALLOCATION QUANTITY SUFFICIENT*/
@RF00288 DS    0H                                                  0291
*       ELSE                        /* NOT CYLINDER REQUEST          */
*         IF CTGFVSPC->CTGFLPT(1)->SPCPRIMQ>CTGFVVCH->CTGFVSPC->CTGFLPT
*             (1)->SPCPRIMQ/CMBLKTRK(1) THEN/* INSUFFICIENT        0291
*                                      ALLOCATION                    */
*                                                                  0291
         B     @RC00287                                            0291
@RF00287 L     @10,CCACPL(,R11)                                    0291
         L     @10,CTGFVT(,@10)                                    0291
         L     @05,CTGFVSPC(,@10)                                  0291
         L     @05,CTGFLPT(,@05)                                   0291
         L     @10,CTGFVVCH(,@10)                                  0291
         L     @10,CTGFVSPC(,@10)                                  0291
         L     @10,CTGFLPT(,@10)                                   0291
         L     @01,CCACMSWA(,R11)                                  0291
         SLR   @07,@07                                             0291
         ICM   @07,7,SPCPRIMQ(@10)                                 0291
         SLR   @06,@06                                             0291
         LH    @10,CMBLKTRK(,@01)                                  0291
         DR    @06,@10                                             0291
         SLR   @10,@10                                             0291
         ICM   @10,7,SPCPRIMQ(@05)                                 0291
         CR    @07,@10                                             0291
         BNL   @RF00291                                            0291
*           /*********************************************************/
*           /*                                                       */
*           /* SET CCAMODID='AP', CCAREASN=RSN24, CCARETRN=RCINCNPM  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0292
*           CCAPROB=IGGSEGID+(RSN24*K256)+RCINCNPM;/* ECD:         0292
*                                      INCONSISTENT PARM LIST. RCD:
*                                      PRIMARY ALLOCATION SIZE LESS
*                                      THAN REQUIRED FOR CATALOG.  0292
*                                                            @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF03509                             0292
*         ELSE                                                     0293
*           ;                       /* ALLOCATION QUANTITY SUFFICIENT*/
@RF00291 DS    0H                                                  0294
*   ELSE                                                           0294
*     ;                             /* ERROR ENCOUNTERED             */
*                                                                  0294
@RF00282 DS    0H                                                  0295
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESSING TO ALLOW ONE CYLINDER FOR CRA              @Y30SSDW*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0295
*   IF CCACD1=RCS&                  /* NO ERROR SO FAR       @Y30SSDW*/
*       CTGFVDCH->CTGFVSPC=N&       /* NO DATA SPACE FPL GIVEN     0295
*                                                            @Y30SSDW*/
*       CTGFVDCH->CTGFVATR->CTGFLPT(1)->CTGDSREC=ON THEN/*         0295
*                                      RECOVERABLE CATALOG   @Y30SSDW*/
@RC00282 CLI   CCACD1(R11),0                                       0295
         BNE   @RF00295                                            0295
         L     @10,CCACPL(,R11)                                    0295
         L     @10,CTGFVT(,@10)                                    0295
         L     @05,CTGFVDCH(,@10)                                  0295
         ICM   @15,15,CTGFVSPC(@05)                                0295
         BNZ   @RF00295                                            0295
         L     @05,CTGFVATR(,@05)                                  0295
         L     @05,CTGFLPT(,@05)                                   0295
         TM    CTGDSREC(@05),B'00001000'                           0295
         BNO   @RF00295                                            0295
*     IF(THREE*CMTRKPCA(1))         /* THREE COMPONENTS, EACH ONE CA
*                                      IN SIZE               @Y30SSDW*/
*         <=((CTGFVSPC->CTGFLPT(1)->SPCPRIMQ-CMTRKCYL(1))/CMTRKPCA(1))*
*         CMTRKPCA(1) THEN          /* CATALOG SPACE MINUS 1 CYL FOR
*                                      CRA ON CA BOUNDARY    @Y30SSDW*/
         L     @05,CCACMSWA(,R11)                                  0296
         LH    @15,CMTRKPCA(,@05)                                  0296
         LR    @14,@15                                             0296
         MH    @14,@CH00414                                        0296
         L     @10,CTGFVSPC(,@10)                                  0296
         L     @10,CTGFLPT(,@10)                                   0296
         SLR   @01,@01                                             0296
         ICM   @01,7,SPCPRIMQ(@10)                                 0296
         SH    @01,CMTRKCYL(,@05)                                  0296
         LR    @06,@01                                             0296
         SRDA  @06,32                                              0296
         DR    @06,@15                                             0296
         MR    @06,@15                                             0296
         CR    @14,@07                                             0296
         BH    @RF00296                                            0296
*       CTGFVSPC->CTGFLPT(1)->SPCPRIMQ=/* CATALOG SPACE PRIMARY    0297
*                                      QUANTITY              @Y30SSDW*/
*           ((CTGFVSPC->CTGFLPT(1)->SPCPRIMQ-CMTRKCYL(1))/CMTRKPCA(1))*
*           CMTRKPCA(1);            /* ALLOW 1 CYLINDER FOR CRA ON CA
*                                      BOUNDARY              @Y30SSDW*/
         STCM  @07,7,SPCPRIMQ(@10)                                 0297
*     ELSE                          /* SPACE INSUFFICIENT    @Y30SSDW*/
*                                                                  0298
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='AP', CCAREASN=RSN24, CCARETRN=RCINCNPM      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0298
*       CCAPROB=IGGSEGID+(RSN24*K256)+RCINCNPM;/* ECD: INCONSISTENT
*                                      PARAMETER LIST. RCD: PRIMARY
*                                      ALLOCATION SIZE LESS THAN   0298
*                                      REQUIRED FOR CATALOG PLUS CRA.
*                                                            @Y30SSDW*/
         B     @RC00296                                            0298
@RF00296 MVC   CCAPROB(4,R11),@CF03509                             0298
*   ELSE                                                           0299
*     ;                             /* IGNORE CRA NEEDS      @Y30SSDW*/
@RF00295 DS    0H                                                  0300
*   IF CCACD1=RCS THEN              /* NO ERROS SO FAR               */
@RC00295 CLI   CCACD1(R11),0                                       0300
         BNE   @RF00300                                            0300
*Z018DCPC:                                                         0301
*     CALL IGGPDCPC;                /* CONSTRUCT CATALOG POINTERS    */
Z018DCPC BAL   @14,IGGPDCPC                                        0301
*   ELSE                                                           0302
*     ;                             /* ERROR ENCOUNTERED             */
@RF00300 DS    0H                                                  0303
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0303
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDCPC');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDCPC'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00004 DS    0H                                                  0306
@EF00004 DS    0H                                                  0306
@ER00004 BR    @14                                                 0306
@PB00004 DS    0H                                                  0307
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0308
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDCPC  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0308
*IGGPDCPC:                                                         0308
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00005                                            0308
IGGPDCPC DS    0H                                                  0309
*Z019:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z019DCPC:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0309
*    (R5,                                                          0309
*     R6,                                                          0309
*     R7,                                                          0309
*     R8,                                                          0309
*     R9,                                                          0309
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z019     DS    0H                                                  0309
Z019DCPC DS    0H                                                  0310
*   RFY                                                            0310
*    (R2,                                                          0310
*     R3,                                                          0310
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*/********************************************************************/
*/*               DEFINE CATALOG POINTER CONSTRUCTION                */
*/********************************************************************/
*                                                                  0311
*   IF CCACD1=RCS THEN              /* NO ERRORS SO FAR              */
         CLI   CCACD1(R11),0                                       0311
         BNE   @RF00311                                            0311
*     DO;                                                          0312
*                                                                  0312
*       /*************************************************************/
*       /*                                                           */
*       /* CONSTRUCT U TYPE ENTRY IN MASTER CATALOG AND ASSIGN CI    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0313
*       CCAASCIK=INCR1;             /* SET NO. OF CI'S REQUIRED      */
*                                                                  0313
         MVI   CCAASCIK(R11),X'01'                                 0313
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLAG                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0314
*Z020AXCI:                                                         0314
*       CALL IGGPAXCI;              /* ASSIGN CI             @YM07571*/
Z020AXCI L     @15,@CV03380                                        0314
         BALR  @14,@15                                             0314
*       IF CCACD1=RCS THEN          /* CI ASSIGNED OK                */
         CLI   CCACD1(R11),0                                       0315
         BNE   @RF00315                                            0315
*         DO;                                                      0316
*           CMUCATCI=CCAASCI(1);    /* SAVE CI NUMBER OF U ENTRY     */
         L     @10,CCACMSWA(,R11)                                  0317
         SLR   @05,@05                                             0317
         ICM   @05,7,CCAASCI(R11)                                  0317
         STCM  @05,7,CMUCATCI(@10)                                 0317
*           CCAURAB=ADDR(CCARAB2);  /* USE RAB2 FOR U ENTRY          */
         LA    @10,CCARAB2(,R11)                                   0318
         ST    @10,CCAURAB(,R11)                                   0318
*           CCARABB=ADDR(CCARAB2);  /* SET BASE RAB ADDRESS FOR USE
*                                      BY UNDO IF NECESSARY          */
         ST    @10,CCARABB(,R11)                                   0319
*           CCARABFL=CCARABFL&&CCARABFL;/* CLEAR RAB FLAG            */
*                                                                  0320
         SLR   @01,@01                                             0320
         IC    @01,CCARABFL(,@10)                                  0320
         LR    @15,@01                                             0320
         XR    @15,@01                                             0320
         STC   @15,CCARABFL(,@10)                                  0320
*           /*********************************************************/
*           /*                                                       */
*           /* CLEAR RECORD AREA                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0321
*           CATRECRD(1,1:256)=CATRECRD(1,1:256)&&CATRECRD(1,1:256);
         L     @10,CCACPE1(,@10)                                   0321
         XC    CATRECRD(256,@10),CATRECRD(@10)                     0321
*           CATRECRD(2,1:256)=CATRECRD(2,1:256)&&CATRECRD(2,1:256);
*                                                                  0322
         XC    CATRECRD+256(256,@10),CATRECRD+256(@10)             0322
*           /*********************************************************/
*           /*                                                       */
*           /* BUILD U ENTRY NON-REPEATING FIELDS                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0323
*           RCDKEYTY='00'X;         /* SET KEY TYPE                  */
         MVI   RCDKEYTY(@10),X'00'                                 0323
*           RCDCINO=CCAASCI(1);     /* SET ASSIGNED CI NUMBER        */
         STCM  @05,7,RCDCINO(@10)                                  0324
*           RCDID=CTGTUCAT;         /* SET USER CAT TYPE CODE        */
         MVI   RCDID(@10),C'U'                                     0325
*           NREPCV=UCNOVARC;        /* SET NUMBER OF VARIABLE LENGTH
*                                      FIELDS                        */
         MVI   NREPCV(@10),X'00'                                   0326
*           NREPLF=LENGTH(CATRCD)+LENGTH(CNAME);/* SET LENGTH OF   0327
*                                      FIXED FIELD AREA OF ENTRY     */
         MVI   NREPLF(@10),X'5D'                                   0327
*           CNAME=CTGFVENT->ENTRYNAM;/* SET USER CAT ENTRYNAME       */
         L     @05,CCACPL(,R11)                                    0328
         L     @05,CTGFVT(,@05)                                    0328
         L     @05,CTGFVENT(,@05)                                  0328
         MVC   CNAME(44,@10),ENTRYNAM(@05)                         0328
*           IF CAXF2REC=ON THEN     /* RECOVERABLE CATALOG   @Y30SSDW*/
         L     @05,CCAACB(,R11)                                    0329
         L     @05,ACBUAPTR(,@05)                                  0329
         TM    CAXF2REC(@05),B'00000010'                           0329
         BNO   @RF00329                                            0329
*             DO;                   /*                       @Y30SSDW*/
*               RFY                                                0331
*                 UCBOB BASED(CAXUCB);/* MAP UCB             @Y30SSDW*/
*               RCDCRAVL=UCBVOLI;   /* SET CRA VOLSER NO.    @Y30SSDW*/
         L     @05,CAXUCB(,@05)                                    0332
         MVC   RCDCRAVL(6,@10),UCBVOLI(@05)                        0332
*               RCDCRADT=UCBTYP&    /* SET CRA DEVICE TYPE   @Y30SSDW*/
*                   'FFCFFFFF'X;    /* MASK OFF SYSTEM BITS  @Y30SSDW*/
         MVC   RCDCRADT(4,@10),UCBTYP(@05)                         0333
         NC    RCDCRADT(4,@10),@CB03481                            0333
*             END;                  /* END RECOV CAT 'DO'    @Y30SSDW*/
*           ELSE                                                   0335
*             ;                     /* NOT RECOVERABLE CAT   @Y30SSDW*/
*                                                                  0335
@RF00329 DS    0H                                                  0336
*           /*********************************************************/
*           /*                                                       */
*           /* FIXED AREA OF UCAT ENTRY COMPLETE EXCEPT FOR TOTAL    */
*           /* ENTRY LENGTH VALUE. CONSTRUCT VOLUME OCCURRENCE.      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0336
*           CCACPE2=CCACPE1+LENGTH(CATRCD)+LENGTH(CNAME);/* SET    0336
*                                      ADDRESS OF GROUP OCCURENCE  0336
*                                      POINTER AREA OF UCAT ENTRY    */
         L     @10,CCAURAB(,R11)                                   0336
         L     @05,CCACPE1(,@10)                                   0336
         LA    @01,93                                              0336
         ALR   @01,@05                                             0336
         ST    @01,CCACPE2(,@10)                                   0336
*           REPCNT=UCNGOS;          /* SET NUMBER OF GROUP         0337
*                                      OCCURRENCES IN UCAT ENTRY     */
         LA    @15,1                                               0337
         STC   @15,REPCNT(,@01)                                    0337
*           CCACPE3=CCACPE2         /* SET ADDR OF FIRST GROUP OCCUR */
*               +LENGTH(REPCNTRL)+LENGTH(CATGOPT)*REPCNT;          0338
         AH    @01,@CH00051                                        0338
         MH    @15,@CH00053                                        0338
         ALR   @15,@01                                             0338
         ST    @15,CCACPE3(,@10)                                   0338
*           CCACPE4=CCACPE3;        /* SET CURRENT END OF REC ADDR   */
         ST    @15,CCACPE4(,@10)                                   0339
*           CCACPE5=CCACPE2         /* SET ADDR OF 1ST GO PTR TO USE */
*               +LENGTH(REPCNTRL);                                 0340
         ST    @01,CCACPE5(,R11)                                   0340
*           CCACPE6=CCACPE3;        /* SET ADDR OF 1ST G.O. TO BUILD */
         ST    @15,CCACPE6(,R11)                                   0341
*           CCACPE7=CCACPE3;        /* SET ADDRESS OF PLACE TO BUILD
*                                      FIRST FIELD                   */
*                                                                  0342
         ST    @15,CCACPE7(,R11)                                   0342
*           /*********************************************************/
*           /*                                                       */
*           /* CONSTRUCT VOLUME OCCURRENCE AND POINTER               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0343
*           CATGOGC1=VOGC;          /* SET VOLUME GRP CODE           */
         MVI   CATGOGC1(@01),X'03'                                 0343
*           CATGODSP=CCACPE6-CCACPE3;/* SET DISPLACEMENT TO G.O.     */
         LR    @10,@15                                             0344
         SLR   @10,@15                                             0344
         STH   @10,CATGODSP(,@01)                                  0344
*           CATGOSEQ=VOSN;          /* SET SEQUENCE NUMBER FOR VOLUME
*                                      GROUP OCCURRENCE              */
         MVI   CATGOSEQ(@01),X'01'                                 0345
*           LENFIX=LENGTH(VOGO)+    /* SET LENGTH OF FIXED           */
*               LENGTH(CNTRLINF);   /* FIELDS AREA OF G.O.           */
*                                                                  0346
         MVI   LENFIX(@15),X'0F'                                   0346
*           /*********************************************************/
*           /*                                                       */
*           /* BUILD VOLUME OCCURRENCE GROUP OCCURRENCE              */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0347
*           VODEVTYP=RTDEVUCB;      /* SET DEVICE TYPE               */
         LA    @10,1                                               0347
         ALR   @10,@15                                             0347
         L     @01,CCACMSWA(,R11)                                  0347
         MVC   VODEVTYP(4,@10),RTDEVUCB+132(@01)                   0347
*           VOVOLSER=CTGFVDCH->CTGFVVLT->LTVOLSER(1);/* SET VOLSER   */
         L     @01,CCACPL(,R11)                                    0348
         L     @01,CTGFVT(,@01)                                    0348
         L     @01,CTGFVDCH(,@01)                                  0348
         L     @01,CTGFVVLT(,@01)                                  0348
         MVC   VOVOLSER(6,@10),LTVOLSER(@01)                       0348
*           VOFILESQ=N;             /* SET FILE SEQUENCE NUMBER      */
         SLR   @14,@14                                             0349
         STH   @14,VOFILESQ(,@10)                                  0349
*           VOPRMVOL=ON;            /* INDICATE PRIME TYPE VOLUM     */
         OI    VOPRMVOL(@10),B'10000000'                           0350
*           CCACPE6=CCACPE6+LENGTH(VOGO)+/* SET ADDRESS OF NEXT      */
*               LENGTH(CNTRLINF);   /* GROUP OCCURRENCE TO BUILD     */
         AH    @15,@CH00338                                        0351
         ST    @15,CCACPE6(,R11)                                   0351
*           RCDSIZ=CCACPE6-CCACPE1; /* SET ENTRY SIZE                */
*                                                                  0352
         SLR   @15,@05                                             0352
         STH   @15,RCDSIZ(,@05)                                    0352
*           /*********************************************************/
*           /*                                                       */
*           /* PUT UCAT ENTRY INTO CATALOG                           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0353
*           DO;                                                    0353
*             CCAURAB=ADDR(CCARAB2);/* SET RAB PTR                   */
*                                                                  0354
         LA    @10,CCARAB2(,R11)                                   0354
         ST    @10,CCAURAB(,R11)                                   0354
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLAG                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0355
*Z022PAD:                                                          0355
*             CALL IGGPPAD;         /* PUT-ADD RECORD                */
Z022PAD  L     @15,@CV03381                                        0355
         BALR  @14,@15                                             0355
*           END;                                                   0356
*         END;                      /* END 'DO' FOR NO ERRORS        */
*       ELSE                                                       0358
*         ;                         /* ERROR IN ASSIGNING CI         */
@RF00315 DS    0H                                                  0359
*     END;                          /* END 'DO' FOR NO ERRORS        */
*   ELSE                                                           0360
*     ;                             /* ERROR ENCOUNTERED             */
@RF00311 DS    0H                                                  0361
*   IF CCACD1=RCS THEN              /* NO ERRORS SO FAR              */
*                                                                  0361
         CLI   CCACD1(R11),0                                       0361
         BNE   @RF00361                                            0361
*     /***************************************************************/
*     /*                                                             */
*     /* CALL TO MODULE IGG0CLAN                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0362
*Z023DCCE:                                                         0362
*     CALL IGGPDCCE;                /* CONSTRUCT CLUSTER ENTRY       */
Z023DCCE L     @15,@CV03382                                        0362
         BALR  @14,@15                                             0362
*   ELSE                                                           0363
*     ;                             /* ERROR ENCOUNTERED             */
@RF00361 DS    0H                                                  0364
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0364
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDCON');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDCON'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00005 DS    0H                                                  0367
@EF00005 DS    0H                                                  0367
@ER00005 BR    @14                                                 0367
@PB00005 DS    0H                                                  0368
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0369
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDCON  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0369
*IGGPDCON:                                                         0369
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00006                                            0369
IGGPDCON DS    0H                                                  0370
*Z024:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z024DCON:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0370
*    (R5,                                                          0370
*     R6,                                                          0370
*     R7,                                                          0370
*     R8,                                                          0370
*     R9,                                                          0370
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z024     DS    0H                                                  0370
Z024DCON DS    0H                                                  0371
*   RFY                                                            0371
*    (R2,                                                          0371
*     R3,                                                          0371
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*         CONVERT SPACE PARAMETERS TO TRACKS.                      */
*/*         ADDRESS OF SPACE PARAMETERS IN SPCPMBAS.                 */
*/********************************************************************/
*                                                                  0374
*   RFY                                                            0374
*     SPACEPRM BASED(SPCPMBAS);     /* ESTABLISH ADDRESSABILITY      */
*   IF SPCRQTYP^=CMSALTRK THEN      /* CONVERSION NECESSARY          */
         TM    SPCRQTYP(SPCPMBAS),B'10000000'                      0375
         BNO   @RT00375                                            0375
         TM    SPCRQTYP(SPCPMBAS),B'01000000'                      0375
         BZ    @RF00375                                            0375
@RT00375 DS    0H                                                  0376
*     DO;                                                          0376
*       IF SPCRQTYP=CMSALCYL THEN   /* CONVERT FROM CYLINDERS        */
         TM    SPCRQTYP(SPCPMBAS),B'11000000'                      0377
         BNO   @RF00377                                            0377
*         DO;                                                      0378
*           SPCPRIMQ=SPCPRIMQ*CMTRKCYL(1);/* CONVERT PRIM QUANT.     */
         L     @10,CCACMSWA(,R11)                                  0379
         LH    @10,CMTRKCYL(,@10)                                  0379
         SLR   @07,@07                                             0379
         ICM   @07,7,SPCPRIMQ(SPCPMBAS)                            0379
         MR    @06,@10                                             0379
         STCM  @07,7,SPCPRIMQ(SPCPMBAS)                            0379
*           SPCSECDQ=SPCSECDQ*CMTRKCYL(1);/* CONVERT SEC. QUANT.     */
         LR    @07,@10                                             0380
         SLR   @10,@10                                             0380
         ICM   @10,7,SPCSECDQ(SPCPMBAS)                            0380
         MR    @06,@10                                             0380
         STCM  @07,7,SPCSECDQ(SPCPMBAS)                            0380
*           SPCRQTYP=CMSALTRK;      /* SET REQUEST TYPE TO TRK       */
         NI    SPCRQTYP(SPCPMBAS),B'10111111'                      0381
         OI    SPCRQTYP(SPCPMBAS),B'10000000'                      0381
*         END;                                                     0382
*       ELSE                        /* NOT CYLINDER TYPE REQUEST     */
*         IF SPCRQTYP=CMSALREC THEN /* CONVERT FROM RECORDS          */
         B     @RC00377                                            0383
@RF00377 TM    SPCRQTYP(SPCPMBAS),B'01000000'                      0383
         BNO   @RF00383                                            0383
         TM    SPCRQTYP(SPCPMBAS),B'10000000'                      0383
         BNZ   @RF00383                                            0383
*           DO;                                                    0384
*             SPCPRIMQ=SPCPRIMQ/CMBLKTRK(1);/* BLK/TRK=REC/TRACK     */
         L     @10,CCACMSWA(,R11)                                  0385
         LH    @10,CMBLKTRK(,@10)                                  0385
         SLR   @07,@07                                             0385
         ICM   @07,7,SPCPRIMQ(SPCPMBAS)                            0385
         SLR   @06,@06                                             0385
         DR    @06,@10                                             0385
         STCM  @07,7,SPCPRIMQ(SPCPMBAS)                            0385
*             SPCSECDQ=SPCSECDQ/CMBLKTRK(1);/* IN CATALOG            */
         SLR   @07,@07                                             0386
         ICM   @07,7,SPCSECDQ(SPCPMBAS)                            0386
         SLR   @06,@06                                             0386
         DR    @06,@10                                             0386
         STCM  @07,7,SPCSECDQ(SPCPMBAS)                            0386
*             SPCRQTYP=CMSALTRK;                                   0387
         NI    SPCRQTYP(SPCPMBAS),B'10111111'                      0387
         OI    SPCRQTYP(SPCPMBAS),B'10000000'                      0387
*           END;                                                   0388
*         ELSE                      /* NOT RECORD REQUEST    @Y30SSDW*/
*                                                                  0389
*           /*********************************************************/
*           /*                                                       */
*           /* SET CCAMODID='AP', CCAREASN=RSN26, CCARETRN=RCINCNPM  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0389
*           CCAPROB=IGGSEGID+(RSN26*K256)+RCINCNPM;/* ECD:         0389
*                                      INCONSISTENT PARM LIST. RCD:
*                                      INVALID SPACE REQUEST TYPE FOR
*                                      CATALOG DEFINE        @Y30SSDW*/
         B     @RC00383                                            0389
@RF00383 MVC   CCAPROB(4,R11),@CF03514                             0389
*     END;                          /* END 'DO' FOR TYPE CONVERSION  */
*   ELSE                                                           0391
*     ;                             /* CONVERSION NOT NECESSARY      */
@RF00375 DS    0H                                                  0392
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RC00375 BAL   @14,EXIT                                            0392
*   END;                            /* END OF INNER PROCEDURE        */
@EL00006 DS    0H                                                  0393
@EF00006 DS    0H                                                  0393
@ER00006 BR    @14                                                 0393
@PB00006 DS    0H                                                  0394
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0395
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0395
*EXIT:                                                             0395
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00007                                            0395
EXIT     DS    0H                                                  0396
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            0399
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00007 DS    0H                                                  0400
@EF00007 DS    0H                                                  0400
@ER00007 BR    @14                                                 0400
*   END                                                            0401
*                                                                  0401
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*/*%INCLUDE SYSLIB  (IGGMCMWA)                                       */
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                       */
*/*%INCLUDE SYSLIB  (IDAAMDSB)                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*                                                                  0401
*       ;                                                          0401
@EL00001 DS    0H                                                  0401
@EF00001 DS    0H                                                  0401
@ER00001 BR    @14                                                 0401
@DATA    DS    0H
@CH00414 DC    H'3'
@CH00053 DC    H'5'
@CH00051 DC    H'6'
@CH00544 DC    H'7'
@CH00338 DC    H'15'
@DATD    DSECT
         DS    0F
@TF00001 DS    F
IGG0CLAP CSECT
         DS    0F
@CF00037 DC    F'1'
@CH00037 EQU   @CF00037+2
@CF02727 DC    F'9'
@CF03503 DC    F'-1042873688'
@CF03501 DC    F'-1042872080'
@CF03506 DC    F'-1042868596'
@CF03509 DC    F'-1042868084'
@CF03514 DC    F'-1042867572'
@DATD    DSECT
         DS    0D
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLAP CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV03380 DC    V(IGGPAXCI)
@CV03381 DC    V(IGGPPAD)
@CV03382 DC    V(IGGPDCCE)
         DS    0D
@CB03481 DC    X'FFCFFFFF'
@CB03391 DC    X'200A'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
RWA      EQU   @02
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R15      EQU   @15
DCWABASE EQU   @04
UCBPTR   EQU   @01
AMDSBBAS EQU   @04
SPCPMBAS EQU   @02
DEVTYPEA EQU   @02
DDNAMELC EQU   @03
DEVTYPTR EQU   @03
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R0       EQU   @00
R1       EQU   @01
R13      EQU   @13
R14      EQU   @14
UCBDCPTR EQU   @01
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCAFLG1  EQU   IGGCCA+14
CCAFLG2  EQU   IGGCCA+15
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCAFLG4  EQU   IGGCCA+17
CCAFLG5  EQU   IGGCCA+18
CCAFLG6  EQU   IGGCCA+19
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5SEG EQU   CCARAB5+8
CCATIQRN EQU   IGGCCA+212
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAASCIK EQU   IGGCCA+268
CCAASCI  EQU   IGGCCA+271
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAMSSPL EQU   IGGCCA+300
CCACMS   EQU   IGGCCA+316
CCACMSWA EQU   CCACMS
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAFLPT  EQU   IGGCCA+364
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCARABB  EQU   IGGCCA+380
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCAIDPT3 EQU   IGGCCA+480
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCAFLG7  EQU   IGGCCA+552
CCAFLG8  EQU   IGGCCA+553
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFLGS EQU   CCAMNAT+240
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCACUMPL EQU   IGGCCA+1412
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFL    EQU   0
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLDAT EQU   CTGFL+16
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CCACPE3  EQU   CCARAB+12
CCACPE4  EQU   CCARAB+16
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGODSP EQU   CATGOCI+1
CATGOGC1 EQU   CATGOPT+3
CATGOSEQ EQU   CATGOPT+4
CATRCD   EQU   0
RCDKEYTY EQU   CATRCD
RCDCINO  EQU   CATRCD+1
RCDCRAVL EQU   CATRCD+5
RCDCRADT EQU   CATRCD+14
RCDID    EQU   CATRCD+44
RCDSIZ   EQU   CATRCD+45
NREPCV   EQU   CATRCD+47
NREPLF   EQU   CATRCD+48
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
REPCNT   EQU   REPCNTRL+5
VARFIELD EQU   0
CNTRLINF EQU   0
LENFIX   EQU   CNTRLINF+1
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXF2REC EQU   CAXFLG2
CAXFLG3  EQU   IGGCAXWA+10
CAXUCB   EQU   IGGCAXWA+28
CAXCCR   EQU   IGGCAXWA+32
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVDCH EQU   CTGFV+4
CTGFVICH EQU   CTGFV+8
CTGFVVCH EQU   CTGFV+12
CTGFVIND EQU   CTGFV+16
CTGFVENT EQU   CTGFV+20
CTGFVVLT EQU   CTGFV+40
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVATR EQU   CTGFV+60
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
DSPTBL   EQU   0
CMSWA    EQU   0
CMWFLAGS EQU   CMSWA
CMCISUSE EQU   CMSWA+2
CMWRKATR EQU   CMCISUSE
CMCPLFVT EQU   CMSWA+20
CMNRMEXT EQU   CMSWA+24
CMLDTFPL EQU   CMNRMEXT
CMSSEXTS EQU   CMSWA+28
CMHDTFPL EQU   CMSSEXTS
CMCANVOL EQU   CMSWA+32
CMHIXFPL EQU   CMCANVOL
CMRNGCTR EQU   CMSWA+40
CMVOLCTR EQU   CMSWA+42
CMSDFSPC EQU   CMSWA+48
CMVLLIST EQU   CMSWA+64
CMVLRTCD EQU   CMVLLIST+2
CMSPCATR EQU   CMSWA+76
CMPHYBLK EQU   CMSPCATR
CMSWADTY EQU   CMSPCATR+4
CMBLKTRK EQU   CMSPCATR+8
CMTRKPCA EQU   CMSPCATR+10
CMTRKCYL EQU   CMSPCATR+12
CMWASTOR EQU   CMSWA+132
CMPOT    EQU   CMWASTOR
CMDCONV  EQU   CMPOT
CMIXFANO EQU   CMDCONV
CMPOTX   EQU   CMWASTOR+4
CMPBI    EQU   CMPOTX
CMIXFANS EQU   CMPBI
CMWABYTB EQU   CMSWA+140
CMPBIX   EQU   CMWABYTB
CMNEST   EQU   CMPBIX
CMFANT   EQU   CMNEST
CMSPCQTY EQU   CMFANT
CMWGENAM EQU   CMSWA+144
CMWDATE  EQU   CMWGENAM+12
CMWTIME  EQU   CMWGENAM+17
DCWPLSPS EQU   CMSWA+200
DCWPLSPL EQU   DCWPLSPS
DCWPLBFS EQU   CMSWA+232
DCWPLBFL EQU   DCWPLBFS
DCWPLEDS EQU   CMSWA+260
DCWPLEDL EQU   DCWPLEDS
DCWPLARS EQU   CMSWA+288
DCWPLARL EQU   DCWPLARS
DCWPLCDS EQU   CMSWA+316
DCWPLCDL EQU   DCWPLCDS
CMUCATCI EQU   CMSWA+410
CUMPLWA  EQU   0
CUMPL    EQU   CUMPLWA
CUMIN    EQU   CUMPL
CUMOUT   EQU   CUMPL+1
CUMWA    EQU   CUMPLWA+8
CUMFLAG  EQU   CUMWA
CUMWASS2 EQU   CUMWA+48
CUMWASS  EQU   CUMWASS2+2
CUMWTYP  EQU   CUMWASS
CATRECRD EQU   0
ASGO     EQU   1
PASSGO   EQU   1
PASSWORD EQU   PASSGO
USERAREC EQU   PASSGO+50
USERLIST EQU   0
LTLENGTH EQU   USERLIST
LTENTRY  EQU   USERLIST+2
LTRETCOD EQU   LTENTRY
LTVOLSER EQU   LTENTRY+2
SPACEPRM EQU   0
SPCPRIMQ EQU   SPACEPRM
SPCSECDQ EQU   SPACEPRM+3
SPCOPTNS EQU   SPACEPRM+6
SPCRQTYP EQU   SPCOPTNS
CTGDSATR EQU   0
CTGATR1  EQU   CTGDSATR
CTGDSSPD EQU   CTGATR1
CTGDSREU EQU   CTGATR1
CTGDSREC EQU   CTGATR1
CTGATR2  EQU   CTGDSATR+1
CTGDSISH EQU   CTGATR2
CTGDSSSH EQU   CTGATR2
RGATTRFL EQU   0
RGATTR1  EQU   RGATTRFL
RGATTSG1 EQU   RGATTRFL+1
ENTRYNAM EQU   0
DEVCHARS EQU   0
RTDEVUCB EQU   DEVCHARS
RTCLSTYP EQU   RTDEVUCB+2
RTNOTRKS EQU   DEVCHARS+10
RTTRKSIZ EQU   DEVCHARS+12
RTBOKAB  EQU   DEVCHARS+14
RTBOKNLB EQU   RTBOKAB
RTBOKLB  EQU   RTBOKAB+1
RTBONK   EQU   DEVCHARS+16
RTDVFLGS EQU   DEVCHARS+17
RTKABFLG EQU   RTDVFLGS
RTTOLFCT EQU   DEVCHARS+18
IDAAMDSB EQU   0
AMDATTR  EQU   IDAAMDSB+1
AMDDST   EQU   AMDATTR
AMDSDT   EQU   AMDATTR
AMDRANGE EQU   AMDATTR
AMDNEST  EQU   IDAAMDSB+4
AMDRKP   EQU   IDAAMDSB+6
AMDKEYLN EQU   IDAAMDSB+8
AMDPCTCA EQU   IDAAMDSB+10
AMDPCTCI EQU   IDAAMDSB+11
AMDCIPCA EQU   IDAAMDSB+12
AMDFSCA  EQU   IDAAMDSB+14
AMDFSCI  EQU   IDAAMDSB+16
AMDCINV  EQU   IDAAMDSB+20
AMDLRECL EQU   IDAAMDSB+24
AMDHLRBA EQU   IDAAMDSB+28
AMDSSRBA EQU   IDAAMDSB+32
AMDATTR3 EQU   IDAAMDSB+40
AMDSTAT  EQU   IDAAMDSB+48
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00127 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
VOGO     EQU   1
VODEVTYP EQU   VOGO
VOVOLSER EQU   VOGO+4
VOFILESQ EQU   VOGO+10
VOVOLFL1 EQU   VOGO+12
VOPRMVOL EQU   VOVOLFL1
DEVVSN   EQU   40
BUFSIZE  EQU   0
CATSN    EQU   0
CI       EQU   0
CTGVLDSP EQU   0
DATEFLD  EQU   0
DVCLSTYP EQU   0
EXCPNAME EQU   0
FIELDNM  EQU   0
LRECL    EQU   0
OWNIDFLD EQU   0
TNAM     EQU   0
UCBBGN   EQU   0
@NM00035 EQU   CTGDDNM
CTGPROB  EQU   @NM00035
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
CTGRBASE EQU   NREPLF+1
CNAME    EQU   CTGRBASE
CATTR    EQU   CTGRBASE+58
CATTR1   EQU   CATTR
CATTR2   EQU   CATTR+1
COPEN    EQU   CTGRBASE+60
CSPACPRM EQU   CTGRBASE+65
@NM00110 EQU   CATTR1
CCATTR   EQU   @NM00110
@NM00111 EQU   CCATTR
@NM00113 EQU   CATTR1
CRGATTR  EQU   @NM00113
CUPG     EQU   CRGATTR
UCBOBS01 EQU   UCBDEV
UCBVOLI  EQU   UCBOBS01+4
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00126 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBOBS09 EQU   UCBDEV
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBCTCF1 EQU   UCBOBS08+4
UCBCTCAD EQU   UCBOBS08
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00126
UCBSKPFG EQU   @NM00126
UCBRIPND EQU   @NM00126
UCBRTIAC EQU   @NM00126
UCBRSV79 EQU   @NM00126
UCBRSV78 EQU   @NM00126
UCBRSV77 EQU   @NM00126
UCBOLTEP EQU   @NM00126
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00125 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVTOC  EQU   UCBOBS01
@NM00114 EQU   CRGATTR
CUPD     EQU   CUPG
CPGSP    EQU   @NM00111
@NM00112 EQU   @NM00111
CEXT     EQU   CTGRBASE+86
CDOSUINF EQU   CTGRBASE+84
CLRECL   EQU   CTGRBASE+80
CHIA     EQU   CTGRBASE+76
CHIU     EQU   CTGRBASE+72
CSORT    EQU   CSPACPRM+6
CSEC     EQU   CSPACPRM+3
CPRIM    EQU   CSPACPRM
CBUF     EQU   CTGRBASE+61
@NM00109 EQU   COPEN
COPENDS  EQU   COPEN
CNUS     EQU   CATTR2
@NM00108 EQU   CATTR2
CATTRSSH EQU   CATTR2
CATTRISH EQU   CATTR2
CTRKOV   EQU   CATTR1
CTEMP    EQU   CATTR1
CINHIB   EQU   CATTR1
CRECOV   EQU   CATTR1
CERASE   EQU   CATTR1
CREUSE   EQU   CATTR1
CUNIQ    EQU   CATTR1
CSP      EQU   CATTR1
CEXP     EQU   CTGRBASE+55
CCRE     EQU   CTGRBASE+52
COWNID   EQU   CTGRBASE+44
@NM00085 EQU   MCATDSTR+1
@NM00084 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
VOLSERNA EQU   DEVVSN+4
DEVTYPEC EQU   DEVVSN
@NM00128 EQU   VOVOLFL1
VOOVFVOL EQU   VOVOLFL1
VOCANVOL EQU   VOVOLFL1
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBRV034 EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00127
UCBHALI  EQU   @NM00127
UCBRSV09 EQU   @NM00127
UCBRSV08 EQU   @NM00127
UCBRSV07 EQU   @NM00127
UCBRSV06 EQU   @NM00127
UCBRSV05 EQU   @NM00127
UCBRSV04 EQU   @NM00127
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBFLB7  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBRV002 EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00124 EQU   UCB
AMDEXCP  EQU   AMDSTAT+44
AMDNCAS  EQU   AMDSTAT+40
AMDNCIS  EQU   AMDSTAT+36
AMDASPA  EQU   AMDSTAT+32
AMDRETR  EQU   AMDSTAT+28
AMDUPR   EQU   AMDSTAT+24
AMDIREC  EQU   AMDSTAT+20
AMDDELR  EQU   AMDSTAT+16
AMDNLR   EQU   AMDSTAT+12
AMDNEXT  EQU   AMDSTAT+10
AMDNIL   EQU   AMDSTAT+8
AMDSTSP  EQU   AMDSTAT
@NM00123 EQU   IDAAMDSB+41
@NM00122 EQU   AMDATTR3
AMDLM    EQU   AMDATTR3
AMDWAIT  EQU   AMDATTR3
AMDBIND  EQU   AMDATTR3
AMDFAULT EQU   AMDATTR3
AMDUNQ   EQU   AMDATTR3
AMDPARDB EQU   IDAAMDSB+36
AMDMAXRR EQU   AMDSSRBA
AMDNSLOT EQU   AMDHLRBA
AMDAXRKP EQU   AMDNEST
AMDLEN   EQU   IDAAMDSB+2
AMDSPAN  EQU   AMDATTR
AMDRRDS  EQU   AMDATTR
AMDORDER EQU   AMDATTR
AMDREPL  EQU   AMDATTR
AMDWCK   EQU   AMDATTR
AMDSBID  EQU   IDAAMDSB
RTTOLFLG EQU   RTDVFLGS
@NM00121 EQU   RTDVFLGS
@NM00120 EQU   RTDVFLGS
RTNOCYLS EQU   DEVCHARS+8
RTMXDBLK EQU   DEVCHARS+4
@NM00119 EQU   RTDEVUCB
@NM00118 EQU   RGATTSG1
RGATSUP1 EQU   RGATTSG1
@NM00117 EQU   RGATTR1
RGATTUPG EQU   RGATTR1
CTGDSNUS EQU   CTGATR2
@NM00116 EQU   CTGATR2
CTGTRKOV EQU   CTGATR1
CTGDSTPX EQU   CTGATR1
CTGDSINH EQU   CTGATR1
CTGDSERA EQU   CTGATR1
CTGDSUNQ EQU   CTGATR1
SPCROUND EQU   SPCOPTNS
SPCALXRQ EQU   SPCOPTNS
SPCMXIGR EQU   SPCOPTNS
SPCCNTIG EQU   SPCOPTNS
@NM00115 EQU   SPCOPTNS
LTRETCD2 EQU   LTRETCOD+1
LTRETCD1 EQU   LTRETCOD
USERAREV EQU   USERAREC+2
USERAREL EQU   USERAREC
USVRMDUL EQU   PASSGO+42
PASSATMP EQU   PASSGO+40
PASSPRMT EQU   PASSGO+32
READPW   EQU   PASSWORD+24
UPDATEPW EQU   PASSWORD+16
CIPW     EQU   PASSWORD+8
MASTERPW EQU   PASSWORD
ASCI     EQU   ASGO+1
ASTYPE   EQU   ASGO
CUMRC    EQU   CUMWA+148
@NM00107 EQU   CUMWA+146
CUMFMWA  EQU   CUMWA+58
CUMWCI2  EQU   CUMWASS2+7
CUMWTYP2 EQU   CUMWASS2+6
CUMWCI   EQU   CUMWASS+1
CUMTYPE  EQU   CUMWTYP
CUMWREL  EQU   CUMWASS2
CUMFN2   EQU   CUMWA+40
CUMFN1   EQU   CUMWA+32
CUMDY    EQU   CUMWA+29
@NM00106 EQU   CUMWA+28
CUMSRID  EQU   CUMWA+25
@NM00105 EQU   CUMWA+24
CUMRABD  EQU   CUMWA+20
CUMRAB2  EQU   CUMWA+16
CUMRAB1  EQU   CUMWA+12
CUMRABB  EQU   CUMWA+8
CUMURAB  EQU   CUMWA+4
CUMBCI   EQU   CUMWA+1
@NM00104 EQU   CUMFLAG
CUMEXIT  EQU   CUMFLAG
CUMICI   EQU   CUMPL+5
CUMDCI   EQU   CUMPL+2
@NM00103 EQU   CUMOUT
CUMNE    EQU   CUMOUT
CUMDUP   EQU   CUMOUT
@NM00102 EQU   CUMIN
CUMFUNC  EQU   CUMIN
CUMNRG   EQU   CUMIN
CUMFDEL  EQU   CUMIN
CMBYTAU  EQU   CMSWA+500
CMBYTTRK EQU   CMSWA+496
CMSCTREC EQU   CMSWA+416
@NM00101 EQU   CMSWA+413
CMDEFACI EQU   CMUCATCI
CMBLPTKS EQU   CMSWA+408
CMSDSPTB EQU   CMSWA+344
@NM00100 EQU   DCWPLCDS+27
DCWPLCDV EQU   DCWPLCDS+24
DCWPLCDA EQU   DCWPLCDL+16
DCWPLCDH EQU   DCWPLCDL
DCWPLARV EQU   DCWPLARS+24
DCWPLARA EQU   DCWPLARL+16
DCWPLARH EQU   DCWPLARL
@NM00099 EQU   DCWPLEDS+27
DCWPLEDV EQU   DCWPLEDS+24
DCWPLEDA EQU   DCWPLEDL+16
DCWPLEDH EQU   DCWPLEDL
DCWPLBFV EQU   DCWPLBFS+24
DCWPLBFA EQU   DCWPLBFL+16
DCWPLBFH EQU   DCWPLBFL
@NM00098 EQU   DCWPLSPS+31
DCWPLSPV EQU   DCWPLSPS+24
DCWPLSPA EQU   DCWPLSPL+16
DCWPLSPH EQU   DCWPLSPL
DCWFPLPT EQU   CMSWA+196
DCWAREPT EQU   CMSWA+192
@NM00097 EQU   CMSWA+190
DCWIX    EQU   CMSWA+188
CMWPAD   EQU   CMWGENAM+35
CMWTIME2 EQU   CMWTIME+11
CMWDELM2 EQU   CMWTIME+9
CMWTIME1 EQU   CMWTIME+2
CMWDELM1 EQU   CMWTIME
CMWDAY   EQU   CMWDATE+2
CMWYEAR  EQU   CMWDATE
CMWFIXID EQU   CMWGENAM
CMNCILL  EQU   CMSPCQTY
CMNCITL  EQU   CMIXFANS
CMWT     EQU   CMIXFANO
CMDEFSWA EQU   CMSWA+128
CMSRCCOR EQU   CMSWA+124
CMEXTLST EQU   CMSWA+120
WORKPROC EQU   CMSWA+118
@NM00096 EQU   CMSWA+116
CMFPLIDX EQU   CMSWA+112
CMCNVNO  EQU   CMSWA+110
CMCNVLEN EQU   CMSWA+108
CMTOTVOL EQU   CMSWA+74
CMVLVOL  EQU   CMVLLIST+4
CMVLRT2  EQU   CMVLRTCD+1
CMVLRT1  EQU   CMVLRTCD
CMVLLTLN EQU   CMVLLIST
@NM00095 EQU   CMSWA+62
CMSCRADT EQU   CMSWA+58
CMSCRAVI EQU   CMSWA+52
CMSDEFCI EQU   CMSDFSPC+1
CMSWAFLG EQU   CMSDFSPC
CMSPCFVT EQU   CMSWA+44
CMRMVVOL EQU   CMVOLCTR
CMADDVOL EQU   CMRNGCTR
SPACINDC EQU   CMSWA+38
PROCESS  EQU   CMSWA+36
CMDTAFPL EQU   CMHIXFPL
CMTSTFPL EQU   CMHDTFPL
CMRNMLST EQU   CMLDTFPL
CMEXTFLS EQU   CMCPLFVT
CMASCFPL EQU   CMSWA+16
CMWFVTPT EQU   CMSWA+12
CMWACI   EQU   CMSWA+3
CMAMDRNG EQU   CMWRKATR
CMAMDORD EQU   CMWRKATR
CMAMDRPL EQU   CMWRKATR
CMAMDSDT EQU   CMWRKATR
CMAMDWCK EQU   CMWRKATR
CMAMDDST EQU   CMWRKATR
CMCISREQ EQU   CMSWA+1
CMPROC   EQU   CMWFLAGS
CMPROCM  EQU   CMWFLAGS
CMFGDLSC EQU   CMWFLAGS
DSNPHYBS EQU   DSPTBL+30
DSPHYBPT EQU   DSPTBL+22
DSMPHYBS EQU   DSPTBL+20
DSDEVCHA EQU   DSPTBL
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00094 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00093 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVPWD EQU   CTGFV+84
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
@NM00092 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00091 EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXCCA   EQU   IGGCAXWA+104
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00090 EQU   COPTS
CENLST   EQU   COPTS
@NM00089 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00088 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00087 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00086 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00083 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00082 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00081 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00080 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00079 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00078 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00077 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00076 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00075 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00074 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00049 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBRSV48 EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00048 EQU   TCB+296
TCBSCBQ  EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBRSV36 EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBRSV35 EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00047 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBRSV04 EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00046 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00045 EQU   CVTFIX+248
@NM00044 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
CNTVAR   EQU   CNTRLINF
VARINFO  EQU   VARFIELD+2
VARLEN   EQU   VARFIELD
REPGOPT  EQU   REPCNTRL+6
@NM00043 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
@NM00042 EQU   CATRCD+26
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRACI EQU   CATRCD+11
RCDRELID EQU   CATRCD+4
CATGOGC  EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOEXT EQU   CATGOGC1
@NM00041 EQU   CATGOFLG
@NM00040 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00039 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
DIC2LC   EQU   DIC2ENT+2
DIC2ST   EQU   DIC2ENT+1
@NM00038 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2VAR  EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
DICTLC   EQU   DICTENT+2
DICTST   EQU   DICTENT+1
@NM00037 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
WKALEN1  EQU   USERWKA
CTGFLNG  EQU   CTGFLDAT
CTGFLCHN EQU   CTGFL+12
CTGFLDTS EQU   CTGFLDRE
@NM00036 EQU   CTGFLDRE
CTGFLDCD EQU   CTGFL+1
CTGFLDNO EQU   CTGFL
CTGFIELD EQU   CTGPL+28
CTGPSWD  EQU   CTGJSCB
@NM00034 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
CTGTYPE  EQU   CTGPL+18
@NM00033 EQU   CTGDSORG
CTGOPTNS EQU   CTGDSORG
@NM00032 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGFUNC  EQU   CTGOPTN3
@NM00031 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGNAME  EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1492
CCADGDGA EQU   IGGCCA+1488
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
@NM00030 EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00029 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
CCATNQCT EQU   IGGCCA+1416
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00028 EQU   CCAREGS
@NM00027 EQU   IGGCCA+1057
@NM00026 EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNADR EQU   CCAMNCAT+252
CCAMNLEN EQU   CCAMNCAT+249
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00025 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00024 EQU   CCAMNAT+1
@NM00023 EQU   MNATTOP
MNATFULL EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00022 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00021 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00020 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
@NM00019 EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCAGVEXT EQU   IGGCCA+488
CCANEVV  EQU   IGGCCA+486
CCAGVCT  EQU   IGGCCA+484
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00018 EQU   IGGCCA+400
CCASN1   EQU   CCASN
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCARABL  EQU   IGGCCA+388
CCARABF  EQU   IGGCCA+384
CCAMCPL  EQU   CCAXCPL
CCARABPT EQU   IGGCCA+368
CCATFLPT EQU   CCAFLPT
CCAILNG  EQU   IGGCCA+360
CCASL    EQU   IGGCCA+358
CCAGOPLN EQU   IGGCCA+356
CCACPE71 EQU   IGGCCA+352
CCAIDPT  EQU   CCACPE7
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCARPRM  EQU   IGGCCA+312
@NM00017 EQU   CCAMSSPL+10
CCAMNSPL EQU   CCAMSSPL+9
@NM00016 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00015 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCARPL1  EQU   IGGCCA+220
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
CCATQDB  EQU   CCATIQRN+2
CCATASID EQU   CCATIQRN
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
CCAR5REC EQU   CCARAB5+4
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCAR5UR  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
CCAR4REC EQU   CCARAB4+4
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCAR4UR  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
CCAR3REC EQU   CCARAB3+4
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
CCAR1REC EQU   CCARAB1+4
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
CCAR0REC EQU   CCARAB0+4
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCASRCIN EQU   CCASRID
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAMOD   EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCAREUSE EQU   CCAFLG6
CCASUPFD EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNC  EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2NVC EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1KEY EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
CCACD2   EQU   IGGCCA+13
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCAMODID EQU   CCAPROB
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
@NM00073 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00072 EQU   PSA+1040
PSAUSEND EQU   PSA+1040
PSARV062 EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00071 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00070 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00069 EQU   FLCFSA
@NM00068 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00067 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00066 EQU   FLCIOA
@NM00065 EQU   FLCMCLA+15
@NM00064 EQU   FLCMCLA+14
@NM00063 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00062 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00061 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00060 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00059 EQU   FLCPER
@NM00058 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00057 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00056 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00055 EQU   FLCPIILC
@NM00054 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00053 EQU   FLCSVILC
@NM00052 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00051 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00050 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00190 EQU   @RC00183
@RC00249 EQU   @RC00246
@RC00265 EQU   @RC00236
@RC00287 EQU   @RC00282
@RC00283 EQU   @RC00282
@RC00296 EQU   @RC00295
@RC00383 EQU   @RC00375
@RC00377 EQU   @RC00375
@PB00007 EQU   @EL00001
@RF00271 EQU   @RC00265
@ENDDATA EQU   *
         END   IGG0CLAP,(C'PLS0606',0602,75269)
