         TITLE 'IGG0CLAQ - CMS DEFINE SPACE IGGPDEFS                   *
                        '
IGG0CLAQ CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLAQ  75.010'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPDEFS'
         EJECT
         B     @PB00002                                            0126
IGGPDEFS DS    0H                                                  0127
         ENTRY IGGPDEFS
         DROP @15
Z003     DS    0H                                                  0129
Z003DEFS DS    0H                                                  0130
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
*                                                                  0138
*/********************************************************************/
*/*        GET  CORE  FOR  THE  DEFINE  SPACE  WORK  AREA            */
*/********************************************************************/
*                                                                  0139
*   CCAMNLEN=LENGTH(DEFSWKA);       /* SET REQUEST CORE LENGTH       */
         MVC   CCAMNLEN(3,R11),@CF04047+1                          0139
*   RFY                                                            0140
*     R1 RSTD;                                                     0140
*   R1=ADDR(CCAMSSPL);              /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0141
*   CCAMNSPL=USUBPOOL;              /* STORE SUBPOOL VALUE           */
*                                                                  0142
         MVI   CCAMNSPL(R11),X'FC'                                 0142
*   /*****************************************************************/
*   /*                                                               */
*   /* ALLOCATE MAIN STORAGE FROM USER SUBPOOL 252                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0143
*   GEN(GETMAIN LC,MF=(E,(1)));     /* GET MAIN STORAGE SPACE        */
         GETMAIN LC,MF=(E,(1))
*   GEN(LR R1,R15);                 /* PICK UP RETURN CODE           */
         LR R1,R15
*   IF R1^=NOGETMSE THEN            /* CHECK FOR ERROR RETURN        */
*                                                                  0145
         LTR   R1,R1                                               0145
         BZ    @RF00145                                            0145
*     /***************************************************************/
*     /*                                                             */
*     /* SET CCAMODID='AQ', CCAREASN=RSN2, CCARETRN=RCINSSWA         */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0146
*     CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/* INSUFFICIENT CORE   0146
*                                      ERROR                         */
         MVC   CCAPROB(4,R11),@CF04049                             0146
*   ELSE                            /* GETMAIN SUCCESSFUL            */
*     DO;                                                          0147
         B     @RC00145                                            0147
@RF00145 DS    0H                                                  0148
*       DO;                                                        0148
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */
*                                                                  0149
         TM    MNATFULL(R11),B'10000000'                           0149
         BNO   @RF00149                                            0149
*           /*********************************************************/
*           /*                                                       */
*           /* CALL TO MODULE IGG0CLAT                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0150
*Z007ARFS:                                                         0150
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */
Z007ARFS L     @15,@CV03737                                        0150
         BALR  @14,@15                                             0150
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0151
*                                      PUSH AND TRACK                */
@RF00149 DS    0H                                                  0151
         MVC CCAMNAT(248,11),CCAMNAT+8(11)
*       END;                                                       0152
*     END;                                                         0153
*   RFY                                                            0154
*     R1 UNRSTD;                                                   0154
@RC00145 DS    0H                                                  0155
*   IF CCACD1^=RCS THEN             /* IF GET CORE FAILED            */
         CLI   CCACD1(R11),0                                       0155
         BE    @RF00155                                            0155
*     DO;                           /* PERFORM ERROR PROCESSING      */
*       LTRETCD1(1)=CCACD1;         /* SAVE RETURN CODE      @Y30SSDW*/
         L     @10,CCACPL(,R11)                                    0157
         L     @10,CTGFVT(,@10)                                    0157
         L     @10,CTGFVVLT(,@10)                                  0157
         MVC   LTRETCD1(1,@10),CCACD1(R11)                         0157
*       CALL EXIT;                  /* EXIT - ERROR          @Y30SSDW*/
         BAL   @14,EXIT                                            0158
*     END;                          /* END ERROR PROCESSING          */
*   ELSE                                                           0160
*     ;                             /* GET CORE SUCCESSFUL           */
@RF00155 DS    0H                                                  0161
*   DEFSWAR4=CCAMNADR;              /* SET WORKAREA BASE REG @Y30SSDW*/
         L     DEFSWAR4,CCAMNADR(,R11)                             0161
*   CCADSPWA=DEFSWAR4;              /* SAVE W.A. ADDR IN CCA @Y30SSDW*/
         ST    DEFSWAR4,CCADSPWA(,R11)                             0162
*   DEFSWKA(1:256)=DEFSWKA(1:256)   /*                               */
*       &&DEFSWKA(1:256);           /* C L E A R                     */
         XC    DEFSWKA(256,DEFSWAR4),DEFSWKA(DEFSWAR4)             0163
*   DEFSWKA(257:LENGTH(DEFSWKA))=   /* D E F I N E - S P A C E       */
*       DEFSWKA(257:LENGTH(DEFSWKA))&&/* W O R K A R E A             */
*       DEFSWKA(257:LENGTH(DEFSWKA));/*                              */
         XC    DEFSWKA+256(195,DEFSWAR4),DEFSWKA+256(DEFSWAR4)     0164
*   DEFSBPTR=ADDR(DEFSBUFF);        /* SET POINTER TO DSCB BUFFER    */
         LA    @10,DEFSBUFF(,DEFSWAR4)                             0165
         ST    @10,DEFSBPTR(,DEFSWAR4)                             0165
*   IF CTGFVATR=ZERO THEN           /* CHECK FOR NULL ATTRIBUTES     */
         L     @10,CCACPL(,R11)                                    0166
         L     @10,CTGFVT(,@10)                                    0166
         ICM   @05,15,CTGFVATR(@10)                                0166
         BNZ   @RF00166                                            0166
*     DEFSUNIQ=OFF;                 /* NULL, SET UNIQUE OFF          */
         NI    DEFSUNIQ(DEFSWAR4),B'10111111'                      0167
*   ELSE                            /* DATA SET ATTRIBUTES ARE GIVEN */
*     DO;                                                          0168
         B     @RC00166                                            0168
@RF00166 DS    0H                                                  0169
*       IF CTGFVATR->CTGFLPT(1)     /* NOT NULL, CHECK FOR           */
*           ->DSATUNIQ=ON THEN      /* UNIQUE REQUEST                */
         L     @10,CCACPL(,R11)                                    0169
         L     @10,CTGFVT(,@10)                                    0169
         L     @10,CTGFVATR(,@10)                                  0169
         L     @10,CTGFLPT(,@10)                                   0169
         TM    DSATUNIQ(@10),B'01000000'                           0169
         BNO   @RF00169                                            0169
*         DEFSUNIQ=ON;              /* SET UNIQUE SWITCH ON          */
         OI    DEFSUNIQ(DEFSWAR4),B'01000000'                      0170
*       ELSE                        /* NOT UNIQUE REQUEST            */
*         DEFSUNIQ=OFF;             /* SET UNIQUE SWITCH OFF         */
         B     @RC00169                                            0171
@RF00169 NI    DEFSUNIQ(DEFSWAR4),B'10111111'                      0171
*     END;                                                         0172
*                                                                  0172
@RC00169 DS    0H                                                  0173
*/********************************************************************/
*/*      LOOP THROUGH THE COMPLETE DEFINE SPACE PROCESS FOR EACH     */
*/*      VOLUME IN THE LIST OF VOLSERS PROVIDED VIA THE FVT          */
*/********************************************************************/
*                                                                  0173
*   DEFSSCAT=OFF;                   /* SET CATALOG TO BE SEARCHED    */
@RC00166 NI    DEFSSCAT(DEFSWAR4),B'11011111'                      0173
*   DO R2=1 TO LTLENGTH/8;          /* DO FOR EACH VOLSER PROVIDED   */
*                                                                  0174
         LA    R2,1                                                0174
         B     @DE00174                                            0174
@DL00174 DS    0H                                                  0175
*     /***************************************************************/
*     /*                                                             */
*     /* CLEAR CCAMODID, CCAREASN, AND CCARETRN                      */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0175
*     CCAPROB=IGNOREIT;             /* CLEAR ERROR CODE      @Y30SSDW*/
         SLR   @10,@10                                             0175
         ST    @10,CCAPROB(,R11)                                   0175
*     DEFSCVOL=R2;                  /* SAVE INDEX TO CURRENT VOLUME  */
*                                                                  0176
         ST    R2,DEFSCVOL(,DEFSWAR4)                              0176
*     /***************************************************************/
*     /*                                                             */
*     /* CALL TO MODULE IGG0CLAL                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0177
*Z009DTIM:                                                         0177
*     CALL IGGPDTIM;                /* GET TIME/DATE STAMP           */
Z009DTIM L     @15,@CV03745                                        0177
         BALR  @14,@15                                             0177
*     DEFSWAR4=CCADSPWA;            /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0178
*     R2=DEFSCVOL;                  /* RE-SET INDEX TO VOL SER NO.   */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0179
*     IF CCACD1^=RCS THEN           /* TIMESTAMP FAILED      @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0180
         BNE   @RT00180                                            0180
*       GOTO NEXTVOL;               /* GO TO NEXT VOLUME     @Y30SSDW*/
*     ELSE                                                         0182
*       ;                           /* TIMESTAMP OPERATION SUCCESSFUL
*                                                            @Y30SSDW*/
*Z010VMTV:                                                         0183
*     CALL IGGPVMTV;                /* VERIFY OR MOUNT VOLUME        */
Z010VMTV BAL   @14,IGGPVMTV                                        0183
*     IF CCACD1^=RCS THEN           /* CHECK ERROR CONDITION         */
         CLI   CCACD1(R11),0                                       0184
         BNE   @RT00184                                            0184
*       GOTO NEXTVOL;               /* SKIP TO PROCESS NEXT VOLUME   */
*     ELSE                                                         0186
*       ;                           /* NO ERRORS SO FAR              */
*     DEFSNVME=OFF;                 /* NEW VOLUME ENTRY FLAG = OFF   */
         NI    DEFSNVME(DEFSWAR4),B'01111111'                      0187
*     DEFSVNUM(1:6)=LTVOLSER(R2);   /* SET CURRENT VOLSER NUMBER     */
         LR    @10,R2                                              0188
         SLA   @10,3                                               0188
         L     @05,CCACPL(,R11)                                    0188
         L     @01,CTGFVT(,@05)                                    0188
         L     @01,CTGFVVLT(,@01)                                  0188
         ALR   @01,@10                                             0188
         AL    @01,@CF04074                                        0188
         MVC   DEFSVNUM(6,DEFSWAR4),LTVOLSER-4(@01)                0188
*/********************************************************************/
*/*           MASTER  OR  USER  CATALOG  BUILD  REQUEST              */
*/********************************************************************/
*                                                                  0189
*     IF CTGTYPE=CTGTMCAT×          /* DEFINE SPACE FOR MASTER       */
*         CTGTYPE=CTGTUCAT THEN     /* OR USER CATALOG BUILD         */
         CLI   CTGTYPE(@05),C'M'                                   0189
         BE    @RT00189                                            0189
         CLI   CTGTYPE(@05),C'U'                                   0189
         BNE   @RF00189                                            0189
@RT00189 DS    0H                                                  0190
*       DO;                         /* DO NOT SEARCH CATALOG         */
*Z011F4PR:                                                         0191
*         CALL IGGPF4PR;            /* MARK VOLUME OWNED ON F4 DSCB  */
Z011F4PR BAL   @14,IGGPF4PR                                        0191
*         IF CCACD1=RCS THEN        /* IF NO ERRORS,                 */
         CLI   CCACD1(R11),0                                       0192
         BNE   @RF00192                                            0192
*Z012IVER:                                                         0193
*           CALL IGGPIVER;          /* BUILD VOLUME ENTRY RECORD     */
Z012IVER BAL   @14,IGGPIVER                                        0193
*         ELSE                      /* IF ERROR,                     */
*           GOTO NEXTVOL;           /* GO PROCESS NEXT VOLUME        */
*       END;                        /* END CATALOG-DEFINE PROCESSING */
*/********************************************************************/
*/*   NOT CATALOG BUILD REQUEST - SEARCH CATALOG FOR VOLUME RECORD   */
*/********************************************************************/
*                                                                  0196
*     ELSE                          /* NOT CATALOG BUILD REQUEST     */
*       DO;                         /* PERFORM NON-CATLG-BUILD WORK  */
         B     @RC00189                                            0196
@RF00189 DS    0H                                                  0197
*         CCAURAB=ADDR(CCARAB3);    /* USE RAB 3                     */
         LA    @10,CCARAB3(,R11)                                   0197
         ST    @10,CCAURAB(,R11)                                   0197
*         IF DEFSSCAT=OFF&          /* IF CAT NOT SRCHED     @XM01568*/
*             DEFSUNIQ=OFF&         /* AND NOT UNIQUE        @XM01568*/
*             CCADSRCL=OFF THEN     /* NOT RECURSIVELY CALLED FROM 0198
*                                      IGG0CLB4              @Y30SSDW*/
         TM    DEFSSCAT(DEFSWAR4),B'01100000'                      0198
         BNZ   @RF00198                                            0198
         TM    CCADSRCL(R11),B'10000000'                           0198
         BNZ   @RF00198                                            0198
*           DO;                     /* SET UP TO CALL SEARCH CAT     */
*             DEFSAVTN=CTGFVENT;    /* SAVE CURRENT TRUENAME POINTER
*                                                            @XM01568*/
         L     @10,CCACPL(,R11)                                    0200
         L     @05,CTGFVT(,@10)                                    0200
         MVC   DEFSAVTN(4,DEFSWAR4),CTGFVENT(@05)                  0200
*             CTGFVENT=ADDR(DEFSVNUM);/* SET TRUENAME ADDRESS        */
         LA    @15,DEFSVNUM(,DEFSWAR4)                             0201
         ST    @15,CTGFVENT(,@05)                                  0201
*             CTGNAME=ON;           /* INDICATE TRUENAME SEARCH      */
         OI    CTGNAME(@10),B'00000100'                            0202
*             CCAF1UP=ON;           /* SET GET FOR UPDATE FLAG       */
*                                                                  0203
         OI    CCAF1UP(R11),B'00000010'                            0203
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLAH                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0204
*Z013SCAT:                                                         0204
*             CALL IGGPSCAT;        /* SEARCH CATALOG                */
Z013SCAT L     @15,@CV03753                                        0204
         BALR  @14,@15                                             0204
*             DEFSWAR4=CCADSPWA;    /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0205
*             CTGFVENT=DEFSAVTN;    /* RESTORE TRUENAME POINTER    0206
*                                                            @XM01568*/
         L     @10,CCACPL(,R11)                                    0206
         L     @10,CTGFVT(,@10)                                    0206
         MVC   CTGFVENT(4,@10),DEFSAVTN(DEFSWAR4)                  0206
*             DEFSSCAT=ON;          /* SET CATALOG SEARCHED  @XM01568*/
         OI    DEFSSCAT(DEFSWAR4),B'00100000'                      0207
*           END;                                                   0208
*         ELSE                      /* GET THE VOLUME RECORD         */
*           DO;                     /* SET UP FOR THE GETREC REQ     */
         B     @RC00198                                            0209
@RF00198 DS    0H                                                  0210
*             CCASRCH=CCASRCH&&CCASRCH;/* CLEAR SEARCH NAME FIELD  0210
*                                                            @XM01568*/
         XC    CCASRCH(44,R11),CCASRCH(R11)                        0210
*             CCASRCH(1:6)=LTVOLSER(R2);/* SET VOL SER NO.           */
         LR    @10,R2                                              0211
         SLA   @10,3                                               0211
         L     @05,CCACPL(,R11)                                    0211
         L     @05,CTGFVT(,@05)                                    0211
         L     @05,CTGFVVLT(,@05)                                  0211
         ALR   @05,@10                                             0211
         AL    @05,@CF04074                                        0211
         MVC   CCASRCH(6,R11),LTVOLSER-4(@05)                      0211
*             DO;                                                  0212
*               CCAF1KEY=ON;        /* TRUE NAME GET                 */
*               CCAF1KGE=OFF;       /* NOT GET NEXT                  */
*               CCAF1UP=ON;         /* GET FOR UPD                   */
*                                                                  0215
         OI    CCAF1KEY(R11),B'00010010'                           0215
         NI    CCAF1KGE(R11),B'11110111'                           0215
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLBI                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0216
*Z015GET:                                                          0216
*               CALL IGGPGET;       /* GET RECORD                    */
Z015GET  L     @15,@CV03749                                        0216
         BALR  @14,@15                                             0216
*             END;                  /* GET VOLUME RECORD             */
*             DEFSWAR4=CCADSPWA;    /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0218
*           END;                    /* END VOLUME GET PROCESS        */
*         R2=DEFSCVOL;              /* RESTORE LOOP INDEX            */
@RC00198 L     R2,DEFSCVOL(,DEFSWAR4)                              0220
*         LTRETCD1(R2)=CCACD1;      /* SAVE I/O PROC RTN CODE        */
         LR    @10,R2                                              0221
         SLA   @10,3                                               0221
         L     @05,CCACPL(,R11)                                    0221
         L     @05,CTGFVT(,@05)                                    0221
         L     @05,CTGFVVLT(,@05)                                  0221
         SLR   @15,@15                                             0221
         IC    @15,CCACD1(,R11)                                    0221
         AL    @05,@CF04078                                        0221
         STC   @15,LTRETCD1-2(@10,@05)                             0221
*         IF(CCACD1=RCS×            /* ENTRY FOUND OR                */
*             CCACD1=RCENT)&        /* ENTRY NOT FOUND AND           */
*             R2=INCR1&             /* FIRST VOLUME AND              */
*             CCADSRCL=OFF&         /* NOT CALL BY DCRA      @Y30SSDW*/
*             DEFSUNIQ=OFF THEN     /* AND NOT A UNIQUE OBJECT       */
         CLI   CCACD1(R11),0                                       0222
         BE    @GL00005                                            0222
         CLI   CCACD1(R11),8                                       0222
         BNE   @RF00222                                            0222
@GL00005 CH    R2,@CH00037                                         0222
         BNE   @RF00222                                            0222
         TM    CCADSRCL(R11),B'10000000'                           0222
         BNZ   @RF00222                                            0222
         TM    DEFSUNIQ(DEFSWAR4),B'01000000'                      0222
         BNZ   @RF00222                                            0222
*           DO;                     /* SET UP TO CHECK SECURITY      */
*                                                                  0223
*             /*******************************************************/
*             /*                                                     */
*             /* CLEAR CCAMODID, CCAREASN, AND CCARETRN              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0224
*             CCAPROB=IGNOREIT;     /* CLEAR CODE FIELD      @Y30SSDW*/
*                                                                  0224
         SLR   @10,@10                                             0224
         ST    @10,CCAPROB(,R11)                                   0224
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLBM                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0225
*Z017CKAU:                                                         0225
*             CALL IGGPCKAU;        /* CALL CHECK AUTHORIZATION      */
Z017CKAU L     @15,@CV03741                                        0225
         BALR  @14,@15                                             0225
*             DEFSWAR4=CCADSPWA;    /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0226
*             R2=DEFSCVOL;          /* RESTORE LOOP INDEX            */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0227
*             IF CCACD1=RCS THEN    /* SECURITY CHECK OKAY           */
         CLI   CCACD1(R11),0                                       0228
         BNE   @RF00228                                            0228
*               CCACD1=LTRETCD1(R2);/* RESTORE I/O PROC CODE         */
         LR    @10,R2                                              0229
         SLA   @10,3                                               0229
         L     @05,CCACPL(,R11)                                    0229
         L     @05,CTGFVT(,@05)                                    0229
         L     @05,CTGFVVLT(,@05)                                  0229
         AL    @05,@CF04078                                        0229
         SLR   @15,@15                                             0229
         IC    @15,LTRETCD1-2(@10,@05)                             0229
         STC   @15,CCACD1(,R11)                                    0229
*             ELSE                                                 0230
*               ;                   /* SECURITY CHECK FAILED         */
@RF00228 DS    0H                                                  0231
*           END;                    /* END SECURITY CHECK PROCESSING */
*         ELSE                                                     0232
*           ;                       /* IGNORE SECURITY CHECK PROCESS */
@RF00222 DS    0H                                                  0233
*/********************************************************************/
*/*       NO VOLUME RECORD CURRENTLY EXISTS IN THE CATALOG FOR       */
*/*       THIS VOLUME, SO MARK THE FORMAT4 DSCB OF THE VOLUME        */
*/*       AS OWNED BY VSAM AND CREATE A VOLUME ENTRY RECORD          */
*/********************************************************************/
*                                                                  0233
*         IF CCACD1=RCENT THEN      /* VOLUME RECORD NOT FOUND       */
         CLI   CCACD1(R11),8                                       0233
         BNE   @RF00233                                            0233
*           DO;                                                    0234
*             LTRETCD1(R2)=ZERO;    /* CLEAR LIST CODE               */
*                                                                  0235
         SLR   @10,@10                                             0235
         LR    @05,R2                                              0235
         SLA   @05,3                                               0235
         L     @01,CCACPL(,R11)                                    0235
         L     @01,CTGFVT(,@01)                                    0235
         L     @01,CTGFVVLT(,@01)                                  0235
         AL    @01,@CF04078                                        0235
         STC   @10,LTRETCD1-2(@05,@01)                             0235
*             /*******************************************************/
*             /*                                                     */
*             /* CLEAR CCAMODID, CCAREASN, AND CCARETRN              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0236
*             CCAPROB=IGNOREIT;     /* CLEAR ERROR CODE      @Y30SSDW*/
         ST    @10,CCAPROB(,R11)                                   0236
*Z019F4PR:                                                         0237
*             CALL IGGPF4PR;        /* TAKE VSAM OWNERSHIP OF VOL    */
Z019F4PR BAL   @14,IGGPF4PR                                        0237
*             IF CCACD1^=RCS THEN   /* CHECK IF I/O ERROR            */
         CLI   CCACD1(R11),0                                       0238
         BNE   @RT00238                                            0238
*               GOTO NEXTVOL;       /* GO PROCESS NEXT VOLUME        */
*             ELSE                                                 0240
*               ;                   /* NO I/O ERROR OCCURRED         */
*             DEFOWNVL=ON;          /* SET VOLUME OWNED              */
*                                                                  0241
         OI    DEFOWNVL(DEFSWAR4),B'00010000'                      0241
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLAG                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0242
*Z020AXCI:                                                         0242
*             CALL IGGPAXCI;        /* ASSIGN CI NO. TO RECD         */
Z020AXCI L     @15,@CV03738                                        0242
         BALR  @14,@15                                             0242
*             DEFSWAR4=CCADSPWA;    /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0243
*             R2=DEFSCVOL;          /* RESTORE LOOP INDEX            */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0244
*             IF CCACD1^=RCS THEN   /* CHECK IF AXCI ERROR   @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0245
         BNE   @RT00245                                            0245
*               GOTO NEXTVOL;       /* GO PROCESS NEXT VOLUME      0246
*                                                            @Y30SSDW*/
*             ELSE                                                 0247
*               ;                   /* IGGPAXCI SUCCESSFUL   @Y30SSDW*/
*             CCAURAB=ADDR(CCARAB3);/* RESET RECORD AREA PTR         */
         LA    @10,CCARAB3(,R11)                                   0248
         ST    @10,CCAURAB(,R11)                                   0248
*             IF CAXF2REC=ON&       /* RECOVERABLE CATALOG   @Y30SSDW*/
*                 CCAF2CB=OFF THEN  /* NOT CATALOG BUILD     @Y30SSDW*/
         L     @10,CCAACB(,R11)                                    0249
         L     @10,ACBUAPTR(,@10)                                  0249
         TM    CAXF2REC(@10),B'00000010'                           0249
         BNO   @RF00249                                            0249
         TM    CCAF2CB(R11),B'00000010'                            0249
         BNZ   @RF00249                                            0249
*               CCAVBUFI=ON;        /* SET VOL BUFFER I/O FLAG     0250
*                                                            @Y30SSDW*/
         OI    CCAVBUFI(R11),B'01000000'                           0250
*             ELSE                                                 0251
*               ;                   /* NOT RECOVERABLE CATALOG OR  0251
*                                      CATLG BUILD           @Y30SSDW*/
@RF00249 DS    0H                                                  0252
*Z021IVER:                                                         0252
*             CALL IGGPIVER;        /* BUILD VOLUME RECORD           */
Z021IVER BAL   @14,IGGPIVER                                        0252
*           END;                    /* END CREATE NEW VOL RCD        */
*/********************************************************************/
*/*         CATALOG  SEARCH  ERROR  OR  CATALOG  EOV  CHECK          */
*/********************************************************************/
*                                                                  0254
*         ELSE                                                     0254
*           IF CCACD1^=RCS THEN     /* IF ERROR, SKIP VOLUME         */
         B     @RC00233                                            0254
@RF00233 CLI   CCACD1(R11),0                                       0254
         BNE   @RT00254                                            0254
*             GOTO NEXTVOL;         /* GO PROCESS NEXT VOLUME        */
*           ELSE                    /* NO ERRORS SO FAR              */
*             DO;                   /* CATALOG EOV CHECK             */
*               IF CCADSRCL=OFF THEN/* NOT RECURSIVE CALL FROM     0257
*                                      IGG0CLB4              @Y30SSDW*/
         TM    CCADSRCL(R11),B'10000000'                           0257
         BNZ   @RF00257                                            0257
*                 DO;               /*                       @Y30SSDW*/
*                                                                  0258
*                   /*************************************************/
*                   /*                                               */
*                   /* CALL TO MODULE IGG0CLAG                       */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0259
*Z022ISCI:                                                         0259
*                   CALL IGGPISCI;  /* INSURE ENOUGH CI'S            */
Z022ISCI L     @15,@CV03750                                        0259
         BALR  @14,@15                                             0259
*                   DEFSWAR4=CCADSPWA;/* RESTORE WORKAREA ADDR     0260
*                                                            @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0260
*                 END;              /*                       @Y30SSDW*/
*               ELSE                                               0262
*                 ;                 /* CALLER IS IGG0CLB4    @Y30SSDW*/
@RF00257 DS    0H                                                  0263
*               IF CCACD1^=RCS THEN /* IF ERROR, SKIP VOLUME         */
         CLI   CCACD1(R11),0                                       0263
         BNE   @RT00263                                            0263
*                 GOTO NEXTVOL;     /* GO PROCESS NEXT VOLUME        */
*               ELSE                                               0265
*                 ;                 /* NO ERROR SO FAR               */
*             END;                  /* END CATALOG EOV PROCESSING    */
*       END;                        /* END 'DO' FOR NOT BUILD CASE   */
@RC00233 DS    0H                                                  0268
*     IF CCACD1^=RCS THEN           /* CHECK FOR ERRORS AT THIS POINT
*                                                            @Y30SSDW*/
@RC00189 CLI   CCACD1(R11),0                                       0268
         BNE   @RT00268                                            0268
*       GOTO NEXTVOL;               /* GO PROCESS NEXT VOL   @Y30SSDW*/
*     ELSE                                                         0270
*       ;                           /* NO ERRORS SO FAR      @Y30SSDW*/
*     IF CTGFVSPC->CTGFLPT(1)       /* CHECK IF RECORD REQUEST       */
*         ->SPCRQTYP=RECRDREQ THEN  /* CHECK IF RECORD REQUEST       */
*                                                                  0271
         L     @10,CCACPL(,R11)                                    0271
         L     @10,CTGFVT(,@10)                                    0271
         L     @10,CTGFVSPC(,@10)                                  0271
         L     @10,CTGFLPT(,@10)                                   0271
         TM    SPCRQTYP(@10),B'01000000'                           0271
         BNO   @RF00271                                            0271
         TM    SPCRQTYP(@10),B'10000000'                           0271
         BNZ   @RF00271                                            0271
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLA6                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0272
*Z023CRTC:                                                         0272
*       CALL IGGPCRTC;              /* IF SO, CONVERT RECORD SIZE TO
*                                      TRACKS OR CYLINDERS           */
Z023CRTC L     @15,@CV03742                                        0272
         BALR  @14,@15                                             0272
*     ELSE                                                         0273
*       ;                           /* NOT RECORD TYPE REQUEST       */
@RF00271 DS    0H                                                  0274
*/********************************************************************/
*/*        THIS VOLUME'S SPACE REQUEST IS NOT TO ESTABLISH           */
*/*        IT AS A CANDIDATE VOLUME, SO PROCEED TO FILL IN           */
*/*        THE REST OF THE VOLUME ENTRY RECORD INFORMATION           */
*/********************************************************************/
*                                                                  0274
*     IF CTGFVSPC->CTGFLPT(1)       /* CHECK IF CANDIDATE REQUEST    */
*         ->SPCRQTYP^=CANDREQ THEN                                 0274
         L     @10,CCACPL(,R11)                                    0274
         L     @05,CTGFVT(,@10)                                    0274
         L     @01,CTGFVSPC(,@05)                                  0274
         L     @01,CTGFLPT(,@01)                                   0274
         TM    SPCRQTYP(@01),B'11000000'                           0274
         BZ    @RF00274                                            0274
*       DO;                                                        0275
*         IF DEFSUNIQ=OFF THEN      /* NOT UNIQUE SPACE REQUEST      */
         TM    DEFSUNIQ(DEFSWAR4),B'01000000'                      0276
         BNZ   @RF00276                                            0276
*           DO;                     /* GENERATE DSNAME FOR F1 DSCB TO
*                                      BE BUILT VIA ALLOCATE         */
*             R2=DEFSCVOL;          /* RESTORE LOOP INDEX            */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0278
*             DEFSDSNM(1:17)='Z9999992.VSAMDSPC';                  0279
         MVC   DEFSDSNM(17,DEFSWAR4),@CC03923                      0279
*             DEFSDSNM(18:35)=CMWTIME;/* INSERT TIME STAMP           */
         L     @01,CCACMSWA(,R11)                                  0280
         MVC   DEFSDSNM+17(18,DEFSWAR4),CMWTIME(@01)               0280
*             DEFSDSNM(36:44)='         ';/* PAD WITH BLANKS         */
         MVC   DEFSDSNM+35(9,DEFSWAR4),@CC03926                    0281
*             CTGFVENT=ADDR(DEFSDSNM);/* SET FVT TRUENAME PTR        */
         LA    @15,DEFSDSNM(,DEFSWAR4)                             0282
         ST    @15,CTGFVENT(,@05)                                  0282
*             IF CTGTYPE=CTGTUCAT THEN/* USER CATLG REQUEST          */
         CLI   CTGTYPE(@10),C'U'                                   0283
         BNE   @RF00283                                            0283
*               DEFSDSNM(8:8)='4';  /* SET GENERATED NAME            */
         MVI   DEFSDSNM+7(DEFSWAR4),C'4'                           0284
*             ELSE                  /* NOT USER CATALOG REQ          */
*               IF CTGTYPE=CTGTMCAT THEN/* MASTER CATLG REQ          */
         B     @RC00283                                            0285
@RF00283 L     @10,CCACPL(,R11)                                    0285
         CLI   CTGTYPE(@10),C'M'                                   0285
         BNE   @RF00285                                            0285
*                 DEFSDSNM(8:8)='4';/* SET GENERATED NAME    @Y30SSDW*/
         MVI   DEFSDSNM+7(DEFSWAR4),C'4'                           0286
*               ELSE                                               0287
*                 ;                 /* NOT MASTER CATALOG DEFINE     */
@RF00285 DS    0H                                                  0288
*           END;                    /* END NON-UNIQUE PROCESSING     */
*         ELSE                                                     0289
*           ;                       /* UNIQUE SPACE REQUEST          */
*                                                                  0289
@RF00276 DS    0H                                                  0290
*         /***********************************************************/
*         /*                                                         */
*         /* CALL TO MODULE IGG0CLA6                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0290
*Z024BJFB:                                                         0290
*         CALL IGGPBJFB;            /* BUILD JFCB FOR ALLOCATE       */
@RC00276 DS    0H                                                  0290
Z024BJFB L     @15,@CV03739                                        0290
         BALR  @14,@15                                             0290
*         IF CCACD1^=RCS THEN       /* BAD JFCB GETMAIN      @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0291
         BNE   @RT00291                                            0291
*           GOTO NEXTVOL;           /* RETURN TO CALLER      @Y30SSDW*/
*         ELSE                                                     0293
*           ;                       /* JFCB GETMAIN OKAY     @Y30SSDW*/
*         RFY                                                      0294
*           INFMJFCB BASED(DEFSJPTR);/* MAP THE JFCB         @Y30SSDW*/
*         IF(DEFSUNIQ=OFF)&         /* NOT UNIQUE REQUEST    @Y30SSDW*/
*             (DEFSNVME=ON)&        /* NEW VOLUME            @Y30SSDW*/
*             (CCADSRCL=OFF)&       /* CALLER NOT DEF CRA    @Y30SSDW*/
*             CCAACB^=ZERO&         /* CALLER NOT DEF CATLG  @Y30SSDW*/
*             (CAXF2REC=ON) THEN    /* RECOVERABLE CATLG     @Y30SSDW*/
         TM    DEFSNVME(DEFSWAR4),B'10000000'                      0295
         BNO   @RF00295                                            0295
         TM    DEFSUNIQ(DEFSWAR4),B'01000000'                      0295
         BNZ   @RF00295                                            0295
         TM    CCADSRCL(R11),B'10000000'                           0295
         BNZ   @RF00295                                            0295
         L     @10,CCAACB(,R11)                                    0295
         LTR   @10,@10                                             0295
         BZ    @RF00295                                            0295
         L     @10,ACBUAPTR(,@10)                                  0295
         TM    CAXF2REC(@10),B'00000010'                           0295
         BNO   @RF00295                                            0295
*           DO;                     /* ADD ONE CYL FOR CRA   @Y30SSDW*/
*             DEFSRALL=OFF;         /* IND 1ST ALLOCATE ATTEMPT    0297
*                                                            @Y30SSDW*/
         NI    DEFSRALL(DEFSWAR4),B'11111011'                      0297
*             IF CTGFVSPC->CTGFLPT(1)/* TRACK REQUEST TYPE           */
*                 ->SPCRQTYP=TRACKREQ THEN/*                 @Y30SSDW*/
         L     @10,CCACPL(,R11)                                    0298
         L     @10,CTGFVT(,@10)                                    0298
         L     @10,CTGFVSPC(,@10)                                  0298
         L     @10,CTGFLPT(,@10)                                   0298
         TM    SPCRQTYP(@10),B'10000000'                           0298
         BNO   @RF00298                                            0298
         TM    SPCRQTYP(@10),B'01000000'                           0298
         BNZ   @RF00298                                            0298
*               JFCBPQTY=           /* INCREASE REQUEST QUANTITY     */
*                   JFCBPQTY+CTVNOTRK;/* BY 1 CYLINDER       @Y30SSDW*/
         L     @10,DEFSJPTR(,DEFSWAR4)                             0299
         L     @05,CCAURAB(,R11)                                   0299
         L     @05,CCACPE1(,@05)                                   0299
         SLR   @15,@15                                             0299
         ICM   @15,7,JFCBPQTY(@10)                                 0299
         AH    @15,CTVNOTRK+48(,@05)                               0299
         STCM  @15,7,JFCBPQTY(@10)                                 0299
*             ELSE                  /* CYLINDER REQUEST TYPE @Y30SSDW*/
*               JFCBPQTY=           /* INCREASE REQUEST QUANTITY BY  */
*                   JFCBPQTY+INCR1; /* 1 CYLINDER FOR CRA    @Y30SSDW*/
         B     @RC00298                                            0300
@RF00298 L     @10,DEFSJPTR(,DEFSWAR4)                             0300
         LA    @05,1                                               0300
         SLR   @15,@15                                             0300
         ICM   @15,7,JFCBPQTY(@10)                                 0300
         ALR   @05,@15                                             0300
         STCM  @05,7,JFCBPQTY(@10)                                 0300
*           END;                    /* END CRA PROCESSING    @Y30SSDW*/
*         ELSE                                                     0302
*           ;                       /* CRA NOT NEEDED        @Y30SSDW*/
@RF00295 DS    0H                                                  0303
*ALLOCSPC:                                                         0303
*         ;                         /* ALLOCATE SPACE        @Y30SSDW*/
@RC00295 DS    0H                                                  0303
ALLOCSPC DS    0H                                                  0304
*         RFY                                                      0304
*          (R0,                                                    0304
*           R1) RSTD;               /* RESTRICT REGS FOR SVC CALL    */
*         R0=DEFSJPTR;              /* SET POINTER TO JFCB           */
         L     R0,DEFSJPTR(,DEFSWAR4)                              0305
*         R1=ADDR(VVOLLUCB(1));     /* SET POINTER TO UCB ADDRESS    */
         LA    R1,VVOLLUCB+125(,DEFSWAR4)                          0306
*         GEN(SVC 32);              /* ALLOCATE SPACE PER REQUEST    */
         SVC 32
*         RFY                                                      0308
*          (R0,                                                    0308
*           R1) UNRSTD;             /* RELEASE REGS USED FOR SVC     */
*         RFY                                                      0309
*          (R15) RSTD;              /* RESTRICT RETURN CODE REG      */
*         IF R15^=ZERO THEN         /* ALLOCATE UNSUCCESSFUL         */
         LTR   R15,R15                                             0310
         BZ    @RF00310                                            0310
*           DO;                     /* SET UP ERROR RETURN CODE      */
*             IF R15='04'X THEN     /* DUPLICATE NAME ON VOLUME      */
*                                                                  0312
         CH    R15,@CH00973                                        0312
         BNE   @RF00312                                            0312
*               /*****************************************************/
*               /*                                                   */
*               /* SET CCAMODID='AQ', CCAREASN=RSN2,                 */
*               /* CCARETRN=RCDUPNVL                                 */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0313
*               CCAPROB=IGGSEGID+(RSN2*K256)+RCDUPNVL;/* ECD:      0313
*                                      DUPLICATE NAME ON VOLUME. RCD:
*                                      DUPLICATE DATA SPACE NAME ON
*                                      VOLUME.               @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF04052                             0313
*             ELSE                  /* NAME NOT FOUND ON VOLUME      */
*               DO;                                                0314
         B     @RC00312                                            0314
@RF00312 DS    0H                                                  0315
*                 IF R15='08'X THEN /* OUT OF VTOC SPACE             */
*                                                                  0315
         CH    R15,@CH03622                                        0315
         BNE   @RF00315                                            0315
*                   /*************************************************/
*                   /*                                               */
*                   /* SET CCAMODID='AQ', CCAREASN=RSN0,             */
*                   /* CCARETRN=RCNSPVTC                             */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0316
*                   CCAPROB=IGGSEGID+(RSN0*K256)+RCNSPVTC;/* ECD: NO
*                                      SPACE ON VTOC. RCD: NO DSCB 0316
*                                      SPACE IN VTOC ON VOLUME.    0316
*                                                            @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF04053                             0316
*                 ELSE              /* VTOC SPACE AVAILABLE          */
*                   DO;                                            0317
         B     @RC00315                                            0317
@RF00315 DS    0H                                                  0318
*                     IF R15='0C'X THEN/* I/O ERROR                  */
         CH    R15,@CH03934                                        0318
         BNE   @RF00318                                            0318
*                       DO;                                        0319
*                         CCAMODID='AQ';/* SET MODULE ID             */
         MVC   CCAMODID(2,R11),@CC03935                            0320
*                         CCAREASN=R15;/* SET REASON CODE            */
         STC   R15,CCAREASN(,R11)                                  0321
*                         CCARETRN=RCIOU;/* SET RETURN CODE          */
         MVI   CCARETRN(R11),X'34'                                 0322
*                       END;        /* ECD: I/O ERROR USER VOLUME. 0323
*                                      RCD: DADSM ERROR CODE.      0323
*                                                            @Y30SSDW*/
*                     ELSE          /* NO SPACE AVAILABLE ERROR      */
*                       DO;         /*                       @Y30SSDW*/
*                                                                  0324
         B     @RC00318                                            0324
@RF00318 DS    0H                                                  0325
*                         /*******************************************/
*                         /*                                         */
*                         /* SET CCAMODID='AQ', CCAREASN=RSN10,      */
*                         /* CCARETRN=RCNOSP                         */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0325
*                         CCAPROB=IGGSEGID+(RSN10*K256)+RCNOSP;/*  0325
*                                      ECD: NO SPACE AVAILABLE ON  0325
*                                      USER VOLUME. RCD: DADSM ERROR.
*                                                            @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF04056                             0325
*                         IF DEFSUNIQ=OFF&/* NOT UNIQUE      @Y30SSDW*/
*                             DEFSNVME=ON&/* NEW VOLUME      @Y30SSDW*/
*                             CCAACB^=ZERO&/* CALLER NOT DEFINE    0326
*                                      CATALOG               @Y30SSDW*/
*                             CAXF2REC=ON&/* RECOV CATLG     @Y30SSDW*/
*                             CCADSRCL=OFF&/* CALLER NOT DEF CRA   0326
*                                                            @Y30SSDW*/
*                             DEFSRALL=OFF THEN/* 2ND ALLOC NOT YET
*                                      ATTEMPTED             @Y30SSDW*/
         TM    DEFSNVME(DEFSWAR4),B'10000000'                      0326
         BNO   @RF00326                                            0326
         TM    DEFSUNIQ(DEFSWAR4),B'01000000'                      0326
         BNZ   @RF00326                                            0326
         SLR   @14,@14                                             0326
         L     @10,CCAACB(,R11)                                    0326
         CR    @10,@14                                             0326
         BE    @RF00326                                            0326
         L     @10,ACBUAPTR(,@10)                                  0326
         TM    CAXF2REC(@10),B'00000010'                           0326
         BNO   @RF00326                                            0326
         TM    CCADSRCL(R11),B'10000000'                           0326
         BNZ   @RF00326                                            0326
         TM    DEFSRALL(DEFSWAR4),B'00000100'                      0326
         BNZ   @RF00326                                            0326
*                           DO;     /* TRY ALLOCATE AGAIN    @Y30SSDW*/
*                             DEFSRALL=ON;/* IND 2ND ATTEMPT TO    0328
*                                      ALLOCATE              @Y30SSDW
*                                      CLEAR CCAMODID, CCAREASN, AND
*                                      CCARETRN                      */
         OI    DEFSRALL(DEFSWAR4),B'00000100'                      0328
*                             CCAPROB=IGNOREIT;/* CLEAR PROB DETER 0329
*                                      FIELDS                @Y30SSDW*/
         ST    @14,CCAPROB(,R11)                                   0329
*                             IF CTGFVSPC->CTGFLPT(1)->SPCRQTYP=   0330
*                                 TRACKREQ THEN/* TRACK REQUEST    0330
*                                                            @Y30SSDW*/
         L     @14,CCACPL(,R11)                                    0330
         L     @14,CTGFVT(,@14)                                    0330
         L     @14,CTGFVSPC(,@14)                                  0330
         L     @14,CTGFLPT(,@14)                                   0330
         TM    SPCRQTYP(@14),B'10000000'                           0330
         BNO   @RF00330                                            0330
         TM    SPCRQTYP(@14),B'01000000'                           0330
         BNZ   @RF00330                                            0330
*                               JFCBPQTY=JFCBPQTY-CTVNOTRK;/* REMOVE
*                                      CYLINDER PREVIOUSLY ADDED ON
*                                      FOR CRA               @Y30SSDW*/
         L     @14,DEFSJPTR(,DEFSWAR4)                             0331
         L     @10,CCAURAB(,R11)                                   0331
         L     @10,CCACPE1(,@10)                                   0331
         SLR   @05,@05                                             0331
         ICM   @05,7,JFCBPQTY(@14)                                 0331
         SH    @05,CTVNOTRK+48(,@10)                               0331
         STCM  @05,7,JFCBPQTY(@14)                                 0331
*                             ELSE  /* CYLNDR REQUEST TYPE   @Y30SSDW*/
*                               JFCBPQTY=JFCBPQTY-INCR1;/* REMOVE  0332
*                                      CYLINDER PREVIOUSLY ADDED ON
*                                      FOR CRA               @Y30SSDW*/
         B     @RC00330                                            0332
@RF00330 L     @14,DEFSJPTR(,DEFSWAR4)                             0332
         SLR   @10,@10                                             0332
         ICM   @10,7,JFCBPQTY(@14)                                 0332
         BCTR  @10,0                                               0332
         STCM  @10,7,JFCBPQTY(@14)                                 0332
*                             GOTO ALLOCSPC;/* TRY AGAIN     @Y30SSDW*/
         B     ALLOCSPC                                            0333
*                           END;    /* END 2ND ALLOCATE TRY  @Y30SSDW*/
*                         ELSE                                     0335
*                           ;       /* NO 2ND ATTEMPT        @Y30SSDW*/
@RF00326 DS    0H                                                  0336
*                       END;        /*                       @Y30SSDW*/
*                   END;                                           0337
@RC00318 DS    0H                                                  0338
*               END;                                               0338
@RC00315 DS    0H                                                  0339
*             LTRETCD1(R2)=CCACD1;  /* SAVE CODE IN VOL LIST         */
@RC00312 LR    @14,R2                                              0339
         SLA   @14,3                                               0339
         L     @10,CCACPL(,R11)                                    0339
         L     @10,CTGFVT(,@10)                                    0339
         L     @10,CTGFVVLT(,@10)                                  0339
         SLR   @05,@05                                             0339
         IC    @05,CCACD1(,R11)                                    0339
         AL    @10,@CF04078                                        0339
         STC   @05,LTRETCD1-2(@14,@10)                             0339
*             GOTO NEXTVOL;         /* GO PROCESS NEXT VOLUME        */
         B     NEXTVOL                                             0340
*           END;                                                   0341
*         ELSE                                                     0342
*           ;                       /* ALLOCATE SUCCESSFUL           */
@RF00310 DS    0H                                                  0343
*         RFY                                                      0343
*          (R15) UNRSTD;            /*                       @Y30SSDW*/
*         DEFSALOK=ON;              /* ALLOCATE SUCCESSFUL   @Y30SSDW*/
         OI    DEFSALOK(DEFSWAR4),B'00000010'                      0344
*Z030COBT:                                                         0345
*         CALL IGGPCOBT;            /* OBTAIN THE FORMAT1 DSCB JUST
*                                      WRITTEN BY ALLOC              */
Z030COBT BAL   @14,IGGPCOBT                                        0345
*         IF CCACD1^=RCS THEN       /* OBTAIN DSCB UNSUCCESSFUL      */
         CLI   CCACD1(R11),0                                       0346
         BNE   @RT00346                                            0346
*           GOTO NEXTVOL;           /* GO PROCESS NEXT VOLUME        */
*         ELSE                                                     0348
*           ;                       /* DSCB OBTAIN SUCCESSFUL        */
*         IF CCAACB^=ZERO&          /* NOT CATALOG DEFINE    @Y30SSDW*/
*             CAXF2REC=OFF&         /* NOT RECOVERABLE CATALOG     0349
*                                                            @Y30SSDW*/
*             DEFSNVME=OFF THEN     /* NOT NEW VOLUME        @Y30SSDW*/
         L     @10,CCAACB(,R11)                                    0349
         LTR   @10,@10                                             0349
         BZ    @RF00349                                            0349
         L     @10,ACBUAPTR(,@10)                                  0349
         TM    CAXF2REC(@10),B'00000010'                           0349
         BNZ   @RF00349                                            0349
         TM    DEFSNVME(DEFSWAR4),B'10000000'                      0349
         BNZ   @RF00349                                            0349
*           DO;                     /*                       @Y30SSDW*/
*Z031TMST:                                                         0351
*             CALL IGGPTMST;        /* GET TIME STAMP        @Y30SSDW*/
Z031TMST BAL   @14,IGGPTMST                                        0351
*             IF CCACD1^=RCS THEN   /* TIMESTAMP FAILED      @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0352
         BE    @RF00352                                            0352
*               DO;                 /*                       @Y30SSDW*/
*                 LTRETCD1(R2)=CCACD1;/* SAVE CODE           @Y30SSDW*/
         LR    @10,R2                                              0354
         SLA   @10,3                                               0354
         L     @05,CCACPL(,R11)                                    0354
         L     @05,CTGFVT(,@05)                                    0354
         L     @05,CTGFVVLT(,@05)                                  0354
         SLR   @15,@15                                             0354
         IC    @15,CCACD1(,R11)                                    0354
         AL    @05,@CF04078                                        0354
         STC   @15,LTRETCD1-2(@10,@05)                             0354
*                 GOTO NEXTVOL;     /* PROCESS NEXT VOL      @Y30SSDW*/
         B     NEXTVOL                                             0355
*               END;                /*                       @Y30SSDW*/
*             ELSE                                                 0357
*               ;                   /* TIMESTAMP SUCCESSFUL  @Y30SSDW*/
@RF00352 DS    0H                                                  0358
*           END;                    /* END TIMESTAMP PROCESS @Y30SSDW*/
*         ELSE                                                     0359
*           ;                       /* TIMESTAMP NOT NEEEDED @Y30SSDW*/
*                                                                  0359
@RF00349 DS    0H                                                  0360
*         /***********************************************************/
*         /*                                                         */
*         /* CALL TO MODULE IGG0CLA6                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0360
*Z032DFS2:                                                         0360
*         CALL IGGPDFS2;            /* CONSTRUCT VOLUME ENTRY SPACE
*                                      HEADER GROUP, SPACE DESCRIPTOR
*                                      GROUP, AND IF UNIQUE, DATA SET
*                                      DIRECTORY GROUP               */
Z032DFS2 L     @15,@CV03744                                        0360
         BALR  @14,@15                                             0360
*         IF CCACD1=RCS&            /* NO ERRORS                     */
*             CCAACB^=ZERO&         /* CALLER NOT DEF CATLG  @Y30SSDW*/
*             (CAXF2REC=OFF×DEFSNVME=OFF)&/* NOT RECOVERABLE CATALOG
*                                      OR NOT NEW VOLUME     @Y30SSDW*/
*             DEFSUNIQ=OFF THEN     /* NOT UNIQUE REQUEST            */
         CLI   CCACD1(R11),0                                       0361
         BNE   @RF00361                                            0361
         L     @10,CCAACB(,R11)                                    0361
         LTR   @10,@10                                             0361
         BZ    @RF00361                                            0361
         L     @10,ACBUAPTR(,@10)                                  0361
         TM    CAXF2REC(@10),B'00000010'                           0361
         BZ    @GL00017                                            0361
         TM    DEFSNVME(DEFSWAR4),B'10000000'                      0361
         BNZ   @RF00361                                            0361
@GL00017 TM    DEFSUNIQ(DEFSWAR4),B'01000000'                      0361
         BNZ   @RF00361                                            0361
*           DO;                     /* PERFORM SMF PROCESSES         */
*             CCALCPL=ADDR(DEFSCPL);/* SET LSPACE CPL ADDR           */
         LA    @10,DEFSCPL(,DEFSWAR4)                              0363
         ST    @10,CCALCPL(,R11)                                   0363
*             RFY                                                  0364
*               CTGPL BASED(CCALCPL);                              0364
*             CTGPL=CTGPL&&CTGPL;   /* CLEAR THE CPL AREA            */
         XC    CTGPL(28,@10),CTGPL(@10)                            0365
*             CTGNAME=ON;           /* INDICATE NAME GIVEN           */
         OI    CTGNAME(@10),B'00000100'                            0366
*             CTGSMF=ON;            /* INDICATE SMF PROCESS          */
         OI    CTGSMF(@10),B'01000000'                             0367
*             CTGFUNC=CTGLSP;       /* SET LSPACE OPTION             */
         NI    CTGFUNC(@10),B'01011111'                            0368
         OI    CTGFUNC(@10),B'01000000'                            0368
*             CTGCAT=ADDR(CCAACB);  /* CATALOG ACB ADDRESS           */
         LA    @05,CCAACB(,R11)                                    0369
         ST    @05,CTGCAT(,@10)                                    0369
*             CTGENT=ADDR(DEFSVNUM);/* ADDR OF VOLUME SERIAL         */
         LA    @05,DEFSVNUM(,DEFSWAR4)                             0370
         ST    @05,CTGENT(,@10)                                    0370
*             CTGNUM=ON;            /* SEARCH ONLY ONE CATLG         */
*             CTGAM0=ON;            /* SET VSAM INDICATOR            */
         OI    CTGNUM(@10),B'00000011'                             0372
*             CCALSP=ON;            /* INDICATE LSPACE CALL          */
         OI    CCALSP(R11),B'10000000'                             0373
*             CCAF2NVC=ON;          /* SET NO VALIDITY CHECK         */
         OI    CCAF2NVC(R11),B'01000000'                           0374
*             CCAURAB=ADDR(CCARAB3);/* BASE RECORD RAB ADDR          */
         LA    @10,CCARAB3(,R11)                                   0375
         ST    @10,CCAURAB(,R11)                                   0375
*             DEFSCVOL=R2;          /* SAVE INDEX LOOP COUNT         */
*                                                                  0376
         ST    R2,DEFSCVOL(,DEFSWAR4)                              0376
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLBK                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0377
*Z033LSP:                                                          0377
*             CALL IGGPLSP;         /* CALL LSPACE FUNCTION          */
Z033LSP  L     @15,@CV03751                                        0377
         BALR  @14,@15                                             0377
*             DEFSWAR4=CCADSPWA;    /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0378
*             R2=DEFSCVOL;          /* RESTORE INDEX LOOP CNT        */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0379
*             CCAR4UR=OFF;          /* USED FOR VOLUME ENTRY         */
         NI    CCAR4UR(R11),B'01111111'                            0380
*             CCAR5UR=OFF;          /* USED FOR VOLUME ENTRY         */
*                                                                  0381
         NI    CCAR5UR(R11),B'01111111'                            0381
*             /*******************************************************/
*             /*                                                     */
*             /* CLEAR CCAMODID, CCAREASN, AND CCARETRN              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0382
*             CCAPROB=IGNOREIT;     /* CLEAR ERROR           @Y30SSDW*/
         SLR   @10,@10                                             0382
         ST    @10,CCAPROB(,R11)                                   0382
*             RFY                                                  0383
*               CTGPL BASED(CCACPL);                               0383
*           END;                    /* END SMF PROCESSING            */
*         ELSE                                                     0385
*           ;                       /* SMF PROCESSING NOT NECESSARY  */
@RF00361 DS    0H                                                  0386
*       END;                        /* END 'DO' FOR CANDIDATE REQUEST*/
*/********************************************************************/
*/*        THE DEFINE SPACE REQUEST WAS TO ESTABLISH A               */
*/*        CANDIDATE VOLUME(S), SO IF A VOLUME ENTRY RECORD          */
*/*        DID NOT PREVIOUSLY EXIST FOR THE GIVEN VOLUME,            */
*/*        WRITE OUT THE RECORD JUST CREATED.                        */
*/********************************************************************/
*                                                                  0387
*     ELSE                          /* PERFORM CANDIDATE PROCESSING  */
*       IF DEFSNVME=ON THEN         /* NEW RECORD CREATED            */
         B     @RC00274                                            0387
@RF00274 TM    DEFSNVME(DEFSWAR4),B'10000000'                      0387
         BNO   @RF00387                                            0387
*         DO;                       /*                       @Y30SSDW*/
*           DO;                                                    0389
*             CCAURAB=ADDR(CCARAB3);/* SET RAB PTR                   */
*                                                                  0390
         LA    @10,CCARAB3(,R11)                                   0390
         ST    @10,CCAURAB(,R11)                                   0390
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLAG                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0391
*Z036PAD:                                                          0391
*             CALL IGGPPAD;         /* PUT-ADD RECORD                */
Z036PAD  L     @15,@CV03752                                        0391
         BALR  @14,@15                                             0391
*           END;                    /* PUT-ADD THE NEW RECORD        */
*           DEFSWAR4=CCADSPWA;      /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0393
*         END;                      /*                       @Y30SSDW*/
*       ELSE                                                       0395
*         ;                         /* NOT NEW VOLUME                */
@RF00387 DS    0H                                                  0396
*NEXTVOL:                                                          0396
*     ;                             /* PROCEED TO NEXT VOLUME        */
@RC00274 DS    0H                                                  0396
NEXTVOL  DS    0H                                                  0397
*     IF CCACD1^=RCS THEN           /* AN ERROR EXISTS       @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0397
         BE    @RF00397                                            0397
*       DO;                         /* BACK OUT F4 OWNERSHIP         */
*         LTRETCD1(R2)=CCACD1;      /* SAVE CODE IN LIST     @Y30SSDW*/
         LR    @10,R2                                              0399
         SLA   @10,3                                               0399
         L     @05,CCACPL(,R11)                                    0399
         L     @05,CTGFVT(,@05)                                    0399
         L     @05,CTGFVVLT(,@05)                                  0399
         SLR   @15,@15                                             0399
         IC    @15,CCACD1(,R11)                                    0399
         AL    @05,@CF04078                                        0399
         STC   @15,LTRETCD1-2(@10,@05)                             0399
*         IF DEFOWNVL=ON THEN       /* VOLUME ALREADY OWNED  @Y30SSDW*/
         TM    DEFOWNVL(DEFSWAR4),B'00010000'                      0400
         BNO   @RF00400                                            0400
*           DO;                     /*                       @Y30SSDW*/
*             CCAPROBX=CCAPROB;     /* SAVE PROB DETER INFO  @Y30SSDW*/
*                                                                  0402
         MVC   CCAPROBX(4,R11),CCAPROB(R11)                        0402
*             /*******************************************************/
*             /*                                                     */
*             /* CLEAR CCAMODID, CCAREASN, AND CCARETRN              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0403
*             CCAPROB=IGNOREIT;     /* CLEAR ERROR CODE      @Y30SSDW*/
         SLR   @10,@10                                             0403
         ST    @10,CCAPROB(,R11)                                   0403
*Z038F4PR:                                                         0404
*             CALL IGGPF4PR;        /* RELEASE VOLUME OWNERSHIP      */
Z038F4PR BAL   @14,IGGPF4PR                                        0404
*             CCAPROB=CCAPROBX;     /* RESTORE PROBLEM DETERMINATION
*                                      INFORMATION           @Y30SSDW*/
         MVC   CCAPROB(4,R11),CCAPROBX(R11)                        0405
*           END;                    /*                       @Y30SSDW*/
*         ELSE                                                     0407
*           ;                       /* OWNERSHIP NOT YET TAKEN     0407
*                                                            @Y30SSDW*/
@RF00400 DS    0H                                                  0408
*         IF DEFSALOK=ON THEN       /* SPACE ALLOCATE OK     @Y30SSDW*/
         TM    DEFSALOK(DEFSWAR4),B'00000010'                      0408
         BNO   @RF00408                                            0408
*Z039F1BO:                                                         0409
*           CALL IGGPF1BO;          /* RELEASE SPACE         @Y30SSDW*/
Z039F1BO BAL   @14,IGGPF1BO                                        0409
*         ELSE                                                     0410
*           ;                       /* ALLOCATE FAILED       @Y30SSDW*/
@RF00408 DS    0H                                                  0411
*       END;                        /* END BACK-OUT PROCESSING       */
*     ELSE                                                         0412
*       ;                           /* NO ERROR SO FAR               */
@RF00397 DS    0H                                                  0413
*     DEFOWNVL=OFF;                 /* CLEAR OWNER INDICATOR         */
*     DEFSALOK=OFF;                 /* CLEAR ALLOCATE-OKAY FLAG    0414
*                                                            @Y30SSDW*/
         NI    DEFOWNVL(DEFSWAR4),B'11101101'                      0414
*     CCAURAB=ADDR(CCARAB3);        /* RESET RAB ADDRESS             */
         LA    @10,CCARAB3(,R11)                                   0415
         ST    @10,CCAURAB(,R11)                                   0415
*     IF DEFSVLMT=ON&               /* VOLUME MOUNTED                */
*         DEFSUPTR^=ZERO THEN       /* UCB ADDRESS EXISTS            */
         TM    DEFSVLMT(DEFSWAR4),B'00001000'                      0416
         BNO   @RF00416                                            0416
         SLR   @10,@10                                             0416
         C     @10,DEFSUPTR(,DEFSWAR4)                             0416
         BE    @RF00416                                            0416
*       DO;                         /* DECREMENT DATA MGMT USE CNT   */
*         IF CCAVBUFI=ON&           /* VOL RECORDS BUFFERED  @Y30SSDW*/
*             CCADSRCL=OFF&         /* NOT RECURSIVE CALL FROM     0418
*                                      IGG0CLB4(IGGPDCRA)    @Y30SSDW*/
*             CCAACB^=ZERO&         /* CALLER NOT DEF CATLG  @Y30SSDW*/
*             CCACD1=RCS THEN       /* ALL IS OKAY           @Y30SSDW*/
         TM    CCAVBUFI(R11),B'01000000'                           0418
         BNO   @RF00418                                            0418
         TM    CCADSRCL(R11),B'10000000'                           0418
         BNZ   @RF00418                                            0418
         C     @10,CCAACB(,R11)                                    0418
         BE    @RF00418                                            0418
         CLI   CCACD1(R11),0                                       0418
         BNE   @RF00418                                            0418
*           DO;                     /* DEFINE A CRA          @Y30SSDW*/
*                                                                  0419
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLA6                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0420
*Z040CBPT:                                                         0420
*             CALL IGGPCBPT;        /* COMPUTE BLOCKS/TRACK VALUE FOR
*                                      DEFINE CRA - IGG0CLB4 @Y30SSDW*/
Z040CBPT L     @15,@CV03740                                        0420
         BALR  @14,@15                                             0420
*             CMSDFSPC=VVOLLUCB(1); /* PASS UCB ADDRESS TO DEFINE CRA
*                                      MODULE                @Y30SSDW*/
*                                                                  0421
         L     @10,CCACMSWA(,R11)                                  0421
         MVC   CMSDFSPC(4,@10),VVOLLUCB+125(DEFSWAR4)              0421
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLB4                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0422
*Z041DCRA:                                                         0422
*             CALL IGGPDCRA;        /* DEFINE A CATALOG RECOVERY AREA
*                                      ON THE VOLUME         @Y30SSDW*/
Z041DCRA L     @15,@CV03743                                        0422
         BALR  @14,@15                                             0422
*             DEFSWAR4=CCADSPWA;    /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0423
*             R2=DEFSCVOL;          /* RESTORE IGGPDEFS LOOP INDEX 0424
*                                                            @Y30SSDW*/
         L     R2,DEFSCVOL(,DEFSWAR4)                              0424
*             IF CCACD1^=RCS THEN   /* DEFINE CRA FAILED     @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0425
         BE    @RF00425                                            0425
*               DO;                 /* RELINQUISH VOLUME OWNERSHIP 0426
*                                                            @Y30SSDW*/
*                 DEFOWNVL=ON;      /* IND. VOLUME IS OWNED  @Y30SSDW*/
         OI    DEFOWNVL(DEFSWAR4),B'00010000'                      0427
*                 GO TO NEXTVOL;    /* NEXT-VOLUME PROCESSING      0428
*                                                            @Y30SSDW*/
         B     NEXTVOL                                             0428
*               END;                /*                       @Y30SSDW*/
*             ELSE                                                 0430
*               ;                   /* CRA PROPERLY DEFINED  @Y30SSDW*/
@RF00425 DS    0H                                                  0431
*           END;                    /* END CRA PROCESSING    @Y30SSDW*/
*         ELSE                                                     0432
*           ;                       /* CRA PROCESSING NOT NECESSARY
*                                                            @Y30SSDW*/
@RF00418 DS    0H                                                  0433
*         DEFSVLMT=OFF;             /* CLEAR THE VOLUME MOUNT FLAG   */
         NI    DEFSVLMT(DEFSWAR4),B'11110111'                      0433
*         RFY                                                      0434
*          (R7,                                                    0434
*           R8,                                                    0434
*           R9,                                                    0434
*           R10) RSTD;              /*                         Y02020*/
*         R10=DEFSUPTR;             /* SET UCB BASE            Y02020*/
         L     R10,DEFSUPTR(,DEFSWAR4)                             0435
*         GEN SETS(R7,R8,R9,R10,UCBDMCT);                          0436
*                                                           /* Y02020*/
CS1            L    R9,UCBDMCT-3(,R10)                         Y02020
               LR   R8,R9                                      Y02020
               LA   R7,1                                       Y02020
               SLR  R9,R7                                      Y02020
               CS   R8,R9,UCBDMCT-3(R10)                       Y02020
               BNZ  CS1                                        Y02020
*         RFY                                                      0437
*          (R7,                                                    0437
*           R8,                                                    0437
*           R9,                                                    0437
*           R10) UNRSTD;            /*                         Y02020*/
*       END;                                                       0438
*     ELSE                                                         0439
*       ;                           /* VOLUME NOT MOUNTED OR NO UCB
*                                      ADDRESS                       */
@RF00416 DS    0H                                                  0440
*     IF CCACD1=COCECOMP×           /* IF OPEN COMPLETED OR          */
*         CCACD1=RCSEC THEN         /* SECURITY CHECK FAILS, THEN    */
         CLI   CCACD1(R11),4                                       0440
         BE    @RT00440                                            0440
         CLI   CCACD1(R11),56                                      0440
         BE    @RT00440                                            0440
*       GOTO ERRORXT;               /* ERROR EXIT FROM DEFINE SPACE  */
*     ELSE                                                         0442
*       ;                           /* NO ERROR SO FAR               */
*   END;                            /* END PROCESSING LOOP ON VOLUME
*                                      LIST                          */
         AH    R2,@CH00037                                         0443
@DE00174 L     @10,CCACPL(,R11)                                    0443
         L     @10,CTGFVT(,@10)                                    0443
         L     @10,CTGFVVLT(,@10)                                  0443
         LH    @00,LTLENGTH(,@10)                                  0443
         SRDA  @00,32                                              0443
         D     @00,@CF00042                                        0443
         CR    R2,@01                                              0443
         BNH   @DL00174                                            0443
*ERRORXT:                                                          0444
*   ;                               /* EXIT WITH MAJOR ERRORS        */
ERRORXT  DS    0H                                                  0445
*Z042DSXT:                                                         0445
*   CALL IGGPDSXT;                  /* CALL DEFINE SPACE EXIT ROUTINE*/
Z042DSXT BAL   @14,IGGPDSXT                                        0445
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0446
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPVMTV');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPVMTV'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0449
@EF00002 DS    0H                                                  0449
@ER00002 BR    @14                                                 0449
@PB00002 DS    0H                                                  0450
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0451
*/********************************************************************/
*/*                                                                  */
*/*        IGGPVMTV  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0451
*IGGPVMTV:                                                         0451
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00003                                            0451
IGGPVMTV DS    0H                                                  0452
*Z043:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z043VMTV:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0452
*    (R5,                                                          0452
*     R6,                                                          0452
*     R7,                                                          0452
*     R8,                                                          0452
*     R9,                                                          0452
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z043     DS    0H                                                  0452
Z043VMTV DS    0H                                                  0453
*   RFY                                                            0453
*    (R2,                                                          0453
*     R3,                                                          0453
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*      THIS SUBFUNCTION MOUNTS AND/OR VERIFIES THE APPROPRIATE     */
*/*      VOLUME FROM THE VOLUME LIST PASSED TO DEFINE SPACE          */
*/********************************************************************/
*                                                                  0456
*   RFY                                                            0456
*     R1 RSTD;                                                     0456
*   R1=ADDR(IDAVVOLL);              /* SET R1 TO PARAMETER LIST FOR
*                                      IFG0192V                      */
         LA    R1,125                                              0457
         ALR   R1,DEFSWAR4                                         0457
*   RFY                                                            0458
*     IDAVVOLL BASED(R1);                                          0458
*   VVOLLID=ON;                     /* SET IND FOR VOLUME LIST       */
         OI    VVOLLID(R1),B'01000000'                             0459
*   VVOLLNBR=INCR1;                 /* SET TO PROCESS 1 VOLUME       */
         MVC   VVOLLNBR(2,R1),@CH00037                             0460
*/********************************************************************/
*/*      FIND THE TIOT ENTRY ADDRESS FOR THE DD CARD ASSOCIATED      */
*/*      WITH THIS REQUEST                                           */
*/********************************************************************/
*                                                                  0461
*   VVOLLTAB=CCATCB->TCBTIO;        /* SET POINTER TO FIRST DD       */
         L     @10,CCATCB(,R11)                                    0461
         L     @10,TCBTIO(,@10)                                    0461
         ST    @10,VVOLLTAB(,R1)                                   0461
*   VVOLLTAB=VVOLLTAB+LENGTH(TIOT1);/* ENTRY IN THE TIOT             */
         AH    @10,@CH00112                                        0462
         ST    @10,VVOLLTAB(,R1)                                   0462
*   VVOLLCAT=ON;                    /* SET CATALOG REQ FLAG          */
         OI    VVOLLCAT(R1),B'00000100'                            0463
*   RFY                                                            0464
*     TIOENTRY BASED(VVOLLTAB);     /* MAP DD ENTRY IN TIOT          */
*   DO WHILE(TIOEDDNM^=CTGFVIND->FIELDNM&TIOELNGH^=ZERO);          0465
         B     @DE00465                                            0465
@DL00465 DS    0H                                                  0466
*     VVOLLTAB=VVOLLTAB+TIOELNGH;   /* SET ADDR NEXT DD ENTRY        */
         L     @10,VVOLLTAB(,R1)                                   0466
         SLR   @05,@05                                             0466
         IC    @05,TIOELNGH(,@10)                                  0466
         ALR   @05,@10                                             0466
         ST    @05,VVOLLTAB(,R1)                                   0466
*   END;                            /* END TIOT SEARCH LOOP          */
@DE00465 L     @10,VVOLLTAB(,R1)                                   0467
         L     @05,CCACPL(,R11)                                    0467
         L     @05,CTGFVT(,@05)                                    0467
         L     @05,CTGFVIND(,@05)                                  0467
         CLC   TIOEDDNM(8,@10),FIELDNM(@05)                        0467
         BE    @DC00465                                            0467
         CLI   TIOELNGH(@10),0                                     0467
         BNE   @DL00465                                            0467
@DC00465 DS    0H                                                  0468
*   VVOLLVSR(1)=LTVOLSER(DEFSCVOL); /* SET VOLSER NUMBER             */
         L     @10,DEFSCVOL(,DEFSWAR4)                             0468
         SLA   @10,3                                               0468
         L     @05,CCACPL(,R11)                                    0468
         L     @05,CTGFVT(,@05)                                    0468
         L     @05,CTGFVVLT(,@05)                                  0468
         ALR   @05,@10                                             0468
         AL    @05,@CF04074                                        0468
         MVC   VVOLLVSR(6,R1),LTVOLSER-4(@05)                      0468
*   RFY                                                            0469
*    (R13) RSTD;                                                   0469
*   R13=R13+TWELVE;                 /* PUSH THE PUCH-DOWN PTR LIST   */
         AH    R13,@CH00072                                        0470
*   R3=CVTSVDCB;                    /* GET SVCLIB DCB ADDRESS        */
         L     @10,CVTPTR                                          0471
         L     R3,CVTSVDCB(,@10)                                   0471
*   RFY                                                            0472
*     R1 UNRSTD;                                                   0472
*   GEN(LOAD EP=IDA0192V,DCB=(R3)); /* LOAD VOLUME MOUNT RTN         */
         LOAD EP=IDA0192V,DCB=(R3)
*   RFY                                                            0474
*    (R0,                                                          0474
*     R1,                                                          0474
*     R15) RSTD;                                                   0474
*   R1=ADDR(DEFSVOLL);              /* RE-SET PARM LIST ADDR         */
         LA    R1,DEFSVOLL(,DEFSWAR4)                              0475
*   R15=R0;                         /* GET ENTRY POINT ADDR          */
         LR    R15,R0                                              0476
*   GEN(BALR 14,15);                /* BRANCH TO VOL MOUNT RTN       */
         BALR 14,15
*   R13=R13-TWELVE;                 /* POP THE PUSH-DOWN PTR LIST    */
         SH    R13,@CH00072                                        0478
*   RFY                                                            0479
*    (R13) UNRSTD;                                                 0479
*   DEFSWAR4=CCADSPWA;              /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0480
*   R2=DEFSCVOL;                    /* RESTORE LOOP INDEX            */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0481
*   DEFSUPTR=VVOLLUCB(1);           /* SAVE POINTER TO UCB           */
         MVC   DEFSUPTR(4,DEFSWAR4),VVOLLUCB(R1)                   0482
*   IF R15^=ZERO THEN               /* ERROR EXISTS                  */
         LTR   R15,R15                                             0483
         BZ    @RF00483                                            0483
*     DO;                                                          0484
*       DO;                                                        0485
*         CCAMODID='AQ';            /* SET MODULE ID                 */
         MVC   CCAMODID(2,R11),@CC03935                            0486
*         CCAREASN=R15;             /* SET REASON CODE               */
         STC   R15,CCAREASN(,R11)                                  0487
*         CCARETRN=RCNMNTD;         /* SET RETURN CODE               */
         MVI   CCARETRN(R11),X'48'                                 0488
*       END;                        /* ECD: USER VOLUME NOT MOUNTED.
*                                      RCD: VOLUME MOUNT ERROR CODE.
*                                                            @Y30SSDW*/
*       LTRETCD1(R2)=RCNMNTD;       /* SAVE ERROR CODE IN LIST       */
         LR    @14,R2                                              0490
         SLA   @14,3                                               0490
         L     @10,CCACPL(,R11)                                    0490
         L     @10,CTGFVT(,@10)                                    0490
         L     @10,CTGFVVLT(,@10)                                  0490
         LA    @05,72                                              0490
         AL    @10,@CF04078                                        0490
         STC   @05,LTRETCD1-2(@14,@10)                             0490
*     END;                                                         0491
*   ELSE                            /* NO ERRORS                     */
*     DEFSVLMT=ON;                  /* INDICATE VOLUME MOUNTED       */
         B     @RC00483                                            0492
@RF00483 OI    DEFSVLMT(DEFSWAR4),B'00001000'                      0492
*   GEN(DELETE EP=IDA0192V);                                       0493
@RC00483 DS    0H                                                  0493
         DELETE EP=IDA0192V
*   RFY                                                            0494
*    (R0,                                                          0494
*     R1,                                                          0494
*     R15) UNRSTD;                                                 0494
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0495
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPIVER');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPIVER'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00003 DS    0H                                                  0498
@EF00003 DS    0H                                                  0498
@ER00003 BR    @14                                                 0498
@PB00003 DS    0H                                                  0499
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0500
*/********************************************************************/
*/*                                                                  */
*/*        IGGPIVER  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0500
*IGGPIVER:                                                         0500
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00004                                            0500
IGGPIVER DS    0H                                                  0501
*Z045:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z045IVER:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0501
*    (R5,                                                          0501
*     R6,                                                          0501
*     R7,                                                          0501
*     R8,                                                          0501
*     R9,                                                          0501
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z045     DS    0H                                                  0501
Z045IVER DS    0H                                                  0502
*   RFY                                                            0502
*    (R2,                                                          0502
*     R3,                                                          0502
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*     THIS SUBFUNCTION INITIALIZES THE FIXED INFORMATION OF THE    */
*/*     NEW VOLUME ENTRY RECORD BEING CREATED BY DEFINE SPACE        */
*/********************************************************************/
*/********************************************************************/
*/*          CONSTRUCT  VOLUME  RECORD  KEY  INFORMATION             */
*/********************************************************************/
*                                                                  0505
*   DEFSDRA1=DEFSDRA1&&DEFSDRA1;    /* CLEAR RECORD AREA BLOCK       */
         L     @10,CCAURAB(,R11)                                   0505
         L     @10,CCACPE1(,@10)                                   0505
         XC    DEFSDRA1(256,@10),DEFSDRA1(@10)                     0505
*   DEFSDRA2=DEFSDRA2&&DEFSDRA2;    /* CLEAR RECORD AREA BLOCK       */
         XC    DEFSDRA2(256,@10),DEFSDRA2(@10)                     0506
*   RCDCINO=CCAASCI(1);             /* SET CI NO. VALUE              */
         MVC   RCDCINO(3,@10),CCAASCI(R11)                         0507
*   RCDID='V';                      /* SET VOLUME RECORD ID          */
         MVI   RCDID(@10),C'V'                                     0508
*   NREPLF=LENGTH(CATRCD)           /* SET LENGTH OF FIXED           */
*       +LENGTH(CTVOLRCD);          /* FIELDS                        */
         LA    @05,127                                             0509
         STC   @05,NREPLF(,@10)                                    0509
*   RCDSIZ=NREPLF                   /* SET AMOUNT OF RECORD          */
*       +LENGTH(CTVEXRPT)           /* SPACE USED SO FAR, INCL       */
*       +LENGTH(CTVEXRCT);          /* FIXED INFO FOR GOP            */
         AH    @05,@CH00051                                        0510
         STH   @05,RCDSIZ(,@10)                                    0510
*/********************************************************************/
*/*          CONSTRUCT  VOLUME  RECORD  FIXED  INFORMATION           */
*/********************************************************************/
*                                                                  0511
*   CTVOLNME=DEFSVNUM;              /* SET VOLSER NUMBER             */
         AH    @10,@CH00124                                        0511
         MVC   CTVOLNME(44,@10),DEFSVNUM(DEFSWAR4)                 0511
*   CTVOLTIM=CMWASTOR;              /* PUT TIME STAMP IN VOLUME RECD */
         L     @05,CCACMSWA(,R11)                                  0512
         MVC   CTVOLTIM(8,@10),CMWASTOR(@05)                       0512
*   RFY                                                            0513
*    (R0,                                                          0513
*     R1,                                                          0513
*     R5,                                                          0513
*     R6,                                                          0513
*     R7,                                                          0513
*     R8,                                                          0513
*     R9,                                                          0513
*     R10) RSTD;                                                   0513
*   R0=ADDR(DEFSDVTY);              /* ADDR OF DEV TYPE FEEDBACK AREA*/
         LA    R0,DEFSDVTY(,DEFSWAR4)                              0514
*   R1=CTGFVIND;                    /* ADDR OF PARM LIST             */
         L     @15,CCACPL(,R11)                                    0515
         L     @15,CTGFVT(,@15)                                    0515
         L     R1,CTGFVIND(,@15)                                   0515
*   GEN;                                                           0516
*                                                         /* @Y30SSDW*/
         SPACE
         DEVTYPE (1),(0),DEVTAB
         SPACE
*   RFY                                                            0517
*     R15 RSTD;                     /* SAVE DEVTYPE RETURN CODE    0517
*                                                            @Y30SSDW*/
*   IF R15^=RCS THEN                /* INFORMATION NOT OBTAINED      */
         LTR   R15,R15                                             0518
         BZ    @RF00518                                            0518
*     DO;                           /* SET ERROR CODE        @Y30SSDW*/
*                                                                  0519
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='AQ', CCAREASN=RSN8, CCARETRN=RCINDER        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0520
*       CCAPROB=IGGSEGID+(RSN8*K256)+RCINDER;/* ECD: DD STMT ERROR.
*                                      RCD: INVALID DEVICE TYPE OR 0520
*                                      IKQLAB FAILURE DURING DEVICE
*                                      TYPE PROCESSING.      @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF04061                             0520
*       CALL EXIT;                  /* RETURN TO IGGPDEFS            */
         BAL   @14,EXIT                                            0521
*     END;                                                         0522
*   ELSE                                                           0523
*     ;                             /* DEVTYPE MACRO SUCCESSFUL      */
@RF00518 DS    0H                                                  0524
*   RFY                                                            0524
*     R15 UNRSTD;                   /* FREE USAGE OF R15     @Y30SSDW*/
*   CTVDVCHR=DEFSDVTY;              /* SET DEVICE CHARACTERISTICS    */
         L     @15,CCAURAB(,R11)                                   0525
         LA    @14,48                                              0525
         AL    @14,CCACPE1(,@15)                                   0525
         MVC   CTVDVCHR(20,@14),DEFSDVTY(DEFSWAR4)                 0525
*   CTVDEVTY(2)=CTVDEVTY(2)&SYSMASK1;/* CLEAR CPU-SHARE BIT  @Y30SSDW*/
         NI    CTVDEVTY+1(@14),X'DF'                               0526
*   IF CTVDEVTY(3:4)=D3340 THEN     /* 3340 DEVICE?          @Y30SSDW*/
         CLC   CTVDEVTY+2(2,@14),@CB03785                          0527
         BNE   @RF00527                                            0527
*     CTVDEVTY(2)=CTVDEVTY(2)&SYSMASK2;/* TURN OFF RPS BIT   @Y30SSDW*/
         NI    CTVDEVTY+1(@14),X'EF'                               0528
*   ELSE                                                           0529
*     ;                             /* NOT 3340 DEVICE       @Y30SSDW*/
@RF00527 DS    0H                                                  0530
*   IF(CCAACB^=ZERO&                /* CALLER NOT IGG0CLAS   @Y30SSDW*/
*       CAXF2REC=ON)×               /* RECOVERABLE CATALOG   @Y30SSDW*/
*       CTGFVDRC=ON THEN            /* DEFINE RECOVERY CATLG @Y30SSDW*/
         L     @15,CCAACB(,R11)                                    0530
         LTR   @15,@15                                             0530
         BZ    @GL00026                                            0530
         L     @15,ACBUAPTR(,@15)                                  0530
         TM    CAXF2REC(@15),B'00000010'                           0530
         BO    @RT00530                                            0530
@GL00026 L     @15,CCACPL(,R11)                                    0530
         L     @15,CTGFVT(,@15)                                    0530
         TM    CTGFVDRC(@15),B'00010000'                           0530
         BNO   @RF00530                                            0530
@RT00530 DS    0H                                                  0531
*     DO;                           /* SET RECOVERY FIELDS   @Y30SSDW*/
*       RCDCRAVL=DEFSVNUM(1:6);     /* SET CRA VOLSER        @Y30SSDW*/
         L     @15,CCAURAB(,R11)                                   0532
         L     @15,CCACPE1(,@15)                                   0532
         MVC   RCDCRAVL(6,@15),DEFSVNUM(DEFSWAR4)                  0532
*       RCDCRADT=CTVDEVTY;          /* SET CRA DEVICE TYPE   @Y30SSDW*/
         MVC   RCDCRADT(4,@15),CTVDEVTY+48(@15)                    0533
*     END;                          /*                       @Y30SSDW*/
*   ELSE                                                           0535
*     ;                             /* NOT RECOVERABLE CATLG @Y30SSDW*/
@RF00530 DS    0H                                                  0536
*   RFY                                                            0536
*    (R0,                                                          0536
*     R1,                                                          0536
*     R5,                                                          0536
*     R6,                                                          0536
*     R7,                                                          0536
*     R8,                                                          0536
*     R9,                                                          0536
*     R10) UNRSTD;                                                 0536
*   CTVSYEDS='05'X;                 /* 5 DATA SET EXTENTS ALLOWED    */
         L     @10,CCAURAB(,R11)                                   0537
         L     @05,CCACPE1(,@10)                                   0537
         MVI   CTVSYEDS+48(@05),X'05'                              0537
*   DEFSNVME=ON;                    /* SET NEW VOLUME ENTRY FLAG     */
         OI    DEFSNVME(DEFSWAR4),B'10000000'                      0538
*   CCACPE2=CCACPE1+NREPLF;         /* SET PTR TO REPEATING FIELDS 0539
*                                      CONTROL INFORMATION           */
         SLR   @15,@15                                             0539
         IC    @15,NREPLF(,@05)                                    0539
         ALR   @15,@05                                             0539
         ST    @15,CCACPE2(,@10)                                   0539
*   CCACPE3=CCACPE2                 /* SET POINTER TO FIRST GROUP    */
*       +LENGTH(EXTRCDPT)           /* OCCURRENCE                    */
*       +LENGTH(REPCNT);                                           0540
         AH    @15,@CH00051                                        0540
         ST    @15,CCACPE3(,@10)                                   0540
*   CCACPE4=CCACPE3;                /* SET POINTER TO END OF RECORD  */
         ST    @15,CCACPE4(,@10)                                   0541
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0542
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPCOBT');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPCOBT'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00004 DS    0H                                                  0545
@EF00004 DS    0H                                                  0545
@ER00004 BR    @14                                                 0545
@PB00004 DS    0H                                                  0546
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0547
*/********************************************************************/
*/*                                                                  */
*/*        IGGPCOBT  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0547
*IGGPCOBT:                                                         0547
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00005                                            0547
IGGPCOBT DS    0H                                                  0548
*Z047:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z047COBT:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0548
*    (R5,                                                          0548
*     R6,                                                          0548
*     R7,                                                          0548
*     R8,                                                          0548
*     R9,                                                          0548
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z047     DS    0H                                                  0548
Z047COBT DS    0H                                                  0549
*   RFY                                                            0549
*    (R2,                                                          0549
*     R3,                                                          0549
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*      THIS SUBFUNCTION OBTAINS A FORMAT 3 OR FORMAT 1 DSCB        */
*/*      FOR THE DEFINE SPACE FUNCTION                               */
*/********************************************************************/
*                                                                  0552
*   DEFSOTYP=DEFSOSRH;              /* SET OPERATION TYPE TO SEARCH  */
         MVC   DEFSOTYP(2,DEFSWAR4),@CH03773                       0552
*   DEFSODSN=CTGFVENT;              /* SET POINTER TO DS NAME        */
         L     @10,CCACPL(,R11)                                    0553
         L     @10,CTGFVT(,@10)                                    0553
         MVC   DEFSODSN(4,DEFSWAR4),CTGFVENT(@10)                  0553
*   DEFSOVOL=ADDR(LTVOLSER(DEFSCVOL));/* SET PTR TO VOLSER #         */
         L     @05,DEFSCVOL(,DEFSWAR4)                             0554
         SLA   @05,3                                               0554
         L     @10,CTGFVVLT(,@10)                                  0554
         AL    @10,@CF04074                                        0554
         LA    @10,LTVOLSER-4(@05,@10)                             0554
         ST    @10,DEFSOVOL(,DEFSWAR4)                             0554
*   DEFSOBUF=ADDR(DEFSBUFF);        /* SET POINTER TO DSCB BUFFER    */
         LA    @10,DEFSBUFF(,DEFSWAR4)                             0555
         ST    @10,DEFSOBUF(,DEFSWAR4)                             0555
*   RFY                                                            0556
*     R1 RSTD;                      /* RESTRICT USE FOR SVC CALL     */
*   R1=ADDR(DEFSOCAM);              /* SET POINTER TO CAM LIST       */
         LA    R1,DEFSOCAM(,DEFSWAR4)                              0557
*   GEN(SVC 27);                    /* ISSUE OBTAIN DSCB SVC         */
         SVC 27
*   RFY                                                            0559
*     R1 UNRSTD;                    /* UNRESTRICT USE OF REG 1       */
*   RFY                                                            0560
*     R15 RSTD;                     /* RESTRICT USE OF RTN CODE REG  */
*   IF R15^=ZERO THEN               /* OBTAIN DSCB FAILED    @Y30SSDW*/
         LTR   R15,R15                                             0561
         BZ    @RF00561                                            0561
*     DO;                                                          0562
*       CCAMODID='AQ';              /* SET MODULE ID                 */
         MVC   CCAMODID(2,R11),@CC03935                            0563
*       CCAREASN=R15;               /* SET REASON CODE               */
         STC   R15,CCAREASN(,R11)                                  0564
*       CCARETRN=RCIOU;             /* SET RETURN CODE               */
         MVI   CCARETRN(R11),X'34'                                 0565
*     END;                          /* ECD: I/O ERROR ON USER VOLUME.
*                                      RCD: DADSM'S ERROR CODE.    0566
*                                                            @Y30SSDW*/
*   ELSE                                                           0567
*     ;                             /* OBTAIN DSCB OKAY      @Y30SSDW*/
@RF00561 DS    0H                                                  0568
*   RFY                                                            0568
*     R15 UNRSTD;                   /* UNRESTRICT USE OF REG 15      */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0569
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPF4PR');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPF4PR'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00005 DS    0H                                                  0572
@EF00005 DS    0H                                                  0572
@ER00005 BR    @14                                                 0572
@PB00005 DS    0H                                                  0573
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0574
*/********************************************************************/
*/*                                                                  */
*/*        IGGPF4PR  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0574
*IGGPF4PR:                                                         0574
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00006                                            0574
IGGPF4PR DS    0H                                                  0575
*Z049:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z049F4PR:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0575
*    (R5,                                                          0575
*     R6,                                                          0575
*     R7,                                                          0575
*     R8,                                                          0575
*     R9,                                                          0575
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z049     DS    0H                                                  0575
Z049F4PR DS    0H                                                  0576
*   RFY                                                            0576
*    (R2,                                                          0576
*     R3,                                                          0576
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*      INTERNAL PROCEDURE TO DO ALL FORMAT 4 DSCB PROCESSING       */
*/********************************************************************/
*                                                                  0579
*   RFY                                                            0579
*     IECSDSF4 BASED(ADDR(F4WBUF));                                0579
*   RFY                                                            0580
*     IGGMF4WA BASED(CCAURAB);                                     0580
*   CCAURAB=CCAR0REC;               /* FORMAT 4 ROUTINE WORKAREA ADDR*/
         L     @10,CCAR0REC(,R11)                                  0581
         ST    @10,CCAURAB(,R11)                                   0581
*   F4WDUCB=DEFSUPTR;               /* SET UCB ADDRESS               */
*                                                                  0582
         MVC   F4WDUCB(3,@10),DEFSUPTR+1(DEFSWAR4)                 0582
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL TO MODULE IGG0CLBU                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0583
*Z050F4RD:                                                         0583
*   CALL IGGPF4RD;                  /* READ FORMAT 4 DSCB            */
Z050F4RD L     @15,@CV03747                                        0583
         BALR  @14,@15                                             0583
*   DEFSWAR4=CCADSPWA;              /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0584
*   IF CCACD1^=RCS THEN             /* FORMAT 4 READ ERROR           */
         CLI   CCACD1(R11),0                                       0585
         BE    @RF00585                                            0585
*     DO;                                                          0586
*       R2=DEFSCVOL;                /* RESTORE IGGPDEFS LOOP IDX     */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0587
*       LTRETCD1(R2)=CCACD1;        /* SAVE ERROR CODE IN VOL LIST   */
         LR    @10,R2                                              0588
         SLA   @10,3                                               0588
         L     @05,CCACPL(,R11)                                    0588
         L     @05,CTGFVT(,@05)                                    0588
         L     @05,CTGFVVLT(,@05)                                  0588
         SLR   @15,@15                                             0588
         IC    @15,CCACD1(,R11)                                    0588
         AL    @05,@CF04078                                        0588
         STC   @15,LTRETCD1-2(@10,@05)                             0588
*       GOTO NXTVLF4;               /* SKIP THIS VOLUME              */
         B     NXTVLF4                                             0589
*     END;                                                         0590
*   ELSE                                                           0591
*     ;                             /* FORMAT-4 READ SUCCESSFUL      */
@RF00585 DS    0H                                                  0592
*   IF DS4VSREF=ON&                 /* VOLUME OWNED          @Y30SSDW*/
*       DEFOWNVL=OFF THEN           /* OWNERSHIP NOT YET NOTED       */
         L     @10,CCAURAB(,R11)                                   0592
         TM    DS4VSREF+120(@10),B'10000000'                       0592
         BNO   @RF00592                                            0592
         TM    DEFOWNVL(DEFSWAR4),B'00010000'                      0592
         BNZ   @RF00592                                            0592
*     DO;                           /* SET ERROR CODE        @Y30SSDW*/
*                                                                  0593
*       /*************************************************************/
*       /*                                                           */
*       /* SET CCAMODID='AQ', CCAREASN=RSN0, CCARETRN=RCVOLOWN       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0594
*       CCAPROB=IGGSEGID+(RSN0*K256)+RCVOLOWN;/* ECD: VOLUME ALREADY
*                                      OWNED. RCD: ATTEMPT TO ACQUIRE
*                                      OWNERSHIP OF A VOLUME ALREADY
*                                      OWNED.                @Y30SSDW*/
         MVC   CCAPROB(4,R11),@CF04062                             0594
*       R2=DEFSCVOL;                /* RESTORE IGGPDEFS LOOP INDEX   */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0595
*       LTRETCD1(R2)=CCACD1;        /* SAVE ERROR CODE IN VOL LIST   */
*                                                                  0596
         LR    @10,R2                                              0596
         SLA   @10,3                                               0596
         L     @05,CCACPL(,R11)                                    0596
         L     @05,CTGFVT(,@05)                                    0596
         L     @05,CTGFVVLT(,@05)                                  0596
         SLR   @15,@15                                             0596
         IC    @15,CCACD1(,R11)                                    0596
         AL    @05,@CF04078                                        0596
         STC   @15,LTRETCD1-2(@10,@05)                             0596
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBU                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0597
*Z052F4DQ:                                                         0597
*       CALL IGGPF4DQ;              /* DEQ VTOC ONLY                 */
Z052F4DQ L     @15,@CV03746                                        0597
         BALR  @14,@15                                             0597
*       GOTO NXTVLF4;               /* SKIP THIS VOLUME              */
         B     NXTVLF4                                             0598
*     END;                                                         0599
*   ELSE                                                           0600
*     ;                             /* VOLUME NOT YET OWNED          */
@RF00592 DS    0H                                                  0601
*   IF DEFOWNVL=ON THEN             /* OWNERSHIP ALREADY TAKEN       */
         TM    DEFOWNVL(DEFSWAR4),B'00010000'                      0601
         BNO   @RF00601                                            0601
*     DO;                           /* RELINQUISH OWNERSHIP          */
*       DS4VSREF=OFF;               /* CLEAR OWNERSHIP BIT   @Y30SSDW*/
         LA    @10,120                                             0603
         AL    @10,CCAURAB(,R11)                                   0603
         NI    DS4VSREF(@10),B'01111111'                           0603
*       DS4AMTIM=DS4AMTIM&&DS4AMTIM;/* CLEAR TIME STAMP              */
         XC    DS4AMTIM(8,@10),DS4AMTIM(@10)                       0604
*       DS4R2TIM=DS4R2TIM&&DS4R2TIM;/* CLEAR TIME STAMP      @Y30SSDW*/
         XC    DS4R2TIM(8,@10),DS4R2TIM(@10)                       0605
*       DS4VSCRA=NOCRATT;           /* CLEAR CRA LOCATION FIELD    0606
*                                                            @Y30SSDW*/
         SLR   @05,@05                                             0606
         STH   @05,DS4VSCRA(,@10)                                  0606
*     END;                                                         0607
*   ELSE                            /* VOLUME NOT OWNED              */
*     DO;                           /* ACQUIRE OWNERSHIP             */
         B     @RC00601                                            0608
@RF00601 DS    0H                                                  0609
*       DS4VSREF=ON;                /* SET VOLUME USED       @Y30SSDW*/
         LA    @10,120                                             0609
         AL    @10,CCAURAB(,R11)                                   0609
         OI    DS4VSREF(@10),B'10000000'                           0609
*       DS4AMTIM=CMWASTOR;          /* SET VOLUME TIME STAMP         */
         L     @05,CCACMSWA(,R11)                                  0610
         MVC   DS4AMTIM(8,@10),CMWASTOR(@05)                       0610
*       DS4R2TIM=CMWASTOR;          /* SET VOLUME TIME STAMP @Y30SSDW*/
         MVC   DS4R2TIM(8,@10),CMWASTOR(@05)                       0611
*     END;                                                         0612
*                                                                  0612
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL TO MODULE IGG0CLBU                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0613
*Z053F4WR:                                                         0613
*   CALL IGGPF4WR;                  /* WRITE F4 DSCB                 */
@RC00601 DS    0H                                                  0613
Z053F4WR L     @15,@CV03748                                        0613
         BALR  @14,@15                                             0613
*NXTVLF4:                                                          0614
*   ;                               /* PREPARE FOR NEXT VOLUME       */
NXTVLF4  DS    0H                                                  0615
*   DEFSWAR4=CCADSPWA;              /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0615
*   R2=DEFSCVOL;                    /* RESTORE IGGPDEFS LOOP IDX     */
         L     R2,DEFSCVOL(,DEFSWAR4)                              0616
*   CCAURAB=ADDR(CCARAB3);          /* RESET RAB ADDRESS             */
         LA    @10,CCARAB3(,R11)                                   0617
         ST    @10,CCAURAB(,R11)                                   0617
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0618
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPTMST');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPTMST'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00006 DS    0H                                                  0621
@EF00006 DS    0H                                                  0621
@ER00006 BR    @14                                                 0621
@PB00006 DS    0H                                                  0622
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0623
*/********************************************************************/
*/*                                                                  */
*/*        IGGPTMST  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0623
*IGGPTMST:                                                         0623
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00007                                            0623
IGGPTMST DS    0H                                                  0624
*Z054:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z054TMST:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0624
*    (R5,                                                          0624
*     R6,                                                          0624
*     R7,                                                          0624
*     R8,                                                          0624
*     R9,                                                          0624
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z054     DS    0H                                                  0624
Z054TMST DS    0H                                                  0625
*   RFY                                                            0625
*    (R2,                                                          0625
*     R3,                                                          0625
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*        INTERNAL PROCEDURE TO UPDATE THE TIME STAMP IN THE        */
*/*        FORMAT 4 DSCB AND IN THE VOLUME ENTRY RECORD              */
*/********************************************************************/
*                                                                  0628
*   CCAURAB=CCAR0REC;               /* USE RA 0 FOR F4 W.A.  @Y30SSDW*/
         L     @10,CCAR0REC(,R11)                                  0628
         ST    @10,CCAURAB(,R11)                                   0628
*   F4WDUCB=DEFSUPTR;               /* SET UCB ADDRESS       @Y30SSDW*/
*                                                                  0629
         MVC   F4WDUCB(3,@10),DEFSUPTR+1(DEFSWAR4)                 0629
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL TO MODULE IGG0CLBU                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0630
*Z055F4RD:                                                         0630
*   CALL IGGPF4RD;                  /* READ THE FMT 4 DSCB   @Y30SSDW*/
Z055F4RD L     @15,@CV03747                                        0630
         BALR  @14,@15                                             0630
*   IF CCACD1=RCS THEN              /* FMT 4 READ SUCCESSFUL @Y30SSDW*/
         CLI   CCACD1(R11),0                                       0631
         BNE   @RF00631                                            0631
*     DO;                           /*                       @Y30SSDW*/
*       DS4AMTIM=CMWASTOR;          /* SET TIME STAMP IN F4  @Y30SSDW*/
         LA    @10,120                                             0633
         AL    @10,CCAURAB(,R11)                                   0633
         L     @05,CCACMSWA(,R11)                                  0633
         MVC   DS4AMTIM(8,@10),CMWASTOR(@05)                       0633
*       DS4R2TIM=CMWASTOR;          /* SET TIME STAMP IN F4  @Y30SSDW*/
*                                                                  0634
         MVC   DS4R2TIM(8,@10),CMWASTOR(@05)                       0634
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBU                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0635
*Z056F4WR:                                                         0635
*       CALL IGGPF4WR;              /* WRITE THE FMT 4 DSCB  @Y30SSDW*/
Z056F4WR L     @15,@CV03748                                        0635
         BALR  @14,@15                                             0635
*       CCAURAB=ADDR(CCARAB3);      /* MAP VOL REC IN RAB 3  @Y30SSDW*/
         LA    @10,CCARAB3(,R11)                                   0636
         ST    @10,CCAURAB(,R11)                                   0636
*       CTVOLTIM=CMWASTOR;          /* SET TIME STAMP IN REC @Y30SSDW*/
         L     @10,CCACPE1(,@10)                                   0637
         L     @05,CCACMSWA(,R11)                                  0637
         MVC   CTVOLTIM+48(8,@10),CMWASTOR(@05)                    0637
*     END;                          /*                       @Y30SSDW*/
*   ELSE                                                           0639
*     ;                             /* FMT-4 READ FAILED     @Y30SSDW*/
@RF00631 DS    0H                                                  0640
*   DEFSWAR4=CCADSPWA;              /* RESTORE WORKAREA ADDR @Y30SSDW*/
         L     DEFSWAR4,CCADSPWA(,R11)                             0640
*   R2=DEFSCVOL;                    /* RESTORE MAIN LOOP INDEX IN  0641
*                                      IGGPDEFS(CLAQ)        @Y30SSDW*/
         L     R2,DEFSCVOL(,DEFSWAR4)                              0641
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0642
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDSXT');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDSXT'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00007 DS    0H                                                  0645
@EF00007 DS    0H                                                  0645
@ER00007 BR    @14                                                 0645
@PB00007 DS    0H                                                  0646
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0647
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDSXT  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0647
*IGGPDSXT:                                                         0647
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00008                                            0647
IGGPDSXT DS    0H                                                  0648
*Z057:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z057DSXT:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0648
*    (R5,                                                          0648
*     R6,                                                          0648
*     R7,                                                          0648
*     R8,                                                          0648
*     R9,                                                          0648
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z057     DS    0H                                                  0648
Z057DSXT DS    0H                                                  0649
*   RFY                                                            0649
*    (R2,                                                          0649
*     R3,                                                          0649
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*/********************************************************************/
*/*        THIS SUBFUNCTION DOES THE CLEANUP PROCESSING, THEN        */
*/*        RETURNS CONTROL TO THE DEFINE SPACE CALLER.               */
*/********************************************************************/
*                                                                  0650
*   RFY                                                            0650
*     IDAVVOLL BASED(ADDR(DEFSVOLL));                              0650
*   IF DEFSWAR4^=ZERO THEN          /* DEF SPACE WORK AREA EXISTS  0651
*                                                            @Y30SSDW*/
         SLR   @10,@10                                             0651
         CR    DEFSWAR4,@10                                        0651
         BE    @RF00651                                            0651
*     DO;                           /* FREEMAIN ALL WORKAREAS        */
*       CMSDFSPC=VVOLLUCB(1);       /* SAVE VOLUME UCB ADDRESS FOR 0653
*                                      DEFINE CATALOG AND DEFINE CRA
*                                                            @Y30SSDW*/
         L     @05,CCACMSWA(,R11)                                  0653
         MVC   CMSDFSPC(4,@05),VVOLLUCB+125(DEFSWAR4)              0653
*       IF DEFSJPTR^=ZERO THEN      /* CORE GOTTEN FOR JFCB          */
         L     @05,DEFSJPTR(,DEFSWAR4)                             0654
         CR    @05,@10                                             0654
         BE    @RF00654                                            0654
*         DO;                       /* PREPARE TO FREE GOTTEN CORE   */
*           CCAMNLEN=JFCBSIZE;      /* SET CORE LENGTH               */
         MVC   CCAMNLEN(3,R11),@CF00194+1                          0656
*           CCAMNADR=DEFSJPTR;      /* SET CORE ADDRESS              */
         ST    @05,CCAMNADR(,R11)                                  0657
*           RFY                                                    0658
*             R1 RSTD;              /* NEED REG 1 FOR FREEMAIN       */
*           R1=ADDR(CCAMSSPL);      /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0659
*           CCAMNSPL=USUBPOOL;      /* STORE SUBPOOL VALUE           */
         MVI   CCAMNSPL(R11),X'FC'                                 0660
*           DO;                                                    0661
*             IF MNATFULL=ON THEN   /* TRACKING TABLE FULL           */
*                                                                  0662
         TM    MNATFULL(R11),B'10000000'                           0662
         BNO   @RF00662                                            0662
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLAT                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0663
*Z060ARFS:                                                         0663
*               CALL IGGPARFS;      /* YES,CALL SPILL ROUTINE        */
Z060ARFS L     @15,@CV03737                                        0663
         BALR  @14,@15                                             0663
*             GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*
*                                      PUSH AND TRACK                */
@RF00662 DS    0H                                                  0664
         MVC CCAMNAT(248,11),CCAMNAT+8(11)
*           END;                                                   0665
*                                                                  0665
*           /*********************************************************/
*           /*                                                       */
*           /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252            */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0666
*           GEN(FREEMAIN L,MF=(E,(1))) ;/* FREE CORE                 */
         FREEMAIN L,MF=(E,(1))
*           RFY                                                    0667
*             R1 UNRSTD;            /* UNRESTRICT USE OF REG 1       */
*         END;                      /* END FREE JFCB STORAGE         */
*       ELSE                                                       0669
*         ;                         /* NO CORE GOTTEN FOR JFCB       */
@RF00654 DS    0H                                                  0670
*       CCAMNADR=CCADSPWA;          /* SET WORK AREA ADDRESS @Y30SSDW*/
         MVC   CCAMNADR(4,R11),CCADSPWA(R11)                       0670
*       CCAMNLEN=LENGTH(DEFSWKA);   /* SET WORK AREA LENGTH          */
         MVC   CCAMNLEN(3,R11),@CF04047+1                          0671
*       RFY                                                        0672
*         R1 RSTD;                  /* NEED REG 1 FOR FREEMAIN       */
*       R1=ADDR(CCAMSSPL);          /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0673
*       CCAMNSPL=USUBPOOL;          /* STORE SUBPOOL VALUE           */
         MVI   CCAMNSPL(R11),X'FC'                                 0674
*       DO;                                                        0675
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */
*                                                                  0676
         TM    MNATFULL(R11),B'10000000'                           0676
         BNO   @RF00676                                            0676
*           /*********************************************************/
*           /*                                                       */
*           /* CALL TO MODULE IGG0CLAT                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0677
*Z063ARFS:                                                         0677
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */
Z063ARFS L     @15,@CV03737                                        0677
         BALR  @14,@15                                             0677
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0678
*                                      PUSH AND TRACK                */
@RF00676 DS    0H                                                  0678
         MVC CCAMNAT(248,11),CCAMNAT+8(11)
*       END;                                                       0679
*                                                                  0679
*       /*************************************************************/
*       /*                                                           */
*       /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0680
*       GEN(FREEMAIN L,MF=(E,(1))) ;/* FREE WORK AREA CORE           */
         FREEMAIN L,MF=(E,(1))
*       RFY                                                        0681
*         R1 UNRSTD;                /* UNRESTRICT USE OF REG 1       */
*     END;                          /* END 'DO' FOR FREEMAIN WORK    */
*   ELSE                                                           0683
*     ;                             /* NO CORE GOTTEN FOR WORKAREA   */
@RF00651 DS    0H                                                  0684
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0684
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPF1BO');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPF1BO'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00008 DS    0H                                                  0687
@EF00008 DS    0H                                                  0687
@ER00008 BR    @14                                                 0687
@PB00008 DS    0H                                                  0688
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0689
*/********************************************************************/
*/*                                                                  */
*/*        IGGPF1BO  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0689
*IGGPF1BO:                                                         0689
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00009                                            0689
IGGPF1BO DS    0H                                                  0690
*Z064:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z064F1BO:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0690
*    (R5,                                                          0690
*     R6,                                                          0690
*     R7,                                                          0690
*     R8,                                                          0690
*     R9,                                                          0690
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z064     DS    0H                                                  0690
Z064F1BO DS    0H                                                  0691
*   RFY                                                            0691
*    (R2,                                                          0691
*     R3,                                                          0691
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/********************************************************************/
*/*     THIS PROCEDURE IS CALLED WHEN AN ERROR IS ENCOUNTERED        */
*/*     DURING DEFINE SPACE PROCESSING IF THE ERROR OCCURRED         */
*/*     AFTER SPACE ALLOCATION (SVC 32) WAS SUCCESSFULLY COMPLETED.  */
*/*     THE ALLOCATED SPACE IS FREED BY CHANGING THE FORMAT-1        */
*/*     (OR FORMAT-3) DSCB BY CALLING THE OS/VS DADSM SCRATCH        */
*/*     FUNCTION (SVC 29).                                           */
*/********************************************************************/
*/********************************************************************/
*/* DECLARATION OF PARAMETER LIST STRUCTURE FOR OS/VS DADSM SCRATCH  */
*/********************************************************************/
*                                                                  0694
*   DECLARE                         /*                       @Y30SSDW*/
*     1 SCRTPL BASED(CCAR0REC),     /* SCRATCH PARAMTER LIST @Y30SSDW*/
*      2 SCRTOPTN CHAR(4),          /* SCRATCH OPTIONS       @Y30SSDW*/
*      2 SCRTDSNM PTR(31),          /* DATA SPACE NAME ADDR  @Y30SSDW*/
*      2 * CHAR(4),                 /* FIELD NOT REFERENCED  @Y30SSDW*/
*      2 SCRTVOLL PTR(31),          /* VOLUME LIST REFERENCE @Y30SSDW*/
*      2 SCRTNOVL FIXED(15),        /* NUMBER OF VOLUMES     @Y30SSDW*/
*      2 SCRTDEVT CHAR(4),          /* VOLUME DEVICE TYPE    @Y30SSDW*/
*      2 SCRTVLSR CHAR(6),          /* VOLUME SERIAL NUMBER  @Y30SSDW*/
*      2 * CHAR(2);                 /* FIELDS NOT REFERENCED @Y30SSDW*/
*/********************************************************************/
*/*        CONSTRUCT  OS/VS  DADSM  SCRATCH  PARAMETER  LIST         */
*/********************************************************************/
*                                                                  0695
*   SCRTOPTN=SCRTCODE;              /* SET SCRATCH OPTIONS   @Y30SSDW*/
         L     @10,CCAR0REC(,R11)                                  0695
         MVC   SCRTOPTN(4,@10),@CB03771                            0695
*   SCRTDSNM=ADDR(DEFSDSNM);        /* DATA SPACE NAME ADDR  @Y30SSDW*/
         LA    @05,DEFSDSNM(,DEFSWAR4)                             0696
         ST    @05,SCRTDSNM(,@10)                                  0696
*   SCRTVOLL=ADDR(SCRTNOVL);        /* VOLSER LIST ADDRESS   @Y30SSDW*/
         LA    @05,SCRTNOVL(,@10)                                  0697
         ST    @05,SCRTVOLL(,@10)                                  0697
*   SCRTNOVL=INCR1;                 /* ONE VOLUME TO PROCESS @Y30SSDW*/
         MVC   SCRTNOVL(2,@10),@CH00037                            0698
*   CCAURAB=ADDR(CCARAB3);          /* POINT TO VOL RECORD   @Y30SSDW*/
         LA    @05,CCARAB3(,R11)                                   0699
         ST    @05,CCAURAB(,R11)                                   0699
*   SCRTDEVT=CTVDEVTY;              /* SET VOL DEVICE TYPE   @Y30SSDW*/
         L     @05,CCACPE1(,@05)                                   0700
         MVC   SCRTDEVT(4,@10),CTVDEVTY+48(@05)                    0700
*   SCRTVLSR=LTVOLSER(R2);          /* SET VOLSER NUMBER     @Y30SSDW*/
         LR    @05,R2                                              0701
         SLA   @05,3                                               0701
         L     @01,CCACPL(,R11)                                    0701
         L     @01,CTGFVT(,@01)                                    0701
         L     @01,CTGFVVLT(,@01)                                  0701
         ALR   @01,@05                                             0701
         AL    @01,@CF04074                                        0701
         MVC   SCRTVLSR(6,@10),LTVOLSER-4(@01)                     0701
*/********************************************************************/
*/*                  ISSUE  DADSM  SCRATCH  CALL                     */
*/********************************************************************/
*                                                                  0702
*   RFY                                                            0702
*    (R0,                                                          0702
*     R1) RSTD;                     /* RST REGS FOR SVC      @Y30SSDW*/
*   R0=ZERO;                        /* CLEAR UCB ADDRESS REG @Y30SSDW*/
         SLR   R0,R0                                               0703
*   R1=ADDR(SCRTPL);                /* SCRATCH PARMLIST ADDR @Y30SSDW*/
         LR    R1,@10                                              0704
*   GEN(SVC 29);                    /* CALL DADSM SCRATCH FUNCTION 0705
*                                                            @Y30SSDW*/
         SVC 29
*   RFY                                                            0706
*    (R0,                                                          0706
*     R1) UNRSTD;                   /* FREE REGISTER USE     @Y30SSDW*/
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0707
*   END;                            /* END OF INNER PROCEDURE        */
@EL00009 DS    0H                                                  0708
@EF00009 DS    0H                                                  0708
@ER00009 BR    @14                                                 0708
@PB00009 DS    0H                                                  0709
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0710
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0710
*EXIT:                                                             0710
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00010                                            0710
EXIT     DS    0H                                                  0711
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            0714
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00010 DS    0H                                                  0715
@EF00010 DS    0H                                                  0715
@ER00010 BR    @14                                                 0715
*   END                             /* END OF MODULE IGG0CLAQ        */
*                                                                  0716
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*/*%INCLUDE SYSLIB  (IGGMCMWA)                                       */
*/*%INCLUDE SYSLIB  (IDAVVOLL)                                       */
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (IGGMVEDC)                                       */
*/*%INCLUDE SYSLIB  (IECSDSL1)                                       */
*/*%INCLUDE SYSLIB  (IGGMF4WA)                                       */
*                                                                  0716
*       ;                                                          0716
@EL00001 DS    0H                                                  0716
@EF00001 DS    0H                                                  0716
@ER00001 BR    @14                                                 0716
@DATA    DS    0H
@CH00037 DC    H'1'
@CH00051 DC    H'6'
@CH00072 DC    H'12'
@CH00112 DC    H'24'
@CH00124 DC    H'48'
@CH03773 DC    XL2'C100'
@CH00973 DC    XL2'04'
@CH03622 DC    XL2'08'
@CH03934 DC    XL2'0C'
@DATD    DSECT
         DS    0F
IGG0CLAQ CSECT
         DS    0F
@CF00042 DC    F'8'
@CF00194 DC    F'176'
@CF04047 DC    F'451'
@CF04062 DC    F'-1042808684'
@CF04053 DC    F'-1042808656'
@CF04049 DC    F'-1042808156'
@CF04052 DC    F'-1042808148'
@CF04061 DC    F'-1042806544'
@CF04056 DC    F'-1042806204'
@CF04078 DC    F'-6'
@CF04074 DC    F'-4'
@DATD    DSECT
         DS    0D
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLAQ CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV03737 DC    V(IGGPARFS)
@CV03738 DC    V(IGGPAXCI)
@CV03739 DC    V(IGGPBJFB)
@CV03740 DC    V(IGGPCBPT)
@CV03741 DC    V(IGGPCKAU)
@CV03742 DC    V(IGGPCRTC)
@CV03743 DC    V(IGGPDCRA)
@CV03744 DC    V(IGGPDFS2)
@CV03745 DC    V(IGGPDTIM)
@CV03746 DC    V(IGGPF4DQ)
@CV03747 DC    V(IGGPF4RD)
@CV03748 DC    V(IGGPF4WR)
@CV03749 DC    V(IGGPGET)
@CV03750 DC    V(IGGPISCI)
@CV03751 DC    V(IGGPLSP)
@CV03752 DC    V(IGGPPAD)
@CV03753 DC    V(IGGPSCAT)
         DS    0D
@CC03923 DC    C'Z9999992.VSAMDSPC'
@CC03926 DC    C'         '
@CC03935 DC    C'AQ'
@CB03771 DC    X'41005000'
@CB03785 DC    X'200A'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
RWA      EQU   @02
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R15      EQU   @15
DCWABASE EQU   @04
TIOTPTR  EQU   @01
JFCBPTR  EQU   @01
F4PTR    EQU   @01
DEFSWAR4 EQU   @04
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R14      EQU   @14
UCBDCPTR EQU   @01
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAMODID EQU   CCAPROB
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCAFLG1  EQU   IGGCCA+14
CCAF1KEY EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAFLG2  EQU   IGGCCA+15
CCAF2NVC EQU   CCAFLG2
CCAF2COB EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAFLG3  EQU   IGGCCA+16
CCAFLG4  EQU   IGGCCA+17
CCAFLG5  EQU   IGGCCA+18
CCAFLG6  EQU   IGGCCA+19
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0REC EQU   CCARAB0+4
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4UR  EQU   CCAR4FLG
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5UR  EQU   CCAR5FLG
CCAR5SEG EQU   CCARAB5+8
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAASCI  EQU   IGGCCA+271
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAMSSPL EQU   IGGCCA+300
CCAMNSPL EQU   CCAMSSPL+9
CCACMS   EQU   IGGCCA+316
CCACMSWA EQU   CCACMS
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAFLPT  EQU   IGGCCA+364
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCAIDPT3 EQU   IGGCCA+480
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCALCPL  EQU   IGGCCA+548
CCAFLG7  EQU   IGGCCA+552
CCALSP   EQU   CCAFLG7
CCAFLG8  EQU   IGGCCA+553
CCADSRCL EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFULL EQU   MNATTOP
MNATFLGS EQU   CCAMNAT+240
CCAMNLEN EQU   CCAMNCAT+249
CCAMNADR EQU   CCAMNCAT+252
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCADSPWA EQU   CCABZSAV
CCACUMPL EQU   IGGCCA+1412
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGNAME  EQU   CTGOPTN1
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGFUNC  EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGAM0   EQU   CTGOPTN3
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGTYPE  EQU   CTGPL+18
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFL    EQU   0
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLDAT EQU   CTGFL+16
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
FIELDNM  EQU   0
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CCACPE3  EQU   CCARAB+12
CCACPE4  EQU   CCARAB+16
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGOGC1 EQU   CATGOPT+3
CATGOSEQ EQU   CATGOPT+4
CATRCD   EQU   0
RCDCINO  EQU   CATRCD+1
RCDCRAVL EQU   CATRCD+5
RCDCRADT EQU   CATRCD+14
RCDID    EQU   CATRCD+44
RCDSIZ   EQU   CATRCD+45
NREPLF   EQU   CATRCD+48
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
REPCNT   EQU   REPCNTRL+5
VARFIELD EQU   0
CNTRLINF EQU   0
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTSVDCB EQU   CVTMAP+84
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBTIO   EQU   TCB+12
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXF2REC EQU   CAXFLG2
CAXFLG3  EQU   IGGCAXWA+10
CAXCCR   EQU   IGGCAXWA+32
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVDRC EQU   CTGFVPRO
CTGFVIND EQU   CTGFV+16
CTGFVENT EQU   CTGFV+20
CTGFVVLT EQU   CTGFV+40
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVATR EQU   CTGFV+60
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
DSPTBL   EQU   0
CMSWA    EQU   0
CMWFLAGS EQU   CMSWA
CMCISUSE EQU   CMSWA+2
CMWRKATR EQU   CMCISUSE
CMCPLFVT EQU   CMSWA+20
CMNRMEXT EQU   CMSWA+24
CMLDTFPL EQU   CMNRMEXT
CMSSEXTS EQU   CMSWA+28
CMHDTFPL EQU   CMSSEXTS
CMCANVOL EQU   CMSWA+32
CMHIXFPL EQU   CMCANVOL
CMRNGCTR EQU   CMSWA+40
CMVOLCTR EQU   CMSWA+42
CMSDFSPC EQU   CMSWA+48
CMVLLIST EQU   CMSWA+64
CMVLRTCD EQU   CMVLLIST+2
CMSPCATR EQU   CMSWA+76
CMWASTOR EQU   CMSWA+132
CMPOT    EQU   CMWASTOR
CMDCONV  EQU   CMPOT
CMIXFANO EQU   CMDCONV
CMPOTX   EQU   CMWASTOR+4
CMPBI    EQU   CMPOTX
CMIXFANS EQU   CMPBI
CMWABYTB EQU   CMSWA+140
CMPBIX   EQU   CMWABYTB
CMNEST   EQU   CMPBIX
CMFANT   EQU   CMNEST
CMSPCQTY EQU   CMFANT
CMWGENAM EQU   CMSWA+144
CMWDATE  EQU   CMWGENAM+12
CMWTIME  EQU   CMWGENAM+17
DCWPLSPS EQU   CMSWA+200
DCWPLSPL EQU   DCWPLSPS
DCWPLBFS EQU   CMSWA+232
DCWPLBFL EQU   DCWPLBFS
DCWPLEDS EQU   CMSWA+260
DCWPLEDL EQU   DCWPLEDS
DCWPLARS EQU   CMSWA+288
DCWPLARL EQU   DCWPLARS
DCWPLCDS EQU   CMSWA+316
DCWPLCDL EQU   DCWPLCDS
CMUCATCI EQU   CMSWA+410
CUMPLWA  EQU   0
CUMPL    EQU   CUMPLWA
CUMIN    EQU   CUMPL
CUMOUT   EQU   CUMPL+1
CUMWA    EQU   CUMPLWA+8
CUMFLAG  EQU   CUMWA
CUMWASS2 EQU   CUMWA+48
CUMWASS  EQU   CUMWASS2+2
CUMWTYP  EQU   CUMWASS
IDAVVOLL EQU   0
@NM00110 EQU   IDAVVOLL
VVOLLID  EQU   @NM00110
VVOLLCAT EQU   @NM00110
VVOLLNBR EQU   IDAVVOLL+2
VVOLLTAB EQU   IDAVVOLL+4
VVOLLERR EQU   IDAVVOLL+12
VVOLLENT EQU   IDAVVOLL+36
VVOLLUCB EQU   VVOLLENT
@NM00113 EQU   VVOLLENT+4
VVOLLVSR EQU   VVOLLENT+6
TIOT1    EQU   0
TIOENTRY EQU   0
TIOELNGH EQU   TIOENTRY
TIOESTTA EQU   TIOENTRY+1
TIOERLOC EQU   TIOENTRY+2
TIOELINK EQU   TIOERLOC+1
TIOESYOT EQU   TIOELINK
TIOEDDNM EQU   TIOENTRY+4
TIOESTTC EQU   TIOENTRY+15
TIOESTTB EQU   TIOENTRY+16
POOLSTAR EQU   TIOENTRY+20
INFMJFCB EQU   0
JFCBDSNM EQU   INFMJFCB
JFCBELNM EQU   INFMJFCB+44
JFCBTSDM EQU   INFMJFCB+52
JFCFCBID EQU   INFMJFCB+56
JFCBFRID EQU   JFCFCBID
JFCBLTYP EQU   INFMJFCB+66
JFCBOTTR EQU   INFMJFCB+67
JFCBUFOF EQU   JFCBOTTR
JFCBFLSQ EQU   JFCBOTTR+1
JFCFUNC  EQU   JFCBFLSQ
JFCBMASK EQU   INFMJFCB+72
JFCBFLG1 EQU   JFCBMASK+5
JFCOPEN  EQU   JFCBFLG1
JFCBFLG2 EQU   JFCBMASK+6
JFCDEFER EQU   JFCBFLG2
JFCBIND1 EQU   INFMJFCB+86
JFCBIND2 EQU   INFMJFCB+87
JFCAMPTR EQU   INFMJFCB+88
JFCBUFRQ EQU   JFCAMPTR
JFCBUFNO EQU   JFCBUFRQ
JFCBGNCP EQU   JFCAMPTR+1
JFCBHIAR EQU   JFCBGNCP
JFCBFALN EQU   JFCBHIAR
JFCBFTEK EQU   JFCBFALN
JFCBBFTA EQU   JFCBFTEK
JFCEROPT EQU   INFMJFCB+92
JFCTRTCH EQU   INFMJFCB+93
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00123 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
CTVOLRCD EQU   1
CTVOLNME EQU   CTVOLRCD
CTVOLTIM EQU   CTVOLRCD+44
CTVDVCHR EQU   CTVOLRCD+52
CTVDEVTY EQU   CTVDVCHR
CTVNOTRK EQU   CTVDVCHR+10
CTVDVFLG EQU   CTVDVCHR+17
CTVSYEDS EQU   CTVOLRCD+73
CTVSPHDR EQU   0
CTVSPFLG EQU   CTVSPHDR+15
CTVDESGP EQU   0
CTVEXTST EQU   CTVDESGP+4
CTVSTDES EQU   CTVEXTST
CTVDSGRP EQU   0
CTVDSDFL EQU   CTVDSGRP+6
CTVDSDIR EQU   CTVDSGRP+9
CTVGOPT  EQU   0
CTVGOCI  EQU   CTVGOPT
CTVGOGCI EQU   CTVGOPT+3
CTVRCTRL EQU   0
CTVEXRPT EQU   CTVRCTRL
CTVEXRCT EQU   CTVRCTRL+5
CTVSPMAP EQU   0
CTVSMSN  EQU   CTVSPMAP
CTVDSPAC EQU   0
CTVDSPSN EQU   CTVDSPAC
CTVDSPFG EQU   CTVDSPAC+15
CTVSPEXT EQU   CTVDSPAC+21
CTVEXTNT EQU   CTVSPEXT
CTVDIR   EQU   0
CTVDSDSN EQU   CTVDIR
CTVDEXTN EQU   0
IECSDSF4 EQU   0
IECSDSL4 EQU   0
DS4DEVCT EQU   IECSDSL4+18
DS4DEVOV EQU   DS4DEVCT+6
DS4AMTIM EQU   IECSDSL4+32
DS4AMCAT EQU   IECSDSL4+40
DS4VSIND EQU   DS4AMCAT
DS4VSREF EQU   DS4VSIND
DS4VSCRA EQU   DS4AMCAT+1
DS4R2TIM EQU   IECSDSL4+43
IGGMF4WA EQU   0
F4WDEB   EQU   IGGMF4WA
F4WDUCB  EQU   F4WDEB+33
F4WECB   EQU   IGGMF4WA+52
F4WIOB   EQU   IGGMF4WA+56
F4WCCW   EQU   IGGMF4WA+96
F4WBUF   EQU   IGGMF4WA+120
DEFSWKA  EQU   0
DEFSFLGS EQU   DEFSWKA
DEFSNVME EQU   DEFSFLGS
DEFSUNIQ EQU   DEFSFLGS
DEFSSCAT EQU   DEFSFLGS
DEFOWNVL EQU   DEFSFLGS
DEFSVLMT EQU   DEFSFLGS
DEFSRALL EQU   DEFSFLGS
DEFSALOK EQU   DEFSFLGS
DEFSVNUM EQU   DEFSWKA+4
DEFSDSNM EQU   DEFSWKA+48
DEFSJPTR EQU   DEFSWKA+92
DEFSAVTN EQU   DEFSWKA+96
DEFSBPTR EQU   DEFSWKA+100
DEFSUPTR EQU   DEFSWKA+104
DEFSCVOL EQU   DEFSWKA+108
DEFSVOLL EQU   DEFSWKA+125
DEFSDVTY EQU   DEFSWKA+176
DEFSOCAM EQU   DEFSWKA+200
DEFSOOPT EQU   DEFSOCAM
DEFSOTYP EQU   DEFSOOPT
DEFSODSN EQU   DEFSOCAM+4
DEFSOVOL EQU   DEFSOCAM+8
DEFSOBUF EQU   DEFSOCAM+12
DEFSBUFF EQU   DEFSWKA+216
DEFSCPL  EQU   DEFSWKA+364
DEFSFPL  EQU   DEFSWKA+396
DEFSFLNM EQU   DEFSWKA+420
DEFSFWKA EQU   DEFSWKA+428
DSATRBTS EQU   0
DSATUNIQ EQU   DSATRBTS
SPACEPRM EQU   0
SPCOPTNS EQU   SPACEPRM+6
SPCRQTYP EQU   SPCOPTNS
USERLIST EQU   0
LTLENGTH EQU   USERLIST
LTENTRY  EQU   USERLIST+2
LTRETCOD EQU   LTENTRY
LTRETCD1 EQU   LTRETCOD
LTVOLSER EQU   LTENTRY+2
DEFSDRAB EQU   0
DEFSDRA1 EQU   DEFSDRAB
DEFSDRA2 EQU   DEFSDRAB+256
SCRTPL   EQU   0
SCRTOPTN EQU   SCRTPL
SCRTDSNM EQU   SCRTPL+4
SCRTVOLL EQU   SCRTPL+12
SCRTNOVL EQU   SCRTPL+16
SCRTDEVT EQU   SCRTPL+18
SCRTVLSR EQU   SCRTPL+22
CATSN    EQU   0
CI       EQU   0
CTGVLDSP EQU   0
DEFSJFCB EQU   0
TNAM     EQU   0
UCBBGN   EQU   0
@NM00037 EQU   CTGDDNM
CTGPROB  EQU   @NM00037
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
TIOEDEVE EQU   TIOESTTB
TIOSTTB  EQU   TIOEDEVE
JFCKEYLE EQU   JFCTRTCH
JFCCODE  EQU   JFCKEYLE
JFCSTACK EQU   JFCTRTCH
JFCMODE  EQU   JFCSTACK
JFCSPPRT EQU   JFCTRTCH
JFCBABFS EQU   JFCSPPRT+2
JFCLIMCT EQU   JFCBABFS
JFCDSORG EQU   JFCSPPRT+5
JFCDSRG1 EQU   JFCDSORG
JFCDSRG2 EQU   JFCDSORG+1
JFCRECFM EQU   JFCSPPRT+7
JFCRCFM  EQU   JFCRECFM
JFCOPTCD EQU   JFCSPPRT+8
JFCWVCSP EQU   JFCOPTCD
JFCWVCIS EQU   JFCWVCSP
JFCWVCBD EQU   JFCWVCIS
JFCALLOW EQU   JFCOPTCD
JFCRSV17 EQU   JFCALLOW
JFCOVER  EQU   JFCRSV17
JFCPCIBT EQU   JFCOPTCD
JFCMAST  EQU   JFCPCIBT
JFCEXT   EQU   JFCMAST
JFCBCKPT EQU   JFCOPTCD
JFCIND   EQU   JFCBCKPT
JFCRSV18 EQU   JFCOPTCD
JFCCYL   EQU   JFCRSV18
JFCACT   EQU   JFCCYL
JFCREDUC EQU   JFCOPTCD
JFCRSV19 EQU   JFCREDUC
JFCRSV20 EQU   JFCRSV19
JFCRSV21 EQU   JFCOPTCD
JFCDEL   EQU   JFCRSV21
JFCRSV23 EQU   JFCOPTCD
JFCREORG EQU   JFCRSV23
JFCBLKSI EQU   JFCSPPRT+9
JFCBUFSI EQU   JFCBLKSI
JFCAMSYN EQU   JFCSPPRT+11
JFCNCP   EQU   JFCAMSYN+2
JFCNTM   EQU   JFCAMSYN+3
JFCBFSEQ EQU   JFCNTM
JFCPCI   EQU   JFCBFSEQ
JFCRESRV EQU   JFCAMSYN+4
JFCUCSEG EQU   JFCRESRV
JFCUCSOP EQU   JFCUCSEG+4
JFCOUTLI EQU   JFCUCSEG+5
JFCTHRSH EQU   JFCOUTLI
JFCCPRI  EQU   JFCTHRSH
JFCBVOLS EQU   JFCUCSEG+10
JFCBS001 EQU   JFCBVOLS
JFCBPQTY EQU   JFCBS001+34
JFCBCTRI EQU   JFCBS001+37
JFCBSQTY EQU   JFCBS001+38
JFCFLGS1 EQU   JFCBS001+41
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00122 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBOBS09 EQU   UCBDEV
FLC      EQU   PSA
F4WDCB   EQU   F4WDEB+4
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBCTCF1 EQU   UCBOBS08+4
UCBCTCAD EQU   UCBOBS08
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00122
UCBSKPFG EQU   @NM00122
UCBRIPND EQU   @NM00122
UCBRTIAC EQU   @NM00122
UCBRSV79 EQU   @NM00122
UCBRSV78 EQU   @NM00122
UCBRSV77 EQU   @NM00122
UCBOLTEP EQU   @NM00122
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00121 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
JFCBEND  EQU   JFCBS001+58
JFCBSPTN EQU   JFCBS001+57
JFCBVLCT EQU   JFCBS001+56
JFCBDRLH EQU   JFCBS001+53
JFCBSBNM EQU   JFCBS001+50
JFCBABST EQU   JFCBS001+48
JFCBSPNM EQU   JFCBS001+45
JFCBDQTY EQU   JFCBS001+42
JFCBUAFF EQU   JFCFLGS1
JFCRSV45 EQU   JFCFLGS1
JFCVRDS  EQU   JFCFLGS1
JFCBCEOV EQU   JFCFLGS1
JFCRSV42 EQU   JFCFLGS1
JFCRSV41 EQU   JFCFLGS1
JFCTOPEN EQU   JFCFLGS1
JFCBDLET EQU   JFCFLGS1
JFCRQID  EQU   JFCBSQTY
JFCROUND EQU   JFCBCTRI
JFCALX   EQU   JFCBCTRI
JFCMIXG  EQU   JFCBCTRI
JFCONTIG EQU   JFCBCTRI
JFCRSV29 EQU   JFCBCTRI
JFCBMSGP EQU   JFCBCTRI
JFCBSPAC EQU   JFCBCTRI
JFCRUNIT EQU   JFCBPQTY
JFCBEXAD EQU   JFCBS001+31
JFCBEXTL EQU   JFCBS001+30
JFCMSVGP EQU   JFCBS001+22
@NM00119 EQU   JFCBS001
JFCAVOLS EQU   JFCBVOLS
JFCBNVOL EQU   JFCUCSEG+9
JFCBNTCS EQU   JFCUCSEG+8
JFCSOWA  EQU   JFCOUTLI+1
JFCSEND  EQU   JFCCPRI
JFCEQUAL EQU   JFCCPRI
JFCRECV  EQU   JFCCPRI
JFCRSV34 EQU   JFCCPRI
JFCRSV33 EQU   JFCCPRI
JFCRSV55 EQU   JFCCPRI
JFCRSV54 EQU   JFCCPRI
JFCRSV53 EQU   JFCCPRI
JFCRSV27 EQU   JFCUCSOP
JFCRSV26 EQU   JFCUCSOP
JFCFCBVR EQU   JFCUCSOP
JFCFCBAL EQU   JFCUCSOP
JFCVER   EQU   JFCUCSOP
JFCRSV25 EQU   JFCUCSOP
JFCFOLD  EQU   JFCUCSOP
JFCRSV24 EQU   JFCUCSOP
JFCUCSID EQU   JFCUCSEG
JFCINTVL EQU   JFCSPPRT+19
JFCDBUFN EQU   JFCRESRV+3
JFCCYLOF EQU   JFCRESRV+2
JFCRKP   EQU   JFCRESRV
JFCPCIR2 EQU   JFCPCI
JFCPCIR1 EQU   JFCPCI
JFCPCIN2 EQU   JFCPCI
JFCPCIN1 EQU   JFCPCI
JFCPCIA2 EQU   JFCPCI
JFCPCIA1 EQU   JFCPCI
JFCPCIX2 EQU   JFCPCI
JFCPCIX1 EQU   JFCPCI
JFCBUFMX EQU   JFCNCP
JFCLRECL EQU   JFCAMSYN
JFCBAXBF EQU   JFCBUFSI
JFCREL   EQU   JFCREORG
JFCRSV22 EQU   JFCDEL
JFCSRCHD EQU   JFCRSV20
JFCOPTQ  EQU   JFCACT
JFCFEED  EQU   JFCIND
JFCCBWU  EQU   JFCEXT
JFCWUMSG EQU   JFCOVER
JFCSDNAM EQU   JFCWVCBD
@NM00118 EQU   JFCRECFM
JFCCHAR  EQU   JFCRECFM
JFCRFS   EQU   JFCRECFM
JFCRFB   EQU   JFCRECFM
JFCRFO   EQU   JFCRCFM
JFCFMREC EQU   JFCRCFM
JFCRSV16 EQU   JFCDSRG2
JFCRSV15 EQU   JFCDSRG2
JFCORGTR EQU   JFCDSRG2
JFCORGAM EQU   JFCDSRG2
JFCRSV13 EQU   JFCDSRG2
JFCORGTQ EQU   JFCDSRG2
JFCORGTX EQU   JFCDSRG2
JFCORGGS EQU   JFCDSRG2
JFCORGU  EQU   JFCDSRG1
JFCORGPO EQU   JFCDSRG1
JFCORGMQ EQU   JFCDSRG1
JFCORGCQ EQU   JFCDSRG1
JFCORGCX EQU   JFCDSRG1
JFCORGDA EQU   JFCDSRG1
JFCORGPS EQU   JFCDSRG1
JFCORGIS EQU   JFCDSRG1
JFCTRKBL EQU   JFCLIMCT+1
@NM00117 EQU   JFCLIMCT
JFCDEN   EQU   JFCSPPRT+1
JFCPRTSP EQU   JFCSPPRT
JFCONE   EQU   JFCMODE
JFCTWO   EQU   JFCMODE
JFCRSV07 EQU   JFCMODE
JFCRSV06 EQU   JFCMODE
JFCMODER EQU   JFCMODE
JFCMODEO EQU   JFCMODE
JFCEBCD  EQU   JFCMODE
JFCBIN   EQU   JFCMODE
JFCRSV32 EQU   JFCCODE
JFCTTY   EQU   JFCCODE
JFCASCII EQU   JFCCODE
JFCNCR   EQU   JFCCODE
JFCBUR   EQU   JFCCODE
JFCFRI   EQU   JFCCODE
JFCBCD   EQU   JFCCODE
JFCNOCON EQU   JFCCODE
TIOUCBP  EQU   TIOEDEVE+1
TIOVERF  EQU   TIOSTTB
TIOUNLD  EQU   TIOSTTB
TIOMNTD  EQU   TIOSTTB
TIOSETU  EQU   TIOSTTB
TIOVLSR  EQU   TIOSTTB
TIOPVIO  EQU   TIOSTTB
TIOREQD  EQU   TIOSTTB
TIOUSED  EQU   TIOSTTB
@NM00087 EQU   MCATDSTR+1
@NM00086 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
@NM00156 EQU   SCRTPL+28
@NM00155 EQU   SCRTPL+8
LTRETCD2 EQU   LTRETCOD+1
SPCROUND EQU   SPCOPTNS
SPCALXRQ EQU   SPCOPTNS
SPCMXIGR EQU   SPCOPTNS
SPCCNTIG EQU   SPCOPTNS
@NM00154 EQU   SPCOPTNS
SPCSECDQ EQU   SPACEPRM+3
SPCPRIMQ EQU   SPACEPRM
@NM00153 EQU   DSATRBTS
DSATTEMP EQU   DSATRBTS
DSATINUP EQU   DSATRBTS
DSATSHAR EQU   DSATRBTS
DSATERAS EQU   DSATRBTS
DSATRELS EQU   DSATRBTS
DSATSPED EQU   DSATRBTS
DEFSWEND EQU   DEFSWKA+451
@NM00152 EQU   DEFSFWKA+21
DEFSSDGV EQU   DEFSFWKA+14
@NM00151 EQU   DEFSFWKA+11
DEFSDSDD EQU   DEFSFWKA+9
DEFSDSDV EQU   DEFSFWKA+7
@NM00150 EQU   DEFSFWKA+2
DEFSRRNM EQU   DEFSFWKA
DEFSALRL EQU   DEFSFLNM
DEFSWAPT EQU   DEFSFPL+20
DEFSFLNG EQU   DEFSFPL+16
@NM00149 EQU   DEFSFPL+12
DEFSFNPT EQU   DEFSFPL+8
@NM00148 EQU   DEFSFPL+1
DEFSNPRS EQU   DEFSFPL
DEFSFPTR EQU   DEFSCPL+28
@NM00147 EQU   DEFSCPL+20
DEFSNFLD EQU   DEFSCPL+19
@NM00146 EQU   DEFSCPL
DEFSBTRK EQU   DEFSBUFF+96
DEFSBDTA EQU   DEFSBUFF
@NM00145 EQU   DEFSOOPT+2
DEFSCAL  EQU   DEFSWKA+196
@NM00144 EQU   DEFSWKA+161
DEFSVTMS EQU   DEFSWKA+117
DEFSEND  EQU   DEFSWKA+115
DEFSTART EQU   DEFSWKA+113
DEFSTGTC EQU   DEFSWKA+112
DEFSHSEQ EQU   DEFSWKA+2
@NM00143 EQU   DEFSWKA+1
@NM00142 EQU   DEFSFLGS
F4WCCW3  EQU   F4WCCW+16
F4WCCW2  EQU   F4WCCW+8
F4WCCW1  EQU   F4WCCW
F4WSEEK  EQU   IGGMF4WA+88
@NM00141 EQU   F4WIOB+24
F4WIDCB  EQU   F4WIOB+20
F4WSCP   EQU   F4WIOB+16
@NM00140 EQU   F4WIOB+8
F4WIECB  EQU   F4WIOB+4
@NM00139 EQU   F4WIOB
@NM00138 EQU   F4WECB+1
F4WECMP  EQU   F4WECB
F4WDEBP  EQU   IGGMF4WA+48
F4WNTK   EQU   F4WDEB+46
F4WECC   EQU   F4WDEB+42
F4WSCC   EQU   F4WDEB+38
F4WDBB   EQU   F4WDEB+36
F4WDMOD  EQU   F4WDEB+32
F4WDAPP  EQU   F4WDEB+29
F4WDEXS  EQU   F4WDEB+28
F4WDDCB  EQU   F4WDEB+25
F4WDID   EQU   F4WDEB+24
@NM00137 EQU   F4WDEB+17
F4WEXT   EQU   F4WDEB+16
@NM00136 EQU   F4WDEB
DS4END   EQU   IECSDSL4+96
@NM00135 EQU   IECSDSL4+71
DS4VTOCE EQU   IECSDSL4+61
DS4F6PTR EQU   IECSDSL4+56
@NM00134 EQU   IECSDSL4+51
@NM00133 EQU   DS4VSIND
DS4VSBAD EQU   DS4VSIND
DS4DEVDB EQU   DS4DEVCT+13
DS4DEVDT EQU   DS4DEVCT+12
DS4DEVTL EQU   DS4DEVCT+10
DS4DEVFG EQU   DS4DEVCT+9
DS4DEVK  EQU   DS4DEVCT+8
DS4DEVL  EQU   DS4DEVOV+1
DS4DEVI  EQU   DS4DEVOV
DS4DEVTK EQU   DS4DEVCT+4
DS4DEVSZ EQU   DS4DEVCT
@NM00132 EQU   IECSDSL4+16
DS4NOEXT EQU   IECSDSL4+15
DS4VTOCI EQU   IECSDSL4+14
DS4NOATK EQU   IECSDSL4+12
DS4HCCHH EQU   IECSDSL4+8
DS4DSREC EQU   IECSDSL4+6
DS4HPCHR EQU   IECSDSL4+1
DS4IDFMT EQU   IECSDSL4
@NM00131 EQU   IECSDSF4
CTVDRSTT EQU   CTVDEXTN+4
CTVDIRTS EQU   CTVDEXTN
CTVDSDCI EQU   CTVDIR+2
CTVDSDLF EQU   CTVDSDSN+1
CTVDSDCV EQU   CTVDSDSN
CTVEXTNN EQU   CTVEXTNT+2
CTVEXTT  EQU   CTVEXTNT
CTVSQT   EQU   CTVDSPAC+18
CTVSPOPT EQU   CTVDSPAC+17
CTVNOEXT EQU   CTVDSPAC+16
@NM00130 EQU   CTVDSPFG
CTVCATDF EQU   CTVDSPFG
@NM00129 EQU   CTVDSPFG
CTVAUTO  EQU   CTVDSPFG
CTVUNIQ  EQU   CTVDSPFG
CTVF1PTR EQU   CTVDSPAC+10
CTVF1TME EQU   CTVDSPAC+2
CTVDSPLF EQU   CTVDSPSN+1
CTVDSPCV EQU   CTVDSPSN
CTVSMBIT EQU   CTVSPMAP+4
CTVSMLEN EQU   CTVSPMAP+2
CTVSMLF  EQU   CTVSMSN+1
CTVSMCV  EQU   CTVSMSN
CTVEGOPT EQU   CTVRCTRL+6
@NM00128 EQU   CTVEXRPT+3
CTVEXGCI EQU   CTVEXRPT
CTVGOSEQ EQU   CTVGOPT+4
CTVGOGC  EQU   CTVGOGCI
CTVGODEL EQU   CTVGOGCI
CTVGOEXT EQU   CTVGOGCI
CTVGODSP EQU   CTVGOCI+1
CTVGOFLG EQU   CTVGOCI
CTVSPSXC EQU   CTVDSDIR+2
CTVSPSSN EQU   CTVDSDIR
CTVDSXCT EQU   CTVDSGRP+7
@NM00127 EQU   CTVDSDFL
CTVDSDCN EQU   CTVDSDFL
CTVDSCID EQU   CTVDSGRP+3
CTVDSNEX EQU   CTVDSGRP+2
CTVDSGLF EQU   CTVDSGRP+1
CTVDSGCV EQU   CTVDSGRP
CTVMAP   EQU   CTVDESGP+14
CTVMAPLN EQU   CTVDESGP+12
CTVDESHD EQU   CTVDESGP+10
CTVDESTK EQU   CTVDESGP+8
CTVSTHH  EQU   CTVSTDES+2
CTVSTCC  EQU   CTVSTDES
CTVDESUU EQU   CTVDESGP+2
CTVDESLF EQU   CTVDESGP+1
CTVDESCV EQU   CTVDESGP
CTVSPSQT EQU   CTVSPHDR+20
CTVSPSPO EQU   CTVSPHDR+19
CTVSPNEX EQU   CTVSPHDR+18
CTVSPNDS EQU   CTVSPHDR+16
@NM00126 EQU   CTVSPFLG
CTVSPCDF EQU   CTVSPFLG
CTVSPMCT EQU   CTVSPFLG
CTVSPUCT EQU   CTVSPFLG
CTVSPAUT EQU   CTVSPFLG
CTVSPUNQ EQU   CTVSPFLG
CTVF1ADR EQU   CTVSPHDR+10
CTVF1TIM EQU   CTVSPHDR+2
CTVSPHLF EQU   CTVSPHDR+1
CTVSPHCV EQU   CTVSPHDR
@NM00125 EQU   CTVOLRCD+74
CTVOLFLG EQU   CTVOLRCD+72
CTVTLFAC EQU   CTVDVCHR+18
CTVTLFLG EQU   CTVDVFLG
@NM00124 EQU   CTVDVFLG
CTVBONK  EQU   CTVDVCHR+16
CTVBKLB  EQU   CTVDVCHR+15
CTVBKNLB EQU   CTVDVCHR+14
CTVTRKSZ EQU   CTVDVCHR+12
CTVNOCYL EQU   CTVDVCHR+8
CTVMXBLK EQU   CTVDVCHR+4
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBRV034 EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00123
UCBHALI  EQU   @NM00123
UCBRSV09 EQU   @NM00123
UCBRSV08 EQU   @NM00123
UCBRSV07 EQU   @NM00123
UCBRSV06 EQU   @NM00123
UCBRSV05 EQU   @NM00123
UCBRSV04 EQU   @NM00123
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBFLB7  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBRV002 EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00120 EQU   UCB
JFCRSV05 EQU   JFCEROPT
JFCRSV04 EQU   JFCEROPT
JFCRSV03 EQU   JFCEROPT
JFCRSV02 EQU   JFCEROPT
JFCTOPT  EQU   JFCEROPT
JFCABN   EQU   JFCEROPT
JFCSKP   EQU   JFCEROPT
JFCACC   EQU   JFCEROPT
JFCBUFL  EQU   JFCAMPTR+2
JFCFWORD EQU   JFCBFTEK
JFCDWORD EQU   JFCBFTEK
JFCHIER1 EQU   JFCBFTEK
JFCDYN   EQU   JFCBFTEK
JFCEXC   EQU   JFCBFTEK
JFCBBFTR EQU   JFCBBFTA
JFCSIM   EQU   JFCBBFTA
JFCHIER  EQU   JFCBFTEK
JFCBFOUT EQU   JFCBUFNO
JFCBUFIN EQU   JFCBUFNO
JFCTEMP  EQU   JFCBIND2
JFCREQ   EQU   JFCBIND2
JFCENT   EQU   JFCBIND2
JFCSHARE EQU   JFCBIND2
JFCSECUR EQU   JFCBIND2
JFCDISP  EQU   JFCBIND2
JFCPDS   EQU   JFCBIND1
JFCGDG   EQU   JFCBIND1
JFCADDED EQU   JFCBIND1
JFCLOC   EQU   JFCBIND1
JFCRLSE  EQU   JFCBIND1
JFCBXPDT EQU   INFMJFCB+83
JFCBCRDT EQU   INFMJFCB+80
JFCBOPS2 EQU   JFCBMASK+7
JFCRCTLG EQU   JFCBFLG2
JFCBBUFF EQU   JFCBFLG2
JFCTRACE EQU   JFCBFLG2
JFCSDRPS EQU   JFCBFLG2
JFCMODNW EQU   JFCBFLG2
JFCNRPS  EQU   JFCDEFER
JFCOUTOP EQU   JFCBFLG2
JFCINOP  EQU   JFCBFLG2
JFCBPWBP EQU   JFCOPEN
@NM00116 EQU   JFCOPEN
JFCDUAL  EQU   JFCBFLG1
JFCSLDES EQU   JFCBFLG1
JFCSLCRE EQU   JFCBFLG1
JFCSTAND EQU   JFCBFLG1
JFCBOPS1 EQU   JFCBMASK
JFCBVLSQ EQU   INFMJFCB+70
JFCRSV31 EQU   JFCFUNC
JFCFNCBT EQU   JFCFUNC
JFCFNCBX EQU   JFCFUNC
JFCFNCBD EQU   JFCFUNC
JFCFNCBW EQU   JFCFUNC
JFCFNCBP EQU   JFCFUNC
JFCFNCBR EQU   JFCFUNC
JFCFNCBI EQU   JFCFUNC
JFCBFOFL EQU   JFCBUFOF
JFCNL    EQU   JFCBLTYP
JFCSL    EQU   JFCBLTYP
JFCNSL   EQU   JFCBLTYP
JFCSUL   EQU   JFCBLTYP
JFCBLP   EQU   JFCBLTYP
JFCBLTM  EQU   JFCBLTYP
JFCBAL   EQU   JFCBLTYP
JFCRSV38 EQU   JFCBLTYP
JFCVINDX EQU   INFMJFCB+64
JFCNLREC EQU   INFMJFCB+62
JFCBADBF EQU   INFMJFCB+60
JFCAMSTR EQU   JFCBFRID+2
JFCAMCRO EQU   JFCBFRID
JFCBDSCB EQU   INFMJFCB+53
JFCPAT   EQU   JFCBTSDM
JFCNDCB  EQU   JFCBTSDM
JFCNDSCB EQU   JFCBTSDM
JFCNWRIT EQU   JFCBTSDM
JFCTTR   EQU   JFCBTSDM
JFCSDS   EQU   JFCBTSDM
JFCVSL   EQU   JFCBTSDM
JFCCAT   EQU   JFCBTSDM
JFCIPLTX EQU   JFCBELNM
JFCBQNAM EQU   JFCBDSNM
TIOTFEND EQU   POOLSTAR+16
TIOPSLOT EQU   POOLSTAR+13
TIOPSTTB EQU   POOLSTAR+12
TIOPPOOL EQU   POOLSTAR+4
TIOPNSRT EQU   POOLSTAR+3
@NM00115 EQU   POOLSTAR+2
TIOPNSLT EQU   POOLSTAR+1
@NM00114 EQU   POOLSTAR
TIOEFSRT EQU   TIOENTRY+17
TIOSVERF EQU   TIOESTTB
TIOSUNLD EQU   TIOESTTB
TIOSMNTD EQU   TIOESTTB
TIOSSETU EQU   TIOESTTB
TIOSVLSR EQU   TIOESTTB
TIOSPVIO EQU   TIOESTTB
TIOSREQD EQU   TIOESTTB
TIOSUSED EQU   TIOESTTB
TIOSBALS EQU   TIOESTTC
TIOSBALP EQU   TIOESTTC
TIOSVOLS EQU   TIOESTTC
TIOSVOLP EQU   TIOESTTC
TIOSAFFS EQU   TIOESTTC
TIOSAFFP EQU   TIOESTTC
TIOSDEFR EQU   TIOESTTC
TIOSDKCR EQU   TIOESTTC
TIOEJFCB EQU   TIOENTRY+12
TIOTREM  EQU   TIOELINK
TIOESSDS EQU   TIOESYOT
TIOESYIN EQU   TIOELINK
TIOEQNAM EQU   TIOELINK
TIOEDYNM EQU   TIOELINK
TIOTTERM EQU   TIOELINK
TIOTRV01 EQU   TIOELINK
TIOSYOUT EQU   TIOELINK
TIOEWTCT EQU   TIOERLOC
TIOSDSP2 EQU   TIOESTTA
TIOSDSP1 EQU   TIOESTTA
TIOSLABL EQU   TIOESTTA
TIOSDADS EQU   TIOESTTA
TIOSJBLB EQU   TIOESTTA
TIOSPLTS EQU   TIOESTTA
TIOSPLTP EQU   TIOESTTA
TIOSLTYP EQU   TIOESTTA
TIOCSTEP EQU   TIOT1+8
TIOCNJOB EQU   TIOT1
VVOLLVFY EQU   @NM00113
VVOLLMNT EQU   @NM00113
VVOLLDEB EQU   IDAVVOLL+32
VVOLLBIB EQU   IDAVVOLL+28
VVOLLSFI EQU   IDAVVOLL+16
VVOLLCNT EQU   VVOLLERR+3
VVOLLSFC EQU   VVOLLERR+2
VVOLLFNC EQU   VVOLLERR+1
VVOLLPDC EQU   VVOLLERR
VVOLLACB EQU   IDAVVOLL+8
@NM00112 EQU   IDAVVOLL+1
VVOLLSWD EQU   @NM00110
VVOLLEOV EQU   @NM00110
VVOLLOPE EQU   @NM00110
VVOLLTIO EQU   @NM00110
@NM00111 EQU   @NM00110
CUMRC    EQU   CUMWA+148
@NM00109 EQU   CUMWA+146
CUMFMWA  EQU   CUMWA+58
CUMWCI2  EQU   CUMWASS2+7
CUMWTYP2 EQU   CUMWASS2+6
CUMWCI   EQU   CUMWASS+1
CUMTYPE  EQU   CUMWTYP
CUMWREL  EQU   CUMWASS2
CUMFN2   EQU   CUMWA+40
CUMFN1   EQU   CUMWA+32
CUMDY    EQU   CUMWA+29
@NM00108 EQU   CUMWA+28
CUMSRID  EQU   CUMWA+25
@NM00107 EQU   CUMWA+24
CUMRABD  EQU   CUMWA+20
CUMRAB2  EQU   CUMWA+16
CUMRAB1  EQU   CUMWA+12
CUMRABB  EQU   CUMWA+8
CUMURAB  EQU   CUMWA+4
CUMBCI   EQU   CUMWA+1
@NM00106 EQU   CUMFLAG
CUMEXIT  EQU   CUMFLAG
CUMICI   EQU   CUMPL+5
CUMDCI   EQU   CUMPL+2
@NM00105 EQU   CUMOUT
CUMNE    EQU   CUMOUT
CUMDUP   EQU   CUMOUT
@NM00104 EQU   CUMIN
CUMFUNC  EQU   CUMIN
CUMNRG   EQU   CUMIN
CUMFDEL  EQU   CUMIN
CMBYTAU  EQU   CMSWA+500
CMBYTTRK EQU   CMSWA+496
CMSCTREC EQU   CMSWA+416
@NM00103 EQU   CMSWA+413
CMDEFACI EQU   CMUCATCI
CMBLPTKS EQU   CMSWA+408
CMSDSPTB EQU   CMSWA+344
@NM00102 EQU   DCWPLCDS+27
DCWPLCDV EQU   DCWPLCDS+24
DCWPLCDA EQU   DCWPLCDL+16
DCWPLCDH EQU   DCWPLCDL
DCWPLARV EQU   DCWPLARS+24
DCWPLARA EQU   DCWPLARL+16
DCWPLARH EQU   DCWPLARL
@NM00101 EQU   DCWPLEDS+27
DCWPLEDV EQU   DCWPLEDS+24
DCWPLEDA EQU   DCWPLEDL+16
DCWPLEDH EQU   DCWPLEDL
DCWPLBFV EQU   DCWPLBFS+24
DCWPLBFA EQU   DCWPLBFL+16
DCWPLBFH EQU   DCWPLBFL
@NM00100 EQU   DCWPLSPS+31
DCWPLSPV EQU   DCWPLSPS+24
DCWPLSPA EQU   DCWPLSPL+16
DCWPLSPH EQU   DCWPLSPL
DCWFPLPT EQU   CMSWA+196
DCWAREPT EQU   CMSWA+192
@NM00099 EQU   CMSWA+190
DCWIX    EQU   CMSWA+188
CMWPAD   EQU   CMWGENAM+35
CMWTIME2 EQU   CMWTIME+11
CMWDELM2 EQU   CMWTIME+9
CMWTIME1 EQU   CMWTIME+2
CMWDELM1 EQU   CMWTIME
CMWDAY   EQU   CMWDATE+2
CMWYEAR  EQU   CMWDATE
CMWFIXID EQU   CMWGENAM
CMNCILL  EQU   CMSPCQTY
CMNCITL  EQU   CMIXFANS
CMWT     EQU   CMIXFANO
CMDEFSWA EQU   CMSWA+128
CMSRCCOR EQU   CMSWA+124
CMEXTLST EQU   CMSWA+120
WORKPROC EQU   CMSWA+118
@NM00098 EQU   CMSWA+116
CMFPLIDX EQU   CMSWA+112
CMCNVNO  EQU   CMSWA+110
CMCNVLEN EQU   CMSWA+108
CMTRKCYL EQU   CMSPCATR+12
CMTRKPCA EQU   CMSPCATR+10
CMBLKTRK EQU   CMSPCATR+8
CMSWADTY EQU   CMSPCATR+4
CMPHYBLK EQU   CMSPCATR
CMTOTVOL EQU   CMSWA+74
CMVLVOL  EQU   CMVLLIST+4
CMVLRT2  EQU   CMVLRTCD+1
CMVLRT1  EQU   CMVLRTCD
CMVLLTLN EQU   CMVLLIST
@NM00097 EQU   CMSWA+62
CMSCRADT EQU   CMSWA+58
CMSCRAVI EQU   CMSWA+52
CMSDEFCI EQU   CMSDFSPC+1
CMSWAFLG EQU   CMSDFSPC
CMSPCFVT EQU   CMSWA+44
CMRMVVOL EQU   CMVOLCTR
CMADDVOL EQU   CMRNGCTR
SPACINDC EQU   CMSWA+38
PROCESS  EQU   CMSWA+36
CMDTAFPL EQU   CMHIXFPL
CMTSTFPL EQU   CMHDTFPL
CMRNMLST EQU   CMLDTFPL
CMEXTFLS EQU   CMCPLFVT
CMASCFPL EQU   CMSWA+16
CMWFVTPT EQU   CMSWA+12
CMWACI   EQU   CMSWA+3
CMAMDRNG EQU   CMWRKATR
CMAMDORD EQU   CMWRKATR
CMAMDRPL EQU   CMWRKATR
CMAMDSDT EQU   CMWRKATR
CMAMDWCK EQU   CMWRKATR
CMAMDDST EQU   CMWRKATR
CMCISREQ EQU   CMSWA+1
CMPROC   EQU   CMWFLAGS
CMPROCM  EQU   CMWFLAGS
CMFGDLSC EQU   CMWFLAGS
DSNPHYBS EQU   DSPTBL+30
DSPHYBPT EQU   DSPTBL+22
DSMPHYBS EQU   DSPTBL+20
DSDEVCHA EQU   DSPTBL
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00096 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00095 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVPWD EQU   CTGFV+84
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVVCH EQU   CTGFV+12
CTGFVICH EQU   CTGFV+8
CTGFVDCH EQU   CTGFV+4
@NM00094 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00093 EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXCCA   EQU   IGGCAXWA+104
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00092 EQU   COPTS
CENLST   EQU   COPTS
@NM00091 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXUCB   EQU   IGGCAXWA+28
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00090 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00089 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00088 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00085 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00084 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00083 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00082 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00081 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00080 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00079 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00078 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00077 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00076 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00051 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBRSV48 EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00050 EQU   TCB+296
TCBSCBQ  EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBRSV36 EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBRSV35 EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00049 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBRSV04 EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00048 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00047 EQU   CVTFIX+248
@NM00046 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
LENFIX   EQU   CNTRLINF+1
CNTVAR   EQU   CNTRLINF
VARINFO  EQU   VARFIELD+2
VARLEN   EQU   VARFIELD
REPGOPT  EQU   REPCNTRL+6
@NM00045 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
NREPCV   EQU   CATRCD+47
@NM00044 EQU   CATRCD+26
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRACI EQU   CATRCD+11
RCDRELID EQU   CATRCD+4
RCDKEYTY EQU   CATRCD
CATGOGC  EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOEXT EQU   CATGOGC1
CATGODSP EQU   CATGOCI+1
@NM00043 EQU   CATGOFLG
@NM00042 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00041 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
DIC2LC   EQU   DIC2ENT+2
DIC2ST   EQU   DIC2ENT+1
@NM00040 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2VAR  EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
DICTLC   EQU   DICTENT+2
DICTST   EQU   DICTENT+1
@NM00039 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
WKALEN1  EQU   USERWKA
CTGFLNG  EQU   CTGFLDAT
CTGFLCHN EQU   CTGFL+12
CTGFLDTS EQU   CTGFLDRE
@NM00038 EQU   CTGFLDRE
CTGFLDCD EQU   CTGFL+1
CTGFLDNO EQU   CTGFL
CTGFIELD EQU   CTGPL+28
CTGPSWD  EQU   CTGJSCB
@NM00036 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
@NM00035 EQU   CTGDSORG
CTGOPTNS EQU   CTGDSORG
@NM00034 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
@NM00033 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1492
CCADGDGA EQU   IGGCCA+1488
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
@NM00032 EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00031 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
@NM00030 EQU   IGGCCA+1416
CCAMODNM EQU   CCAREGS+4
@NM00029 EQU   CCAREGS
@NM00028 EQU   IGGCCA+1057
@NM00027 EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00026 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00025 EQU   CCAMNAT+1
@NM00024 EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00023 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00022 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00021 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
@NM00020 EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCAGVEXT EQU   IGGCCA+488
CCANEVV  EQU   IGGCCA+486
CCAGVCT  EQU   IGGCCA+484
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00019 EQU   IGGCCA+400
CCASN1   EQU   CCASN
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCARABL  EQU   IGGCCA+388
CCARABF  EQU   IGGCCA+384
CCARABB  EQU   IGGCCA+380
CCAMCPL  EQU   CCAXCPL
CCARABPT EQU   IGGCCA+368
CCATFLPT EQU   CCAFLPT
CCAILNG  EQU   IGGCCA+360
CCASL    EQU   IGGCCA+358
CCAGOPLN EQU   IGGCCA+356
CCACPE71 EQU   IGGCCA+352
CCAIDPT  EQU   CCACPE7
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCARPRM  EQU   IGGCCA+312
@NM00018 EQU   CCAMSSPL+10
@NM00017 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00016 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCARPL1  EQU   IGGCCA+220
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
@NM00015 EQU   IGGCCA+212
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
CCAR5REC EQU   CCARAB5+4
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
CCAR4REC EQU   CCARAB4+4
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
CCAR3REC EQU   CCARAB3+4
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
CCAR1REC EQU   CCARAB1+4
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCASRCIN EQU   CCASRID
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAMOD   EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCAREUSE EQU   CCAFLG6
CCASUPFD EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNC  EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
CCACD2   EQU   IGGCCA+13
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
@NM00075 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00074 EQU   PSA+1040
PSAUSEND EQU   PSA+1040
PSARV062 EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00073 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00072 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00071 EQU   FLCFSA
@NM00070 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00069 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00068 EQU   FLCIOA
@NM00067 EQU   FLCMCLA+15
@NM00066 EQU   FLCMCLA+14
@NM00065 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00064 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00063 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00062 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00061 EQU   FLCPER
@NM00060 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00059 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00058 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00057 EQU   FLCPIILC
@NM00056 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00055 EQU   FLCSVILC
@NM00054 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00053 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00052 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00180 EQU   NEXTVOL
@RT00184 EQU   NEXTVOL
@RF00192 EQU   NEXTVOL
@RT00238 EQU   NEXTVOL
@RT00245 EQU   NEXTVOL
@RT00254 EQU   NEXTVOL
@RT00263 EQU   NEXTVOL
@RT00268 EQU   NEXTVOL
@RC00283 EQU   @RC00276
@RT00291 EQU   NEXTVOL
@RC00298 EQU   @RC00295
@RC00330 EQU   ALLOCSPC
@RT00346 EQU   NEXTVOL
@RT00440 EQU   ERRORXT
@PB00010 EQU   @EL00001
@ENDDATA EQU   *
         END   IGG0CLAQ,(C'PLS2133',0602,75010)
